#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_ChangeEnableCharaEffect

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AnimNotify_ChangeEnableCharaEffect.AnimNotify_ChangeEnableCharaEffect_C
// 0x0030 (0x0068 - 0x0038)
class UAnimNotify_ChangeEnableCharaEffect_C final : public UAnimNotify
{
public:
	bool                                          Activate;                                          // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          Visible;                                           // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_8101[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ComponentNames;                                    // 0x0040(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          IsFirstTimeOnly;                                   // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_8102[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OptionNotifyName;                                  // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation) const;
	class FString GetNotifyName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimNotify_ChangeEnableCharaEffect_C">();
	}
	static class UAnimNotify_ChangeEnableCharaEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_ChangeEnableCharaEffect_C>();
	}
};
static_assert(alignof(UAnimNotify_ChangeEnableCharaEffect_C) == 0x000008, "Wrong alignment on UAnimNotify_ChangeEnableCharaEffect_C");
static_assert(sizeof(UAnimNotify_ChangeEnableCharaEffect_C) == 0x000068, "Wrong size on UAnimNotify_ChangeEnableCharaEffect_C");
static_assert(offsetof(UAnimNotify_ChangeEnableCharaEffect_C, Activate) == 0x000038, "Member 'UAnimNotify_ChangeEnableCharaEffect_C::Activate' has a wrong offset!");
static_assert(offsetof(UAnimNotify_ChangeEnableCharaEffect_C, Visible) == 0x000039, "Member 'UAnimNotify_ChangeEnableCharaEffect_C::Visible' has a wrong offset!");
static_assert(offsetof(UAnimNotify_ChangeEnableCharaEffect_C, ComponentNames) == 0x000040, "Member 'UAnimNotify_ChangeEnableCharaEffect_C::ComponentNames' has a wrong offset!");
static_assert(offsetof(UAnimNotify_ChangeEnableCharaEffect_C, IsFirstTimeOnly) == 0x000050, "Member 'UAnimNotify_ChangeEnableCharaEffect_C::IsFirstTimeOnly' has a wrong offset!");
static_assert(offsetof(UAnimNotify_ChangeEnableCharaEffect_C, OptionNotifyName) == 0x000058, "Member 'UAnimNotify_ChangeEnableCharaEffect_C::OptionNotifyName' has a wrong offset!");

}

