#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_ChangeEnableCharaDecal

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AnimNotify_ChangeEnableCharaDecal.AnimNotify_ChangeEnableCharaDecal_C
// 0x0020 (0x0058 - 0x0038)
class UAnimNotify_ChangeEnableCharaDecal_C final : public UAnimNotify
{
public:
	bool                                          Visible;                                           // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_A35A[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ComponentNames;                                    // 0x0040(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          HideInGame;                                        // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          IsFirstTimeOnly;                                   // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimNotify_ChangeEnableCharaDecal_C">();
	}
	static class UAnimNotify_ChangeEnableCharaDecal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_ChangeEnableCharaDecal_C>();
	}
};
static_assert(alignof(UAnimNotify_ChangeEnableCharaDecal_C) == 0x000008, "Wrong alignment on UAnimNotify_ChangeEnableCharaDecal_C");
static_assert(sizeof(UAnimNotify_ChangeEnableCharaDecal_C) == 0x000058, "Wrong size on UAnimNotify_ChangeEnableCharaDecal_C");
static_assert(offsetof(UAnimNotify_ChangeEnableCharaDecal_C, Visible) == 0x000038, "Member 'UAnimNotify_ChangeEnableCharaDecal_C::Visible' has a wrong offset!");
static_assert(offsetof(UAnimNotify_ChangeEnableCharaDecal_C, ComponentNames) == 0x000040, "Member 'UAnimNotify_ChangeEnableCharaDecal_C::ComponentNames' has a wrong offset!");
static_assert(offsetof(UAnimNotify_ChangeEnableCharaDecal_C, HideInGame) == 0x000050, "Member 'UAnimNotify_ChangeEnableCharaDecal_C::HideInGame' has a wrong offset!");
static_assert(offsetof(UAnimNotify_ChangeEnableCharaDecal_C, IsFirstTimeOnly) == 0x000051, "Member 'UAnimNotify_ChangeEnableCharaDecal_C::IsFirstTimeOnly' has a wrong offset!");

}

