#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_Dev078DevilSkillVoice

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function AnimNotify_Dev078DevilSkillVoice.AnimNotify_Dev078DevilSkillVoice_C.GetAttrVoice
// 0x0120 (0x0120 - 0x0000)
struct AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice final
{
public:
	E_ATTRIBUTE_TYPE                              SkillAttr;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A349[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          AttrVoice;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ATTRIBUTE_TYPE                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A34A[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_1;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_2;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_3;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_4;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_5;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_6;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_7;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_8;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_9;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_10;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_11;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_12;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_13;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_14;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_15;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_16;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_17;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_18;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_19;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_20;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_21;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_22;                           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_23;                           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_24;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_25;                           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_26;                           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_27;                           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_28;                           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_29;                           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_30;                           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_31;                           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          K2Node_Select_Default;                             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice) == 0x000008, "Wrong alignment on AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice");
static_assert(sizeof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice) == 0x000120, "Wrong size on AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, SkillAttr) == 0x000000, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::SkillAttr' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, AttrVoice) == 0x000008, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::AttrVoice' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_byte_Variable) == 0x000010, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable) == 0x000018, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_1) == 0x000020, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_2) == 0x000028, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_3) == 0x000030, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_4) == 0x000038, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_5) == 0x000040, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_6) == 0x000048, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_7) == 0x000050, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_8) == 0x000058, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_9) == 0x000060, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_10) == 0x000068, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_11) == 0x000070, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_12) == 0x000078, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_13) == 0x000080, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_13' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_14) == 0x000088, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_14' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_15) == 0x000090, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_15' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_16) == 0x000098, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_16' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_17) == 0x0000A0, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_17' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_18) == 0x0000A8, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_18' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_19) == 0x0000B0, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_19' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_20) == 0x0000B8, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_20' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_21) == 0x0000C0, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_21' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_22) == 0x0000C8, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_22' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_23) == 0x0000D0, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_23' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_24) == 0x0000D8, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_24' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_25) == 0x0000E0, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_25' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_26) == 0x0000E8, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_26' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_27) == 0x0000F0, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_27' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_28) == 0x0000F8, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_28' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_29) == 0x000100, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_29' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_30) == 0x000108, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_30' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, Temp_object_Variable_31) == 0x000110, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::Temp_object_Variable_31' has a wrong offset!");
static_assert(offsetof(AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice, K2Node_Select_Default) == 0x000118, "Member 'AnimNotify_Dev078DevilSkillVoice_C_GetAttrVoice::K2Node_Select_Default' has a wrong offset!");

}

