#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_MaterialAnim

#include "Basic.hpp"


namespace SDK::Params
{

// Function AnimNotify_MaterialAnim.AnimNotify_MaterialAnim_C.Received_Notify
// 0x0048 (0x0048 - 0x0000)
struct AnimNotify_MaterialAnim_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49D6[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor;      // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_BI_GetActionState_Value;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49D7[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_BI_GetMeshComponent_MeshComp;             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_InstantMaterialAnimation_NoUse;        // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimNotify_MaterialAnim_C_Received_Notify) == 0x000008, "Wrong alignment on AnimNotify_MaterialAnim_C_Received_Notify");
static_assert(sizeof(AnimNotify_MaterialAnim_C_Received_Notify) == 0x000048, "Wrong size on AnimNotify_MaterialAnim_C_Received_Notify");
static_assert(offsetof(AnimNotify_MaterialAnim_C_Received_Notify, MeshComp) == 0x000000, "Member 'AnimNotify_MaterialAnim_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotify_MaterialAnim_C_Received_Notify, Animation) == 0x000008, "Member 'AnimNotify_MaterialAnim_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotify_MaterialAnim_C_Received_Notify, ReturnValue) == 0x000010, "Member 'AnimNotify_MaterialAnim_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_MaterialAnim_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'AnimNotify_MaterialAnim_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_MaterialAnim_C_Received_Notify, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor) == 0x000020, "Member 'AnimNotify_MaterialAnim_C_Received_Notify::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor' has a wrong offset!");
static_assert(offsetof(AnimNotify_MaterialAnim_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AnimNotify_MaterialAnim_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimNotify_MaterialAnim_C_Received_Notify, CallFunc_BI_GetActionState_Value) == 0x000031, "Member 'AnimNotify_MaterialAnim_C_Received_Notify::CallFunc_BI_GetActionState_Value' has a wrong offset!");
static_assert(offsetof(AnimNotify_MaterialAnim_C_Received_Notify, CallFunc_BI_GetMeshComponent_MeshComp) == 0x000038, "Member 'AnimNotify_MaterialAnim_C_Received_Notify::CallFunc_BI_GetMeshComponent_MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotify_MaterialAnim_C_Received_Notify, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000040, "Member 'AnimNotify_MaterialAnim_C_Received_Notify::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_MaterialAnim_C_Received_Notify, CallFunc_IsVisible_ReturnValue) == 0x000041, "Member 'AnimNotify_MaterialAnim_C_Received_Notify::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_MaterialAnim_C_Received_Notify, CallFunc_BooleanAND_ReturnValue) == 0x000042, "Member 'AnimNotify_MaterialAnim_C_Received_Notify::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_MaterialAnim_C_Received_Notify, CallFunc_BI_InstantMaterialAnimation_NoUse) == 0x000043, "Member 'AnimNotify_MaterialAnim_C_Received_Notify::CallFunc_BI_InstantMaterialAnimation_NoUse' has a wrong offset!");

// Function AnimNotify_MaterialAnim.AnimNotify_MaterialAnim_C.GetNotifyName
// 0x0060 (0x0060 - 0x0000)
struct AnimNotify_MaterialAnim_C_GetNotifyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49D8[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49D9[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotify_MaterialAnim_C_GetNotifyName) == 0x000008, "Wrong alignment on AnimNotify_MaterialAnim_C_GetNotifyName");
static_assert(sizeof(AnimNotify_MaterialAnim_C_GetNotifyName) == 0x000060, "Wrong size on AnimNotify_MaterialAnim_C_GetNotifyName");
static_assert(offsetof(AnimNotify_MaterialAnim_C_GetNotifyName, ReturnValue) == 0x000000, "Member 'AnimNotify_MaterialAnim_C_GetNotifyName::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_MaterialAnim_C_GetNotifyName, Temp_bool_Variable) == 0x000010, "Member 'AnimNotify_MaterialAnim_C_GetNotifyName::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AnimNotify_MaterialAnim_C_GetNotifyName, Temp_string_Variable) == 0x000018, "Member 'AnimNotify_MaterialAnim_C_GetNotifyName::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(AnimNotify_MaterialAnim_C_GetNotifyName, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'AnimNotify_MaterialAnim_C_GetNotifyName::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_MaterialAnim_C_GetNotifyName, CallFunc_Len_ReturnValue) == 0x000038, "Member 'AnimNotify_MaterialAnim_C_GetNotifyName::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_MaterialAnim_C_GetNotifyName, CallFunc_Greater_IntInt_ReturnValue) == 0x00003C, "Member 'AnimNotify_MaterialAnim_C_GetNotifyName::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_MaterialAnim_C_GetNotifyName, K2Node_Select_Default) == 0x000040, "Member 'AnimNotify_MaterialAnim_C_GetNotifyName::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AnimNotify_MaterialAnim_C_GetNotifyName, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'AnimNotify_MaterialAnim_C_GetNotifyName::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");

}

