#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_PlaySkelParticle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AnimNotify_PlaySkelParticle.AnimNotify_PlaySkelParticle_C.Received_Notify
// 0x01C0 (0x01C0 - 0x0000)
struct AnimNotify_PlaySkelParticle_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FE8[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Lo_PlayRate;                                       // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Particle;                                          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationMode                                CallFunc_GetAnimationMode_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FE9[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FEA[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetCurrentActiveMontage_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FEB[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_GetPlayRate_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayRate_ReturnValue;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FEC[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FED[0x8];                                     // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAxes_X;                                // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAxes_Y;                                // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAxes_Z;                                // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FEE[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0100(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotify_PlaySkelParticle_C_Received_Notify) == 0x000010, "Wrong alignment on AnimNotify_PlaySkelParticle_C_Received_Notify");
static_assert(sizeof(AnimNotify_PlaySkelParticle_C_Received_Notify) == 0x0001C0, "Wrong size on AnimNotify_PlaySkelParticle_C_Received_Notify");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, MeshComp) == 0x000000, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, Animation) == 0x000008, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, ReturnValue) == 0x000010, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, Lo_PlayRate) == 0x000014, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::Lo_PlayRate' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, Particle) == 0x000018, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::Particle' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_GetAnimationMode_ReturnValue) == 0x000020, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_GetAnimationMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_GetAnimInstance_ReturnValue) == 0x000028, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000030, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_GetCurrentActiveMontage_ReturnValue) == 0x000038, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_GetCurrentActiveMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000040, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_Montage_GetPlayRate_ReturnValue) == 0x000044, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_Montage_GetPlayRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_GetPlayRate_ReturnValue) == 0x000048, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_GetPlayRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000060, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000090, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_BreakTransform_Location) == 0x00009C, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_BreakTransform_Rotation) == 0x0000A8, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_BreakTransform_Scale) == 0x0000B4, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_GetAxes_X) == 0x0000C0, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_GetAxes_X' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_GetAxes_Y) == 0x0000CC, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_GetAxes_Y' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_GetAxes_Z) == 0x0000D8, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_GetAxes_Z' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_IsValid_ReturnValue_2) == 0x0000E4, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_BreakVector_X) == 0x0000E8, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_BreakVector_Y) == 0x0000EC, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_BreakVector_Z) == 0x0000F0, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000F4, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_GetSocketTransform_ReturnValue) == 0x000100, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000130, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_BreakTransform_Location_1) == 0x00013C, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_BreakTransform_Rotation_1) == 0x000148, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_BreakTransform_Scale_1) == 0x000154, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x000160, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_ComposeRotators_ReturnValue) == 0x00016C, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_Add_VectorVector_ReturnValue) == 0x000178, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000184, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000190, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_Multiply_VectorVector_ReturnValue) == 0x00019C, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0001A8, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySkelParticle_C_Received_Notify, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0001B0, "Member 'AnimNotify_PlaySkelParticle_C_Received_Notify::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");

}

