#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_PlayRestrictedParticle

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AnimNotify_PlayRestrictedParticle.AnimNotify_PlayRestrictedParticle_C.Received_Notify
// 0x00C0 (0x00C0 - 0x0000)
struct AnimNotify_PlayRestrictedParticle_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82C0[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Lo_MinSpendSec;                                    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClockingParticleSystem_C*              Lo_FoundTemplate;                                  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Lo_IsFoundTemplate;                                // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82C1[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClockingParticleSystem_C*>      Lo_particles;                                      // 0x0028(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82C2[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachLocation                               Temp_byte_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82C3[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor;      // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82C4[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClockingParticleSystem_C*>      CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	EAttachLocation                               Temp_byte_Variable_1;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAttachLocation                               Temp_byte_Variable_2;                              // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachLocation                               Temp_byte_Variable_3;                              // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClockingParticleSystem_C*              CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_GetSpawnedEmitter_SpawnedEmitter;         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSpawnedEmitter_IsValid;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82C5[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSpendSec_SpendSec;                     // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82C6[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachLocation                               K2Node_Select_Default;                             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82C7[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachLocation                               K2Node_Select_Default_1;                           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_AttachClockingParticleSystem_NoUse;    // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimNotify_PlayRestrictedParticle_C_Received_Notify) == 0x000008, "Wrong alignment on AnimNotify_PlayRestrictedParticle_C_Received_Notify");
static_assert(sizeof(AnimNotify_PlayRestrictedParticle_C_Received_Notify) == 0x0000C0, "Wrong size on AnimNotify_PlayRestrictedParticle_C_Received_Notify");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, MeshComp) == 0x000000, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, Animation) == 0x000008, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, ReturnValue) == 0x000010, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, Lo_MinSpendSec) == 0x000014, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::Lo_MinSpendSec' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, Lo_FoundTemplate) == 0x000018, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::Lo_FoundTemplate' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, Lo_IsFoundTemplate) == 0x000020, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::Lo_IsFoundTemplate' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, Lo_particles) == 0x000028, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::Lo_particles' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, Temp_bool_Variable) == 0x000038, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, Temp_byte_Variable) == 0x000048, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor) == 0x000050, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000068, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, Temp_byte_Variable_1) == 0x000078, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, Temp_bool_Variable_1) == 0x000079, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, Temp_byte_Variable_2) == 0x00007A, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, Temp_byte_Variable_3) == 0x00007B, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, Temp_int_Array_Index_Variable) == 0x000080, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, Temp_int_Loop_Counter_Variable) == 0x000084, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, CallFunc_Array_Get_Item) == 0x000088, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, CallFunc_GetSpawnedEmitter_SpawnedEmitter) == 0x000090, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::CallFunc_GetSpawnedEmitter_SpawnedEmitter' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, CallFunc_GetSpawnedEmitter_IsValid) == 0x000098, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::CallFunc_GetSpawnedEmitter_IsValid' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, CallFunc_GetSpendSec_SpendSec) == 0x00009C, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::CallFunc_GetSpendSec_SpendSec' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, CallFunc_Add_IntInt_ReturnValue) == 0x0000A4, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, K2Node_Select_Default) == 0x0000A8, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0000B0, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, K2Node_Select_Default_1) == 0x0000B8, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000B9, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, CallFunc_BI_AttachClockingParticleSystem_NoUse) == 0x0000BA, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::CallFunc_BI_AttachClockingParticleSystem_NoUse' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000BB, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayRestrictedParticle_C_Received_Notify, CallFunc_BooleanAND_ReturnValue) == 0x0000BC, "Member 'AnimNotify_PlayRestrictedParticle_C_Received_Notify::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

