#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotifyState_AtomPlayGate

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AnimNotifyState_AtomPlayGate.AnimNotifyState_AtomPlayGate_C
// 0x0018 (0x0048 - 0x0030)
class UAnimNotifyState_AtomPlayGate_C final : public UAnimNotifyState
{
public:
	class USoundAtomCue*                          Sound;                                             // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Bone;                                              // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Follow;                                            // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	bool Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration) const;
	bool Received_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimNotifyState_AtomPlayGate_C">();
	}
	static class UAnimNotifyState_AtomPlayGate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_AtomPlayGate_C>();
	}
};
static_assert(alignof(UAnimNotifyState_AtomPlayGate_C) == 0x000008, "Wrong alignment on UAnimNotifyState_AtomPlayGate_C");
static_assert(sizeof(UAnimNotifyState_AtomPlayGate_C) == 0x000048, "Wrong size on UAnimNotifyState_AtomPlayGate_C");
static_assert(offsetof(UAnimNotifyState_AtomPlayGate_C, Sound) == 0x000030, "Member 'UAnimNotifyState_AtomPlayGate_C::Sound' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_AtomPlayGate_C, Bone) == 0x000038, "Member 'UAnimNotifyState_AtomPlayGate_C::Bone' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_AtomPlayGate_C, Follow) == 0x000040, "Member 'UAnimNotifyState_AtomPlayGate_C::Follow' has a wrong offset!");

}

