#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotifyState_WalkBrakeTrigger

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AnimNotifyState_WalkBrakeTrigger.AnimNotifyState_WalkBrakeTrigger_C
// 0x0008 (0x0038 - 0x0030)
class UAnimNotifyState_WalkBrakeTrigger_C final : public UAnimNotifyState
{
public:
	bool                                          bLeft_1;                                           // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLeft_2;                                           // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bRight_1;                                          // 0x0032(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bRight_2;                                          // 0x0033(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	bool Received_NotifyTick(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime) const;
	class FString GetNotifyName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimNotifyState_WalkBrakeTrigger_C">();
	}
	static class UAnimNotifyState_WalkBrakeTrigger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_WalkBrakeTrigger_C>();
	}
};
static_assert(alignof(UAnimNotifyState_WalkBrakeTrigger_C) == 0x000008, "Wrong alignment on UAnimNotifyState_WalkBrakeTrigger_C");
static_assert(sizeof(UAnimNotifyState_WalkBrakeTrigger_C) == 0x000038, "Wrong size on UAnimNotifyState_WalkBrakeTrigger_C");
static_assert(offsetof(UAnimNotifyState_WalkBrakeTrigger_C, bLeft_1) == 0x000030, "Member 'UAnimNotifyState_WalkBrakeTrigger_C::bLeft_1' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_WalkBrakeTrigger_C, bLeft_2) == 0x000031, "Member 'UAnimNotifyState_WalkBrakeTrigger_C::bLeft_2' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_WalkBrakeTrigger_C, bRight_1) == 0x000032, "Member 'UAnimNotifyState_WalkBrakeTrigger_C::bRight_1' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_WalkBrakeTrigger_C, bRight_2) == 0x000033, "Member 'UAnimNotifyState_WalkBrakeTrigger_C::bRight_2' has a wrong offset!");

}

