#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AogamiDebrisPose

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_AogamiDebrisMotion_structs.hpp"


namespace SDK
{

// UserDefinedStruct AogamiDebrisPose.AogamiDebrisPose
// 0x0078 (0x0078 - 0x0000)
struct FAogamiDebrisPose final
{
public:
	E_AogamiDebrisMotion                          MotionID_12_652BB28144C9183F056013AA61D7782C;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9540[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimSequence>           AnimSequence_13_D5562A034A32287B194C70A8E8222BF3;  // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USkeletalMesh>           SkeletalMesh_14_9365A93A493DEA67C33B979BE61B2B32;  // 0x0030(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FVector                                CollisonOffset_15_9D33D9154121D14F220FC1B984C21E2D; // 0x0058(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CollisionRotate_20_CDEA6EDA49A7CB8D76DDD481525BF62E; // 0x0064(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CollisionRadius_16_21367C4645A73D3AC82B0C92D2021073; // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CollisionHalfHeight_17_51B4720741F8B76A470C42A83CB027FE; // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FAogamiDebrisPose) == 0x000008, "Wrong alignment on FAogamiDebrisPose");
static_assert(sizeof(FAogamiDebrisPose) == 0x000078, "Wrong size on FAogamiDebrisPose");
static_assert(offsetof(FAogamiDebrisPose, MotionID_12_652BB28144C9183F056013AA61D7782C) == 0x000000, "Member 'FAogamiDebrisPose::MotionID_12_652BB28144C9183F056013AA61D7782C' has a wrong offset!");
static_assert(offsetof(FAogamiDebrisPose, AnimSequence_13_D5562A034A32287B194C70A8E8222BF3) == 0x000008, "Member 'FAogamiDebrisPose::AnimSequence_13_D5562A034A32287B194C70A8E8222BF3' has a wrong offset!");
static_assert(offsetof(FAogamiDebrisPose, SkeletalMesh_14_9365A93A493DEA67C33B979BE61B2B32) == 0x000030, "Member 'FAogamiDebrisPose::SkeletalMesh_14_9365A93A493DEA67C33B979BE61B2B32' has a wrong offset!");
static_assert(offsetof(FAogamiDebrisPose, CollisonOffset_15_9D33D9154121D14F220FC1B984C21E2D) == 0x000058, "Member 'FAogamiDebrisPose::CollisonOffset_15_9D33D9154121D14F220FC1B984C21E2D' has a wrong offset!");
static_assert(offsetof(FAogamiDebrisPose, CollisionRotate_20_CDEA6EDA49A7CB8D76DDD481525BF62E) == 0x000064, "Member 'FAogamiDebrisPose::CollisionRotate_20_CDEA6EDA49A7CB8D76DDD481525BF62E' has a wrong offset!");
static_assert(offsetof(FAogamiDebrisPose, CollisionRadius_16_21367C4645A73D3AC82B0C92D2021073) == 0x000070, "Member 'FAogamiDebrisPose::CollisionRadius_16_21367C4645A73D3AC82B0C92D2021073' has a wrong offset!");
static_assert(offsetof(FAogamiDebrisPose, CollisionHalfHeight_17_51B4720741F8B76A470C42A83CB027FE) == 0x000074, "Member 'FAogamiDebrisPose::CollisionHalfHeight_17_51B4720741F8B76A470C42A83CB027FE' has a wrong offset!");

}

