#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BacktraceOnCrashpad

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class BacktraceOnCrashpad.BacktraceOnCrashpadSettings
// 0x0030 (0x0068 - 0x0038)
class UBacktraceOnCrashpadSettings final : public UDeveloperSettings
{
public:
	class FString                                 BacktraceURL;                                      // 0x0038(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BacktraceToken;                                    // 0x0048(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CrashpadDatabasePath;                              // 0x0058(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BacktraceOnCrashpadSettings">();
	}
	static class UBacktraceOnCrashpadSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBacktraceOnCrashpadSettings>();
	}
};
static_assert(alignof(UBacktraceOnCrashpadSettings) == 0x000008, "Wrong alignment on UBacktraceOnCrashpadSettings");
static_assert(sizeof(UBacktraceOnCrashpadSettings) == 0x000068, "Wrong size on UBacktraceOnCrashpadSettings");
static_assert(offsetof(UBacktraceOnCrashpadSettings, BacktraceURL) == 0x000038, "Member 'UBacktraceOnCrashpadSettings::BacktraceURL' has a wrong offset!");
static_assert(offsetof(UBacktraceOnCrashpadSettings, BacktraceToken) == 0x000048, "Member 'UBacktraceOnCrashpadSettings::BacktraceToken' has a wrong offset!");
static_assert(offsetof(UBacktraceOnCrashpadSettings, CrashpadDatabasePath) == 0x000058, "Member 'UBacktraceOnCrashpadSettings::CrashpadDatabasePath' has a wrong offset!");

}

