#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleCommand

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "BTL_CURSOR_MEMORY_T_structs.hpp"
#include "UMG_structs.hpp"
#include "E_TutorialWindow_WidgetState_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BtlUISkill_UseData_st_structs.hpp"
#include "BtlUIItemData_structs.hpp"
#include "ST_BtnHelp_ColorInfo_byIdx_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BattleCommand.BattleCommand_C.ExecuteUbergraph_BattleCommand
// 0x01C0 (0x01C0 - 0x0000)
struct BattleCommand_C_ExecuteUbergraph_BattleCommand final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7957[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7958[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsWB_Btl_Command_Menu;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7959[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtlCommandMenu_C*                   CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_2;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(E_BTL_UI_COMMAND Command)>     K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 ShiftIndex)>             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	E_BTL_UI_COMM_STEP                            K2Node_CustomEvent_m_MainStep;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_795A[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_StartCursorIndex;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_TopIndex;                       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_795B[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_795C[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_795D[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_1;                       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_795E[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MainInterface>    CallFunc_GetBPIMainInterface_AsBPI_Main_Interface; // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetBPIMainInterface_bSuccess;             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_795F[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_TUTORIAL_WINDOW_MESSAGE_TYPE>        K2Node_CustomEvent_MessageType;                    // 0x00C0(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_CustomEvent_CleanUp;                        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7960[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7961[0x6];                                     // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable_1;                             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor;                   // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7962[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_TutorialWindow_WidgetState                  CallFunc_BPL_TutorialWIndow2_GetAnimState_AnimState; // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0106(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7963[0x1];                                     // 0x0107(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_OptionCtrl_C>     K2Node_DynamicCast_AsBPI_Option_Ctrl;              // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7964[0x3];                                     // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPL_TutorialWIndow2_IsClickedByMouse_IsClicked; // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCancel_ReturnValue;                  // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7965[0x1];                                     // 0x0123(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0124(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7966[0xC];                                     // 0x0134(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7967[0x3];                                     // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0184(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7968[0x4];                                     // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable_2;                             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_TUTORIAL_WINDOW_MESSAGE_TYPE                CallFunc_Array_Get_Item;                           // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7969[0x6];                                     // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MainInterface>    CallFunc_GetBPIMainInterface_AsBPI_Main_Interface_1; // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetBPIMainInterface_bSuccess_1;           // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCommand_C_ExecuteUbergraph_BattleCommand) == 0x000010, "Wrong alignment on BattleCommand_C_ExecuteUbergraph_BattleCommand");
static_assert(sizeof(BattleCommand_C_ExecuteUbergraph_BattleCommand) == 0x0001C0, "Wrong size on BattleCommand_C_ExecuteUbergraph_BattleCommand");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, EntryPoint) == 0x000000, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, Temp_class_Variable) == 0x000008, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, Temp_int_Variable) == 0x000010, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_ClassDynamicCast_AsWB_Btl_Command_Menu) == 0x000018, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_ClassDynamicCast_AsWB_Btl_Command_Menu' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_ClassDynamicCast_bSuccess) == 0x000020, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, CallFunc_Create_ReturnValue) == 0x000028, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_CustomEvent_Loaded_2) == 0x000030, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_CreateDelegate_OutputDelegate_2) == 0x000058, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_CreateDelegate_OutputDelegate_3) == 0x000068, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_CustomEvent_m_MainStep) == 0x000078, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_CustomEvent_m_MainStep' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_CustomEvent_StartCursorIndex) == 0x00007C, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_CustomEvent_StartCursorIndex' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_CustomEvent_TopIndex) == 0x000080, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_CustomEvent_TopIndex' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_Event_EndPlayReason) == 0x000084, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_Event_DeltaSeconds) == 0x000088, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_SwitchInteger_CmpSuccess) == 0x00008C, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_CustomEvent_Loaded_1) == 0x000098, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A0, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, CallFunc_GetBPIMainInterface_AsBPI_Main_Interface) == 0x0000A8, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::CallFunc_GetBPIMainInterface_AsBPI_Main_Interface' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, CallFunc_GetBPIMainInterface_bSuccess) == 0x0000B8, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::CallFunc_GetBPIMainInterface_bSuccess' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_CustomEvent_MessageType) == 0x0000C0, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_CustomEvent_MessageType' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_CustomEvent_CleanUp) == 0x0000D0, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_CustomEvent_CleanUp' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000D4, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000D8, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x0000D9, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, Temp_class_Variable_1) == 0x0000E0, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_ClassDynamicCast_AsActor) == 0x0000E8, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_ClassDynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_ClassDynamicCast_bSuccess_1) == 0x0000F0, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_ClassDynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_CustomEvent_Loaded) == 0x0000F8, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, Temp_int_Variable_1) == 0x000100, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, CallFunc_IsValid_ReturnValue) == 0x000104, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, CallFunc_BPL_TutorialWIndow2_GetAnimState_AnimState) == 0x000105, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::CallFunc_BPL_TutorialWIndow2_GetAnimState_AnimState' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_SwitchEnum_CmpSuccess) == 0x000106, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_DynamicCast_AsBPI_Option_Ctrl) == 0x000108, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_DynamicCast_AsBPI_Option_Ctrl' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, Temp_int_Variable_2) == 0x00011C, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, CallFunc_BPL_TutorialWIndow2_IsClickedByMouse_IsClicked) == 0x000120, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::CallFunc_BPL_TutorialWIndow2_IsClickedByMouse_IsClicked' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, CallFunc_CheckCancel_ReturnValue) == 0x000121, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::CallFunc_CheckCancel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, CallFunc_BooleanOR_ReturnValue) == 0x000122, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_CreateDelegate_OutputDelegate_4) == 0x000124, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, CallFunc_MakeTransform_ReturnValue) == 0x000140, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000170, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, CallFunc_FinishSpawningActor_ReturnValue) == 0x000178, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, CallFunc_IsValid_ReturnValue_1) == 0x000180, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, K2Node_CreateDelegate_OutputDelegate_5) == 0x000184, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, Temp_class_Variable_2) == 0x000198, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, CallFunc_Array_Get_Item) == 0x0001A0, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001A1, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, CallFunc_GetBPIMainInterface_AsBPI_Main_Interface_1) == 0x0001A8, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::CallFunc_GetBPIMainInterface_AsBPI_Main_Interface_1' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ExecuteUbergraph_BattleCommand, CallFunc_GetBPIMainInterface_bSuccess_1) == 0x0001B8, "Member 'BattleCommand_C_ExecuteUbergraph_BattleCommand::CallFunc_GetBPIMainInterface_bSuccess_1' has a wrong offset!");

// Function BattleCommand.BattleCommand_C.OpenTutorialWindow
// 0x0018 (0x0018 - 0x0000)
struct BattleCommand_C_OpenTutorialWindow final
{
public:
	TArray<E_TUTORIAL_WINDOW_MESSAGE_TYPE>        MessageType;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CleanUp;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCommand_C_OpenTutorialWindow) == 0x000008, "Wrong alignment on BattleCommand_C_OpenTutorialWindow");
static_assert(sizeof(BattleCommand_C_OpenTutorialWindow) == 0x000018, "Wrong size on BattleCommand_C_OpenTutorialWindow");
static_assert(offsetof(BattleCommand_C_OpenTutorialWindow, MessageType) == 0x000000, "Member 'BattleCommand_C_OpenTutorialWindow::MessageType' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_OpenTutorialWindow, CleanUp) == 0x000010, "Member 'BattleCommand_C_OpenTutorialWindow::CleanUp' has a wrong offset!");

// Function BattleCommand.BattleCommand_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BattleCommand_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleCommand_C_ReceiveTick) == 0x000004, "Wrong alignment on BattleCommand_C_ReceiveTick");
static_assert(sizeof(BattleCommand_C_ReceiveTick) == 0x000004, "Wrong size on BattleCommand_C_ReceiveTick");
static_assert(offsetof(BattleCommand_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BattleCommand_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BattleCommand.BattleCommand_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BattleCommand_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleCommand_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BattleCommand_C_ReceiveEndPlay");
static_assert(sizeof(BattleCommand_C_ReceiveEndPlay) == 0x000001, "Wrong size on BattleCommand_C_ReceiveEndPlay");
static_assert(offsetof(BattleCommand_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BattleCommand_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BattleCommand.BattleCommand_C.CallStep
// 0x000C (0x000C - 0x0000)
struct BattleCommand_C_CallStep final
{
public:
	E_BTL_UI_COMM_STEP                            M_MainStep;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_796A[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StartCursorIndex;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TopIndex;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleCommand_C_CallStep) == 0x000004, "Wrong alignment on BattleCommand_C_CallStep");
static_assert(sizeof(BattleCommand_C_CallStep) == 0x00000C, "Wrong size on BattleCommand_C_CallStep");
static_assert(offsetof(BattleCommand_C_CallStep, M_MainStep) == 0x000000, "Member 'BattleCommand_C_CallStep::M_MainStep' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_CallStep, StartCursorIndex) == 0x000004, "Member 'BattleCommand_C_CallStep::StartCursorIndex' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_CallStep, TopIndex) == 0x000008, "Member 'BattleCommand_C_CallStep::TopIndex' has a wrong offset!");

// Function BattleCommand.BattleCommand_C.OnLoaded_DDD9B75145880DA34D813688855E615B
// 0x0008 (0x0008 - 0x0000)
struct BattleCommand_C_OnLoaded_DDD9B75145880DA34D813688855E615B final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BattleCommand_C_OnLoaded_DDD9B75145880DA34D813688855E615B) == 0x000008, "Wrong alignment on BattleCommand_C_OnLoaded_DDD9B75145880DA34D813688855E615B");
static_assert(sizeof(BattleCommand_C_OnLoaded_DDD9B75145880DA34D813688855E615B) == 0x000008, "Wrong size on BattleCommand_C_OnLoaded_DDD9B75145880DA34D813688855E615B");
static_assert(offsetof(BattleCommand_C_OnLoaded_DDD9B75145880DA34D813688855E615B, Loaded) == 0x000000, "Member 'BattleCommand_C_OnLoaded_DDD9B75145880DA34D813688855E615B::Loaded' has a wrong offset!");

// Function BattleCommand.BattleCommand_C.OnLoaded_7D39E72949435427115CBCBD25F297DF
// 0x0008 (0x0008 - 0x0000)
struct BattleCommand_C_OnLoaded_7D39E72949435427115CBCBD25F297DF final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BattleCommand_C_OnLoaded_7D39E72949435427115CBCBD25F297DF) == 0x000008, "Wrong alignment on BattleCommand_C_OnLoaded_7D39E72949435427115CBCBD25F297DF");
static_assert(sizeof(BattleCommand_C_OnLoaded_7D39E72949435427115CBCBD25F297DF) == 0x000008, "Wrong size on BattleCommand_C_OnLoaded_7D39E72949435427115CBCBD25F297DF");
static_assert(offsetof(BattleCommand_C_OnLoaded_7D39E72949435427115CBCBD25F297DF, Loaded) == 0x000000, "Member 'BattleCommand_C_OnLoaded_7D39E72949435427115CBCBD25F297DF::Loaded' has a wrong offset!");

// Function BattleCommand.BattleCommand_C.OnLoaded_FC22B888429A4250960F64AD7E05ED41
// 0x0008 (0x0008 - 0x0000)
struct BattleCommand_C_OnLoaded_FC22B888429A4250960F64AD7E05ED41 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BattleCommand_C_OnLoaded_FC22B888429A4250960F64AD7E05ED41) == 0x000008, "Wrong alignment on BattleCommand_C_OnLoaded_FC22B888429A4250960F64AD7E05ED41");
static_assert(sizeof(BattleCommand_C_OnLoaded_FC22B888429A4250960F64AD7E05ED41) == 0x000008, "Wrong size on BattleCommand_C_OnLoaded_FC22B888429A4250960F64AD7E05ED41");
static_assert(offsetof(BattleCommand_C_OnLoaded_FC22B888429A4250960F64AD7E05ED41, Loaded) == 0x000000, "Member 'BattleCommand_C_OnLoaded_FC22B888429A4250960F64AD7E05ED41::Loaded' has a wrong offset!");

// Function BattleCommand.BattleCommand_C.StartSeq
// 0x03C0 (0x03C0 - 0x0000)
struct BattleCommand_C_StartSeq final
{
public:
	struct FBtlParty                              InParty;                                           // 0x0000(0x0320)(BlueprintVisible, BlueprintReadOnly, Parm)
	TScriptInterface<class IBPI_BattleMain_C>     InMainWork;                                        // 0x0320(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsCounterActor;                                    // 0x0330(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsNoMoveCamera;                                    // 0x0331(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NewParam;                                          // 0x0332(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_796B[0x5];                                     // 0x0333(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSkillCriticalValueOne>         SettleCriticalInfo;                                // 0x0338(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TScriptInterface<class IWBPI_BtlCommon_C>     CallFunc_InitDisappeared_self_CastInput;           // 0x0348(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_796C[0x7];                                     // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PTUtilInterface>  CallFunc_BI_GetPartyUtilInterface_retValue;        // 0x0360(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_OPTION_COMMON_SELECT_TYPE                   CallFunc_GetBattleCursorPositionType_ReturnValue;  // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_796D[0x7];                                     // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_BI_GetSideIsInFieldList_ReturnValue;      // 0x0378(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_796E[0x3];                                     // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MainInterface>    CallFunc_GetBPIMainInterface_AsBPI_Main_Interface; // 0x0390(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetBPIMainInterface_bSuccess;             // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_796F[0x3];                                     // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBTL_CURSOR_MEMORY_T                   CallFunc_Map_Find_Value;                           // 0x03A4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_CheckBattleDebugFlag2_ReturnValue;     // 0x03B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7970[0x2];                                     // 0x03B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CalcItemCursorIndex_ItemCursorIndex;      // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue;              // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x03BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCommand_C_StartSeq) == 0x000010, "Wrong alignment on BattleCommand_C_StartSeq");
static_assert(sizeof(BattleCommand_C_StartSeq) == 0x0003C0, "Wrong size on BattleCommand_C_StartSeq");
static_assert(offsetof(BattleCommand_C_StartSeq, InParty) == 0x000000, "Member 'BattleCommand_C_StartSeq::InParty' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_StartSeq, InMainWork) == 0x000320, "Member 'BattleCommand_C_StartSeq::InMainWork' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_StartSeq, IsCounterActor) == 0x000330, "Member 'BattleCommand_C_StartSeq::IsCounterActor' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_StartSeq, IsNoMoveCamera) == 0x000331, "Member 'BattleCommand_C_StartSeq::IsNoMoveCamera' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_StartSeq, NewParam) == 0x000332, "Member 'BattleCommand_C_StartSeq::NewParam' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_StartSeq, SettleCriticalInfo) == 0x000338, "Member 'BattleCommand_C_StartSeq::SettleCriticalInfo' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_StartSeq, CallFunc_InitDisappeared_self_CastInput) == 0x000348, "Member 'BattleCommand_C_StartSeq::CallFunc_InitDisappeared_self_CastInput' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_StartSeq, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000358, "Member 'BattleCommand_C_StartSeq::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_StartSeq, CallFunc_BI_GetPartyUtilInterface_retValue) == 0x000360, "Member 'BattleCommand_C_StartSeq::CallFunc_BI_GetPartyUtilInterface_retValue' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_StartSeq, CallFunc_GetBattleCursorPositionType_ReturnValue) == 0x000370, "Member 'BattleCommand_C_StartSeq::CallFunc_GetBattleCursorPositionType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_StartSeq, CallFunc_BI_GetSideIsInFieldList_ReturnValue) == 0x000378, "Member 'BattleCommand_C_StartSeq::CallFunc_BI_GetSideIsInFieldList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_StartSeq, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000388, "Member 'BattleCommand_C_StartSeq::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_StartSeq, CallFunc_Array_Length_ReturnValue) == 0x00038C, "Member 'BattleCommand_C_StartSeq::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_StartSeq, CallFunc_GetBPIMainInterface_AsBPI_Main_Interface) == 0x000390, "Member 'BattleCommand_C_StartSeq::CallFunc_GetBPIMainInterface_AsBPI_Main_Interface' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_StartSeq, CallFunc_GetBPIMainInterface_bSuccess) == 0x0003A0, "Member 'BattleCommand_C_StartSeq::CallFunc_GetBPIMainInterface_bSuccess' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_StartSeq, CallFunc_Map_Find_Value) == 0x0003A4, "Member 'BattleCommand_C_StartSeq::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_StartSeq, CallFunc_Map_Find_ReturnValue) == 0x0003B0, "Member 'BattleCommand_C_StartSeq::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_StartSeq, CallFunc_BI_CheckBattleDebugFlag2_ReturnValue) == 0x0003B1, "Member 'BattleCommand_C_StartSeq::CallFunc_BI_CheckBattleDebugFlag2_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_StartSeq, CallFunc_CalcItemCursorIndex_ItemCursorIndex) == 0x0003B4, "Member 'BattleCommand_C_StartSeq::CallFunc_CalcItemCursorIndex_ItemCursorIndex' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_StartSeq, CallFunc_SelectInt_ReturnValue) == 0x0003B8, "Member 'BattleCommand_C_StartSeq::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_StartSeq, CallFunc_AddToWidgetPrio_ReturnValue) == 0x0003BC, "Member 'BattleCommand_C_StartSeq::CallFunc_AddToWidgetPrio_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_StartSeq, CallFunc_IsInViewport_ReturnValue) == 0x0003BD, "Member 'BattleCommand_C_StartSeq::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");

// Function BattleCommand.BattleCommand_C.ChangeStep
// 0x0030 (0x0030 - 0x0000)
struct BattleCommand_C_ChangeStep final
{
public:
	E_BTL_UI_COMM_STEP                            Step;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7971[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CursorIndex;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TopIndex;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Top;                                               // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BTL_UI_COMM_STEP                            CallFunc_TopStep_TopStep;                          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_UI_COMM_STEP                            CallFunc_TopStep_TopStep_1;                        // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7972[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MainInterface>    CallFunc_GetBPIMainInterface_AsBPI_Main_Interface; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetBPIMainInterface_bSuccess;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_CheckBattleDebugFlag2_ReturnValue;     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCommand_C_ChangeStep) == 0x000008, "Wrong alignment on BattleCommand_C_ChangeStep");
static_assert(sizeof(BattleCommand_C_ChangeStep) == 0x000030, "Wrong size on BattleCommand_C_ChangeStep");
static_assert(offsetof(BattleCommand_C_ChangeStep, Step) == 0x000000, "Member 'BattleCommand_C_ChangeStep::Step' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ChangeStep, CursorIndex) == 0x000004, "Member 'BattleCommand_C_ChangeStep::CursorIndex' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ChangeStep, TopIndex) == 0x000008, "Member 'BattleCommand_C_ChangeStep::TopIndex' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ChangeStep, Top) == 0x00000C, "Member 'BattleCommand_C_ChangeStep::Top' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ChangeStep, Param_Index) == 0x000010, "Member 'BattleCommand_C_ChangeStep::Param_Index' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ChangeStep, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000014, "Member 'BattleCommand_C_ChangeStep::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ChangeStep, CallFunc_TopStep_TopStep) == 0x000015, "Member 'BattleCommand_C_ChangeStep::CallFunc_TopStep_TopStep' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ChangeStep, CallFunc_TopStep_TopStep_1) == 0x000016, "Member 'BattleCommand_C_ChangeStep::CallFunc_TopStep_TopStep_1' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ChangeStep, CallFunc_GetBPIMainInterface_AsBPI_Main_Interface) == 0x000018, "Member 'BattleCommand_C_ChangeStep::CallFunc_GetBPIMainInterface_AsBPI_Main_Interface' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ChangeStep, CallFunc_GetBPIMainInterface_bSuccess) == 0x000028, "Member 'BattleCommand_C_ChangeStep::CallFunc_GetBPIMainInterface_bSuccess' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ChangeStep, CallFunc_BI_CheckBattleDebugFlag2_ReturnValue) == 0x000029, "Member 'BattleCommand_C_ChangeStep::CallFunc_BI_CheckBattleDebugFlag2_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ChangeStep, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'BattleCommand_C_ChangeStep::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BattleCommand.BattleCommand_C.CallEndStep
// 0x0002 (0x0002 - 0x0000)
struct BattleCommand_C_CallEndStep final
{
public:
	E_BTL_UI_COMM_STEP                            Param_PrevStep;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCommand_C_CallEndStep) == 0x000001, "Wrong alignment on BattleCommand_C_CallEndStep");
static_assert(sizeof(BattleCommand_C_CallEndStep) == 0x000002, "Wrong size on BattleCommand_C_CallEndStep");
static_assert(offsetof(BattleCommand_C_CallEndStep, Param_PrevStep) == 0x000000, "Member 'BattleCommand_C_CallEndStep::Param_PrevStep' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_CallEndStep, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'BattleCommand_C_CallEndStep::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BattleCommand.BattleCommand_C.ChangeMenuVisibility
// 0x0028 (0x0028 - 0x0000)
struct BattleCommand_C_ChangeMenuVisibility final
{
public:
	bool                                          IsView;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7973[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IWBPI_BtlCommon_C>     CallFunc_Disappear_self_CastInput;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IWBPI_BtlCommon_C>     CallFunc_Appear_self_CastInput;                    // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCommand_C_ChangeMenuVisibility) == 0x000008, "Wrong alignment on BattleCommand_C_ChangeMenuVisibility");
static_assert(sizeof(BattleCommand_C_ChangeMenuVisibility) == 0x000028, "Wrong size on BattleCommand_C_ChangeMenuVisibility");
static_assert(offsetof(BattleCommand_C_ChangeMenuVisibility, IsView) == 0x000000, "Member 'BattleCommand_C_ChangeMenuVisibility::IsView' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ChangeMenuVisibility, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BattleCommand_C_ChangeMenuVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ChangeMenuVisibility, CallFunc_Disappear_self_CastInput) == 0x000008, "Member 'BattleCommand_C_ChangeMenuVisibility::CallFunc_Disappear_self_CastInput' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_ChangeMenuVisibility, CallFunc_Appear_self_CastInput) == 0x000018, "Member 'BattleCommand_C_ChangeMenuVisibility::CallFunc_Appear_self_CastInput' has a wrong offset!");

// Function BattleCommand.BattleCommand_C.EndSkillMenu
// 0x0003 (0x0003 - 0x0000)
struct BattleCommand_C_EndSkillMenu final
{
public:
	bool                                          CloseList;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsCharaChange;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsCancel;                                          // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCommand_C_EndSkillMenu) == 0x000001, "Wrong alignment on BattleCommand_C_EndSkillMenu");
static_assert(sizeof(BattleCommand_C_EndSkillMenu) == 0x000003, "Wrong size on BattleCommand_C_EndSkillMenu");
static_assert(offsetof(BattleCommand_C_EndSkillMenu, CloseList) == 0x000000, "Member 'BattleCommand_C_EndSkillMenu::CloseList' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_EndSkillMenu, IsCharaChange) == 0x000001, "Member 'BattleCommand_C_EndSkillMenu::IsCharaChange' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_EndSkillMenu, IsCancel) == 0x000002, "Member 'BattleCommand_C_EndSkillMenu::IsCancel' has a wrong offset!");

// Function BattleCommand.BattleCommand_C.SetVisibilitySkillList
// 0x0028 (0x0028 - 0x0000)
struct BattleCommand_C_SetVisibilitySkillList final
{
public:
	ESlateVisibility                              IsVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCancel;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7974[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IWBPI_BtlCommon_C>     CallFunc_Appear_self_CastInput;                    // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IWBPI_BtlCommon_C>     CallFunc_Disappear_self_CastInput;                 // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCommand_C_SetVisibilitySkillList) == 0x000008, "Wrong alignment on BattleCommand_C_SetVisibilitySkillList");
static_assert(sizeof(BattleCommand_C_SetVisibilitySkillList) == 0x000028, "Wrong size on BattleCommand_C_SetVisibilitySkillList");
static_assert(offsetof(BattleCommand_C_SetVisibilitySkillList, IsVisibility) == 0x000000, "Member 'BattleCommand_C_SetVisibilitySkillList::IsVisibility' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_SetVisibilitySkillList, IsCancel) == 0x000001, "Member 'BattleCommand_C_SetVisibilitySkillList::IsCancel' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_SetVisibilitySkillList, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'BattleCommand_C_SetVisibilitySkillList::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_SetVisibilitySkillList, CallFunc_Appear_self_CastInput) == 0x000008, "Member 'BattleCommand_C_SetVisibilitySkillList::CallFunc_Appear_self_CastInput' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_SetVisibilitySkillList, CallFunc_Disappear_self_CastInput) == 0x000018, "Member 'BattleCommand_C_SetVisibilitySkillList::CallFunc_Disappear_self_CastInput' has a wrong offset!");

// Function BattleCommand.BattleCommand_C.SetVisibilityItemList
// 0x0028 (0x0028 - 0x0000)
struct BattleCommand_C_SetVisibilityItemList final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7975[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IWBPI_BtlCommon_C>     CallFunc_Disappear_self_CastInput;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IWBPI_BtlCommon_C>     CallFunc_Appear_self_CastInput;                    // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCommand_C_SetVisibilityItemList) == 0x000008, "Wrong alignment on BattleCommand_C_SetVisibilityItemList");
static_assert(sizeof(BattleCommand_C_SetVisibilityItemList) == 0x000028, "Wrong size on BattleCommand_C_SetVisibilityItemList");
static_assert(offsetof(BattleCommand_C_SetVisibilityItemList, InVisibility) == 0x000000, "Member 'BattleCommand_C_SetVisibilityItemList::InVisibility' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_SetVisibilityItemList, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'BattleCommand_C_SetVisibilityItemList::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_SetVisibilityItemList, CallFunc_Disappear_self_CastInput) == 0x000008, "Member 'BattleCommand_C_SetVisibilityItemList::CallFunc_Disappear_self_CastInput' has a wrong offset!");
static_assert(offsetof(BattleCommand_C_SetVisibilityItemList, CallFunc_Appear_self_CastInput) == 0x000018, "Member 'BattleCommand_C_SetVisibilityItemList::CallFunc_Appear_self_CastInput' has a wrong offset!");

// Function BattleCommand.BattleCommand_C.EndCondition
// 0x0001 (0x0001 - 0x0000)
struct BattleCommand_C_EndCondition final
{
public:
	bool                                          CallFunc_BI_BattleUISwitch_NoUse;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCommand_C_EndCondition) == 0x000001, "Wrong alignment on BattleCommand_C_EndCondition");
static_assert(sizeof(BattleCommand_C_EndCondition) == 0x000001, "Wrong size on BattleCommand_C_EndCondition");
static_assert(offsetof(BattleCommand_C_EndCondition, CallFunc_BI_BattleUISwitch_NoUse) == 0x000000, "Member 'BattleCommand_C_EndCondition::CallFunc_BI_BattleUISwitch_NoUse' has a wrong offset!");

// Function BattleCommand.BattleCommand_C.CallEvent
// 0x0048 (0x0048 - 0x0000)
struct BattleCommand_C_CallEvent final
{
public:
	E_BTL_UI_COMM_STEP                            CallFunc_TopStep_TopStep;                          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7976[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 MoveDirection)>          K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7977[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsWB_Btl_List_Menu;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7978[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtlListMenu_C*                      CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCommand_C_CallEvent) == 0x000008, "Wrong alignment on BattleCommand_C_CallEvent");
static_assert(sizeof(BattleCommand_C_CallEvent) == 0x000048, "Wrong size on BattleCommand_C_CallEvent");
