#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleTaskModelManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BattleTaskModelManager.BattleTaskModelManager_C
// 0x0078 (0x0128 - 0x00B0)
class UBattleTaskModelManager_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<int32, class ACharaBase_C*>              M_TaskSpawnUnitArray;                              // 0x00B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ACharaBase_C*>                   M_ReserveDestroyArray;                             // 0x0108(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ACharaBase_C*>                   M_KeepRefUnitArray;                                // 0x0118(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BattleTaskModelManager(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void AddUnit(int32 TaskIndex, class ACharaBase_C* InUnit);
	void IsExist(int32 TaskIndex, bool* RetValue);
	void GetModelUnit(int32 TaskIndex, class ACharaBase_C** RetValue);
	void DeleteIndex(int32 TaskIndex);
	void DeleteAll();
	void UpdateReserveDestroy();
	void AddReserveDestroy(class ACharaBase_C* InUnit);
	void ReserveDestroyDeleteAll();
	void AddKeepRefUnit(const class ACharaBase_C*& InUnit);
	void DeleteKeepRefUnit();
	void GetKeepRefUnitList(TArray<class ACharaBase_C*>* RetValue);
	void BI_DestroyReserveUnits(bool* NoUse);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattleTaskModelManager_C">();
	}
	static class UBattleTaskModelManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleTaskModelManager_C>();
	}
};
static_assert(alignof(UBattleTaskModelManager_C) == 0x000008, "Wrong alignment on UBattleTaskModelManager_C");
static_assert(sizeof(UBattleTaskModelManager_C) == 0x000128, "Wrong size on UBattleTaskModelManager_C");
static_assert(offsetof(UBattleTaskModelManager_C, UberGraphFrame) == 0x0000B0, "Member 'UBattleTaskModelManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattleTaskModelManager_C, M_TaskSpawnUnitArray) == 0x0000B8, "Member 'UBattleTaskModelManager_C::M_TaskSpawnUnitArray' has a wrong offset!");
static_assert(offsetof(UBattleTaskModelManager_C, M_ReserveDestroyArray) == 0x000108, "Member 'UBattleTaskModelManager_C::M_ReserveDestroyArray' has a wrong offset!");
static_assert(offsetof(UBattleTaskModelManager_C, M_KeepRefUnitArray) == 0x000118, "Member 'UBattleTaskModelManager_C::M_KeepRefUnitArray' has a wrong offset!");

}

