#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleCamera

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BattleCamera.BattleCamera_C.ExecuteUbergraph_BattleCamera
// 0x00C0 (0x00C0 - 0x0000)
struct BattleCamera_C_ExecuteUbergraph_BattleCamera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2A19[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialParameterApplier*              K2Node_DynamicCast_AsMaterial_Parameter_Applier;   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1A[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1B[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFOVAngle_ReturnValue;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1C[0x2];                                     // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1D[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_RemoveBlendable_InBlendableObject_CastInput; // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1E[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateComponent_ContinueUpdate;           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCamera_C_ExecuteUbergraph_BattleCamera) == 0x000008, "Wrong alignment on BattleCamera_C_ExecuteUbergraph_BattleCamera");
static_assert(sizeof(BattleCamera_C_ExecuteUbergraph_BattleCamera) == 0x0000C0, "Wrong size on BattleCamera_C_ExecuteUbergraph_BattleCamera");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, EntryPoint) == 0x000000, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, K2Node_CustomEvent_Loaded_1) == 0x000018, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, Temp_object_Variable) == 0x000030, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, K2Node_CustomEvent_Loaded) == 0x000038, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, Temp_object_Variable_1) == 0x000040, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, K2Node_DynamicCast_AsMaterial_Parameter_Applier) == 0x000048, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::K2Node_DynamicCast_AsMaterial_Parameter_Applier' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, K2Node_DynamicCast_AsMaterial_Instance) == 0x000058, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::K2Node_DynamicCast_AsMaterial_Instance' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000068, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, CallFunc_GetPlayerController_ReturnValue) == 0x000070, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, CallFunc_GetPlayerController_ReturnValue_1) == 0x000078, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, CallFunc_GetFOVAngle_ReturnValue) == 0x000080, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::CallFunc_GetFOVAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, CallFunc_IsValid_ReturnValue) == 0x000084, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, CallFunc_IsValid_ReturnValue_1) == 0x000085, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000088, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, CallFunc_IsValid_ReturnValue_2) == 0x000098, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, CallFunc_RemoveBlendable_InBlendableObject_CastInput) == 0x0000A0, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::CallFunc_RemoveBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, K2Node_Event_EndPlayReason) == 0x0000B0, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, K2Node_Event_DeltaSeconds) == 0x0000B4, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_ExecuteUbergraph_BattleCamera, CallFunc_UpdateComponent_ContinueUpdate) == 0x0000B8, "Member 'BattleCamera_C_ExecuteUbergraph_BattleCamera::CallFunc_UpdateComponent_ContinueUpdate' has a wrong offset!");

// Function BattleCamera.BattleCamera_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BattleCamera_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleCamera_C_ReceiveTick) == 0x000004, "Wrong alignment on BattleCamera_C_ReceiveTick");
static_assert(sizeof(BattleCamera_C_ReceiveTick) == 0x000004, "Wrong size on BattleCamera_C_ReceiveTick");
static_assert(offsetof(BattleCamera_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BattleCamera_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BattleCamera.BattleCamera_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BattleCamera_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleCamera_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BattleCamera_C_ReceiveEndPlay");
static_assert(sizeof(BattleCamera_C_ReceiveEndPlay) == 0x000001, "Wrong size on BattleCamera_C_ReceiveEndPlay");
static_assert(offsetof(BattleCamera_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BattleCamera_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BattleCamera.BattleCamera_C.OnLoaded_F037AA5742592184378AD09B6B17F15B
// 0x0008 (0x0008 - 0x0000)
struct BattleCamera_C_OnLoaded_F037AA5742592184378AD09B6B17F15B final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleCamera_C_OnLoaded_F037AA5742592184378AD09B6B17F15B) == 0x000008, "Wrong alignment on BattleCamera_C_OnLoaded_F037AA5742592184378AD09B6B17F15B");
static_assert(sizeof(BattleCamera_C_OnLoaded_F037AA5742592184378AD09B6B17F15B) == 0x000008, "Wrong size on BattleCamera_C_OnLoaded_F037AA5742592184378AD09B6B17F15B");
static_assert(offsetof(BattleCamera_C_OnLoaded_F037AA5742592184378AD09B6B17F15B, Loaded) == 0x000000, "Member 'BattleCamera_C_OnLoaded_F037AA5742592184378AD09B6B17F15B::Loaded' has a wrong offset!");

// Function BattleCamera.BattleCamera_C.OnLoaded_944C3FC641F62CE9C4DDFFBE1BD13F20
// 0x0008 (0x0008 - 0x0000)
struct BattleCamera_C_OnLoaded_944C3FC641F62CE9C4DDFFBE1BD13F20 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleCamera_C_OnLoaded_944C3FC641F62CE9C4DDFFBE1BD13F20) == 0x000008, "Wrong alignment on BattleCamera_C_OnLoaded_944C3FC641F62CE9C4DDFFBE1BD13F20");
static_assert(sizeof(BattleCamera_C_OnLoaded_944C3FC641F62CE9C4DDFFBE1BD13F20) == 0x000008, "Wrong size on BattleCamera_C_OnLoaded_944C3FC641F62CE9C4DDFFBE1BD13F20");
static_assert(offsetof(BattleCamera_C_OnLoaded_944C3FC641F62CE9C4DDFFBE1BD13F20, Loaded) == 0x000000, "Member 'BattleCamera_C_OnLoaded_944C3FC641F62CE9C4DDFFBE1BD13F20::Loaded' has a wrong offset!");

// Function BattleCamera.BattleCamera_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct BattleCamera_C_UserConstructionScript final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCamera_C_UserConstructionScript) == 0x000010, "Wrong alignment on BattleCamera_C_UserConstructionScript");
static_assert(sizeof(BattleCamera_C_UserConstructionScript) == 0x000030, "Wrong size on BattleCamera_C_UserConstructionScript");
static_assert(offsetof(BattleCamera_C_UserConstructionScript, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'BattleCamera_C_UserConstructionScript::CallFunc_GetTransform_ReturnValue' has a wrong offset!");

// Function BattleCamera.BattleCamera_C.SetHome
// 0x0098 (0x0098 - 0x0000)
struct BattleCamera_C_SetHome final
{
public:
	float                                         BlendTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0004(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1F[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleCamera_C_SetHome) == 0x000008, "Wrong alignment on BattleCamera_C_SetHome");
static_assert(sizeof(BattleCamera_C_SetHome) == 0x000098, "Wrong size on BattleCamera_C_SetHome");
static_assert(offsetof(BattleCamera_C_SetHome, BlendTime) == 0x000000, "Member 'BattleCamera_C_SetHome::BlendTime' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetHome, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000004, "Member 'BattleCamera_C_SetHome::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetHome, CallFunc_K2_SetActorTransform_ReturnValue) == 0x00008C, "Member 'BattleCamera_C_SetHome::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetHome, CallFunc_GetPlayerController_ReturnValue) == 0x000090, "Member 'BattleCamera_C_SetHome::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function BattleCamera.BattleCamera_C.SetPartyFront
// 0x01A0 (0x01A0 - 0x0000)
struct BattleCamera_C_SetPartyFront final
{
public:
	TScriptInterface<class IBPI_CharaBaseAccessor_C> InUnit;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         DeltaTime;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A20[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCapsuleComponent*                      CallFunc_BI_GetCapsuleComponent_Param;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_BI_GetMeshComponent_MeshComp;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A21[0xC];                                     // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Find_Look_at_Rotation_with_UpVec_ReturnValue; // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               K2Node_Select_Default;                             // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0108(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCamera_C_SetPartyFront) == 0x000010, "Wrong alignment on BattleCamera_C_SetPartyFront");
static_assert(sizeof(BattleCamera_C_SetPartyFront) == 0x0001A0, "Wrong size on BattleCamera_C_SetPartyFront");
static_assert(offsetof(BattleCamera_C_SetPartyFront, InUnit) == 0x000000, "Member 'BattleCamera_C_SetPartyFront::InUnit' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetPartyFront, DeltaTime) == 0x000010, "Member 'BattleCamera_C_SetPartyFront::DeltaTime' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetPartyFront, Temp_bool_Variable) == 0x000014, "Member 'BattleCamera_C_SetPartyFront::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetPartyFront, CallFunc_BI_GetCapsuleComponent_Param) == 0x000018, "Member 'BattleCamera_C_SetPartyFront::CallFunc_BI_GetCapsuleComponent_Param' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetPartyFront, CallFunc_BI_GetMeshComponent_MeshComp) == 0x000020, "Member 'BattleCamera_C_SetPartyFront::CallFunc_BI_GetMeshComponent_MeshComp' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetPartyFront, CallFunc_GetForwardVector_ReturnValue) == 0x000028, "Member 'BattleCamera_C_SetPartyFront::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetPartyFront, CallFunc_GetSocketTransform_ReturnValue) == 0x000040, "Member 'BattleCamera_C_SetPartyFront::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetPartyFront, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000070, "Member 'BattleCamera_C_SetPartyFront::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetPartyFront, CallFunc_BreakTransform_Location) == 0x00007C, "Member 'BattleCamera_C_SetPartyFront::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetPartyFront, CallFunc_BreakTransform_Rotation) == 0x000088, "Member 'BattleCamera_C_SetPartyFront::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetPartyFront, CallFunc_BreakTransform_Scale) == 0x000094, "Member 'BattleCamera_C_SetPartyFront::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetPartyFront, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A0, "Member 'BattleCamera_C_SetPartyFront::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetPartyFront, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000AC, "Member 'BattleCamera_C_SetPartyFront::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetPartyFront, CallFunc_Find_Look_at_Rotation_with_UpVec_ReturnValue) == 0x0000B8, "Member 'BattleCamera_C_SetPartyFront::CallFunc_Find_Look_at_Rotation_with_UpVec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetPartyFront, K2Node_Select_Default) == 0x0000C4, "Member 'BattleCamera_C_SetPartyFront::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetPartyFront, CallFunc_MakeTransform_ReturnValue) == 0x0000D0, "Member 'BattleCamera_C_SetPartyFront::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetPartyFront, CallFunc_GetPlayerController_ReturnValue) == 0x000100, "Member 'BattleCamera_C_SetPartyFront::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetPartyFront, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000108, "Member 'BattleCamera_C_SetPartyFront::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetPartyFront, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000190, "Member 'BattleCamera_C_SetPartyFront::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");

// Function BattleCamera.BattleCamera_C.SetSkillCam
// 0x0150 (0x0150 - 0x0000)
struct BattleCamera_C_SetSkillCam final
{
public:
	TScriptInterface<class IBPI_CharaBaseAccessor_C> PartyIndex;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         DeltaTime;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BI_GetActorRotation_Rotation;             // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMeshComponent*                         CallFunc_BI_GetMeshComponent_MeshComp;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A22[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A23[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x00C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCamera_C_SetSkillCam) == 0x000010, "Wrong alignment on BattleCamera_C_SetSkillCam");
static_assert(sizeof(BattleCamera_C_SetSkillCam) == 0x000150, "Wrong size on BattleCamera_C_SetSkillCam");
static_assert(offsetof(BattleCamera_C_SetSkillCam, PartyIndex) == 0x000000, "Member 'BattleCamera_C_SetSkillCam::PartyIndex' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetSkillCam, DeltaTime) == 0x000010, "Member 'BattleCamera_C_SetSkillCam::DeltaTime' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetSkillCam, CallFunc_BI_GetActorRotation_Rotation) == 0x000014, "Member 'BattleCamera_C_SetSkillCam::CallFunc_BI_GetActorRotation_Rotation' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetSkillCam, CallFunc_BI_GetMeshComponent_MeshComp) == 0x000020, "Member 'BattleCamera_C_SetSkillCam::CallFunc_BI_GetMeshComponent_MeshComp' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetSkillCam, CallFunc_GetSocketTransform_ReturnValue) == 0x000030, "Member 'BattleCamera_C_SetSkillCam::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetSkillCam, CallFunc_GetPlayerController_ReturnValue) == 0x000060, "Member 'BattleCamera_C_SetSkillCam::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetSkillCam, CallFunc_BreakTransform_Location) == 0x000068, "Member 'BattleCamera_C_SetSkillCam::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetSkillCam, CallFunc_BreakTransform_Rotation) == 0x000074, "Member 'BattleCamera_C_SetSkillCam::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetSkillCam, CallFunc_BreakTransform_Scale) == 0x000080, "Member 'BattleCamera_C_SetSkillCam::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetSkillCam, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'BattleCamera_C_SetSkillCam::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetSkillCam, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0000C0, "Member 'BattleCamera_C_SetSkillCam::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetSkillCam, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000148, "Member 'BattleCamera_C_SetSkillCam::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");

// Function BattleCamera.BattleCamera_C.SetSplineCam
// 0x0018 (0x0018 - 0x0000)
struct BattleCamera_C_SetSplineCam final
{
public:
	class UObject*                                SplineActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EyeTarget;                                         // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleCamera_C_SetSplineCam) == 0x000008, "Wrong alignment on BattleCamera_C_SetSplineCam");
static_assert(sizeof(BattleCamera_C_SetSplineCam) == 0x000018, "Wrong size on BattleCamera_C_SetSplineCam");
static_assert(offsetof(BattleCamera_C_SetSplineCam, SplineActor) == 0x000000, "Member 'BattleCamera_C_SetSplineCam::SplineActor' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetSplineCam, EyeTarget) == 0x000008, "Member 'BattleCamera_C_SetSplineCam::EyeTarget' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetSplineCam, Speed) == 0x000014, "Member 'BattleCamera_C_SetSplineCam::Speed' has a wrong offset!");

// Function BattleCamera.BattleCamera_C.UpdateInterp
// 0x0340 (0x0340 - 0x0000)
struct BattleCamera_C_UpdateInterp final
{
public:
	float                                         Tick;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A24[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Lo_SubTrans;                                       // 0x0010(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FTransform                             Lo_Trans;                                          // 0x0040(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A25[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x00D4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A26[0x3];                                     // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A27[0xC];                                     // 0x0164(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0170(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A28[0x3];                                     // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A29[0x3];                                     // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A2A[0xC];                                     // 0x0214(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0220(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetFirstTransform_ReturnValue;            // 0x0250(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetSplinePointNum_retValue;               // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A2B[0x2];                                     // 0x0286(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_RotatorRotator_ReturnValue;    // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0293(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0294(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_3;                // 0x02AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_3;                // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_3;                   // 0x02C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterp_To_UpVec_Considered_Return_Value; // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A2C[0x3];                                     // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               K2Node_Select_Default;                             // 0x02EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x02F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2D[0xC];                                     // 0x0304(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0310(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCamera_C_UpdateInterp) == 0x000010, "Wrong alignment on BattleCamera_C_UpdateInterp");
static_assert(sizeof(BattleCamera_C_UpdateInterp) == 0x000340, "Wrong size on BattleCamera_C_UpdateInterp");
static_assert(offsetof(BattleCamera_C_UpdateInterp, Tick) == 0x000000, "Member 'BattleCamera_C_UpdateInterp::Tick' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, Lo_SubTrans) == 0x000010, "Member 'BattleCamera_C_UpdateInterp::Lo_SubTrans' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, Lo_Trans) == 0x000040, "Member 'BattleCamera_C_UpdateInterp::Lo_Trans' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, Temp_bool_Variable) == 0x000070, "Member 'BattleCamera_C_UpdateInterp::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BreakTransform_Location) == 0x000074, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BreakTransform_Rotation) == 0x000080, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BreakTransform_Scale) == 0x00008C, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BreakRotator_Roll) == 0x000098, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BreakRotator_Pitch) == 0x00009C, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BreakRotator_Yaw) == 0x0000A0, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_MakeVector_ReturnValue) == 0x0000A4, "Member 'BattleCamera_C_UpdateInterp::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BreakTransform_Location_1) == 0x0000B0, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BreakTransform_Rotation_1) == 0x0000BC, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BreakTransform_Scale_1) == 0x0000C8, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0000D4, "Member 'BattleCamera_C_UpdateInterp::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_K2_SetActorTransform_ReturnValue) == 0x00015C, "Member 'BattleCamera_C_UpdateInterp::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_VSize_ReturnValue) == 0x000160, "Member 'BattleCamera_C_UpdateInterp::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_GetTransform_ReturnValue) == 0x000170, "Member 'BattleCamera_C_UpdateInterp::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BreakTransform_Location_2) == 0x0001A0, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BreakTransform_Location_2' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BreakTransform_Rotation_2) == 0x0001AC, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BreakTransform_Rotation_2' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BreakTransform_Scale_2) == 0x0001B8, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BreakTransform_Scale_2' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001C4, "Member 'BattleCamera_C_UpdateInterp::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BreakRotator_Roll_1) == 0x0001C8, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BreakRotator_Pitch_1) == 0x0001CC, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BreakRotator_Yaw_1) == 0x0001D0, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001D4, "Member 'BattleCamera_C_UpdateInterp::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_MakeVector_ReturnValue_1) == 0x0001E0, "Member 'BattleCamera_C_UpdateInterp::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0001EC, "Member 'BattleCamera_C_UpdateInterp::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_IsValid_ReturnValue) == 0x0001F8, "Member 'BattleCamera_C_UpdateInterp::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BreakVector_X) == 0x0001FC, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BreakVector_Y) == 0x000200, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BreakVector_Z) == 0x000204, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_MakeRotator_ReturnValue) == 0x000208, "Member 'BattleCamera_C_UpdateInterp::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_MakeTransform_ReturnValue) == 0x000220, "Member 'BattleCamera_C_UpdateInterp::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_GetFirstTransform_ReturnValue) == 0x000250, "Member 'BattleCamera_C_UpdateInterp::CallFunc_GetFirstTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_GetSplinePointNum_retValue) == 0x000280, "Member 'BattleCamera_C_UpdateInterp::CallFunc_GetSplinePointNum_retValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_Greater_IntInt_ReturnValue) == 0x000284, "Member 'BattleCamera_C_UpdateInterp::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_IsValid_ReturnValue_1) == 0x000285, "Member 'BattleCamera_C_UpdateInterp::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_SelectFloat_ReturnValue) == 0x000288, "Member 'BattleCamera_C_UpdateInterp::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00028C, "Member 'BattleCamera_C_UpdateInterp::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_Less_FloatFloat_ReturnValue) == 0x000290, "Member 'BattleCamera_C_UpdateInterp::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_EqualEqual_RotatorRotator_ReturnValue) == 0x000291, "Member 'BattleCamera_C_UpdateInterp::CallFunc_EqualEqual_RotatorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BooleanAND_ReturnValue) == 0x000292, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BooleanOR_ReturnValue) == 0x000293, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000294, "Member 'BattleCamera_C_UpdateInterp::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002A0, "Member 'BattleCamera_C_UpdateInterp::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BreakTransform_Location_3) == 0x0002AC, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BreakTransform_Location_3' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BreakTransform_Rotation_3) == 0x0002B8, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BreakTransform_Rotation_3' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_BreakTransform_Scale_3) == 0x0002C4, "Member 'BattleCamera_C_UpdateInterp::CallFunc_BreakTransform_Scale_3' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_RInterp_To_UpVec_Considered_Return_Value) == 0x0002D0, "Member 'BattleCamera_C_UpdateInterp::CallFunc_RInterp_To_UpVec_Considered_Return_Value' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0002DC, "Member 'BattleCamera_C_UpdateInterp::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_RInterpTo_ReturnValue) == 0x0002E0, "Member 'BattleCamera_C_UpdateInterp::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, K2Node_Select_Default) == 0x0002EC, "Member 'BattleCamera_C_UpdateInterp::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_VInterpTo_ReturnValue) == 0x0002F8, "Member 'BattleCamera_C_UpdateInterp::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_UpdateInterp, CallFunc_MakeTransform_ReturnValue_1) == 0x000310, "Member 'BattleCamera_C_UpdateInterp::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");

// Function BattleCamera.BattleCamera_C.SetRailCam
// 0x0090 (0x0090 - 0x0000)
struct BattleCamera_C_SetRailCam final
{
public:
	class ABP_RailActor_C*                        SplineActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EyeTarget;                                         // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoop;                                            // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsReturn;                                          // 0x0015(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsLockTarget;                                      // 0x0016(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A2E[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ChangeSpeedPoint;                                  // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FirstSpeed;                                        // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SecondSpeed;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         brendSpeed;                                        // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPanCamera;                                       // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A2F[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Fovy;                                              // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A30[0x5];                                     // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetFirstTransform_ReturnValue;            // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A31[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTempoBlendValue_retValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCamera_C_SetRailCam) == 0x000010, "Wrong alignment on BattleCamera_C_SetRailCam");
static_assert(sizeof(BattleCamera_C_SetRailCam) == 0x000090, "Wrong size on BattleCamera_C_SetRailCam");
static_assert(offsetof(BattleCamera_C_SetRailCam, SplineActor) == 0x000000, "Member 'BattleCamera_C_SetRailCam::SplineActor' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetRailCam, EyeTarget) == 0x000008, "Member 'BattleCamera_C_SetRailCam::EyeTarget' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetRailCam, IsLoop) == 0x000014, "Member 'BattleCamera_C_SetRailCam::IsLoop' has a wrong offset!");
static_assert(offsetof(BattleCamera_C_SetRailCam, IsReturn) == 0x000015, "Member 'BattleCamera_C_SetRailCam::IsReturn' has a wrong offset!");
