#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleCamActorFactory

#include "Basic.hpp"

#include "RigRailData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BattleCamActorFactory.BattleCamActorFactory_C.ExecuteUbergraph_BattleCamActorFactory
// 0x0050 (0x0050 - 0x0000)
struct BattleCamActorFactory_C_ExecuteUbergraph_BattleCamActorFactory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D0[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleCamActorFactory_C_ExecuteUbergraph_BattleCamActorFactory) == 0x000008, "Wrong alignment on BattleCamActorFactory_C_ExecuteUbergraph_BattleCamActorFactory");
static_assert(sizeof(BattleCamActorFactory_C_ExecuteUbergraph_BattleCamActorFactory) == 0x000050, "Wrong size on BattleCamActorFactory_C_ExecuteUbergraph_BattleCamActorFactory");
static_assert(offsetof(BattleCamActorFactory_C_ExecuteUbergraph_BattleCamActorFactory, EntryPoint) == 0x000000, "Member 'BattleCamActorFactory_C_ExecuteUbergraph_BattleCamActorFactory::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_ExecuteUbergraph_BattleCamActorFactory, CallFunc_GetTimeSeconds_ReturnValue) == 0x000004, "Member 'BattleCamActorFactory_C_ExecuteUbergraph_BattleCamActorFactory::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_ExecuteUbergraph_BattleCamActorFactory, CallFunc_Conv_FloatToString_ReturnValue) == 0x000008, "Member 'BattleCamActorFactory_C_ExecuteUbergraph_BattleCamActorFactory::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_ExecuteUbergraph_BattleCamActorFactory, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'BattleCamActorFactory_C_ExecuteUbergraph_BattleCamActorFactory::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_ExecuteUbergraph_BattleCamActorFactory, K2Node_Event_EndPlayReason) == 0x000028, "Member 'BattleCamActorFactory_C_ExecuteUbergraph_BattleCamActorFactory::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_ExecuteUbergraph_BattleCamActorFactory, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x00002C, "Member 'BattleCamActorFactory_C_ExecuteUbergraph_BattleCamActorFactory::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_ExecuteUbergraph_BattleCamActorFactory, CallFunc_Conv_FloatToString_ReturnValue_1) == 0x000030, "Member 'BattleCamActorFactory_C_ExecuteUbergraph_BattleCamActorFactory::CallFunc_Conv_FloatToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_ExecuteUbergraph_BattleCamActorFactory, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000040, "Member 'BattleCamActorFactory_C_ExecuteUbergraph_BattleCamActorFactory::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");

// Function BattleCamActorFactory.BattleCamActorFactory_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BattleCamActorFactory_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleCamActorFactory_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BattleCamActorFactory_C_ReceiveEndPlay");
static_assert(sizeof(BattleCamActorFactory_C_ReceiveEndPlay) == 0x000001, "Wrong size on BattleCamActorFactory_C_ReceiveEndPlay");
static_assert(offsetof(BattleCamActorFactory_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BattleCamActorFactory_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BattleCamActorFactory.BattleCamActorFactory_C.SpawnRailActor
// 0x00A0 (0x00A0 - 0x0000)
struct BattleCamActorFactory_C_SpawnRailActor final
{
public:
	E_BTL_CAM_TYPE                                CamType;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D1[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PartyIndex;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RailActor_C*                        RetValue;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RailActor_C*                        CallFunc_Spawn_TiamatHead_retValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RailActor_C*                        CallFunc_Spawn_Command_retValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RailActor_C*                        CallFunc_Spawn_Target_retValue;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RailActor_C*                        CallFunc_Spawn_Recam_retValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RailActor_C*                        CallFunc_Spawn_BadStatus_retValue;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RailActor_C*                        CallFunc_Spawn_BadStatus_One_retValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RailActor_C*                        CallFunc_Spawn_Command_retValue_1;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RailActor_C*                        CallFunc_Spawn_Command_retValue_2;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RailActor_C*                        CallFunc_Spawn_Summon_One_retValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RailActor_C*                        CallFunc_Spawn_N_Command_retValue;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RailActor_C*                        CallFunc_Spawn_N_Command_retValue_1;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RailActor_C*                        CallFunc_Spawn_Summon_retValue;                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33D2[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RailActor_C*                        CallFunc_Spawn_FusionForm_retValue;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RailActor_C*                        CallFunc_Spawn_Result_retValue;                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RailActor_C*                        CallFunc_Spawn_TurnPrevEnemy_retValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RailActor_C*                        CallFunc_Spawn_Start_retValue;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RailActor_C*                        CallFunc_Spawn_TurnPrevPlayer_Output_Get;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleCamActorFactory_C_SpawnRailActor) == 0x000008, "Wrong alignment on BattleCamActorFactory_C_SpawnRailActor");
static_assert(sizeof(BattleCamActorFactory_C_SpawnRailActor) == 0x0000A0, "Wrong size on BattleCamActorFactory_C_SpawnRailActor");
static_assert(offsetof(BattleCamActorFactory_C_SpawnRailActor, CamType) == 0x000000, "Member 'BattleCamActorFactory_C_SpawnRailActor::CamType' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_SpawnRailActor, PartyIndex) == 0x000004, "Member 'BattleCamActorFactory_C_SpawnRailActor::PartyIndex' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_SpawnRailActor, RetValue) == 0x000008, "Member 'BattleCamActorFactory_C_SpawnRailActor::RetValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_SpawnRailActor, CallFunc_Spawn_TiamatHead_retValue) == 0x000010, "Member 'BattleCamActorFactory_C_SpawnRailActor::CallFunc_Spawn_TiamatHead_retValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_SpawnRailActor, CallFunc_Spawn_Command_retValue) == 0x000018, "Member 'BattleCamActorFactory_C_SpawnRailActor::CallFunc_Spawn_Command_retValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_SpawnRailActor, CallFunc_Spawn_Target_retValue) == 0x000020, "Member 'BattleCamActorFactory_C_SpawnRailActor::CallFunc_Spawn_Target_retValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_SpawnRailActor, CallFunc_Spawn_Recam_retValue) == 0x000028, "Member 'BattleCamActorFactory_C_SpawnRailActor::CallFunc_Spawn_Recam_retValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_SpawnRailActor, CallFunc_Spawn_BadStatus_retValue) == 0x000030, "Member 'BattleCamActorFactory_C_SpawnRailActor::CallFunc_Spawn_BadStatus_retValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_SpawnRailActor, CallFunc_Spawn_BadStatus_One_retValue) == 0x000038, "Member 'BattleCamActorFactory_C_SpawnRailActor::CallFunc_Spawn_BadStatus_One_retValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_SpawnRailActor, CallFunc_Spawn_Command_retValue_1) == 0x000040, "Member 'BattleCamActorFactory_C_SpawnRailActor::CallFunc_Spawn_Command_retValue_1' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_SpawnRailActor, CallFunc_Spawn_Command_retValue_2) == 0x000048, "Member 'BattleCamActorFactory_C_SpawnRailActor::CallFunc_Spawn_Command_retValue_2' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_SpawnRailActor, CallFunc_Spawn_Summon_One_retValue) == 0x000050, "Member 'BattleCamActorFactory_C_SpawnRailActor::CallFunc_Spawn_Summon_One_retValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_SpawnRailActor, CallFunc_Spawn_N_Command_retValue) == 0x000058, "Member 'BattleCamActorFactory_C_SpawnRailActor::CallFunc_Spawn_N_Command_retValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_SpawnRailActor, CallFunc_Spawn_N_Command_retValue_1) == 0x000060, "Member 'BattleCamActorFactory_C_SpawnRailActor::CallFunc_Spawn_N_Command_retValue_1' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_SpawnRailActor, CallFunc_Spawn_Summon_retValue) == 0x000068, "Member 'BattleCamActorFactory_C_SpawnRailActor::CallFunc_Spawn_Summon_retValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_SpawnRailActor, K2Node_SwitchEnum_CmpSuccess) == 0x000070, "Member 'BattleCamActorFactory_C_SpawnRailActor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_SpawnRailActor, CallFunc_Spawn_FusionForm_retValue) == 0x000078, "Member 'BattleCamActorFactory_C_SpawnRailActor::CallFunc_Spawn_FusionForm_retValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_SpawnRailActor, CallFunc_Spawn_Result_retValue) == 0x000080, "Member 'BattleCamActorFactory_C_SpawnRailActor::CallFunc_Spawn_Result_retValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_SpawnRailActor, CallFunc_Spawn_TurnPrevEnemy_retValue) == 0x000088, "Member 'BattleCamActorFactory_C_SpawnRailActor::CallFunc_Spawn_TurnPrevEnemy_retValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_SpawnRailActor, CallFunc_Spawn_Start_retValue) == 0x000090, "Member 'BattleCamActorFactory_C_SpawnRailActor::CallFunc_Spawn_Start_retValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_SpawnRailActor, CallFunc_Spawn_TurnPrevPlayer_Output_Get) == 0x000098, "Member 'BattleCamActorFactory_C_SpawnRailActor::CallFunc_Spawn_TurnPrevPlayer_Output_Get' has a wrong offset!");

// Function BattleCamActorFactory.BattleCamActorFactory_C.Spawn_TurnPrevPlayer
// 0x0330 (0x0330 - 0x0000)
struct BattleCamActorFactory_C_Spawn_TurnPrevPlayer final
{
public:
	bool                                          IsPreview;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33D3[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RailActor_C*                        Output_Get;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Lo_RowNamePool;                                    // 0x0010(0x0010)(Edit, BlueprintVisible)
	bool                                          Lo_IsIgnoreSightCheck;                             // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Lo_ReserveDestroyCurrent;                          // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Lo_IsRotateRailOffset;                             // 0x0022(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33D4[0x5];                                     // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Lo_DebugItemPath;                                  // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Lo_IsChecked;                                      // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33D5[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Lo_RowName;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FTransform                             Lo_Transform;                                      // 0x0050(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class FString                                 Lo_DataName;                                       // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSideFirstIndex_retValue;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33D6[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_MakeName_TurnPrev_CameraNames;            // 0x00B0(0x0010)(ReferenceParm)
	struct FTransform                             CallFunc_IdentifyTransform_ReturnValue;            // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RailActor_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetOriginUpVec_UpVec;                     // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D7[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0110(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0140(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSameCameraName_IsSame;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33D8[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Debug_GetCameraName_CameraName;           // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleCamActorFactory_C> CallFunc_SetCamFactory_Factory_CastInput;          // 0x0208(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Debug_IsUseDebugData_IsUse;               // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33D9[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33DA[0x8];                                     // 0x0248(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigRailData                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0250(0x0090)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckSplineSight_isClear;                 // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33DB[0xE];                                     // 0x02E2(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_CalcCameraTransform_ret;                  // 0x02F0(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer) == 0x000010, "Wrong alignment on BattleCamActorFactory_C_Spawn_TurnPrevPlayer");
static_assert(sizeof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer) == 0x000330, "Wrong size on BattleCamActorFactory_C_Spawn_TurnPrevPlayer");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, IsPreview) == 0x000000, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::IsPreview' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, Output_Get) == 0x000008, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::Output_Get' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, Lo_RowNamePool) == 0x000010, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::Lo_RowNamePool' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, Lo_IsIgnoreSightCheck) == 0x000020, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::Lo_IsIgnoreSightCheck' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, Lo_ReserveDestroyCurrent) == 0x000021, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::Lo_ReserveDestroyCurrent' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, Lo_IsRotateRailOffset) == 0x000022, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::Lo_IsRotateRailOffset' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, Lo_DebugItemPath) == 0x000028, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::Lo_DebugItemPath' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, Lo_IsChecked) == 0x000038, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::Lo_IsChecked' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, Lo_RowName) == 0x000040, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::Lo_RowName' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, Lo_Transform) == 0x000050, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::Lo_Transform' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, Lo_DataName) == 0x000080, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::Lo_DataName' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_GetSideFirstIndex_retValue) == 0x000090, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_GetSideFirstIndex_retValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000098, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, K2Node_MakeArray_Array) == 0x0000A0, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_MakeName_TurnPrev_CameraNames) == 0x0000B0, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_MakeName_TurnPrev_CameraNames' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_IdentifyTransform_ReturnValue) == 0x0000C0, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_IdentifyTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000F0, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000F8, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_GetOriginUpVec_UpVec) == 0x000100, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_GetOriginUpVec_UpVec' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_MakeTransform_ReturnValue) == 0x000110, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000140, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_Conv_StringToName_ReturnValue) == 0x0001C8, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_IsSameCameraName_IsSame) == 0x0001D0, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_IsSameCameraName_IsSame' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_Concat_StrStr_ReturnValue) == 0x0001D8, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_Debug_GetCameraName_CameraName) == 0x0001E8, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_Debug_GetCameraName_CameraName' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0001F8, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_SetCamFactory_Factory_CastInput) == 0x000208, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_SetCamFactory_Factory_CastInput' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_Debug_IsUseDebugData_IsUse) == 0x000218, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_Debug_IsUseDebugData_IsUse' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000220, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000230, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000240, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_GetDataTableRowFromName_OutRow) == 0x000250, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0002E0, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_CheckSplineSight_isClear) == 0x0002E1, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_CheckSplineSight_isClear' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_CalcCameraTransform_ret) == 0x0002F0, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_CalcCameraTransform_ret' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_Array_Length_ReturnValue_1) == 0x000320, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_TurnPrevPlayer, CallFunc_Greater_IntInt_ReturnValue) == 0x000324, "Member 'BattleCamActorFactory_C_Spawn_TurnPrevPlayer::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BattleCamActorFactory.BattleCamActorFactory_C.GetMainWork
// 0x0030 (0x0030 - 0x0000)
struct BattleCamActorFactory_C_GetMainWork final
{
public:
	TScriptInterface<class IBPI_BattleMain_C>     AsBPI_Battle_Main;                                 // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleMain_C>     K2Node_DynamicCast_AsBPI_Battle_Main;              // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCamActorFactory_C_GetMainWork) == 0x000008, "Wrong alignment on BattleCamActorFactory_C_GetMainWork");
static_assert(sizeof(BattleCamActorFactory_C_GetMainWork) == 0x000030, "Wrong size on BattleCamActorFactory_C_GetMainWork");
static_assert(offsetof(BattleCamActorFactory_C_GetMainWork, AsBPI_Battle_Main) == 0x000000, "Member 'BattleCamActorFactory_C_GetMainWork::AsBPI_Battle_Main' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_GetMainWork, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BattleCamActorFactory_C_GetMainWork::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_GetMainWork, K2Node_DynamicCast_AsBPI_Battle_Main) == 0x000018, "Member 'BattleCamActorFactory_C_GetMainWork::K2Node_DynamicCast_AsBPI_Battle_Main' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_GetMainWork, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BattleCamActorFactory_C_GetMainWork::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BattleCamActorFactory.BattleCamActorFactory_C.GetPartySystem
// 0x0010 (0x0010 - 0x0000)
struct BattleCamActorFactory_C_GetPartySystem final
{
public:
	TScriptInterface<class IBPI_BattleParty_C>    Ret;                                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCamActorFactory_C_GetPartySystem) == 0x000008, "Wrong alignment on BattleCamActorFactory_C_GetPartySystem");
static_assert(sizeof(BattleCamActorFactory_C_GetPartySystem) == 0x000010, "Wrong size on BattleCamActorFactory_C_GetPartySystem");
static_assert(offsetof(BattleCamActorFactory_C_GetPartySystem, Ret) == 0x000000, "Member 'BattleCamActorFactory_C_GetPartySystem::Ret' has a wrong offset!");

// Function BattleCamActorFactory.BattleCamActorFactory_C.Spawn_Start
// 0x04E0 (0x04E0 - 0x0000)
struct BattleCamActorFactory_C_Spawn_Start final
{
public:
	bool                                          IsPrevBattle;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33DC[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DevIDOption;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class ABP_RailActor_C*                        RetValue;                                          // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Lo_DevIDOption;                                    // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Lo_IsPreview;                                      // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33DD[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Lo_PrevLocation;                                   // 0x0034(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Lo_RowNamePool;                                    // 0x0040(0x0010)(Edit, BlueprintVisible)
	bool                                          Lo_IsIgnoreSightCheck;                             // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Lo_IsReserveDestroyCurrent;                        // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33DE[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_CAMERA_SIDE_LR_TYPE>                 Lo_InvalidLRCamera;                                // 0x0058(0x0010)(Edit, BlueprintVisible)
	class FString                                 Lo_DebugMenuPath;                                  // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Lo_RowName;                                        // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Lo_IsChecked;                                      // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33DF[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Lo_Transform;                                      // 0x0090(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class FString                                 Lo_DataName;                                       // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleCamActorFactory_C> CallFunc_SetCamFactory_Factory_CastInput;          // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class FString>                         CallFunc_MakeName_Start_CameraNames;               // 0x00E0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33E0[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_InvestigateSideMaxSizeFloat_Scale;        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33E1[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> CallFunc_Array_Get_Item;                           // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33E2[0x3];                                     // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0190(0x0010)(ReferenceParm)
	struct FTransform                             CallFunc_IdentifyTransform_ReturnValue;            // 0x01A0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_IdentifyTransform_ReturnValue_1;          // 0x01D0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RailActor_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetOriginUpVec_UpVec;                     // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0228(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsSameCameraName_IsSame;                  // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33E3[0x3];                                     // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x02B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33E4[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Debug_GetCameraName_CameraName;           // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Debug_IsUseDebugData_IsUse;               // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33E5[0x7];                                     // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0310(0x0030)(IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0340(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33E6[0x8];                                     // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigRailData                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0370(0x0090)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33E7[0x3];                                     // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_RetrieveSocketName_ret;                   // 0x0404(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RetrieveSocketName_isAllSelect;           // 0x040C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckSplineSight_isClear;                 // 0x040D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33E8[0x2];                                     // 0x040E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigRailPlayInfo                       K2Node_MakeStruct_RigRailPlayInfo;                 // 0x0410(0x0034)(NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0444(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33E9[0xB];                                     // 0x0445(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_CalcCameraTransform_ret;                  // 0x0450(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_BI_GetSocketTransform_RetVal;             // 0x0480(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x04B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x04BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x04C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x04D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleCamActorFactory_C_Spawn_Start) == 0x000010, "Wrong alignment on BattleCamActorFactory_C_Spawn_Start");
static_assert(sizeof(BattleCamActorFactory_C_Spawn_Start) == 0x0004E0, "Wrong size on BattleCamActorFactory_C_Spawn_Start");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, IsPrevBattle) == 0x000000, "Member 'BattleCamActorFactory_C_Spawn_Start::IsPrevBattle' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, DevIDOption) == 0x000008, "Member 'BattleCamActorFactory_C_Spawn_Start::DevIDOption' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, RetValue) == 0x000018, "Member 'BattleCamActorFactory_C_Spawn_Start::RetValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, Lo_DevIDOption) == 0x000020, "Member 'BattleCamActorFactory_C_Spawn_Start::Lo_DevIDOption' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, Lo_IsPreview) == 0x000030, "Member 'BattleCamActorFactory_C_Spawn_Start::Lo_IsPreview' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, Lo_PrevLocation) == 0x000034, "Member 'BattleCamActorFactory_C_Spawn_Start::Lo_PrevLocation' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, Lo_RowNamePool) == 0x000040, "Member 'BattleCamActorFactory_C_Spawn_Start::Lo_RowNamePool' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, Lo_IsIgnoreSightCheck) == 0x000050, "Member 'BattleCamActorFactory_C_Spawn_Start::Lo_IsIgnoreSightCheck' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, Lo_IsReserveDestroyCurrent) == 0x000051, "Member 'BattleCamActorFactory_C_Spawn_Start::Lo_IsReserveDestroyCurrent' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, Lo_InvalidLRCamera) == 0x000058, "Member 'BattleCamActorFactory_C_Spawn_Start::Lo_InvalidLRCamera' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, Lo_DebugMenuPath) == 0x000068, "Member 'BattleCamActorFactory_C_Spawn_Start::Lo_DebugMenuPath' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, Lo_RowName) == 0x000078, "Member 'BattleCamActorFactory_C_Spawn_Start::Lo_RowName' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, Lo_IsChecked) == 0x000088, "Member 'BattleCamActorFactory_C_Spawn_Start::Lo_IsChecked' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, Lo_Transform) == 0x000090, "Member 'BattleCamActorFactory_C_Spawn_Start::Lo_Transform' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, Lo_DataName) == 0x0000C0, "Member 'BattleCamActorFactory_C_Spawn_Start::Lo_DataName' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_SetCamFactory_Factory_CastInput) == 0x0000D0, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_SetCamFactory_Factory_CastInput' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_MakeName_Start_CameraNames) == 0x0000E0, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_MakeName_Start_CameraNames' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_Array_Length_ReturnValue_1) == 0x0000F4, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, Temp_int_Loop_Counter_Variable) == 0x0000F8, "Member 'BattleCamActorFactory_C_Spawn_Start::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_Clamp_ReturnValue) == 0x0000FC, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_Less_IntInt_ReturnValue) == 0x000100, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000104, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_Add_IntInt_ReturnValue) == 0x000108, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, Temp_int_Array_Index_Variable) == 0x00010C, "Member 'BattleCamActorFactory_C_Spawn_Start::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_InvestigateSideMaxSizeFloat_Scale) == 0x000110, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_InvestigateSideMaxSizeFloat_Scale' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_Array_Get_Item) == 0x000118, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_BreakTransform_Location) == 0x000128, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_BreakTransform_Rotation) == 0x000134, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_BreakTransform_Scale) == 0x000140, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_GetUpVector_ReturnValue) == 0x00014C, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_BreakTransform_Location_1) == 0x000158, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_BreakTransform_Rotation_1) == 0x000164, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_BreakTransform_Scale_1) == 0x000170, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_Divide_VectorFloat_ReturnValue) == 0x00017C, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_Array_Length_ReturnValue_2) == 0x000188, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00018C, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, K2Node_MakeArray_Array) == 0x000190, "Member 'BattleCamActorFactory_C_Spawn_Start::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_IdentifyTransform_ReturnValue) == 0x0001A0, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_IdentifyTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_IdentifyTransform_ReturnValue_1) == 0x0001D0, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_IdentifyTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000200, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_FinishSpawningActor_ReturnValue) == 0x000208, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_GetOriginUpVec_UpVec) == 0x000210, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_GetOriginUpVec_UpVec' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_SelectVector_ReturnValue) == 0x00021C, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000228, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_IsSameCameraName_IsSame) == 0x0002B0, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_IsSameCameraName_IsSame' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_Conv_StringToName_ReturnValue) == 0x0002B4, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_Array_Length_ReturnValue_3) == 0x0002BC, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_Concat_StrStr_ReturnValue) == 0x0002C0, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_Greater_IntInt_ReturnValue) == 0x0002D0, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0002D8, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0002E8, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_Debug_GetCameraName_CameraName) == 0x0002F8, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_Debug_GetCameraName_CameraName' has a wrong offset!");
static_assert(offsetof(BattleCamActorFactory_C_Spawn_Start, CallFunc_Debug_IsUseDebugData_IsUse) == 0x000308, "Member 'BattleCamActorFactory_C_Spawn_Start::CallFunc_Debug_IsUseDebugData_IsUse' has a wrong offset!");
