#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePostProcessCtrl

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BattlePostProcessCtrl.BattlePostProcessCtrl_C.ExecuteUbergraph_BattlePostProcessCtrl
// 0x00E8 (0x00E8 - 0x0000)
struct BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPI_ReturnValue;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ActorIndex;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaBase_C*                           CallFunc_GetPartyUnit_Unit;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPartyUnit_IsValid;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPI_ReturnValue_1;                      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_5;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_BPL_GetBIBattleMain_retValue;             // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPL_GetBIBattleMain_success;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BI_GetBattlePlayRate_PlayRate;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_6;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_7;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPI_ReturnValue_2;                      // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_8;          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_9;          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_10;         // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl) == 0x000008, "Wrong alignment on BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl");
static_assert(sizeof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl) == 0x0000E8, "Wrong size on BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, EntryPoint) == 0x000000, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000004, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_GetPI_ReturnValue) == 0x00000C, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_GetPI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000010, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000014, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000018, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, K2Node_CustomEvent_ActorIndex) == 0x00001C, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::K2Node_CustomEvent_ActorIndex' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_GetPartyUnit_Unit) == 0x000028, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_GetPartyUnit_Unit' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_GetPartyUnit_IsValid) == 0x000030, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_GetPartyUnit_IsValid' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x000034, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_GetPI_ReturnValue_1) == 0x000038, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_GetPI_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_Divide_FloatFloat_ReturnValue_4) == 0x00003C, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_Divide_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_GetWorldDeltaSeconds_ReturnValue_2) == 0x000040, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_GetWorldDeltaSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, K2Node_CustomEvent_Actor) == 0x000048, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_Divide_FloatFloat_ReturnValue_5) == 0x000050, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_Divide_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_Array_Add_ReturnValue) == 0x000054, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_Array_Add_ReturnValue_1) == 0x000058, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_BPL_GetBIBattleMain_retValue) == 0x000060, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_BPL_GetBIBattleMain_retValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_BPL_GetBIBattleMain_success) == 0x000070, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_BPL_GetBIBattleMain_success' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_BI_GetBattlePlayRate_PlayRate) == 0x000074, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_BI_GetBattlePlayRate_PlayRate' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_Divide_FloatFloat_ReturnValue_6) == 0x000078, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_Divide_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00007C, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_GetTimeSeconds_ReturnValue) == 0x000080, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_Divide_FloatFloat_ReturnValue_7) == 0x000084, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_Divide_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_Conv_FloatToString_ReturnValue) == 0x000088, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_Concat_StrStr_ReturnValue) == 0x000098, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x0000A8, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_Conv_FloatToString_ReturnValue_1) == 0x0000B0, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_Conv_FloatToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000C0, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_GetPI_ReturnValue_2) == 0x0000D0, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_GetPI_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_Divide_FloatFloat_ReturnValue_8) == 0x0000D4, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_Divide_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, K2Node_Event_DeltaSeconds) == 0x0000D8, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_Divide_FloatFloat_ReturnValue_9) == 0x0000DC, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_Divide_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0000E0, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl, CallFunc_Divide_FloatFloat_ReturnValue_10) == 0x0000E4, "Member 'BattlePostProcessCtrl_C_ExecuteUbergraph_BattlePostProcessCtrl::CallFunc_Divide_FloatFloat_ReturnValue_10' has a wrong offset!");

// Function BattlePostProcessCtrl.BattlePostProcessCtrl_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BattlePostProcessCtrl_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePostProcessCtrl_C_ReceiveTick) == 0x000004, "Wrong alignment on BattlePostProcessCtrl_C_ReceiveTick");
static_assert(sizeof(BattlePostProcessCtrl_C_ReceiveTick) == 0x000004, "Wrong size on BattlePostProcessCtrl_C_ReceiveTick");
static_assert(offsetof(BattlePostProcessCtrl_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BattlePostProcessCtrl_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BattlePostProcessCtrl.BattlePostProcessCtrl_C.CounterActorStopEnd2
// 0x0008 (0x0008 - 0x0000)
struct BattlePostProcessCtrl_C_CounterActorStopEnd2 final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePostProcessCtrl_C_CounterActorStopEnd2) == 0x000008, "Wrong alignment on BattlePostProcessCtrl_C_CounterActorStopEnd2");
static_assert(sizeof(BattlePostProcessCtrl_C_CounterActorStopEnd2) == 0x000008, "Wrong size on BattlePostProcessCtrl_C_CounterActorStopEnd2");
static_assert(offsetof(BattlePostProcessCtrl_C_CounterActorStopEnd2, Actor) == 0x000000, "Member 'BattlePostProcessCtrl_C_CounterActorStopEnd2::Actor' has a wrong offset!");

// Function BattlePostProcessCtrl.BattlePostProcessCtrl_C.CounterActorStopEnd
// 0x0004 (0x0004 - 0x0000)
struct BattlePostProcessCtrl_C_CounterActorStopEnd final
{
public:
	int32                                         ActorIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePostProcessCtrl_C_CounterActorStopEnd) == 0x000004, "Wrong alignment on BattlePostProcessCtrl_C_CounterActorStopEnd");
static_assert(sizeof(BattlePostProcessCtrl_C_CounterActorStopEnd) == 0x000004, "Wrong size on BattlePostProcessCtrl_C_CounterActorStopEnd");
static_assert(offsetof(BattlePostProcessCtrl_C_CounterActorStopEnd, ActorIndex) == 0x000000, "Member 'BattlePostProcessCtrl_C_CounterActorStopEnd::ActorIndex' has a wrong offset!");

// Function BattlePostProcessCtrl.BattlePostProcessCtrl_C.Setup
// 0x0048 (0x0048 - 0x0000)
struct BattlePostProcessCtrl_C_Setup final
{
public:
	class UMaterialInstanceDynamic*               BattleMapDark;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattlePostProcessActor_C*              CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BI_AddOrUpdateBlendable_RetVal;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattlePostProcessVolume*               K2Node_DynamicCast_AsBattle_Post_Process_Volume;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePostProcessCtrl_C_Setup) == 0x000008, "Wrong alignment on BattlePostProcessCtrl_C_Setup");
static_assert(sizeof(BattlePostProcessCtrl_C_Setup) == 0x000048, "Wrong size on BattlePostProcessCtrl_C_Setup");
static_assert(offsetof(BattlePostProcessCtrl_C_Setup, BattleMapDark) == 0x000000, "Member 'BattlePostProcessCtrl_C_Setup::BattleMapDark' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_Setup, CallFunc_GetActorOfClass_ReturnValue) == 0x000008, "Member 'BattlePostProcessCtrl_C_Setup::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_Setup, CallFunc_BI_AddOrUpdateBlendable_RetVal) == 0x000010, "Member 'BattlePostProcessCtrl_C_Setup::CallFunc_BI_AddOrUpdateBlendable_RetVal' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_Setup, CallFunc_GetAllActorsWithTag_OutActors) == 0x000018, "Member 'BattlePostProcessCtrl_C_Setup::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_Setup, CallFunc_Array_Get_Item) == 0x000028, "Member 'BattlePostProcessCtrl_C_Setup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_Setup, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BattlePostProcessCtrl_C_Setup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_Setup, K2Node_DynamicCast_AsBattle_Post_Process_Volume) == 0x000038, "Member 'BattlePostProcessCtrl_C_Setup::K2Node_DynamicCast_AsBattle_Post_Process_Volume' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_Setup, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BattlePostProcessCtrl_C_Setup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_Setup, CallFunc_Greater_IntInt_ReturnValue) == 0x000041, "Member 'BattlePostProcessCtrl_C_Setup::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BattlePostProcessCtrl.BattlePostProcessCtrl_C.SwRadialBlur
// 0x0020 (0x0020 - 0x0000)
struct BattlePostProcessCtrl_C_SwRadialBlur final
{
public:
	bool                                          Sw;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Lo_Value;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_BPL_GetBIBattleMain_retValue;             // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPL_GetBIBattleMain_success;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BI_GetBattlePlayRate_PlayRate;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePostProcessCtrl_C_SwRadialBlur) == 0x000008, "Wrong alignment on BattlePostProcessCtrl_C_SwRadialBlur");
static_assert(sizeof(BattlePostProcessCtrl_C_SwRadialBlur) == 0x000020, "Wrong size on BattlePostProcessCtrl_C_SwRadialBlur");
static_assert(offsetof(BattlePostProcessCtrl_C_SwRadialBlur, Sw) == 0x000000, "Member 'BattlePostProcessCtrl_C_SwRadialBlur::Sw' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_SwRadialBlur, Lo_Value) == 0x000004, "Member 'BattlePostProcessCtrl_C_SwRadialBlur::Lo_Value' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_SwRadialBlur, CallFunc_BPL_GetBIBattleMain_retValue) == 0x000008, "Member 'BattlePostProcessCtrl_C_SwRadialBlur::CallFunc_BPL_GetBIBattleMain_retValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_SwRadialBlur, CallFunc_BPL_GetBIBattleMain_success) == 0x000018, "Member 'BattlePostProcessCtrl_C_SwRadialBlur::CallFunc_BPL_GetBIBattleMain_success' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_SwRadialBlur, CallFunc_BI_GetBattlePlayRate_PlayRate) == 0x00001C, "Member 'BattlePostProcessCtrl_C_SwRadialBlur::CallFunc_BI_GetBattlePlayRate_PlayRate' has a wrong offset!");

// Function BattlePostProcessCtrl.BattlePostProcessCtrl_C.UpdateCounterPostProcess
// 0x0038 (0x0038 - 0x0000)
struct BattlePostProcessCtrl_C_UpdateCounterPostProcess final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Sin_ReturnValue;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_AddOrUpdateBlendable_RetVal;           // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePostProcessCtrl_C_UpdateCounterPostProcess) == 0x000008, "Wrong alignment on BattlePostProcessCtrl_C_UpdateCounterPostProcess");
static_assert(sizeof(BattlePostProcessCtrl_C_UpdateCounterPostProcess) == 0x000038, "Wrong size on BattlePostProcessCtrl_C_UpdateCounterPostProcess");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterPostProcess, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BattlePostProcessCtrl_C_UpdateCounterPostProcess::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterPostProcess, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BattlePostProcessCtrl_C_UpdateCounterPostProcess::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterPostProcess, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BattlePostProcessCtrl_C_UpdateCounterPostProcess::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterPostProcess, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BattlePostProcessCtrl_C_UpdateCounterPostProcess::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterPostProcess, CallFunc_Array_Length_ReturnValue_1) == 0x000010, "Member 'BattlePostProcessCtrl_C_UpdateCounterPostProcess::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterPostProcess, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000014, "Member 'BattlePostProcessCtrl_C_UpdateCounterPostProcess::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterPostProcess, CallFunc_Array_Get_Item) == 0x000018, "Member 'BattlePostProcessCtrl_C_UpdateCounterPostProcess::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterPostProcess, CallFunc_Array_Length_ReturnValue_2) == 0x000020, "Member 'BattlePostProcessCtrl_C_UpdateCounterPostProcess::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterPostProcess, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BattlePostProcessCtrl_C_UpdateCounterPostProcess::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterPostProcess, CallFunc_Sin_ReturnValue) == 0x000028, "Member 'BattlePostProcessCtrl_C_UpdateCounterPostProcess::CallFunc_Sin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterPostProcess, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00002C, "Member 'BattlePostProcessCtrl_C_UpdateCounterPostProcess::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterPostProcess, CallFunc_SelectFloat_ReturnValue) == 0x000030, "Member 'BattlePostProcessCtrl_C_UpdateCounterPostProcess::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterPostProcess, CallFunc_Less_FloatFloat_ReturnValue) == 0x000034, "Member 'BattlePostProcessCtrl_C_UpdateCounterPostProcess::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterPostProcess, CallFunc_BI_AddOrUpdateBlendable_RetVal) == 0x000035, "Member 'BattlePostProcessCtrl_C_UpdateCounterPostProcess::CallFunc_BI_AddOrUpdateBlendable_RetVal' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterPostProcess, CallFunc_BooleanOR_ReturnValue) == 0x000036, "Member 'BattlePostProcessCtrl_C_UpdateCounterPostProcess::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BattlePostProcessCtrl.BattlePostProcessCtrl_C.UpdateCounterTheta
// 0x0024 (0x0024 - 0x0000)
struct BattlePostProcessCtrl_C_UpdateCounterTheta final
{
public:
	bool                                          Lo_PlayRate;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPI_ReturnValue;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPI_ReturnValue_1;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePostProcessCtrl_C_UpdateCounterTheta) == 0x000004, "Wrong alignment on BattlePostProcessCtrl_C_UpdateCounterTheta");
static_assert(sizeof(BattlePostProcessCtrl_C_UpdateCounterTheta) == 0x000024, "Wrong size on BattlePostProcessCtrl_C_UpdateCounterTheta");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTheta, Lo_PlayRate) == 0x000000, "Member 'BattlePostProcessCtrl_C_UpdateCounterTheta::Lo_PlayRate' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTheta, CallFunc_GetPI_ReturnValue) == 0x000004, "Member 'BattlePostProcessCtrl_C_UpdateCounterTheta::CallFunc_GetPI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTheta, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'BattlePostProcessCtrl_C_UpdateCounterTheta::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTheta, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'BattlePostProcessCtrl_C_UpdateCounterTheta::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTheta, CallFunc_FClamp_ReturnValue) == 0x000010, "Member 'BattlePostProcessCtrl_C_UpdateCounterTheta::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTheta, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000014, "Member 'BattlePostProcessCtrl_C_UpdateCounterTheta::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTheta, CallFunc_GetPI_ReturnValue_1) == 0x000018, "Member 'BattlePostProcessCtrl_C_UpdateCounterTheta::CallFunc_GetPI_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTheta, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'BattlePostProcessCtrl_C_UpdateCounterTheta::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTheta, CallFunc_FClamp_ReturnValue_1) == 0x000020, "Member 'BattlePostProcessCtrl_C_UpdateCounterTheta::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");

// Function BattlePostProcessCtrl.BattlePostProcessCtrl_C.UpdateCounterTimeDilation
// 0x0098 (0x0098 - 0x0000)
struct BattlePostProcessCtrl_C_UpdateCounterTimeDilation final
{
public:
	TArray<class ACharaBase_C*>                   Lo_SlomoActors;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_BPL_GetBIBattleMain_retValue;             // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPL_GetBIBattleMain_success;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_BI_GetPartySystem_ret;                    // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BI_const_GetPartyLoopMax_retValue;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BI_const_GetPartyStart_retValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExist_isExist;                          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaBase_C*                           CallFunc_GetPartyUnit_Unit;                        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPartyUnit_IsValid;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sin_ReturnValue;                          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sin_ReturnValue_1;                        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation) == 0x000008, "Wrong alignment on BattlePostProcessCtrl_C_UpdateCounterTimeDilation");
static_assert(sizeof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation) == 0x000098, "Wrong size on BattlePostProcessCtrl_C_UpdateCounterTimeDilation");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, Lo_SlomoActors) == 0x000000, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::Lo_SlomoActors' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, CallFunc_BPL_GetBIBattleMain_retValue) == 0x000020, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::CallFunc_BPL_GetBIBattleMain_retValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, CallFunc_BPL_GetBIBattleMain_success) == 0x000030, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::CallFunc_BPL_GetBIBattleMain_success' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, CallFunc_Array_Get_Item) == 0x000038, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, CallFunc_BI_GetPartySystem_ret) == 0x000040, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::CallFunc_BI_GetPartySystem_ret' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, CallFunc_BI_const_GetPartyLoopMax_retValue) == 0x000054, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::CallFunc_BI_const_GetPartyLoopMax_retValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, CallFunc_Subtract_IntInt_ReturnValue) == 0x00005C, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, CallFunc_BI_const_GetPartyStart_retValue) == 0x000060, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::CallFunc_BI_const_GetPartyStart_retValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, Temp_int_Variable) == 0x000064, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, CallFunc_IsExist_isExist) == 0x000068, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::CallFunc_IsExist_isExist' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, CallFunc_GetPartyUnit_Unit) == 0x000070, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::CallFunc_GetPartyUnit_Unit' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, CallFunc_GetPartyUnit_IsValid) == 0x000078, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::CallFunc_GetPartyUnit_IsValid' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, CallFunc_Array_Add_ReturnValue) == 0x00007C, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000080, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, CallFunc_Add_IntInt_ReturnValue_1) == 0x000084, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, CallFunc_Sin_ReturnValue) == 0x000088, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::CallFunc_Sin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, CallFunc_Sin_ReturnValue_1) == 0x00008C, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::CallFunc_Sin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, CallFunc_FClamp_ReturnValue) == 0x000090, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounterTimeDilation, CallFunc_FClamp_ReturnValue_1) == 0x000094, "Member 'BattlePostProcessCtrl_C_UpdateCounterTimeDilation::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");

// Function BattlePostProcessCtrl.BattlePostProcessCtrl_C.UpdateCounter
// 0x0001 (0x0001 - 0x0000)
struct BattlePostProcessCtrl_C_UpdateCounter final
{
public:
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePostProcessCtrl_C_UpdateCounter) == 0x000001, "Wrong alignment on BattlePostProcessCtrl_C_UpdateCounter");
static_assert(sizeof(BattlePostProcessCtrl_C_UpdateCounter) == 0x000001, "Wrong size on BattlePostProcessCtrl_C_UpdateCounter");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateCounter, CallFunc_BooleanAND_ReturnValue) == 0x000000, "Member 'BattlePostProcessCtrl_C_UpdateCounter::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BattlePostProcessCtrl.BattlePostProcessCtrl_C.InitializeCounterDMI
// 0x0030 (0x0030 - 0x0000)
struct BattlePostProcessCtrl_C_InitializeCounterDMI final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePostProcessCtrl_C_InitializeCounterDMI) == 0x000008, "Wrong alignment on BattlePostProcessCtrl_C_InitializeCounterDMI");
static_assert(sizeof(BattlePostProcessCtrl_C_InitializeCounterDMI) == 0x000030, "Wrong size on BattlePostProcessCtrl_C_InitializeCounterDMI");
static_assert(offsetof(BattlePostProcessCtrl_C_InitializeCounterDMI, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BattlePostProcessCtrl_C_InitializeCounterDMI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_InitializeCounterDMI, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BattlePostProcessCtrl_C_InitializeCounterDMI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_InitializeCounterDMI, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BattlePostProcessCtrl_C_InitializeCounterDMI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_InitializeCounterDMI, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BattlePostProcessCtrl_C_InitializeCounterDMI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_InitializeCounterDMI, CallFunc_Array_Get_Item) == 0x000010, "Member 'BattlePostProcessCtrl_C_InitializeCounterDMI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_InitializeCounterDMI, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'BattlePostProcessCtrl_C_InitializeCounterDMI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_InitializeCounterDMI, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'BattlePostProcessCtrl_C_InitializeCounterDMI::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessCtrl_C_InitializeCounterDMI, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'BattlePostProcessCtrl_C_InitializeCounterDMI::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BattlePostProcessCtrl.BattlePostProcessCtrl_C.UpdateBlur
// 0x004C (0x004C - 0x0000)
struct BattlePostProcessCtrl_C_UpdateBlur final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lo_progress;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BI_RadialBlurSetValue_retValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalcBlurUV_ValueU;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcBlurUV_ValueV;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPI_ReturnValue;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sin_ReturnValue;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePostProcessCtrl_C_UpdateBlur) == 0x000004, "Wrong alignment on BattlePostProcessCtrl_C_UpdateBlur");
static_assert(sizeof(BattlePostProcessCtrl_C_UpdateBlur) == 0x00004C, "Wrong size on BattlePostProcessCtrl_C_UpdateBlur");
static_assert(offsetof(BattlePostProcessCtrl_C_UpdateBlur, DeltaTime) == 0x000000, "Member 'BattlePostProcessCtrl_C_UpdateBlur::DeltaTime' has a wrong offset!");
