#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleFieldCheckerBase

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EncountPostTableData_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BattleFieldCheckerBase.BattleFieldCheckerBase_C.ExecuteUbergraph_BattleFieldCheckerBase
// 0x0770 (0x0770 - 0x0000)
struct BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TraceGround_Hit;                          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5685[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_TraceGround_Location;                     // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TraceGround_Normal;                       // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_TraceGround_Surface;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5686[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0080(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5687[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5688[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0118(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector>                        CallFunc_Map_Values_Values;                        // 0x0128(0x0010)(ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5689[0x3];                                     // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_Map_Keys_Keys;                            // 0x0140(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_568A[0x4];                                     // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Map_Find_Value;                           // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_568B[0x3];                                     // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChipNormal_hit;                           // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_568C[0x2];                                     // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_ChipNormal_location;                      // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ChipNormal_normal;                        // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_568D[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_568E[0x3];                                     // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_568F[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item_2;                         // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5690[0x4];                                     // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5691[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TriNormal_ReturnValue;                    // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item_3;                         // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5692[0x4];                                     // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_3;             // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5693[0x7];                                     // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TriNormal_ReturnValue_1;                  // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5694[0x3];                                     // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x029C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x02A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x02B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TraceGroundObject_Hit;                    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5695[0x3];                                     // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_TraceGroundObject_Location;               // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TraceGroundObject_Normal;                 // 0x02E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_TraceGroundObject_Surface;                // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5696[0x3];                                     // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_TraceGroundObject_HitActor;               // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_TraceGroundObject_HitComponent;           // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_5;       // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0314(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TraceGroundObject_Hit_1;                  // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5697[0x3];                                     // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_TraceGroundObject_Location_1;             // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TraceGroundObject_Normal_1;               // 0x0330(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_TraceGroundObject_Surface_1;              // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5698[0x3];                                     // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_TraceGroundObject_HitActor_1;             // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_TraceGroundObject_HitComponent_1;         // 0x0348(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue_1;                    // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_2;           // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue_2;                    // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_4;                         // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5699[0x3];                                     // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569A[0x3];                                     // 0x037D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item_5;                         // 0x0388(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0390(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_4;             // 0x03A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x03B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue_1;                // 0x03C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_569B[0x4];                                     // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x03D0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_6;       // 0x0400(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x040C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0418(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0424(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0430(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_569C[0x4];                                     // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0450(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x0460(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0470(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0480(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0490(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x04A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x04B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569D[0x6];                                     // 0x04B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_2;         // 0x04B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x04C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x04D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569E[0x6];                                     // 0x04DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_3;         // 0x04E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x04F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0501(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569F[0x6];                                     // 0x0502(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_4;         // 0x0508(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x0518(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_11;             // 0x0528(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_12;             // 0x0538(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56A0[0x3];                                     // 0x0549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Angle_2;                        // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Angle_1;                        // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56A1[0x4];                                     // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_inMesh_2;                       // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Angle;                          // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56A2[0x4];                                     // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_inMesh_1;                       // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_ErrorObject;                    // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_inMesh;                         // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x0584(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56A3[0x3];                                     // 0x0585(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_7;       // 0x0588(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x0594(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x05A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56A4[0x3];                                     // 0x0629(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x062C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56A5[0x3];                                     // 0x0631(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0634(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0639(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56A6[0x2];                                     // 0x063A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x063C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0644(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0650(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x065C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0668(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56A7[0x4];                                     // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0688(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x069C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x06A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x06B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56A8[0x4];                                     // 0x06BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_5;             // 0x06C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x06D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x06D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56A9[0x5];                                     // 0x06D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor;      // 0x06D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56AA[0x7];                                     // 0x06E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       K2Node_DynamicCast_AsStatic_Mesh_Actor;            // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56AB[0x7];                                     // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_13;             // 0x0700(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_6;                         // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_14;             // 0x0718(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_15;             // 0x0728(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_16;             // 0x0738(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0748(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x074C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56AC[0x3];                                     // 0x074D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_5;         // 0x0750(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_17;             // 0x0760(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase) == 0x000010, "Wrong alignment on BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase");
static_assert(sizeof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase) == 0x000770, "Wrong size on BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, EntryPoint) == 0x000000, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_GetUpVector_ReturnValue) == 0x00001C, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000028, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000034, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000040, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, Temp_int_Loop_Counter_Variable_2) == 0x00004C, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_TraceGround_Hit) == 0x000050, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_TraceGround_Hit' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_TraceGround_Location) == 0x000054, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_TraceGround_Location' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_TraceGround_Normal) == 0x000060, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_TraceGround_Normal' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_TraceGround_Surface) == 0x00006C, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_TraceGround_Surface' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Add_IntInt_ReturnValue_2) == 0x000070, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Add_VectorVector_ReturnValue) == 0x000074, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000080, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Not_PreBool_ReturnValue) == 0x000108, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Array_Length_ReturnValue) == 0x00010C, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Less_IntInt_ReturnValue) == 0x000110, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Array_Length_ReturnValue_1) == 0x000114, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, Temp_object_Variable) == 0x000118, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Map_Values_Values) == 0x000128, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Not_PreBool_ReturnValue_1) == 0x000138, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, Temp_int_Array_Index_Variable_2) == 0x00013C, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Map_Keys_Keys) == 0x000140, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Array_Length_ReturnValue_2) == 0x000150, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, Temp_int_Loop_Counter_Variable_3) == 0x000154, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, Temp_int_Array_Index_Variable_3) == 0x000158, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Array_Get_Item) == 0x000160, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Map_Find_Value) == 0x000168, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Map_Find_ReturnValue) == 0x000174, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_GetDisplayName_ReturnValue) == 0x000178, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Not_PreBool_ReturnValue_2) == 0x000188, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_ChipNormal_hit) == 0x000189, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_ChipNormal_hit' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_ChipNormal_location) == 0x00018C, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_ChipNormal_location' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_ChipNormal_normal) == 0x000198, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_ChipNormal_normal' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0001A4, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_GetDisplayName_ReturnValue_1) == 0x0001B0, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Add_IntInt_ReturnValue_3) == 0x0001C0, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Concat_StrStr_ReturnValue) == 0x0001C8, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Not_PreBool_ReturnValue_3) == 0x0001D8, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, Temp_int_Loop_Counter_Variable_4) == 0x0001DC, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, Temp_int_Array_Index_Variable_4) == 0x0001E0, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Add_IntInt_ReturnValue_4) == 0x0001E4, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, Temp_int_Array_Index_Variable_5) == 0x0001E8, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Array_Get_Item_1) == 0x0001F0, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Array_Get_Item_2) == 0x0001F8, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Array_Length_ReturnValue_3) == 0x000200, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_GetDisplayName_ReturnValue_2) == 0x000208, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_GetDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Less_IntInt_ReturnValue_1) == 0x000218, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000220, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000230, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_TriNormal_ReturnValue) == 0x00023C, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_TriNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Array_Get_Item_3) == 0x000248, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Array_Length_ReturnValue_4) == 0x000250, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_GetDisplayName_ReturnValue_3) == 0x000258, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_GetDisplayName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Less_IntInt_ReturnValue_2) == 0x000268, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000270, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x000280, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_TriNormal_ReturnValue_1) == 0x00028C, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_TriNormal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Not_PreBool_ReturnValue_4) == 0x000298, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_GetActorUpVector_ReturnValue) == 0x00029C, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x0002A8, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Multiply_VectorFloat_ReturnValue_3) == 0x0002B4, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Multiply_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0002C0, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Multiply_VectorFloat_ReturnValue_4) == 0x0002CC, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Multiply_VectorFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_TraceGroundObject_Hit) == 0x0002D8, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_TraceGroundObject_Hit' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_TraceGroundObject_Location) == 0x0002DC, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_TraceGroundObject_Location' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_TraceGroundObject_Normal) == 0x0002E8, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_TraceGroundObject_Normal' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_TraceGroundObject_Surface) == 0x0002F4, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_TraceGroundObject_Surface' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_TraceGroundObject_HitActor) == 0x0002F8, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_TraceGroundObject_HitActor' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_TraceGroundObject_HitComponent) == 0x000300, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_TraceGroundObject_HitComponent' has a wrong offset!");
static_assert(offsetof(BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase, CallFunc_Multiply_VectorFloat_ReturnValue_5) == 0x000308, "Member 'BattleFieldCheckerBase_C_ExecuteUbergraph_BattleFieldCheckerBase::CallFunc_Multiply_VectorFloat_ReturnValue_5' has a wrong offset!");
