#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleTargetSelect

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "RigRailData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BTL_PAD_MAP_structs.hpp"


namespace SDK::Params
{

// Function BattleTargetSelect.BattleTargetSelect_C.ExecuteUbergraph_BattleTargetSelect
// 0x00C0 (0x00C0 - 0x0000)
struct BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10F6[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10F7[0x1];                                     // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MainInterface>    CallFunc_GetMainInterface_AsBPI_Main_Interface;    // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Event_PartyIndex_1;                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BI_CheckBattleFlag_ReturnValue;           // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10F8[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_PartyIndex;                           // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect) == 0x000008, "Wrong alignment on BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect");
static_assert(sizeof(BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect) == 0x0000C0, "Wrong size on BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect");
static_assert(offsetof(BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect, EntryPoint) == 0x000000, "Member 'BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect, K2Node_CreateDelegate_OutputDelegate_4) == 0x000044, "Member 'BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect, K2Node_CreateDelegate_OutputDelegate_5) == 0x000054, "Member 'BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect, K2Node_CreateDelegate_OutputDelegate_6) == 0x000064, "Member 'BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect, K2Node_CreateDelegate_OutputDelegate_7) == 0x000074, "Member 'BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect, CallFunc_Not_PreBool_ReturnValue) == 0x000084, "Member 'BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect, K2Node_CreateDelegate_OutputDelegate_8) == 0x000088, "Member 'BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect, K2Node_Event_DeltaSeconds) == 0x000098, "Member 'BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect, CallFunc_BooleanAND_ReturnValue) == 0x00009C, "Member 'BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect, CallFunc_Not_PreBool_ReturnValue_1) == 0x00009D, "Member 'BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect, CallFunc_BooleanAND_ReturnValue_1) == 0x00009E, "Member 'BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect, CallFunc_GetMainInterface_AsBPI_Main_Interface) == 0x0000A0, "Member 'BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect::CallFunc_GetMainInterface_AsBPI_Main_Interface' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect, K2Node_Event_PartyIndex_1) == 0x0000B0, "Member 'BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect::K2Node_Event_PartyIndex_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect, CallFunc_BI_CheckBattleFlag_ReturnValue) == 0x0000B4, "Member 'BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect::CallFunc_BI_CheckBattleFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect, K2Node_Event_PartyIndex) == 0x0000B8, "Member 'BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect::K2Node_Event_PartyIndex' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000BC, "Member 'BattleTargetSelect_C_ExecuteUbergraph_BattleTargetSelect::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BattleTargetSelect.BattleTargetSelect_C.BI_DirectDecideTargetIndex
// 0x0004 (0x0004 - 0x0000)
struct BattleTargetSelect_C_BI_DirectDecideTargetIndex final
{
public:
	int32                                         PartyIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleTargetSelect_C_BI_DirectDecideTargetIndex) == 0x000004, "Wrong alignment on BattleTargetSelect_C_BI_DirectDecideTargetIndex");
static_assert(sizeof(BattleTargetSelect_C_BI_DirectDecideTargetIndex) == 0x000004, "Wrong size on BattleTargetSelect_C_BI_DirectDecideTargetIndex");
static_assert(offsetof(BattleTargetSelect_C_BI_DirectDecideTargetIndex, PartyIndex) == 0x000000, "Member 'BattleTargetSelect_C_BI_DirectDecideTargetIndex::PartyIndex' has a wrong offset!");

// Function BattleTargetSelect.BattleTargetSelect_C.BI_DirectSelectTargetIndex
// 0x0004 (0x0004 - 0x0000)
struct BattleTargetSelect_C_BI_DirectSelectTargetIndex final
{
public:
	int32                                         PartyIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleTargetSelect_C_BI_DirectSelectTargetIndex) == 0x000004, "Wrong alignment on BattleTargetSelect_C_BI_DirectSelectTargetIndex");
static_assert(sizeof(BattleTargetSelect_C_BI_DirectSelectTargetIndex) == 0x000004, "Wrong size on BattleTargetSelect_C_BI_DirectSelectTargetIndex");
static_assert(offsetof(BattleTargetSelect_C_BI_DirectSelectTargetIndex, PartyIndex) == 0x000000, "Member 'BattleTargetSelect_C_BI_DirectSelectTargetIndex::PartyIndex' has a wrong offset!");

// Function BattleTargetSelect.BattleTargetSelect_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BattleTargetSelect_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleTargetSelect_C_ReceiveTick) == 0x000004, "Wrong alignment on BattleTargetSelect_C_ReceiveTick");
static_assert(sizeof(BattleTargetSelect_C_ReceiveTick) == 0x000004, "Wrong size on BattleTargetSelect_C_ReceiveTick");
static_assert(offsetof(BattleTargetSelect_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BattleTargetSelect_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BattleTargetSelect.BattleTargetSelect_C.InvSideOneFunc
// 0x00C0 (0x00C0 - 0x0000)
struct BattleTargetSelect_C_InvSideOneFunc final
{
public:
	int32                                         Lo_Direction;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Lo_IsUseCamRail;                                   // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10F9[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Lo_WaitTask;                                       // 0x0008(0x0010)(Edit, BlueprintVisible)
	EBTL_PAD_MAP                                  Lo_A;                                              // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBTL_PAD_MAP                                  Lo_Right;                                          // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBTL_PAD_MAP                                  Lo_Left;                                           // 0x001A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetMouseWheelAxis_Axis;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10FA[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBattlePartySystem_C*                   CallFunc_GetPartySystem_retValue;                  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10FB[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetSideIsTargetList_ReturnValue;          // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10FC[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CalcPenetrationEfficacy_IsPenetration;    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CalcPenetrationEfficacy_IsPenetration_1;  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10FD[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_ATTRIBUTE_TYPE>                      CallFunc_CalcDefenceAishouArray_Aishou;            // 0x0058(0x0010)(ReferenceParm)
	TArray<E_ATTRIBUTE_TYPE>                      CallFunc_CalcDefenceAishouArray_Aishou_1;          // 0x0068(0x0010)(ReferenceParm)
	TArray<E_ATTRIBUTE_TYPE>                      K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	TArray<E_ATTRIBUTE_TYPE>                      K2Node_MakeArray_Array_1;                          // 0x0088(0x0010)(ReferenceParm)
	class UBattlePartySystem_C*                   CallFunc_GetPartySystem_retValue_1;                // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBattlePartySystem_C*                   CallFunc_GetPartySystem_retValue_2;                // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10FE[0x2];                                     // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetInvSideOneStartIndex_retValue;         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUseCamRailAtInvOne_isUse;               // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleTargetSelect_C_InvSideOneFunc) == 0x000008, "Wrong alignment on BattleTargetSelect_C_InvSideOneFunc");
static_assert(sizeof(BattleTargetSelect_C_InvSideOneFunc) == 0x0000C0, "Wrong size on BattleTargetSelect_C_InvSideOneFunc");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, Lo_Direction) == 0x000000, "Member 'BattleTargetSelect_C_InvSideOneFunc::Lo_Direction' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, Lo_IsUseCamRail) == 0x000004, "Member 'BattleTargetSelect_C_InvSideOneFunc::Lo_IsUseCamRail' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, Lo_WaitTask) == 0x000008, "Member 'BattleTargetSelect_C_InvSideOneFunc::Lo_WaitTask' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, Lo_A) == 0x000018, "Member 'BattleTargetSelect_C_InvSideOneFunc::Lo_A' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, Lo_Right) == 0x000019, "Member 'BattleTargetSelect_C_InvSideOneFunc::Lo_Right' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, Lo_Left) == 0x00001A, "Member 'BattleTargetSelect_C_InvSideOneFunc::Lo_Left' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00001B, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_GetMouseWheelAxis_Axis) == 0x00001C, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_GetMouseWheelAxis_Axis' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_FTrunc_ReturnValue) == 0x000020, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_Less_IntInt_ReturnValue) == 0x000025, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_GetPartySystem_retValue) == 0x000028, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_GetPartySystem_retValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000030, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_GetSideIsTargetList_ReturnValue) == 0x000038, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_GetSideIsTargetList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00004C, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_CalcPenetrationEfficacy_IsPenetration) == 0x000054, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_CalcPenetrationEfficacy_IsPenetration' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_CalcPenetrationEfficacy_IsPenetration_1) == 0x000055, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_CalcPenetrationEfficacy_IsPenetration_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_CalcDefenceAishouArray_Aishou) == 0x000058, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_CalcDefenceAishouArray_Aishou' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_CalcDefenceAishouArray_Aishou_1) == 0x000068, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_CalcDefenceAishouArray_Aishou_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, K2Node_MakeArray_Array) == 0x000078, "Member 'BattleTargetSelect_C_InvSideOneFunc::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, K2Node_MakeArray_Array_1) == 0x000088, "Member 'BattleTargetSelect_C_InvSideOneFunc::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_GetPartySystem_retValue_1) == 0x000098, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_GetPartySystem_retValue_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_GetPartySystem_retValue_2) == 0x0000A0, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_GetPartySystem_retValue_2' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_Not_PreBool_ReturnValue) == 0x0000A8, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_BooleanAND_ReturnValue) == 0x0000A9, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_GetInvSideOneStartIndex_retValue) == 0x0000AC, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_GetInvSideOneStartIndex_retValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, Temp_int_Variable) == 0x0000B0, "Member 'BattleTargetSelect_C_InvSideOneFunc::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, Temp_int_Variable_1) == 0x0000B4, "Member 'BattleTargetSelect_C_InvSideOneFunc::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000B8, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_IsUseCamRailAtInvOne_isUse) == 0x0000BC, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_IsUseCamRailAtInvOne_isUse' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_IsActionPadCheck_Success) == 0x0000BD, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, CallFunc_IsActionPadCheck_Success_1) == 0x0000BE, "Member 'BattleTargetSelect_C_InvSideOneFunc::CallFunc_IsActionPadCheck_Success_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideOneFunc, K2Node_SwitchInteger_CmpSuccess) == 0x0000BF, "Member 'BattleTargetSelect_C_InvSideOneFunc::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function BattleTargetSelect.BattleTargetSelect_C.StartSelect
// 0x0030 (0x0030 - 0x0000)
struct BattleTargetSelect_C_StartSelect final
{
public:
	int32                                         InPartyIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCounter;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsInvTarget;                                       // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsCursorEnable;                                    // 0x0006(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10FF[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UBattlePartySystem_C*                   Lo_PartySystem;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_tempIndex;                                      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LoEraseUnitMax;                                    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LoEraseUnitStart;                                  // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1100[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 LoWaitTask;                                        // 0x0020(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(BattleTargetSelect_C_StartSelect) == 0x000008, "Wrong alignment on BattleTargetSelect_C_StartSelect");
static_assert(sizeof(BattleTargetSelect_C_StartSelect) == 0x000030, "Wrong size on BattleTargetSelect_C_StartSelect");
static_assert(offsetof(BattleTargetSelect_C_StartSelect, InPartyIndex) == 0x000000, "Member 'BattleTargetSelect_C_StartSelect::InPartyIndex' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_StartSelect, IsCounter) == 0x000004, "Member 'BattleTargetSelect_C_StartSelect::IsCounter' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_StartSelect, IsInvTarget) == 0x000005, "Member 'BattleTargetSelect_C_StartSelect::IsInvTarget' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_StartSelect, IsCursorEnable) == 0x000006, "Member 'BattleTargetSelect_C_StartSelect::IsCursorEnable' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_StartSelect, Lo_PartySystem) == 0x000008, "Member 'BattleTargetSelect_C_StartSelect::Lo_PartySystem' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_StartSelect, Lo_tempIndex) == 0x000010, "Member 'BattleTargetSelect_C_StartSelect::Lo_tempIndex' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_StartSelect, LoEraseUnitMax) == 0x000014, "Member 'BattleTargetSelect_C_StartSelect::LoEraseUnitMax' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_StartSelect, LoEraseUnitStart) == 0x000018, "Member 'BattleTargetSelect_C_StartSelect::LoEraseUnitStart' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_StartSelect, LoWaitTask) == 0x000020, "Member 'BattleTargetSelect_C_StartSelect::LoWaitTask' has a wrong offset!");

// Function BattleTargetSelect.BattleTargetSelect_C.GetMainWork
// 0x0020 (0x0020 - 0x0000)
struct BattleTargetSelect_C_GetMainWork final
{
public:
	class ABattleMain_C*                          RetValue;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleMain_C*                          K2Node_DynamicCast_AsBattle_Main;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleTargetSelect_C_GetMainWork) == 0x000008, "Wrong alignment on BattleTargetSelect_C_GetMainWork");
static_assert(sizeof(BattleTargetSelect_C_GetMainWork) == 0x000020, "Wrong size on BattleTargetSelect_C_GetMainWork");
static_assert(offsetof(BattleTargetSelect_C_GetMainWork, RetValue) == 0x000000, "Member 'BattleTargetSelect_C_GetMainWork::RetValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_GetMainWork, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BattleTargetSelect_C_GetMainWork::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_GetMainWork, K2Node_DynamicCast_AsBattle_Main) == 0x000010, "Member 'BattleTargetSelect_C_GetMainWork::K2Node_DynamicCast_AsBattle_Main' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_GetMainWork, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BattleTargetSelect_C_GetMainWork::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BattleTargetSelect.BattleTargetSelect_C.GetPartySystem
// 0x0008 (0x0008 - 0x0000)
struct BattleTargetSelect_C_GetPartySystem final
{
public:
	class UBattlePartySystem_C*                   RetValue;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleTargetSelect_C_GetPartySystem) == 0x000008, "Wrong alignment on BattleTargetSelect_C_GetPartySystem");
static_assert(sizeof(BattleTargetSelect_C_GetPartySystem) == 0x000008, "Wrong size on BattleTargetSelect_C_GetPartySystem");
static_assert(offsetof(BattleTargetSelect_C_GetPartySystem, RetValue) == 0x000000, "Member 'BattleTargetSelect_C_GetPartySystem::RetValue' has a wrong offset!");

// Function BattleTargetSelect.BattleTargetSelect_C.InvSideAllFunc
// 0x00B8 (0x00B8 - 0x0000)
struct BattleTargetSelect_C_InvSideAllFunc final
{
public:
	int32                                         Lo_Direction;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1101[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Lo_TargetList;                                     // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 LoSelectedTarget;                                  // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 LoWaitTask;                                        // 0x0028(0x0010)(Edit, BlueprintVisible)
	class UBattlePartySystem_C*                   CallFunc_GetPartySystem_retValue;                  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1102[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMouseWheelAxis_Axis;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1103[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBattlePartySystem_C*                   CallFunc_GetPartySystem_retValue_1;                // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1104[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetSideIsTargetList_ReturnValue;          // 0x0068(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CalcPenetrationEfficacy_IsPenetration;    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1105[0x6];                                     // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_ATTRIBUTE_TYPE>                      CallFunc_CalcDefenceAishouArray_Aishou;            // 0x0088(0x0010)(ReferenceParm)
	class UBattlePartySystem_C*                   CallFunc_GetPartySystem_retValue_2;                // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1106[0x2];                                     // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetInvSideOneStartIndex_retValue;         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleTargetSelect_C_InvSideAllFunc) == 0x000008, "Wrong alignment on BattleTargetSelect_C_InvSideAllFunc");
static_assert(sizeof(BattleTargetSelect_C_InvSideAllFunc) == 0x0000B8, "Wrong size on BattleTargetSelect_C_InvSideAllFunc");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, Lo_Direction) == 0x000000, "Member 'BattleTargetSelect_C_InvSideAllFunc::Lo_Direction' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, Lo_TargetList) == 0x000008, "Member 'BattleTargetSelect_C_InvSideAllFunc::Lo_TargetList' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, LoSelectedTarget) == 0x000018, "Member 'BattleTargetSelect_C_InvSideAllFunc::LoSelectedTarget' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, LoWaitTask) == 0x000028, "Member 'BattleTargetSelect_C_InvSideAllFunc::LoWaitTask' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, CallFunc_GetPartySystem_retValue) == 0x000038, "Member 'BattleTargetSelect_C_InvSideAllFunc::CallFunc_GetPartySystem_retValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000040, "Member 'BattleTargetSelect_C_InvSideAllFunc::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, CallFunc_GetMouseWheelAxis_Axis) == 0x000044, "Member 'BattleTargetSelect_C_InvSideAllFunc::CallFunc_GetMouseWheelAxis_Axis' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, CallFunc_FTrunc_ReturnValue) == 0x000048, "Member 'BattleTargetSelect_C_InvSideAllFunc::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, CallFunc_Greater_IntInt_ReturnValue) == 0x00004C, "Member 'BattleTargetSelect_C_InvSideAllFunc::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, CallFunc_Less_IntInt_ReturnValue) == 0x00004D, "Member 'BattleTargetSelect_C_InvSideAllFunc::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00004E, "Member 'BattleTargetSelect_C_InvSideAllFunc::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, CallFunc_IsActionPadCheck_Success) == 0x00004F, "Member 'BattleTargetSelect_C_InvSideAllFunc::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, CallFunc_IsActionPadCheck_Success_1) == 0x000050, "Member 'BattleTargetSelect_C_InvSideAllFunc::CallFunc_IsActionPadCheck_Success_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, CallFunc_GetPartySystem_retValue_1) == 0x000058, "Member 'BattleTargetSelect_C_InvSideAllFunc::CallFunc_GetPartySystem_retValue_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, Temp_int_Variable) == 0x000060, "Member 'BattleTargetSelect_C_InvSideAllFunc::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, CallFunc_GetSideIsTargetList_ReturnValue) == 0x000068, "Member 'BattleTargetSelect_C_InvSideAllFunc::CallFunc_GetSideIsTargetList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'BattleTargetSelect_C_InvSideAllFunc::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'BattleTargetSelect_C_InvSideAllFunc::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000080, "Member 'BattleTargetSelect_C_InvSideAllFunc::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, CallFunc_CalcPenetrationEfficacy_IsPenetration) == 0x000081, "Member 'BattleTargetSelect_C_InvSideAllFunc::CallFunc_CalcPenetrationEfficacy_IsPenetration' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, CallFunc_CalcDefenceAishouArray_Aishou) == 0x000088, "Member 'BattleTargetSelect_C_InvSideAllFunc::CallFunc_CalcDefenceAishouArray_Aishou' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, CallFunc_GetPartySystem_retValue_2) == 0x000098, "Member 'BattleTargetSelect_C_InvSideAllFunc::CallFunc_GetPartySystem_retValue_2' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A0, "Member 'BattleTargetSelect_C_InvSideAllFunc::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, Temp_int_Variable_1) == 0x0000A4, "Member 'BattleTargetSelect_C_InvSideAllFunc::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, CallFunc_Not_PreBool_ReturnValue) == 0x0000A8, "Member 'BattleTargetSelect_C_InvSideAllFunc::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, CallFunc_BooleanAND_ReturnValue) == 0x0000A9, "Member 'BattleTargetSelect_C_InvSideAllFunc::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, CallFunc_GetInvSideOneStartIndex_retValue) == 0x0000AC, "Member 'BattleTargetSelect_C_InvSideAllFunc::CallFunc_GetInvSideOneStartIndex_retValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_InvSideAllFunc, K2Node_SwitchInteger_CmpSuccess) == 0x0000B0, "Member 'BattleTargetSelect_C_InvSideAllFunc::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function BattleTargetSelect.BattleTargetSelect_C.SelfSideOneFunc
// 0x00B8 (0x00B8 - 0x0000)
struct BattleTargetSelect_C_SelfSideOneFunc final
{
public:
	bool                                          Lo_IsUseViewFromCamera;                            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1107[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Lo_Direction;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 LoWaitTask;                                        // 0x0008(0x0010)(Edit, BlueprintVisible)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1108[0x1];                                     // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMouseWheelAxis_Axis;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_2;               // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_3;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1109[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBattlePartySystem_C*                   CallFunc_GetPartySystem_retValue;                  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_GetSideIsTargetList_ReturnValue;          // 0x0038(0x0010)(ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_110A[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_110B[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_ATTRIBUTE_TYPE>                      CallFunc_CalcDefenceAishouArray_Aishou;            // 0x0060(0x0010)(ReferenceParm)
	TArray<E_ATTRIBUTE_TYPE>                      CallFunc_CalcDefenceAishouArray_Aishou_1;          // 0x0070(0x0010)(ReferenceParm)
	TArray<E_ATTRIBUTE_TYPE>                      K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	TArray<E_ATTRIBUTE_TYPE>                      K2Node_MakeArray_Array_1;                          // 0x0090(0x0010)(ReferenceParm)
	class UBattlePartySystem_C*                   CallFunc_GetPartySystem_retValue_1;                // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBattlePartySystem_C*                   CallFunc_GetPartySystem_retValue_2;                // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_110C[0x1];                                     // 0x00B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleTargetSelect_C_SelfSideOneFunc) == 0x000008, "Wrong alignment on BattleTargetSelect_C_SelfSideOneFunc");
static_assert(sizeof(BattleTargetSelect_C_SelfSideOneFunc) == 0x0000B8, "Wrong size on BattleTargetSelect_C_SelfSideOneFunc");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, Lo_IsUseViewFromCamera) == 0x000000, "Member 'BattleTargetSelect_C_SelfSideOneFunc::Lo_IsUseViewFromCamera' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, Lo_Direction) == 0x000004, "Member 'BattleTargetSelect_C_SelfSideOneFunc::Lo_Direction' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, LoWaitTask) == 0x000008, "Member 'BattleTargetSelect_C_SelfSideOneFunc::LoWaitTask' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'BattleTargetSelect_C_SelfSideOneFunc::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, CallFunc_IsActionPadCheck_Success) == 0x000019, "Member 'BattleTargetSelect_C_SelfSideOneFunc::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, CallFunc_IsActionPadCheck_Success_1) == 0x00001A, "Member 'BattleTargetSelect_C_SelfSideOneFunc::CallFunc_IsActionPadCheck_Success_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, CallFunc_GetMouseWheelAxis_Axis) == 0x00001C, "Member 'BattleTargetSelect_C_SelfSideOneFunc::CallFunc_GetMouseWheelAxis_Axis' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, CallFunc_FTrunc_ReturnValue) == 0x000020, "Member 'BattleTargetSelect_C_SelfSideOneFunc::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'BattleTargetSelect_C_SelfSideOneFunc::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, CallFunc_Less_IntInt_ReturnValue) == 0x000025, "Member 'BattleTargetSelect_C_SelfSideOneFunc::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000026, "Member 'BattleTargetSelect_C_SelfSideOneFunc::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, CallFunc_IsActionPadCheck_Success_2) == 0x000027, "Member 'BattleTargetSelect_C_SelfSideOneFunc::CallFunc_IsActionPadCheck_Success_2' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, CallFunc_IsActionPadCheck_Success_3) == 0x000028, "Member 'BattleTargetSelect_C_SelfSideOneFunc::CallFunc_IsActionPadCheck_Success_3' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, CallFunc_GetPartySystem_retValue) == 0x000030, "Member 'BattleTargetSelect_C_SelfSideOneFunc::CallFunc_GetPartySystem_retValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, CallFunc_GetSideIsTargetList_ReturnValue) == 0x000038, "Member 'BattleTargetSelect_C_SelfSideOneFunc::CallFunc_GetSideIsTargetList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, Temp_int_Variable) == 0x000048, "Member 'BattleTargetSelect_C_SelfSideOneFunc::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'BattleTargetSelect_C_SelfSideOneFunc::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000050, "Member 'BattleTargetSelect_C_SelfSideOneFunc::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BattleTargetSelect_C_SelfSideOneFunc::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, Temp_int_Variable_1) == 0x000058, "Member 'BattleTargetSelect_C_SelfSideOneFunc::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, CallFunc_CalcDefenceAishouArray_Aishou) == 0x000060, "Member 'BattleTargetSelect_C_SelfSideOneFunc::CallFunc_CalcDefenceAishouArray_Aishou' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, CallFunc_CalcDefenceAishouArray_Aishou_1) == 0x000070, "Member 'BattleTargetSelect_C_SelfSideOneFunc::CallFunc_CalcDefenceAishouArray_Aishou_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, K2Node_MakeArray_Array) == 0x000080, "Member 'BattleTargetSelect_C_SelfSideOneFunc::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, K2Node_MakeArray_Array_1) == 0x000090, "Member 'BattleTargetSelect_C_SelfSideOneFunc::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, CallFunc_GetPartySystem_retValue_1) == 0x0000A0, "Member 'BattleTargetSelect_C_SelfSideOneFunc::CallFunc_GetPartySystem_retValue_1' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, CallFunc_GetPartySystem_retValue_2) == 0x0000A8, "Member 'BattleTargetSelect_C_SelfSideOneFunc::CallFunc_GetPartySystem_retValue_2' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, CallFunc_Not_PreBool_ReturnValue) == 0x0000B0, "Member 'BattleTargetSelect_C_SelfSideOneFunc::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, CallFunc_BooleanAND_ReturnValue) == 0x0000B1, "Member 'BattleTargetSelect_C_SelfSideOneFunc::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, K2Node_SwitchInteger_CmpSuccess) == 0x0000B2, "Member 'BattleTargetSelect_C_SelfSideOneFunc::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleTargetSelect_C_SelfSideOneFunc, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000B4, "Member 'BattleTargetSelect_C_SelfSideOneFunc::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BattleTargetSelect.BattleTargetSelect_C.SelfSideAllFunc
// 0x00A8 (0x00A8 - 0x0000)
struct BattleTargetSelect_C_SelfSideAllFunc final
{
public:
	int32                                         Lo_Direction;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Lo_IsUseViewFromCamera;                            // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_110D[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 LoSelectedTarget;                                  // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 LoWaitTask;                                        // 0x0018(0x0010)(Edit, BlueprintVisible)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_110E[0x1];                                     // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
