#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleParticleManager

#include "Basic.hpp"

#include "MaterialAnimSetting_T_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BattleParticleManager.BattleParticleManager_C.ExecuteUbergraph_BattleParticleManager
// 0x0050 (0x0050 - 0x0000)
struct BattleParticleManager_C_ExecuteUbergraph_BattleParticleManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleParticleManager_C_ExecuteUbergraph_BattleParticleManager) == 0x000008, "Wrong alignment on BattleParticleManager_C_ExecuteUbergraph_BattleParticleManager");
static_assert(sizeof(BattleParticleManager_C_ExecuteUbergraph_BattleParticleManager) == 0x000050, "Wrong size on BattleParticleManager_C_ExecuteUbergraph_BattleParticleManager");
static_assert(offsetof(BattleParticleManager_C_ExecuteUbergraph_BattleParticleManager, EntryPoint) == 0x000000, "Member 'BattleParticleManager_C_ExecuteUbergraph_BattleParticleManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_ExecuteUbergraph_BattleParticleManager, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BattleParticleManager_C_ExecuteUbergraph_BattleParticleManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_ExecuteUbergraph_BattleParticleManager, CallFunc_GetTimeSeconds_ReturnValue) == 0x000008, "Member 'BattleParticleManager_C_ExecuteUbergraph_BattleParticleManager::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_ExecuteUbergraph_BattleParticleManager, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x00000C, "Member 'BattleParticleManager_C_ExecuteUbergraph_BattleParticleManager::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_ExecuteUbergraph_BattleParticleManager, CallFunc_Conv_FloatToString_ReturnValue) == 0x000010, "Member 'BattleParticleManager_C_ExecuteUbergraph_BattleParticleManager::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_ExecuteUbergraph_BattleParticleManager, CallFunc_Conv_FloatToString_ReturnValue_1) == 0x000020, "Member 'BattleParticleManager_C_ExecuteUbergraph_BattleParticleManager::CallFunc_Conv_FloatToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_ExecuteUbergraph_BattleParticleManager, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'BattleParticleManager_C_ExecuteUbergraph_BattleParticleManager::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_ExecuteUbergraph_BattleParticleManager, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000040, "Member 'BattleParticleManager_C_ExecuteUbergraph_BattleParticleManager::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");

// Function BattleParticleManager.BattleParticleManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BattleParticleManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleParticleManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BattleParticleManager_C_ReceiveTick");
static_assert(sizeof(BattleParticleManager_C_ReceiveTick) == 0x000004, "Wrong size on BattleParticleManager_C_ReceiveTick");
static_assert(offsetof(BattleParticleManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BattleParticleManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BattleParticleManager.BattleParticleManager_C.AddParticle
// 0x0330 (0x0330 - 0x0000)
struct BattleParticleManager_C_AddParticle final
{
public:
	class UObject*                                ParticleObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C2B[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SpawnTransform;                                    // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FTransform                             RelativeTransform;                                 // 0x0040(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	int32                                         TranslucencyPriority;                              // 0x0070(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSkillEffectPairSetting                PairSetting;                                       // 0x0074(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	uint8                                         Pad_4C2C[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TargetActor;                                       // 0x00A8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 AttackSocketName;                                  // 0x00B0(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          AllowPositionUpdate;                               // 0x00C0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C2D[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          ModSkeltal;                                        // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ModAnim;                                           // 0x00D0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ModSocketName;                                     // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 HashID;                                            // 0x00E0(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x00F0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Lo_KeepBallEffect;                                 // 0x00F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C2E[0x6];                                     // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Lo_ParticleSystem;                                 // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Lo_ModSocketName;                                  // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Lo_ModAnim;                                        // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          Lo_ModSkeletal;                                    // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Lo_TargetActor;                                    // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_TransPrio;                                      // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C2F[0xC];                                     // 0x0124(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Lo_RelativeTrans;                                  // 0x0130(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FTransform                             Lo_SpawnTrans;                                     // 0x0160(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FVector                                Lo_upvec;                                          // 0x0190(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lo_ExtensionDist;                                  // 0x019C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lo_Gravity;                                        // 0x01A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lo_BulletTangent;                                  // 0x01A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lo_BulletSpeed;                                    // 0x01A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Lo_TargetLocation;                                 // 0x01AC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Lo_ActorLocation;                                  // 0x01B8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C30[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleSkillParticle_C*                 Lo_Particle;                                       // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C31[0x6];                                     // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System;              // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C32[0x8];                                     // 0x0228(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0230(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_DegTan_ReturnValue;                       // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C33[0x4];                                     // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleMain_C*                          CallFunc_GetMainWork_BattleMain;                   // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetOriginTransform_retValue;              // 0x0270(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x02AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x02C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             K2Node_Select_Default;                             // 0x02D0(0x0030)(IsPlainOldData, NoDestructor)
	class ABattleMain_C*                          CallFunc_GetMainWork_BattleMain_1;                 // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABattleSkillParticle_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleParticleManager_C_AddParticle) == 0x000010, "Wrong alignment on BattleParticleManager_C_AddParticle");
static_assert(sizeof(BattleParticleManager_C_AddParticle) == 0x000330, "Wrong size on BattleParticleManager_C_AddParticle");
static_assert(offsetof(BattleParticleManager_C_AddParticle, ParticleObject) == 0x000000, "Member 'BattleParticleManager_C_AddParticle::ParticleObject' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, SpawnTransform) == 0x000010, "Member 'BattleParticleManager_C_AddParticle::SpawnTransform' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, RelativeTransform) == 0x000040, "Member 'BattleParticleManager_C_AddParticle::RelativeTransform' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, TranslucencyPriority) == 0x000070, "Member 'BattleParticleManager_C_AddParticle::TranslucencyPriority' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, PairSetting) == 0x000074, "Member 'BattleParticleManager_C_AddParticle::PairSetting' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, TargetActor) == 0x0000A8, "Member 'BattleParticleManager_C_AddParticle::TargetActor' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, AttackSocketName) == 0x0000B0, "Member 'BattleParticleManager_C_AddParticle::AttackSocketName' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, AllowPositionUpdate) == 0x0000C0, "Member 'BattleParticleManager_C_AddParticle::AllowPositionUpdate' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, ModSkeltal) == 0x0000C8, "Member 'BattleParticleManager_C_AddParticle::ModSkeltal' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, ModAnim) == 0x0000D0, "Member 'BattleParticleManager_C_AddParticle::ModAnim' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, ModSocketName) == 0x0000D8, "Member 'BattleParticleManager_C_AddParticle::ModSocketName' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, HashID) == 0x0000E0, "Member 'BattleParticleManager_C_AddParticle::HashID' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, IsValid) == 0x0000F0, "Member 'BattleParticleManager_C_AddParticle::IsValid' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, Lo_KeepBallEffect) == 0x0000F1, "Member 'BattleParticleManager_C_AddParticle::Lo_KeepBallEffect' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, Lo_ParticleSystem) == 0x0000F8, "Member 'BattleParticleManager_C_AddParticle::Lo_ParticleSystem' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, Lo_ModSocketName) == 0x000100, "Member 'BattleParticleManager_C_AddParticle::Lo_ModSocketName' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, Lo_ModAnim) == 0x000108, "Member 'BattleParticleManager_C_AddParticle::Lo_ModAnim' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, Lo_ModSkeletal) == 0x000110, "Member 'BattleParticleManager_C_AddParticle::Lo_ModSkeletal' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, Lo_TargetActor) == 0x000118, "Member 'BattleParticleManager_C_AddParticle::Lo_TargetActor' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, Lo_TransPrio) == 0x000120, "Member 'BattleParticleManager_C_AddParticle::Lo_TransPrio' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, Lo_RelativeTrans) == 0x000130, "Member 'BattleParticleManager_C_AddParticle::Lo_RelativeTrans' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, Lo_SpawnTrans) == 0x000160, "Member 'BattleParticleManager_C_AddParticle::Lo_SpawnTrans' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, Lo_upvec) == 0x000190, "Member 'BattleParticleManager_C_AddParticle::Lo_upvec' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, Lo_ExtensionDist) == 0x00019C, "Member 'BattleParticleManager_C_AddParticle::Lo_ExtensionDist' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, Lo_Gravity) == 0x0001A0, "Member 'BattleParticleManager_C_AddParticle::Lo_Gravity' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, Lo_BulletTangent) == 0x0001A4, "Member 'BattleParticleManager_C_AddParticle::Lo_BulletTangent' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, Lo_BulletSpeed) == 0x0001A8, "Member 'BattleParticleManager_C_AddParticle::Lo_BulletSpeed' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, Lo_TargetLocation) == 0x0001AC, "Member 'BattleParticleManager_C_AddParticle::Lo_TargetLocation' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, Lo_ActorLocation) == 0x0001B8, "Member 'BattleParticleManager_C_AddParticle::Lo_ActorLocation' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, Lo_Particle) == 0x0001C8, "Member 'BattleParticleManager_C_AddParticle::Lo_Particle' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, CallFunc_Conv_StringToName_ReturnValue) == 0x0001D0, "Member 'BattleParticleManager_C_AddParticle::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, K2Node_SwitchEnum_CmpSuccess) == 0x0001D8, "Member 'BattleParticleManager_C_AddParticle::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, K2Node_SwitchEnum_CmpSuccess_1) == 0x0001D9, "Member 'BattleParticleManager_C_AddParticle::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, K2Node_DynamicCast_AsParticle_System) == 0x0001E0, "Member 'BattleParticleManager_C_AddParticle::K2Node_DynamicCast_AsParticle_System' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, K2Node_DynamicCast_bSuccess) == 0x0001E8, "Member 'BattleParticleManager_C_AddParticle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, Temp_bool_Variable) == 0x0001E9, "Member 'BattleParticleManager_C_AddParticle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, CallFunc_IsValid_ReturnValue) == 0x0001EA, "Member 'BattleParticleManager_C_AddParticle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, CallFunc_IsValid_ReturnValue_1) == 0x0001EB, "Member 'BattleParticleManager_C_AddParticle::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, CallFunc_BreakTransform_Location) == 0x0001EC, "Member 'BattleParticleManager_C_AddParticle::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, CallFunc_BreakTransform_Rotation) == 0x0001F8, "Member 'BattleParticleManager_C_AddParticle::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, CallFunc_BreakTransform_Scale) == 0x000204, "Member 'BattleParticleManager_C_AddParticle::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, CallFunc_BreakRotator_Roll) == 0x000210, "Member 'BattleParticleManager_C_AddParticle::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, CallFunc_BreakRotator_Pitch) == 0x000214, "Member 'BattleParticleManager_C_AddParticle::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, CallFunc_BreakRotator_Yaw) == 0x000218, "Member 'BattleParticleManager_C_AddParticle::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, CallFunc_MakeRotator_ReturnValue) == 0x00021C, "Member 'BattleParticleManager_C_AddParticle::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, CallFunc_MakeTransform_ReturnValue) == 0x000230, "Member 'BattleParticleManager_C_AddParticle::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, CallFunc_DegTan_ReturnValue) == 0x000260, "Member 'BattleParticleManager_C_AddParticle::CallFunc_DegTan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, CallFunc_GetMainWork_BattleMain) == 0x000268, "Member 'BattleParticleManager_C_AddParticle::CallFunc_GetMainWork_BattleMain' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, CallFunc_GetOriginTransform_retValue) == 0x000270, "Member 'BattleParticleManager_C_AddParticle::CallFunc_GetOriginTransform_retValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, CallFunc_BreakTransform_Location_1) == 0x0002A0, "Member 'BattleParticleManager_C_AddParticle::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, CallFunc_BreakTransform_Rotation_1) == 0x0002AC, "Member 'BattleParticleManager_C_AddParticle::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, CallFunc_BreakTransform_Scale_1) == 0x0002B8, "Member 'BattleParticleManager_C_AddParticle::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, CallFunc_GetUpVector_ReturnValue) == 0x0002C4, "Member 'BattleParticleManager_C_AddParticle::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, K2Node_Select_Default) == 0x0002D0, "Member 'BattleParticleManager_C_AddParticle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, CallFunc_GetMainWork_BattleMain_1) == 0x000300, "Member 'BattleParticleManager_C_AddParticle::CallFunc_GetMainWork_BattleMain_1' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000308, "Member 'BattleParticleManager_C_AddParticle::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, CallFunc_GetDisplayName_ReturnValue) == 0x000310, "Member 'BattleParticleManager_C_AddParticle::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_AddParticle, CallFunc_FinishSpawningActor_ReturnValue) == 0x000320, "Member 'BattleParticleManager_C_AddParticle::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BattleParticleManager.BattleParticleManager_C.IsAlive
// 0x0028 (0x0028 - 0x0000)
struct BattleParticleManager_C_IsAlive final
{
public:
	class FString                                 HashID;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Param_IsAlive;                                     // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C34[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleSkillParticle_C*                 CallFunc_Map_Find_Value;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPerformEnd_IsPerformEnd;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleParticleManager_C_IsAlive) == 0x000008, "Wrong alignment on BattleParticleManager_C_IsAlive");
static_assert(sizeof(BattleParticleManager_C_IsAlive) == 0x000028, "Wrong size on BattleParticleManager_C_IsAlive");
static_assert(offsetof(BattleParticleManager_C_IsAlive, HashID) == 0x000000, "Member 'BattleParticleManager_C_IsAlive::HashID' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_IsAlive, Param_IsAlive) == 0x000010, "Member 'BattleParticleManager_C_IsAlive::Param_IsAlive' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_IsAlive, CallFunc_Map_Find_Value) == 0x000018, "Member 'BattleParticleManager_C_IsAlive::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_IsAlive, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'BattleParticleManager_C_IsAlive::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_IsAlive, CallFunc_IsPerformEnd_IsPerformEnd) == 0x000021, "Member 'BattleParticleManager_C_IsAlive::CallFunc_IsPerformEnd_IsPerformEnd' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_IsAlive, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'BattleParticleManager_C_IsAlive::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BattleParticleManager.BattleParticleManager_C.GetMainWork
// 0x0020 (0x0020 - 0x0000)
struct BattleParticleManager_C_GetMainWork final
{
public:
	class ABattleMain_C*                          BattleMain;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleMain_C*                          K2Node_DynamicCast_AsBattle_Main;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleParticleManager_C_GetMainWork) == 0x000008, "Wrong alignment on BattleParticleManager_C_GetMainWork");
static_assert(sizeof(BattleParticleManager_C_GetMainWork) == 0x000020, "Wrong size on BattleParticleManager_C_GetMainWork");
static_assert(offsetof(BattleParticleManager_C_GetMainWork, BattleMain) == 0x000000, "Member 'BattleParticleManager_C_GetMainWork::BattleMain' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_GetMainWork, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BattleParticleManager_C_GetMainWork::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_GetMainWork, K2Node_DynamicCast_AsBattle_Main) == 0x000010, "Member 'BattleParticleManager_C_GetMainWork::K2Node_DynamicCast_AsBattle_Main' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_GetMainWork, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BattleParticleManager_C_GetMainWork::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BattleParticleManager.BattleParticleManager_C.SetBeamParameter
// 0x0098 (0x0098 - 0x0000)
struct BattleParticleManager_C_SetBeamParameter final
{
public:
	class FString                                 HashID;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Target;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Source;                                            // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C35[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x002C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C36[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleMain_C*                          CallFunc_GetMainWork_BattleMain;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBattlePartySystem_C*                   CallFunc_GetPartyAccessor_retValue;                // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           CallFunc_GetPartyUnit_retValue;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           CallFunc_GetPartyUnit_retValue_1;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetAllSocketNames_ReturnValue;            // 0x0058(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C37[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleSkillParticle_C*                 CallFunc_Map_Find_Value;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C38[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleParticleManager_C_SetBeamParameter) == 0x000008, "Wrong alignment on BattleParticleManager_C_SetBeamParameter");
static_assert(sizeof(BattleParticleManager_C_SetBeamParameter) == 0x000098, "Wrong size on BattleParticleManager_C_SetBeamParameter");
static_assert(offsetof(BattleParticleManager_C_SetBeamParameter, HashID) == 0x000000, "Member 'BattleParticleManager_C_SetBeamParameter::HashID' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetBeamParameter, Target) == 0x000010, "Member 'BattleParticleManager_C_SetBeamParameter::Target' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetBeamParameter, Source) == 0x000014, "Member 'BattleParticleManager_C_SetBeamParameter::Source' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetBeamParameter, IsValid) == 0x000018, "Member 'BattleParticleManager_C_SetBeamParameter::IsValid' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetBeamParameter, Temp_bool_Variable) == 0x000019, "Member 'BattleParticleManager_C_SetBeamParameter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetBeamParameter, Temp_name_Variable) == 0x00001C, "Member 'BattleParticleManager_C_SetBeamParameter::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetBeamParameter, Temp_name_Variable_1) == 0x000024, "Member 'BattleParticleManager_C_SetBeamParameter::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetBeamParameter, Temp_name_Variable_2) == 0x00002C, "Member 'BattleParticleManager_C_SetBeamParameter::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetBeamParameter, CallFunc_GetMainWork_BattleMain) == 0x000038, "Member 'BattleParticleManager_C_SetBeamParameter::CallFunc_GetMainWork_BattleMain' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetBeamParameter, CallFunc_GetPartyAccessor_retValue) == 0x000040, "Member 'BattleParticleManager_C_SetBeamParameter::CallFunc_GetPartyAccessor_retValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetBeamParameter, CallFunc_GetPartyUnit_retValue) == 0x000048, "Member 'BattleParticleManager_C_SetBeamParameter::CallFunc_GetPartyUnit_retValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetBeamParameter, CallFunc_GetPartyUnit_retValue_1) == 0x000050, "Member 'BattleParticleManager_C_SetBeamParameter::CallFunc_GetPartyUnit_retValue_1' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetBeamParameter, CallFunc_GetAllSocketNames_ReturnValue) == 0x000058, "Member 'BattleParticleManager_C_SetBeamParameter::CallFunc_GetAllSocketNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetBeamParameter, CallFunc_GetSocketLocation_ReturnValue) == 0x000068, "Member 'BattleParticleManager_C_SetBeamParameter::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetBeamParameter, CallFunc_Array_Contains_ReturnValue) == 0x000074, "Member 'BattleParticleManager_C_SetBeamParameter::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetBeamParameter, K2Node_Select_Default) == 0x000078, "Member 'BattleParticleManager_C_SetBeamParameter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetBeamParameter, CallFunc_Map_Find_Value) == 0x000080, "Member 'BattleParticleManager_C_SetBeamParameter::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetBeamParameter, CallFunc_Map_Find_ReturnValue) == 0x000088, "Member 'BattleParticleManager_C_SetBeamParameter::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetBeamParameter, CallFunc_GetSocketLocation_ReturnValue_1) == 0x00008C, "Member 'BattleParticleManager_C_SetBeamParameter::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");

// Function BattleParticleManager.BattleParticleManager_C.SetProjectileParameter
// 0x0120 (0x0120 - 0x0000)
struct BattleParticleManager_C_SetProjectileParameter final
{
public:
	class FString                                 HashID;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Target;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Source;                                            // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tangent;                                           // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C39[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0034(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C3A[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleMain_C*                          CallFunc_GetMainWork_BattleMain;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C3B[0x8];                                     // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetOriginTransform_retValue;              // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	class ABattleMain_C*                          CallFunc_GetMainWork_BattleMain_1;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C3C[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBattlePartySystem_C*                   CallFunc_GetPartyAccessor_retValue;                // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C3D[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaBase_C*                           CallFunc_GetPartyUnit_retValue;                    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           CallFunc_GetPartyUnit_retValue_1;                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetAllSocketNames_ReturnValue;            // 0x00D8(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C3E[0x3];                                     // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleSkillParticle_C*                 CallFunc_Map_Find_Value;                           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C3F[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleParticleManager_C_SetProjectileParameter) == 0x000010, "Wrong alignment on BattleParticleManager_C_SetProjectileParameter");
static_assert(sizeof(BattleParticleManager_C_SetProjectileParameter) == 0x000120, "Wrong size on BattleParticleManager_C_SetProjectileParameter");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, HashID) == 0x000000, "Member 'BattleParticleManager_C_SetProjectileParameter::HashID' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, Target) == 0x000010, "Member 'BattleParticleManager_C_SetProjectileParameter::Target' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, Source) == 0x000014, "Member 'BattleParticleManager_C_SetProjectileParameter::Source' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, Speed) == 0x000018, "Member 'BattleParticleManager_C_SetProjectileParameter::Speed' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, Tangent) == 0x00001C, "Member 'BattleParticleManager_C_SetProjectileParameter::Tangent' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, IsValid) == 0x000020, "Member 'BattleParticleManager_C_SetProjectileParameter::IsValid' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, Temp_bool_Variable) == 0x000021, "Member 'BattleParticleManager_C_SetProjectileParameter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, Temp_name_Variable) == 0x000024, "Member 'BattleParticleManager_C_SetProjectileParameter::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, Temp_name_Variable_1) == 0x00002C, "Member 'BattleParticleManager_C_SetProjectileParameter::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, Temp_name_Variable_2) == 0x000034, "Member 'BattleParticleManager_C_SetProjectileParameter::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, CallFunc_GetMainWork_BattleMain) == 0x000040, "Member 'BattleParticleManager_C_SetProjectileParameter::CallFunc_GetMainWork_BattleMain' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, CallFunc_GetOriginTransform_retValue) == 0x000050, "Member 'BattleParticleManager_C_SetProjectileParameter::CallFunc_GetOriginTransform_retValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, CallFunc_GetMainWork_BattleMain_1) == 0x000080, "Member 'BattleParticleManager_C_SetProjectileParameter::CallFunc_GetMainWork_BattleMain_1' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, CallFunc_BreakTransform_Location) == 0x000088, "Member 'BattleParticleManager_C_SetProjectileParameter::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, CallFunc_BreakTransform_Rotation) == 0x000094, "Member 'BattleParticleManager_C_SetProjectileParameter::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, CallFunc_BreakTransform_Scale) == 0x0000A0, "Member 'BattleParticleManager_C_SetProjectileParameter::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, CallFunc_GetPartyAccessor_retValue) == 0x0000B0, "Member 'BattleParticleManager_C_SetProjectileParameter::CallFunc_GetPartyAccessor_retValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, CallFunc_GetUpVector_ReturnValue) == 0x0000B8, "Member 'BattleParticleManager_C_SetProjectileParameter::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, CallFunc_GetPartyUnit_retValue) == 0x0000C8, "Member 'BattleParticleManager_C_SetProjectileParameter::CallFunc_GetPartyUnit_retValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, CallFunc_GetPartyUnit_retValue_1) == 0x0000D0, "Member 'BattleParticleManager_C_SetProjectileParameter::CallFunc_GetPartyUnit_retValue_1' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, CallFunc_GetAllSocketNames_ReturnValue) == 0x0000D8, "Member 'BattleParticleManager_C_SetProjectileParameter::CallFunc_GetAllSocketNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, CallFunc_GetSocketLocation_ReturnValue) == 0x0000E8, "Member 'BattleParticleManager_C_SetProjectileParameter::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, CallFunc_Array_Contains_ReturnValue) == 0x0000F4, "Member 'BattleParticleManager_C_SetProjectileParameter::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, K2Node_Select_Default) == 0x0000F8, "Member 'BattleParticleManager_C_SetProjectileParameter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, CallFunc_Map_Find_Value) == 0x000100, "Member 'BattleParticleManager_C_SetProjectileParameter::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, CallFunc_Map_Find_ReturnValue) == 0x000108, "Member 'BattleParticleManager_C_SetProjectileParameter::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_SetProjectileParameter, CallFunc_GetSocketLocation_ReturnValue_1) == 0x00010C, "Member 'BattleParticleManager_C_SetProjectileParameter::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");

// Function BattleParticleManager.BattleParticleManager_C.DestroyAll
// 0x0048 (0x0048 - 0x0000)
struct BattleParticleManager_C_DestroyAll final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C40[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0010(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C41[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleSkillParticle_C*                 CallFunc_Map_Find_Value;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleParticleManager_C_DestroyAll) == 0x000008, "Wrong alignment on BattleParticleManager_C_DestroyAll");
static_assert(sizeof(BattleParticleManager_C_DestroyAll) == 0x000048, "Wrong size on BattleParticleManager_C_DestroyAll");
static_assert(offsetof(BattleParticleManager_C_DestroyAll, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BattleParticleManager_C_DestroyAll::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_DestroyAll, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BattleParticleManager_C_DestroyAll::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_DestroyAll, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BattleParticleManager_C_DestroyAll::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_DestroyAll, CallFunc_Map_Keys_Keys) == 0x000010, "Member 'BattleParticleManager_C_DestroyAll::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_DestroyAll, CallFunc_Array_Get_Item) == 0x000020, "Member 'BattleParticleManager_C_DestroyAll::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_DestroyAll, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BattleParticleManager_C_DestroyAll::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_DestroyAll, CallFunc_Map_Find_Value) == 0x000038, "Member 'BattleParticleManager_C_DestroyAll::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_DestroyAll, CallFunc_Map_Find_ReturnValue) == 0x000040, "Member 'BattleParticleManager_C_DestroyAll::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleParticleManager_C_DestroyAll, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'BattleParticleManager_C_DestroyAll::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BattleParticleManager.BattleParticleManager_C.SetPlayRate
// 0x0038 (0x0038 - 0x0000)
struct BattleParticleManager_C_SetPlayRate final
{
public:
	float                                         PlayRate;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABattleSkillParticle_C*>         CallFunc_Map_Values_Values;                        // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
