#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleSkillParticle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "MaterialAnimSetting_T_structs.hpp"


namespace SDK::Params
{

// Function BattleSkillParticle.BattleSkillParticle_C.ExecuteUbergraph_BattleSkillParticle
// 0x00D0 (0x00D0 - 0x0000)
struct BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C1C[0xB];                                     // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C1D[0x8];                                     // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	class ATargetPoint*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetPoint*                           CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C1E[0x8];                                     // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00A0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle) == 0x000010, "Wrong alignment on BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle");
static_assert(sizeof(BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle) == 0x0000D0, "Wrong size on BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle");
static_assert(offsetof(BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle, EntryPoint) == 0x000000, "Member 'BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle, K2Node_Event_EndPlayReason) == 0x000004, "Member 'BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle, CallFunc_MakeTransform_ReturnValue_1) == 0x000050, "Member 'BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle, CallFunc_FinishSpawningActor_ReturnValue) == 0x000080, "Member 'BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000088, "Member 'BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000090, "Member 'BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle, CallFunc_GetTransform_ReturnValue) == 0x0000A0, "Member 'BattleSkillParticle_C_ExecuteUbergraph_BattleSkillParticle::CallFunc_GetTransform_ReturnValue' has a wrong offset!");

// Function BattleSkillParticle.BattleSkillParticle_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BattleSkillParticle_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleSkillParticle_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BattleSkillParticle_C_ReceiveEndPlay");
static_assert(sizeof(BattleSkillParticle_C_ReceiveEndPlay) == 0x000001, "Wrong size on BattleSkillParticle_C_ReceiveEndPlay");
static_assert(offsetof(BattleSkillParticle_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BattleSkillParticle_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BattleSkillParticle.BattleSkillParticle_C.IsEnd
// 0x000C (0x000C - 0x0000)
struct BattleSkillParticle_C_IsEnd final
{
public:
	bool                                          Param_IsEnd;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C1F[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumActiveParticles_ReturnValue;        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleSkillParticle_C_IsEnd) == 0x000004, "Wrong alignment on BattleSkillParticle_C_IsEnd");
static_assert(sizeof(BattleSkillParticle_C_IsEnd) == 0x00000C, "Wrong size on BattleSkillParticle_C_IsEnd");
static_assert(offsetof(BattleSkillParticle_C_IsEnd, Param_IsEnd) == 0x000000, "Member 'BattleSkillParticle_C_IsEnd::Param_IsEnd' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_IsEnd, CallFunc_IsActive_ReturnValue) == 0x000001, "Member 'BattleSkillParticle_C_IsEnd::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_IsEnd, CallFunc_GetNumActiveParticles_ReturnValue) == 0x000004, "Member 'BattleSkillParticle_C_IsEnd::CallFunc_GetNumActiveParticles_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_IsEnd, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'BattleSkillParticle_C_IsEnd::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_IsEnd, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000009, "Member 'BattleSkillParticle_C_IsEnd::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BattleSkillParticle.BattleSkillParticle_C.Update
// 0x0060 (0x0060 - 0x0000)
struct BattleSkillParticle_C_Update final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFinished;                                        // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C20[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Lo_Delta;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C21[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C22[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C23[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_Get_BIMainWork_NewParam;                  // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BI_BattleLog_retValue;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnd_IsEnd;                              // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C24[0x1];                                     // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleSkillParticle_C_Update) == 0x000008, "Wrong alignment on BattleSkillParticle_C_Update");
static_assert(sizeof(BattleSkillParticle_C_Update) == 0x000060, "Wrong size on BattleSkillParticle_C_Update");
static_assert(offsetof(BattleSkillParticle_C_Update, Delta) == 0x000000, "Member 'BattleSkillParticle_C_Update::Delta' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_Update, IsFinished) == 0x000004, "Member 'BattleSkillParticle_C_Update::IsFinished' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_Update, Lo_Delta) == 0x000008, "Member 'BattleSkillParticle_C_Update::Lo_Delta' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_Update, Temp_bool_Variable) == 0x00000C, "Member 'BattleSkillParticle_C_Update::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_Update, Temp_int_Variable) == 0x000010, "Member 'BattleSkillParticle_C_Update::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_Update, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BattleSkillParticle_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_Update, CallFunc_Greater_IntInt_ReturnValue) == 0x000015, "Member 'BattleSkillParticle_C_Update::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_Update, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BattleSkillParticle_C_Update::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_Update, CallFunc_Conv_FloatToString_ReturnValue) == 0x000020, "Member 'BattleSkillParticle_C_Update::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_Update, CallFunc_Get_BIMainWork_NewParam) == 0x000030, "Member 'BattleSkillParticle_C_Update::CallFunc_Get_BIMainWork_NewParam' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_Update, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'BattleSkillParticle_C_Update::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_Update, CallFunc_BI_BattleLog_retValue) == 0x000050, "Member 'BattleSkillParticle_C_Update::CallFunc_BI_BattleLog_retValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_Update, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000051, "Member 'BattleSkillParticle_C_Update::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_Update, CallFunc_IsEnd_IsEnd) == 0x000052, "Member 'BattleSkillParticle_C_Update::CallFunc_IsEnd_IsEnd' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_Update, CallFunc_BooleanOR_ReturnValue) == 0x000053, "Member 'BattleSkillParticle_C_Update::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_Update, Temp_bool_Variable_1) == 0x000054, "Member 'BattleSkillParticle_C_Update::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_Update, CallFunc_BooleanOR_ReturnValue_1) == 0x000055, "Member 'BattleSkillParticle_C_Update::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_Update, K2Node_Select_Default) == 0x000056, "Member 'BattleSkillParticle_C_Update::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_Update, CallFunc_Add_FloatFloat_ReturnValue) == 0x000058, "Member 'BattleSkillParticle_C_Update::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BattleSkillParticle.BattleSkillParticle_C.Get BIMainWork
// 0x0030 (0x0030 - 0x0000)
struct BattleSkillParticle_C_Get_BIMainWork final
{
public:
	TScriptInterface<class IBPI_BattleMain_C>     NewParam;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleMain_C>     K2Node_DynamicCast_AsBPI_Battle_Main;              // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleSkillParticle_C_Get_BIMainWork) == 0x000008, "Wrong alignment on BattleSkillParticle_C_Get_BIMainWork");
static_assert(sizeof(BattleSkillParticle_C_Get_BIMainWork) == 0x000030, "Wrong size on BattleSkillParticle_C_Get_BIMainWork");
static_assert(offsetof(BattleSkillParticle_C_Get_BIMainWork, NewParam) == 0x000000, "Member 'BattleSkillParticle_C_Get_BIMainWork::NewParam' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_Get_BIMainWork, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BattleSkillParticle_C_Get_BIMainWork::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_Get_BIMainWork, K2Node_DynamicCast_AsBPI_Battle_Main) == 0x000018, "Member 'BattleSkillParticle_C_Get_BIMainWork::K2Node_DynamicCast_AsBPI_Battle_Main' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_Get_BIMainWork, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BattleSkillParticle_C_Get_BIMainWork::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BattleSkillParticle.BattleSkillParticle_C.SetTargetLocation
// 0x0098 (0x0098 - 0x0000)
struct BattleSkillParticle_C_SetTargetLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x000C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleSkillParticle_C_SetTargetLocation) == 0x000004, "Wrong alignment on BattleSkillParticle_C_SetTargetLocation");
static_assert(sizeof(BattleSkillParticle_C_SetTargetLocation) == 0x000098, "Wrong size on BattleSkillParticle_C_SetTargetLocation");
static_assert(offsetof(BattleSkillParticle_C_SetTargetLocation, Location) == 0x000000, "Member 'BattleSkillParticle_C_SetTargetLocation::Location' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_SetTargetLocation, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x00000C, "Member 'BattleSkillParticle_C_SetTargetLocation::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_SetTargetLocation, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000094, "Member 'BattleSkillParticle_C_SetTargetLocation::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function BattleSkillParticle.BattleSkillParticle_C.SetSourceLocation
// 0x0098 (0x0098 - 0x0000)
struct BattleSkillParticle_C_SetSourceLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x000C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleSkillParticle_C_SetSourceLocation) == 0x000004, "Wrong alignment on BattleSkillParticle_C_SetSourceLocation");
static_assert(sizeof(BattleSkillParticle_C_SetSourceLocation) == 0x000098, "Wrong size on BattleSkillParticle_C_SetSourceLocation");
static_assert(offsetof(BattleSkillParticle_C_SetSourceLocation, Location) == 0x000000, "Member 'BattleSkillParticle_C_SetSourceLocation::Location' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_SetSourceLocation, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x00000C, "Member 'BattleSkillParticle_C_SetSourceLocation::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_SetSourceLocation, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000094, "Member 'BattleSkillParticle_C_SetSourceLocation::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function BattleSkillParticle.BattleSkillParticle_C.ApplyBeamParameter
// 0x00F0 (0x00F0 - 0x0000)
struct BattleSkillParticle_C_ApplyBeamParameter final
{
public:
	struct FVector                                Target;                                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Source;                                            // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtensionDist;                                     // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C25[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C26[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C27[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C28[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C29[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_1;          // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_3;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleSkillParticle_C_ApplyBeamParameter) == 0x000008, "Wrong alignment on BattleSkillParticle_C_ApplyBeamParameter");
static_assert(sizeof(BattleSkillParticle_C_ApplyBeamParameter) == 0x0000F0, "Wrong size on BattleSkillParticle_C_ApplyBeamParameter");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, Target) == 0x000000, "Member 'BattleSkillParticle_C_ApplyBeamParameter::Target' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, Source) == 0x00000C, "Member 'BattleSkillParticle_C_ApplyBeamParameter::Source' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, ExtensionDist) == 0x000018, "Member 'BattleSkillParticle_C_ApplyBeamParameter::ExtensionDist' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00001C, "Member 'BattleSkillParticle_C_ApplyBeamParameter::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, CallFunc_Normal_ReturnValue) == 0x000028, "Member 'BattleSkillParticle_C_ApplyBeamParameter::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, Temp_int_Variable) == 0x000034, "Member 'BattleSkillParticle_C_ApplyBeamParameter::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000038, "Member 'BattleSkillParticle_C_ApplyBeamParameter::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, CallFunc_Conv_IntToString_ReturnValue) == 0x000048, "Member 'BattleSkillParticle_C_ApplyBeamParameter::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, CallFunc_Add_VectorVector_ReturnValue) == 0x000058, "Member 'BattleSkillParticle_C_ApplyBeamParameter::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000064, "Member 'BattleSkillParticle_C_ApplyBeamParameter::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'BattleSkillParticle_C_ApplyBeamParameter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, CallFunc_MakeLiteralString_ReturnValue) == 0x000070, "Member 'BattleSkillParticle_C_ApplyBeamParameter::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, Temp_int_Variable_1) == 0x000080, "Member 'BattleSkillParticle_C_ApplyBeamParameter::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, CallFunc_Conv_StringToName_ReturnValue) == 0x000084, "Member 'BattleSkillParticle_C_ApplyBeamParameter::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000090, "Member 'BattleSkillParticle_C_ApplyBeamParameter::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, CallFunc_Concat_StrStr_ReturnValue) == 0x0000A0, "Member 'BattleSkillParticle_C_ApplyBeamParameter::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000B0, "Member 'BattleSkillParticle_C_ApplyBeamParameter::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, CallFunc_Conv_StringToName_ReturnValue_1) == 0x0000B4, "Member 'BattleSkillParticle_C_ApplyBeamParameter::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000BC, "Member 'BattleSkillParticle_C_ApplyBeamParameter::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, CallFunc_MakeLiteralString_ReturnValue_1) == 0x0000C0, "Member 'BattleSkillParticle_C_ApplyBeamParameter::CallFunc_MakeLiteralString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000D0, "Member 'BattleSkillParticle_C_ApplyBeamParameter::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, CallFunc_Conv_StringToName_ReturnValue_2) == 0x0000E0, "Member 'BattleSkillParticle_C_ApplyBeamParameter::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyBeamParameter, CallFunc_Conv_StringToName_ReturnValue_3) == 0x0000E8, "Member 'BattleSkillParticle_C_ApplyBeamParameter::CallFunc_Conv_StringToName_ReturnValue_3' has a wrong offset!");

// Function BattleSkillParticle.BattleSkillParticle_C.ApplyProjectileParameter
// 0x01AC (0x01AC - 0x0000)
struct BattleSkillParticle_C_ApplyProjectileParameter final
{
public:
	struct FVector                                Target;                                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Source;                                            // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tangent;                                           // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                UpVec;                                             // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Gravity;                                           // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtensionDist;                                     // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          KeepEffect;                                        // 0x0034(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C2A[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Lo_GravityForce;                                   // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lo_TotalHeight;                                    // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lo_PlusHeight;                                     // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lo_Speed_e;                                        // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lo_Theat_e;                                        // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lo_Height;                                         // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lo_DurationSec;                                    // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Lo_Horizontal;                                     // 0x0054(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lo_GravityPerFrame;                                // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Lo_Source;                                         // 0x0064(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Lo_Direction;                                      // 0x0070(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lo_Theta_s;                                        // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lo_Dist;                                           // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZX_ReturnValue;                // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromXZ_ReturnValue;                // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x00E4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C2B[0x3];                                     // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleSkillParticle_C_ApplyProjectileParameter) == 0x000004, "Wrong alignment on BattleSkillParticle_C_ApplyProjectileParameter");
static_assert(sizeof(BattleSkillParticle_C_ApplyProjectileParameter) == 0x0001AC, "Wrong size on BattleSkillParticle_C_ApplyProjectileParameter");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, Target) == 0x000000, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::Target' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, Source) == 0x00000C, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::Source' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, Speed) == 0x000018, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::Speed' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, Tangent) == 0x00001C, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::Tangent' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, UpVec) == 0x000020, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::UpVec' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, Gravity) == 0x00002C, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::Gravity' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, ExtensionDist) == 0x000030, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::ExtensionDist' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, KeepEffect) == 0x000034, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::KeepEffect' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, Lo_GravityForce) == 0x000038, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::Lo_GravityForce' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, Lo_TotalHeight) == 0x00003C, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::Lo_TotalHeight' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, Lo_PlusHeight) == 0x000040, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::Lo_PlusHeight' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, Lo_Speed_e) == 0x000044, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::Lo_Speed_e' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, Lo_Theat_e) == 0x000048, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::Lo_Theat_e' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, Lo_Height) == 0x00004C, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::Lo_Height' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, Lo_DurationSec) == 0x000050, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::Lo_DurationSec' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, Lo_Horizontal) == 0x000054, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::Lo_Horizontal' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, Lo_GravityPerFrame) == 0x000060, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::Lo_GravityPerFrame' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, Lo_Source) == 0x000064, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::Lo_Source' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, Lo_Direction) == 0x000070, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::Lo_Direction' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, Lo_Theta_s) == 0x00007C, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::Lo_Theta_s' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, Lo_Dist) == 0x000080, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::Lo_Dist' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, CallFunc_Normal_ReturnValue) == 0x000084, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000090, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00009C, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, CallFunc_Normal_ReturnValue_1) == 0x0000A0, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, CallFunc_Dot_VectorVector_ReturnValue) == 0x0000AC, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x0000B0, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, CallFunc_MakeRotFromZX_ReturnValue) == 0x0000B4, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::CallFunc_MakeRotFromZX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, CallFunc_GetForwardVector_ReturnValue) == 0x0000C0, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000CC, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, CallFunc_MakeRotFromXZ_ReturnValue) == 0x0000D8, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::CallFunc_MakeRotFromXZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x0000E4, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x00016C, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000170, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000174, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000180, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000184, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000188, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, CallFunc_Add_FloatFloat_ReturnValue) == 0x00018C, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000190, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x000194, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_ApplyProjectileParameter, CallFunc_Add_VectorVector_ReturnValue) == 0x0001A0, "Member 'BattleSkillParticle_C_ApplyProjectileParameter::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function BattleSkillParticle.BattleSkillParticle_C.UpdateProjectile
// 0x01E0 (0x01E0 - 0x0000)
struct BattleSkillParticle_C_UpdateProjectile final
{
public:
	struct FVector                                Lo_Direction;                                      // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C2C[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumActiveParticles_ReturnValue;        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_2;                     // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C2D[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_3;                     // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C2E[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromXZ_ReturnValue;                // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0124(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C2F[0x3];                                     // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleSkillParticle_C_UpdateProjectile) == 0x000004, "Wrong alignment on BattleSkillParticle_C_UpdateProjectile");
static_assert(sizeof(BattleSkillParticle_C_UpdateProjectile) == 0x0001E0, "Wrong size on BattleSkillParticle_C_UpdateProjectile");
static_assert(offsetof(BattleSkillParticle_C_UpdateProjectile, Lo_Direction) == 0x000000, "Member 'BattleSkillParticle_C_UpdateProjectile::Lo_Direction' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_UpdateProjectile, CallFunc_Normal_ReturnValue) == 0x00000C, "Member 'BattleSkillParticle_C_UpdateProjectile::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_UpdateProjectile, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BattleSkillParticle_C_UpdateProjectile::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_UpdateProjectile, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000024, "Member 'BattleSkillParticle_C_UpdateProjectile::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleSkillParticle_C_UpdateProjectile, CallFunc_BreakVector_X) == 0x000030, "Member 'BattleSkillParticle_C_UpdateProjectile::CallFunc_BreakVector_X' has a wrong offset!");
