#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleActionTaskFactory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"
#include "Project_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BattleActionTaskFactory.BattleActionTaskFactory_C
// 0x0350 (0x0400 - 0x00B0)
class UBattleActionTaskFactory_C final : public UBattleActionTaskFactoryBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class ABattleActionTask_C*>            M_ExistActionTask;                                 // 0x00B8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         M_GlobalPecID;                                     // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7AD6[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             M_Transform;                                       // 0x00D0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class ABattleActionTask_C*>            M_ReserveTask;                                     // 0x0100(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<uint8>                                 M_ValidArray;                                      // 0x0110(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FBtlTaskDesc                           M_CommandCamera;                                   // 0x0120(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         M_NowTick;                                         // 0x01C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         M_CommandTime;                                     // 0x01C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          M_CommandStack;                                    // 0x01C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7AD7[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 M_CommandTaskName;                                 // 0x01D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         M_CommandLastCall;                                 // 0x01E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          M_CommandMotion;                                   // 0x01E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7AD8[0x3];                                     // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABattleActionTask_C*>            M_KillRequestedTask;                               // 0x01E8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	uint8                                         Pad_7AD9[0x8];                                     // 0x01F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlTaskDesc                           Lo_Desc;                                           // 0x0200(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         M_UpdateTimes;                                     // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7ADA[0x4];                                     // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FBattleIntegerArray>       M_PoolTaskListKey;                                 // 0x02A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, struct FBattleTaskArray>          M_PoolTaskListValue;                               // 0x02F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ABattleActionTask_C*>            M_ProcessTaskList;                                 // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<int32>                                 M_PoppedPoolTaskListKey;                           // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 M_DebugTaskInfo;                                   // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FDebugBattleTaskInfo>           M_DebugTaskInfoArray;                              // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UParticleSystem>> M_MusmahEffectRef;                                 // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UParticleSystem*>                M_MusmahEffect;                                    // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class USoundAtomCue>>   M_MusmahSERef;                                     // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class USoundAtomCue*>                  M_MusmahSE;                                        // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          M_AllawUpdate;                                     // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7ADB[0x7];                                     // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UCurveFloat>>     M_MusmahCVRef;                                     // 0x03D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UCurveFloat*>                    M_MusmahCV;                                        // 0x03E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         M_KuishibariDataIndex;                             // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BattleActionTaskFactory(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void DestroyMusmahData();
	void LoadMusmahData();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void Evt_ClearArray();
	void OnLoaded_430CAF474B0F79C3F98FD98578ADF046(class UObject* Loaded);
	void OnLoaded_7D84137042529291144500850D49C96D(class UObject* Loaded);
	void OnLoaded_55EF183A4BDF28D25C43F1BD691A7361(class UObject* Loaded);
	void CheckTask();
	void GetParentNameTaskCnt(const class FString& ParentName, int32* RetCnt);
	void SpawnActionTaskActor(const struct FBtlTaskDesc& InDesc, TArray<int32>& TaskWaitList, const class FString& ParentName, class UObject* Data, class UClass* ClassData, float TaskDuration, class ABattleActionTask_C** RetValue);
