#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleCharActionFactory

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BattleCharActionFactory.BattleCharActionFactory_C.ExecuteUbergraph_BattleCharActionFactory
// 0x0008 (0x0008 - 0x0000)
struct BattleCharActionFactory_C_ExecuteUbergraph_BattleCharActionFactory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleCharActionFactory_C_ExecuteUbergraph_BattleCharActionFactory) == 0x000004, "Wrong alignment on BattleCharActionFactory_C_ExecuteUbergraph_BattleCharActionFactory");
static_assert(sizeof(BattleCharActionFactory_C_ExecuteUbergraph_BattleCharActionFactory) == 0x000008, "Wrong size on BattleCharActionFactory_C_ExecuteUbergraph_BattleCharActionFactory");
static_assert(offsetof(BattleCharActionFactory_C_ExecuteUbergraph_BattleCharActionFactory, EntryPoint) == 0x000000, "Member 'BattleCharActionFactory_C_ExecuteUbergraph_BattleCharActionFactory::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_ExecuteUbergraph_BattleCharActionFactory, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BattleCharActionFactory_C_ExecuteUbergraph_BattleCharActionFactory::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BattleCharActionFactory.BattleCharActionFactory_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BattleCharActionFactory_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleCharActionFactory_C_ReceiveTick) == 0x000004, "Wrong alignment on BattleCharActionFactory_C_ReceiveTick");
static_assert(sizeof(BattleCharActionFactory_C_ReceiveTick) == 0x000004, "Wrong size on BattleCharActionFactory_C_ReceiveTick");
static_assert(offsetof(BattleCharActionFactory_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BattleCharActionFactory_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BattleCharActionFactory.BattleCharActionFactory_C.GetMainWork
// 0x0020 (0x0020 - 0x0000)
struct BattleCharActionFactory_C_GetMainWork final
{
public:
	class ABattleMain_C*                          RetValue;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleMain_C*                          K2Node_DynamicCast_AsBattle_Main;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCharActionFactory_C_GetMainWork) == 0x000008, "Wrong alignment on BattleCharActionFactory_C_GetMainWork");
static_assert(sizeof(BattleCharActionFactory_C_GetMainWork) == 0x000020, "Wrong size on BattleCharActionFactory_C_GetMainWork");
static_assert(offsetof(BattleCharActionFactory_C_GetMainWork, RetValue) == 0x000000, "Member 'BattleCharActionFactory_C_GetMainWork::RetValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetMainWork, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BattleCharActionFactory_C_GetMainWork::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetMainWork, K2Node_DynamicCast_AsBattle_Main) == 0x000010, "Member 'BattleCharActionFactory_C_GetMainWork::K2Node_DynamicCast_AsBattle_Main' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetMainWork, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BattleCharActionFactory_C_GetMainWork::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BattleCharActionFactory.BattleCharActionFactory_C.SpawnCharActionActor
// 0x00E8 (0x00E8 - 0x0000)
struct BattleCharActionFactory_C_SpawnCharActionActor final
{
public:
	struct FBtlActionStack                        InData;                                            // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FBtlActionStack                        Lo_Data;                                           // 0x0014(0x0014)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78CB[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleMain_C*                          CallFunc_GetMainWork_retValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78CC[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_BI_StartBlendOverride_self_CastInput;     // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_StartBlendOverride_retValue;           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78CD[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleMain_C*                          CallFunc_GetMainWork_retValue_1;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_const_GetEnemyStart_retValue;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78CE[0x2];                                     // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78CF[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleMain_C*                          CallFunc_GetMainWork_retValue_2;                   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleCharAction_C*                    CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78D0[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleCharAction_C*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78D1[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleMain_C*                          CallFunc_GetMainWork_retValue_3;                   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleCharAction_C*                    CallFunc_Array_Get_Item_1;                         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78D2[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleCharAction_C*                    CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleCharActionFactory_C_SpawnCharActionActor) == 0x000008, "Wrong alignment on BattleCharActionFactory_C_SpawnCharActionActor");
static_assert(sizeof(BattleCharActionFactory_C_SpawnCharActionActor) == 0x0000E8, "Wrong size on BattleCharActionFactory_C_SpawnCharActionActor");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, InData) == 0x000000, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::InData' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, Lo_Data) == 0x000014, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::Lo_Data' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, Temp_int_Variable) == 0x000028, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, Temp_int_Variable_1) == 0x00002C, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000030, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000032, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000033, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000034, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_BooleanOR_ReturnValue) == 0x000035, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_BooleanOR_ReturnValue_1) == 0x000036, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000037, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_BooleanOR_ReturnValue_2) == 0x000038, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_GetMainWork_retValue) == 0x000040, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_GetMainWork_retValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_BooleanOR_ReturnValue_3) == 0x000048, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_BI_StartBlendOverride_self_CastInput) == 0x000050, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_BI_StartBlendOverride_self_CastInput' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_BI_StartBlendOverride_retValue) == 0x000060, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_BI_StartBlendOverride_retValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_GetMainWork_retValue_1) == 0x000068, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_GetMainWork_retValue_1' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_const_GetEnemyStart_retValue) == 0x000070, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_const_GetEnemyStart_retValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000074, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_BooleanOR_ReturnValue_4) == 0x000075, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_GetMainWork_retValue_2) == 0x000080, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_GetMainWork_retValue_2' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_Array_Get_Item) == 0x000088, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000090, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000098, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A0, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A8, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_Percent_IntInt_ReturnValue) == 0x0000AC, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000B0, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_GetMainWork_retValue_3) == 0x0000B8, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_GetMainWork_retValue_3' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_Array_Get_Item_1) == 0x0000C0, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0000C8, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0000D0, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0000D8, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000E0, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SpawnCharActionActor, CallFunc_Percent_IntInt_ReturnValue_1) == 0x0000E4, "Member 'BattleCharActionFactory_C_SpawnCharActionActor::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");

// Function BattleCharActionFactory.BattleCharActionFactory_C.GetPrevActionSeq
// 0x0028 (0x0028 - 0x0000)
struct BattleCharActionFactory_C_GetPrevActionSeq final
{
public:
	E_BTL_ACT_SEQ                                 RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78D3[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Lo_No;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78D4[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleCharAction_C*                    CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78D5[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleCharActionFactory_C_GetPrevActionSeq) == 0x000008, "Wrong alignment on BattleCharActionFactory_C_GetPrevActionSeq");
static_assert(sizeof(BattleCharActionFactory_C_GetPrevActionSeq) == 0x000028, "Wrong size on BattleCharActionFactory_C_GetPrevActionSeq");
static_assert(offsetof(BattleCharActionFactory_C_GetPrevActionSeq, RetValue) == 0x000000, "Member 'BattleCharActionFactory_C_GetPrevActionSeq::RetValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetPrevActionSeq, Lo_No) == 0x000004, "Member 'BattleCharActionFactory_C_GetPrevActionSeq::Lo_No' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetPrevActionSeq, CallFunc_Less_IntInt_ReturnValue) == 0x000008, "Member 'BattleCharActionFactory_C_GetPrevActionSeq::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetPrevActionSeq, CallFunc_Array_Get_Item) == 0x000010, "Member 'BattleCharActionFactory_C_GetPrevActionSeq::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetPrevActionSeq, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'BattleCharActionFactory_C_GetPrevActionSeq::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetPrevActionSeq, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00001C, "Member 'BattleCharActionFactory_C_GetPrevActionSeq::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetPrevActionSeq, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000020, "Member 'BattleCharActionFactory_C_GetPrevActionSeq::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");

// Function BattleCharActionFactory.BattleCharActionFactory_C.GetNowAction
// 0x0020 (0x0020 - 0x0000)
struct BattleCharActionFactory_C_GetNowAction final
{
public:
	bool                                          IsSuccess;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78D6[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleCharAction_C*                    RetValue;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleCharAction_C*                    CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCharActionFactory_C_GetNowAction) == 0x000008, "Wrong alignment on BattleCharActionFactory_C_GetNowAction");
static_assert(sizeof(BattleCharActionFactory_C_GetNowAction) == 0x000020, "Wrong size on BattleCharActionFactory_C_GetNowAction");
static_assert(offsetof(BattleCharActionFactory_C_GetNowAction, IsSuccess) == 0x000000, "Member 'BattleCharActionFactory_C_GetNowAction::IsSuccess' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetNowAction, RetValue) == 0x000008, "Member 'BattleCharActionFactory_C_GetNowAction::RetValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetNowAction, CallFunc_Array_Get_Item) == 0x000010, "Member 'BattleCharActionFactory_C_GetNowAction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetNowAction, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BattleCharActionFactory_C_GetNowAction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetNowAction, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00001C, "Member 'BattleCharActionFactory_C_GetNowAction::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetNowAction, CallFunc_Less_IntInt_ReturnValue) == 0x00001D, "Member 'BattleCharActionFactory_C_GetNowAction::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetNowAction, CallFunc_BooleanOR_ReturnValue) == 0x00001E, "Member 'BattleCharActionFactory_C_GetNowAction::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BattleCharActionFactory.BattleCharActionFactory_C.DestroyForPecID
// 0x0040 (0x0040 - 0x0000)
struct BattleCharActionFactory_C_DestroyForPecID final
{
public:
	int32                                         InPecID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78D7[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleCharAction_C*                    Lo_Action;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPecID_retValue;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78D8[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class ABattleCharAction_C*              Temp_object_Variable;                              // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleCharAction_C*                    CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCharActionFactory_C_DestroyForPecID) == 0x000008, "Wrong alignment on BattleCharActionFactory_C_DestroyForPecID");
static_assert(sizeof(BattleCharActionFactory_C_DestroyForPecID) == 0x000040, "Wrong size on BattleCharActionFactory_C_DestroyForPecID");
static_assert(offsetof(BattleCharActionFactory_C_DestroyForPecID, InPecID) == 0x000000, "Member 'BattleCharActionFactory_C_DestroyForPecID::InPecID' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_DestroyForPecID, RetValue) == 0x000004, "Member 'BattleCharActionFactory_C_DestroyForPecID::RetValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_DestroyForPecID, Lo_Action) == 0x000008, "Member 'BattleCharActionFactory_C_DestroyForPecID::Lo_Action' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_DestroyForPecID, CallFunc_GetPecID_retValue) == 0x000010, "Member 'BattleCharActionFactory_C_DestroyForPecID::CallFunc_GetPecID_retValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_DestroyForPecID, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BattleCharActionFactory_C_DestroyForPecID::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_DestroyForPecID, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'BattleCharActionFactory_C_DestroyForPecID::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_DestroyForPecID, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BattleCharActionFactory_C_DestroyForPecID::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_DestroyForPecID, Temp_object_Variable) == 0x000020, "Member 'BattleCharActionFactory_C_DestroyForPecID::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_DestroyForPecID, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BattleCharActionFactory_C_DestroyForPecID::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_DestroyForPecID, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'BattleCharActionFactory_C_DestroyForPecID::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_DestroyForPecID, CallFunc_Array_Get_Item) == 0x000030, "Member 'BattleCharActionFactory_C_DestroyForPecID::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_DestroyForPecID, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BattleCharActionFactory_C_DestroyForPecID::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_DestroyForPecID, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000039, "Member 'BattleCharActionFactory_C_DestroyForPecID::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BattleCharActionFactory.BattleCharActionFactory_C.AllActionIsFinished
// 0x0028 (0x0028 - 0x0000)
struct BattleCharActionFactory_C_AllActionIsFinished final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78D9[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78DA[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleCharAction_C*                    CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCharActionFactory_C_AllActionIsFinished) == 0x000008, "Wrong alignment on BattleCharActionFactory_C_AllActionIsFinished");
static_assert(sizeof(BattleCharActionFactory_C_AllActionIsFinished) == 0x000028, "Wrong size on BattleCharActionFactory_C_AllActionIsFinished");
static_assert(offsetof(BattleCharActionFactory_C_AllActionIsFinished, RetValue) == 0x000000, "Member 'BattleCharActionFactory_C_AllActionIsFinished::RetValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_AllActionIsFinished, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BattleCharActionFactory_C_AllActionIsFinished::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_AllActionIsFinished, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BattleCharActionFactory_C_AllActionIsFinished::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_AllActionIsFinished, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BattleCharActionFactory_C_AllActionIsFinished::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_AllActionIsFinished, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BattleCharActionFactory_C_AllActionIsFinished::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_AllActionIsFinished, CallFunc_Array_Get_Item) == 0x000018, "Member 'BattleCharActionFactory_C_AllActionIsFinished::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_AllActionIsFinished, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BattleCharActionFactory_C_AllActionIsFinished::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_AllActionIsFinished, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000021, "Member 'BattleCharActionFactory_C_AllActionIsFinished::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BattleCharActionFactory.BattleCharActionFactory_C.CheckAction
// 0x0040 (0x0040 - 0x0000)
struct BattleCharActionFactory_C_CheckAction final
{
public:
	float                                         DeltaSec;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ContinueUpdate;                                    // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Lo_ContinueUpdate;                                 // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78DB[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleCharAction_C*                    Lo_Action;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Update_ContinueUpdate;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFinished_retValue;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78DC[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPecID_retValue;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DestroyForPecID_retValue;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78DD[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78DE[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleCharAction_C*                    CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCharActionFactory_C_CheckAction) == 0x000008, "Wrong alignment on BattleCharActionFactory_C_CheckAction");
static_assert(sizeof(BattleCharActionFactory_C_CheckAction) == 0x000040, "Wrong size on BattleCharActionFactory_C_CheckAction");
static_assert(offsetof(BattleCharActionFactory_C_CheckAction, DeltaSec) == 0x000000, "Member 'BattleCharActionFactory_C_CheckAction::DeltaSec' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_CheckAction, ContinueUpdate) == 0x000004, "Member 'BattleCharActionFactory_C_CheckAction::ContinueUpdate' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_CheckAction, Lo_ContinueUpdate) == 0x000005, "Member 'BattleCharActionFactory_C_CheckAction::Lo_ContinueUpdate' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_CheckAction, Lo_Action) == 0x000008, "Member 'BattleCharActionFactory_C_CheckAction::Lo_Action' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_CheckAction, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BattleCharActionFactory_C_CheckAction::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_CheckAction, CallFunc_Update_ContinueUpdate) == 0x000014, "Member 'BattleCharActionFactory_C_CheckAction::CallFunc_Update_ContinueUpdate' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_CheckAction, CallFunc_IsFinished_retValue) == 0x000015, "Member 'BattleCharActionFactory_C_CheckAction::CallFunc_IsFinished_retValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_CheckAction, CallFunc_BooleanAND_ReturnValue) == 0x000016, "Member 'BattleCharActionFactory_C_CheckAction::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_CheckAction, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BattleCharActionFactory_C_CheckAction::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_CheckAction, CallFunc_GetPecID_retValue) == 0x00001C, "Member 'BattleCharActionFactory_C_CheckAction::CallFunc_GetPecID_retValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_CheckAction, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BattleCharActionFactory_C_CheckAction::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_CheckAction, CallFunc_DestroyForPecID_retValue) == 0x000024, "Member 'BattleCharActionFactory_C_CheckAction::CallFunc_DestroyForPecID_retValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_CheckAction, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BattleCharActionFactory_C_CheckAction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_CheckAction, CallFunc_Array_Get_Item) == 0x000030, "Member 'BattleCharActionFactory_C_CheckAction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_CheckAction, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BattleCharActionFactory_C_CheckAction::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_CheckAction, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'BattleCharActionFactory_C_CheckAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BattleCharActionFactory.BattleCharActionFactory_C.GetActionForPartyIndex
// 0x0038 (0x0038 - 0x0000)
struct BattleCharActionFactory_C_GetActionForPartyIndex final
{
public:
	int32                                         PartyIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78DF[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleCharAction_C*                    RetValue;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleCharAction_C*                    CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78E0[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPartyIndex_retValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCharActionFactory_C_GetActionForPartyIndex) == 0x000008, "Wrong alignment on BattleCharActionFactory_C_GetActionForPartyIndex");
static_assert(sizeof(BattleCharActionFactory_C_GetActionForPartyIndex) == 0x000038, "Wrong size on BattleCharActionFactory_C_GetActionForPartyIndex");
static_assert(offsetof(BattleCharActionFactory_C_GetActionForPartyIndex, PartyIndex) == 0x000000, "Member 'BattleCharActionFactory_C_GetActionForPartyIndex::PartyIndex' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetActionForPartyIndex, RetValue) == 0x000008, "Member 'BattleCharActionFactory_C_GetActionForPartyIndex::RetValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetActionForPartyIndex, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BattleCharActionFactory_C_GetActionForPartyIndex::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetActionForPartyIndex, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BattleCharActionFactory_C_GetActionForPartyIndex::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetActionForPartyIndex, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BattleCharActionFactory_C_GetActionForPartyIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetActionForPartyIndex, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BattleCharActionFactory_C_GetActionForPartyIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetActionForPartyIndex, CallFunc_Array_Get_Item) == 0x000020, "Member 'BattleCharActionFactory_C_GetActionForPartyIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetActionForPartyIndex, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'BattleCharActionFactory_C_GetActionForPartyIndex::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetActionForPartyIndex, CallFunc_GetPartyIndex_retValue) == 0x00002C, "Member 'BattleCharActionFactory_C_GetActionForPartyIndex::CallFunc_GetPartyIndex_retValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetActionForPartyIndex, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000030, "Member 'BattleCharActionFactory_C_GetActionForPartyIndex::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetActionForPartyIndex, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000031, "Member 'BattleCharActionFactory_C_GetActionForPartyIndex::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BattleCharActionFactory.BattleCharActionFactory_C.GetActionNum
// 0x0030 (0x0030 - 0x0000)
struct BattleCharActionFactory_C_GetActionNum final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_Cnt;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78E1[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleCharAction_C*                    CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCharActionFactory_C_GetActionNum) == 0x000008, "Wrong alignment on BattleCharActionFactory_C_GetActionNum");
static_assert(sizeof(BattleCharActionFactory_C_GetActionNum) == 0x000030, "Wrong size on BattleCharActionFactory_C_GetActionNum");
static_assert(offsetof(BattleCharActionFactory_C_GetActionNum, RetValue) == 0x000000, "Member 'BattleCharActionFactory_C_GetActionNum::RetValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetActionNum, Lo_Cnt) == 0x000004, "Member 'BattleCharActionFactory_C_GetActionNum::Lo_Cnt' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetActionNum, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BattleCharActionFactory_C_GetActionNum::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetActionNum, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BattleCharActionFactory_C_GetActionNum::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetActionNum, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BattleCharActionFactory_C_GetActionNum::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetActionNum, Temp_int_Variable) == 0x000014, "Member 'BattleCharActionFactory_C_GetActionNum::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetActionNum, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'BattleCharActionFactory_C_GetActionNum::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetActionNum, CallFunc_Array_Get_Item) == 0x000020, "Member 'BattleCharActionFactory_C_GetActionNum::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetActionNum, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BattleCharActionFactory_C_GetActionNum::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetActionNum, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'BattleCharActionFactory_C_GetActionNum::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_GetActionNum, CallFunc_Less_IntInt_ReturnValue) == 0x00002D, "Member 'BattleCharActionFactory_C_GetActionNum::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BattleCharActionFactory.BattleCharActionFactory_C.SetCharActionPlayRate
// 0x0028 (0x0028 - 0x0000)
struct BattleCharActionFactory_C_SetCharActionPlayRate final
{
public:
	float                                         PlayRate;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_Length;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleCharAction_C*                    CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleCharActionFactory_C_SetCharActionPlayRate) == 0x000008, "Wrong alignment on BattleCharActionFactory_C_SetCharActionPlayRate");
static_assert(sizeof(BattleCharActionFactory_C_SetCharActionPlayRate) == 0x000028, "Wrong size on BattleCharActionFactory_C_SetCharActionPlayRate");
static_assert(offsetof(BattleCharActionFactory_C_SetCharActionPlayRate, PlayRate) == 0x000000, "Member 'BattleCharActionFactory_C_SetCharActionPlayRate::PlayRate' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SetCharActionPlayRate, Lo_Length) == 0x000004, "Member 'BattleCharActionFactory_C_SetCharActionPlayRate::Lo_Length' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SetCharActionPlayRate, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BattleCharActionFactory_C_SetCharActionPlayRate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SetCharActionPlayRate, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BattleCharActionFactory_C_SetCharActionPlayRate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SetCharActionPlayRate, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BattleCharActionFactory_C_SetCharActionPlayRate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SetCharActionPlayRate, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BattleCharActionFactory_C_SetCharActionPlayRate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SetCharActionPlayRate, CallFunc_Array_Get_Item) == 0x000018, "Member 'BattleCharActionFactory_C_SetCharActionPlayRate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SetCharActionPlayRate, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BattleCharActionFactory_C_SetCharActionPlayRate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleCharActionFactory_C_SetCharActionPlayRate, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BattleCharActionFactory_C_SetCharActionPlayRate::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BattleCharActionFactory.BattleCharActionFactory_C.UpdateComponent
// 0x0008 (0x0008 - 0x0000)
