#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleAICommand

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BattleAICommand.BattleAICommand_C.ExecuteUbergraph_BattleAICommand
// 0x0004 (0x0004 - 0x0000)
struct BattleAICommand_C_ExecuteUbergraph_BattleAICommand final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleAICommand_C_ExecuteUbergraph_BattleAICommand) == 0x000004, "Wrong alignment on BattleAICommand_C_ExecuteUbergraph_BattleAICommand");
static_assert(sizeof(BattleAICommand_C_ExecuteUbergraph_BattleAICommand) == 0x000004, "Wrong size on BattleAICommand_C_ExecuteUbergraph_BattleAICommand");
static_assert(offsetof(BattleAICommand_C_ExecuteUbergraph_BattleAICommand, EntryPoint) == 0x000000, "Member 'BattleAICommand_C_ExecuteUbergraph_BattleAICommand::EntryPoint' has a wrong offset!");

// Function BattleAICommand.BattleAICommand_C.Act_Attack
// 0x0020 (0x0020 - 0x0000)
struct BattleAICommand_C_Act_Attack final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PTMemDataInterface> CallFunc_GetPTMemInterface_retValue;               // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetActorIndex_retValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleAICommand_C_Act_Attack) == 0x000008, "Wrong alignment on BattleAICommand_C_Act_Attack");
static_assert(sizeof(BattleAICommand_C_Act_Attack) == 0x000020, "Wrong size on BattleAICommand_C_Act_Attack");
static_assert(offsetof(BattleAICommand_C_Act_Attack, Success) == 0x000000, "Member 'BattleAICommand_C_Act_Attack::Success' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Act_Attack, CallFunc_GetPTMemInterface_retValue) == 0x000008, "Member 'BattleAICommand_C_Act_Attack::CallFunc_GetPTMemInterface_retValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Act_Attack, CallFunc_GetActorIndex_retValue) == 0x000018, "Member 'BattleAICommand_C_Act_Attack::CallFunc_GetActorIndex_retValue' has a wrong offset!");

// Function BattleAICommand.BattleAICommand_C.Tar_Random
// 0x0018 (0x0018 - 0x0000)
struct BattleAICommand_C_Tar_Random final
{
public:
	int32                                         CallFunc_GetActorIndex_retValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 CallFunc_AIBaseTar_Common_ReturnValue;             // 0x0008(0x0010)(ReferenceParm)
};
static_assert(alignof(BattleAICommand_C_Tar_Random) == 0x000008, "Wrong alignment on BattleAICommand_C_Tar_Random");
static_assert(sizeof(BattleAICommand_C_Tar_Random) == 0x000018, "Wrong size on BattleAICommand_C_Tar_Random");
static_assert(offsetof(BattleAICommand_C_Tar_Random, CallFunc_GetActorIndex_retValue) == 0x000000, "Member 'BattleAICommand_C_Tar_Random::CallFunc_GetActorIndex_retValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Tar_Random, CallFunc_AIBaseTar_Common_ReturnValue) == 0x000008, "Member 'BattleAICommand_C_Tar_Random::CallFunc_AIBaseTar_Common_ReturnValue' has a wrong offset!");

// Function BattleAICommand.BattleAICommand_C.Chk_MyHPPerc
// 0x0014 (0x0014 - 0x0000)
struct BattleAICommand_C_Chk_MyHPPerc final
{
public:
	int32                                         Perc;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActorIndex_retValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalcHPRate_retValue;                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleAICommand_C_Chk_MyHPPerc) == 0x000004, "Wrong alignment on BattleAICommand_C_Chk_MyHPPerc");
static_assert(sizeof(BattleAICommand_C_Chk_MyHPPerc) == 0x000014, "Wrong size on BattleAICommand_C_Chk_MyHPPerc");
static_assert(offsetof(BattleAICommand_C_Chk_MyHPPerc, Perc) == 0x000000, "Member 'BattleAICommand_C_Chk_MyHPPerc::Perc' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_MyHPPerc, ReturnValue) == 0x000004, "Member 'BattleAICommand_C_Chk_MyHPPerc::ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_MyHPPerc, CallFunc_GetActorIndex_retValue) == 0x000008, "Member 'BattleAICommand_C_Chk_MyHPPerc::CallFunc_GetActorIndex_retValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_MyHPPerc, CallFunc_CalcHPRate_retValue) == 0x00000C, "Member 'BattleAICommand_C_Chk_MyHPPerc::CallFunc_CalcHPRate_retValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_MyHPPerc, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'BattleAICommand_C_Chk_MyHPPerc::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BattleAICommand.BattleAICommand_C.GetActorIndex
// 0x0038 (0x0038 - 0x0000)
struct BattleAICommand_C_GetActorIndex final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_GetBIMainWork_ret;                        // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_GetCharAction_Success;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleCharAction_C> CallFunc_BI_GetCharAction_RetValue;                // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BPI_GetActorIndex_Ret;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleAICommand_C_GetActorIndex) == 0x000008, "Wrong alignment on BattleAICommand_C_GetActorIndex");
static_assert(sizeof(BattleAICommand_C_GetActorIndex) == 0x000038, "Wrong size on BattleAICommand_C_GetActorIndex");
static_assert(offsetof(BattleAICommand_C_GetActorIndex, RetValue) == 0x000000, "Member 'BattleAICommand_C_GetActorIndex::RetValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_GetActorIndex, CallFunc_GetBIMainWork_ret) == 0x000008, "Member 'BattleAICommand_C_GetActorIndex::CallFunc_GetBIMainWork_ret' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_GetActorIndex, CallFunc_BI_GetCharAction_Success) == 0x000018, "Member 'BattleAICommand_C_GetActorIndex::CallFunc_BI_GetCharAction_Success' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_GetActorIndex, CallFunc_BI_GetCharAction_RetValue) == 0x000020, "Member 'BattleAICommand_C_GetActorIndex::CallFunc_BI_GetCharAction_RetValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_GetActorIndex, CallFunc_BPI_GetActorIndex_Ret) == 0x000030, "Member 'BattleAICommand_C_GetActorIndex::CallFunc_BPI_GetActorIndex_Ret' has a wrong offset!");

// Function BattleAICommand.BattleAICommand_C.CalcRate
// 0x0014 (0x0014 - 0x0000)
struct BattleAICommand_C_CalcRate final
{
public:
	int32                                         Num;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetValue;                                          // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleAICommand_C_CalcRate) == 0x000004, "Wrong alignment on BattleAICommand_C_CalcRate");
static_assert(sizeof(BattleAICommand_C_CalcRate) == 0x000014, "Wrong size on BattleAICommand_C_CalcRate");
static_assert(offsetof(BattleAICommand_C_CalcRate, Num) == 0x000000, "Member 'BattleAICommand_C_CalcRate::Num' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_CalcRate, Max) == 0x000004, "Member 'BattleAICommand_C_CalcRate::Max' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_CalcRate, RetValue) == 0x000008, "Member 'BattleAICommand_C_CalcRate::RetValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_CalcRate, CallFunc_Multiply_IntInt_ReturnValue) == 0x00000C, "Member 'BattleAICommand_C_CalcRate::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_CalcRate, CallFunc_Divide_IntInt_ReturnValue) == 0x000010, "Member 'BattleAICommand_C_CalcRate::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");

// Function BattleAICommand.BattleAICommand_C.CalcHPRate
// 0x0030 (0x0030 - 0x0000)
struct BattleAICommand_C_CalcHPRate final
{
public:
	int32                                         PartyIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetValue;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_maxHP;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_nowHP;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalcRate_retValue;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_GetBIPartySystem_ret;                     // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BI_GetMaxHP_retValue;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BI_GetNowHP_retValue;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleAICommand_C_CalcHPRate) == 0x000008, "Wrong alignment on BattleAICommand_C_CalcHPRate");
static_assert(sizeof(BattleAICommand_C_CalcHPRate) == 0x000030, "Wrong size on BattleAICommand_C_CalcHPRate");
static_assert(offsetof(BattleAICommand_C_CalcHPRate, PartyIndex) == 0x000000, "Member 'BattleAICommand_C_CalcHPRate::PartyIndex' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_CalcHPRate, RetValue) == 0x000004, "Member 'BattleAICommand_C_CalcHPRate::RetValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_CalcHPRate, Lo_maxHP) == 0x000008, "Member 'BattleAICommand_C_CalcHPRate::Lo_maxHP' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_CalcHPRate, Lo_nowHP) == 0x00000C, "Member 'BattleAICommand_C_CalcHPRate::Lo_nowHP' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_CalcHPRate, CallFunc_CalcRate_retValue) == 0x000010, "Member 'BattleAICommand_C_CalcHPRate::CallFunc_CalcRate_retValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_CalcHPRate, CallFunc_GetBIPartySystem_ret) == 0x000018, "Member 'BattleAICommand_C_CalcHPRate::CallFunc_GetBIPartySystem_ret' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_CalcHPRate, CallFunc_BI_GetMaxHP_retValue) == 0x000028, "Member 'BattleAICommand_C_CalcHPRate::CallFunc_BI_GetMaxHP_retValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_CalcHPRate, CallFunc_BI_GetNowHP_retValue) == 0x00002C, "Member 'BattleAICommand_C_CalcHPRate::CallFunc_BI_GetNowHP_retValue' has a wrong offset!");

// Function BattleAICommand.BattleAICommand_C.Chk_PLHPPerc
// 0x0060 (0x0060 - 0x0000)
struct BattleAICommand_C_Chk_PLHPPerc final
{
public:
	int32                                         Perc;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Lo_ActList;                                        // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PTUtilInterface>  CallFunc_GetPTUtilInterface_retValue;              // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_BI_GetSideIsInFieldList_ReturnValue;      // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_CalcHPRate_retValue;                      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleAICommand_C_Chk_PLHPPerc) == 0x000008, "Wrong alignment on BattleAICommand_C_Chk_PLHPPerc");
static_assert(sizeof(BattleAICommand_C_Chk_PLHPPerc) == 0x000060, "Wrong size on BattleAICommand_C_Chk_PLHPPerc");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPerc, Perc) == 0x000000, "Member 'BattleAICommand_C_Chk_PLHPPerc::Perc' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPerc, ReturnValue) == 0x000004, "Member 'BattleAICommand_C_Chk_PLHPPerc::ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPerc, Lo_ActList) == 0x000008, "Member 'BattleAICommand_C_Chk_PLHPPerc::Lo_ActList' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPerc, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BattleAICommand_C_Chk_PLHPPerc::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPerc, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BattleAICommand_C_Chk_PLHPPerc::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPerc, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BattleAICommand_C_Chk_PLHPPerc::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPerc, CallFunc_GetPTUtilInterface_retValue) == 0x000028, "Member 'BattleAICommand_C_Chk_PLHPPerc::CallFunc_GetPTUtilInterface_retValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPerc, CallFunc_Array_Get_Item) == 0x000038, "Member 'BattleAICommand_C_Chk_PLHPPerc::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPerc, CallFunc_BI_GetSideIsInFieldList_ReturnValue) == 0x000040, "Member 'BattleAICommand_C_Chk_PLHPPerc::CallFunc_BI_GetSideIsInFieldList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPerc, CallFunc_CalcHPRate_retValue) == 0x000050, "Member 'BattleAICommand_C_Chk_PLHPPerc::CallFunc_CalcHPRate_retValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPerc, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000054, "Member 'BattleAICommand_C_Chk_PLHPPerc::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPerc, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BattleAICommand_C_Chk_PLHPPerc::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPerc, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'BattleAICommand_C_Chk_PLHPPerc::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BattleAICommand.BattleAICommand_C.Chk_PLHPPercOver
// 0x0060 (0x0060 - 0x0000)
struct BattleAICommand_C_Chk_PLHPPercOver final
{
public:
	int32                                         Perc;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Lo_ActList;                                        // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PTUtilInterface>  CallFunc_GetPTUtilInterface_retValue;              // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_BI_GetSideIsInFieldList_ReturnValue;      // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_CalcHPRate_retValue;                      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleAICommand_C_Chk_PLHPPercOver) == 0x000008, "Wrong alignment on BattleAICommand_C_Chk_PLHPPercOver");
static_assert(sizeof(BattleAICommand_C_Chk_PLHPPercOver) == 0x000060, "Wrong size on BattleAICommand_C_Chk_PLHPPercOver");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPercOver, Perc) == 0x000000, "Member 'BattleAICommand_C_Chk_PLHPPercOver::Perc' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPercOver, ReturnValue) == 0x000004, "Member 'BattleAICommand_C_Chk_PLHPPercOver::ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPercOver, Lo_ActList) == 0x000008, "Member 'BattleAICommand_C_Chk_PLHPPercOver::Lo_ActList' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPercOver, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BattleAICommand_C_Chk_PLHPPercOver::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPercOver, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BattleAICommand_C_Chk_PLHPPercOver::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPercOver, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BattleAICommand_C_Chk_PLHPPercOver::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPercOver, CallFunc_GetPTUtilInterface_retValue) == 0x000028, "Member 'BattleAICommand_C_Chk_PLHPPercOver::CallFunc_GetPTUtilInterface_retValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPercOver, CallFunc_Array_Get_Item) == 0x000038, "Member 'BattleAICommand_C_Chk_PLHPPercOver::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPercOver, CallFunc_BI_GetSideIsInFieldList_ReturnValue) == 0x000040, "Member 'BattleAICommand_C_Chk_PLHPPercOver::CallFunc_BI_GetSideIsInFieldList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPercOver, CallFunc_CalcHPRate_retValue) == 0x000050, "Member 'BattleAICommand_C_Chk_PLHPPercOver::CallFunc_CalcHPRate_retValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPercOver, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000054, "Member 'BattleAICommand_C_Chk_PLHPPercOver::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPercOver, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BattleAICommand_C_Chk_PLHPPercOver::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLHPPercOver, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'BattleAICommand_C_Chk_PLHPPercOver::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BattleAICommand.BattleAICommand_C.Chk_ENHPPerc
// 0x0060 (0x0060 - 0x0000)
struct BattleAICommand_C_Chk_ENHPPerc final
{
public:
	int32                                         Perc;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Lo_ActList;                                        // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PTUtilInterface>  CallFunc_GetPTUtilInterface_retValue;              // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_BI_GetSideIsInFieldList_ReturnValue;      // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_CalcHPRate_retValue;                      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleAICommand_C_Chk_ENHPPerc) == 0x000008, "Wrong alignment on BattleAICommand_C_Chk_ENHPPerc");
static_assert(sizeof(BattleAICommand_C_Chk_ENHPPerc) == 0x000060, "Wrong size on BattleAICommand_C_Chk_ENHPPerc");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPerc, Perc) == 0x000000, "Member 'BattleAICommand_C_Chk_ENHPPerc::Perc' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPerc, ReturnValue) == 0x000004, "Member 'BattleAICommand_C_Chk_ENHPPerc::ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPerc, Lo_ActList) == 0x000008, "Member 'BattleAICommand_C_Chk_ENHPPerc::Lo_ActList' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPerc, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BattleAICommand_C_Chk_ENHPPerc::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPerc, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BattleAICommand_C_Chk_ENHPPerc::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPerc, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BattleAICommand_C_Chk_ENHPPerc::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPerc, CallFunc_GetPTUtilInterface_retValue) == 0x000028, "Member 'BattleAICommand_C_Chk_ENHPPerc::CallFunc_GetPTUtilInterface_retValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPerc, CallFunc_Array_Get_Item) == 0x000038, "Member 'BattleAICommand_C_Chk_ENHPPerc::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPerc, CallFunc_BI_GetSideIsInFieldList_ReturnValue) == 0x000040, "Member 'BattleAICommand_C_Chk_ENHPPerc::CallFunc_BI_GetSideIsInFieldList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPerc, CallFunc_CalcHPRate_retValue) == 0x000050, "Member 'BattleAICommand_C_Chk_ENHPPerc::CallFunc_CalcHPRate_retValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPerc, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000054, "Member 'BattleAICommand_C_Chk_ENHPPerc::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPerc, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BattleAICommand_C_Chk_ENHPPerc::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPerc, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'BattleAICommand_C_Chk_ENHPPerc::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BattleAICommand.BattleAICommand_C.Chk_ENHPPercOver
// 0x0060 (0x0060 - 0x0000)
struct BattleAICommand_C_Chk_ENHPPercOver final
{
public:
	int32                                         Perc;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Lo_ActList;                                        // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PTUtilInterface>  CallFunc_GetPTUtilInterface_retValue;              // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_BI_GetSideIsInFieldList_ReturnValue;      // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_CalcHPRate_retValue;                      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleAICommand_C_Chk_ENHPPercOver) == 0x000008, "Wrong alignment on BattleAICommand_C_Chk_ENHPPercOver");
static_assert(sizeof(BattleAICommand_C_Chk_ENHPPercOver) == 0x000060, "Wrong size on BattleAICommand_C_Chk_ENHPPercOver");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercOver, Perc) == 0x000000, "Member 'BattleAICommand_C_Chk_ENHPPercOver::Perc' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercOver, ReturnValue) == 0x000004, "Member 'BattleAICommand_C_Chk_ENHPPercOver::ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercOver, Lo_ActList) == 0x000008, "Member 'BattleAICommand_C_Chk_ENHPPercOver::Lo_ActList' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercOver, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BattleAICommand_C_Chk_ENHPPercOver::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercOver, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BattleAICommand_C_Chk_ENHPPercOver::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercOver, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BattleAICommand_C_Chk_ENHPPercOver::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercOver, CallFunc_GetPTUtilInterface_retValue) == 0x000028, "Member 'BattleAICommand_C_Chk_ENHPPercOver::CallFunc_GetPTUtilInterface_retValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercOver, CallFunc_Array_Get_Item) == 0x000038, "Member 'BattleAICommand_C_Chk_ENHPPercOver::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercOver, CallFunc_BI_GetSideIsInFieldList_ReturnValue) == 0x000040, "Member 'BattleAICommand_C_Chk_ENHPPercOver::CallFunc_BI_GetSideIsInFieldList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercOver, CallFunc_CalcHPRate_retValue) == 0x000050, "Member 'BattleAICommand_C_Chk_ENHPPercOver::CallFunc_CalcHPRate_retValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercOver, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000054, "Member 'BattleAICommand_C_Chk_ENHPPercOver::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercOver, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BattleAICommand_C_Chk_ENHPPercOver::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercOver, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'BattleAICommand_C_Chk_ENHPPercOver::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BattleAICommand.BattleAICommand_C.Chk_ENHPPercID
// 0x0088 (0x0088 - 0x0000)
struct BattleAICommand_C_Chk_ENHPPercID final
{
public:
	int32                                         DevilID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Perc;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Lo_ActList;                                        // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Lo_Perc;                                           // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_DevilID;                                        // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalcHPRate_retValue;                      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_GetBIPartySystem_ret;                     // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_PTUtilInterface>  CallFunc_GetPTUtilInterface_retValue;              // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BI_GetCharaID_retValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_BI_GetSideIsInFieldList_ReturnValue;      // 0x0070(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleAICommand_C_Chk_ENHPPercID) == 0x000008, "Wrong alignment on BattleAICommand_C_Chk_ENHPPercID");
static_assert(sizeof(BattleAICommand_C_Chk_ENHPPercID) == 0x000088, "Wrong size on BattleAICommand_C_Chk_ENHPPercID");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercID, DevilID) == 0x000000, "Member 'BattleAICommand_C_Chk_ENHPPercID::DevilID' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercID, Perc) == 0x000004, "Member 'BattleAICommand_C_Chk_ENHPPercID::Perc' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercID, ReturnValue) == 0x000008, "Member 'BattleAICommand_C_Chk_ENHPPercID::ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercID, Lo_ActList) == 0x000010, "Member 'BattleAICommand_C_Chk_ENHPPercID::Lo_ActList' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercID, Lo_Perc) == 0x000020, "Member 'BattleAICommand_C_Chk_ENHPPercID::Lo_Perc' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercID, Lo_DevilID) == 0x000024, "Member 'BattleAICommand_C_Chk_ENHPPercID::Lo_DevilID' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercID, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BattleAICommand_C_Chk_ENHPPercID::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercID, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BattleAICommand_C_Chk_ENHPPercID::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercID, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BattleAICommand_C_Chk_ENHPPercID::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercID, CallFunc_Array_Get_Item) == 0x000034, "Member 'BattleAICommand_C_Chk_ENHPPercID::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercID, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BattleAICommand_C_Chk_ENHPPercID::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercID, CallFunc_CalcHPRate_retValue) == 0x00003C, "Member 'BattleAICommand_C_Chk_ENHPPercID::CallFunc_CalcHPRate_retValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercID, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BattleAICommand_C_Chk_ENHPPercID::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercID, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000041, "Member 'BattleAICommand_C_Chk_ENHPPercID::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercID, CallFunc_GetBIPartySystem_ret) == 0x000048, "Member 'BattleAICommand_C_Chk_ENHPPercID::CallFunc_GetBIPartySystem_ret' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercID, CallFunc_GetPTUtilInterface_retValue) == 0x000058, "Member 'BattleAICommand_C_Chk_ENHPPercID::CallFunc_GetPTUtilInterface_retValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercID, CallFunc_BI_GetCharaID_retValue) == 0x000068, "Member 'BattleAICommand_C_Chk_ENHPPercID::CallFunc_BI_GetCharaID_retValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercID, CallFunc_BI_GetSideIsInFieldList_ReturnValue) == 0x000070, "Member 'BattleAICommand_C_Chk_ENHPPercID::CallFunc_BI_GetSideIsInFieldList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_ENHPPercID, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000080, "Member 'BattleAICommand_C_Chk_ENHPPercID::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BattleAICommand.BattleAICommand_C.Chk_MyLvOver
// 0x0170 (0x0170 - 0x0000)
struct BattleAICommand_C_Chk_MyLvOver final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PTMemDataInterface> CallFunc_GetPTMemInterface_retValue;               // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetActorIndex_retValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlCharData                           CallFunc_BI_GetBtlCharaData_ReturnValue;           // 0x0020(0x0148)()
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleAICommand_C_Chk_MyLvOver) == 0x000008, "Wrong alignment on BattleAICommand_C_Chk_MyLvOver");
static_assert(sizeof(BattleAICommand_C_Chk_MyLvOver) == 0x000170, "Wrong size on BattleAICommand_C_Chk_MyLvOver");
static_assert(offsetof(BattleAICommand_C_Chk_MyLvOver, Level) == 0x000000, "Member 'BattleAICommand_C_Chk_MyLvOver::Level' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_MyLvOver, ReturnValue) == 0x000004, "Member 'BattleAICommand_C_Chk_MyLvOver::ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_MyLvOver, CallFunc_GetPTMemInterface_retValue) == 0x000008, "Member 'BattleAICommand_C_Chk_MyLvOver::CallFunc_GetPTMemInterface_retValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_MyLvOver, CallFunc_GetActorIndex_retValue) == 0x000018, "Member 'BattleAICommand_C_Chk_MyLvOver::CallFunc_GetActorIndex_retValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_MyLvOver, CallFunc_BI_GetBtlCharaData_ReturnValue) == 0x000020, "Member 'BattleAICommand_C_Chk_MyLvOver::CallFunc_BI_GetBtlCharaData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_MyLvOver, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000168, "Member 'BattleAICommand_C_Chk_MyLvOver::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BattleAICommand.BattleAICommand_C.Chk_PLLvOver
// 0x01C8 (0x01C8 - 0x0000)
struct BattleAICommand_C_Chk_PLLvOver final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Lo_ActList;                                        // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         Lo_Ave;                                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_Cnt;                                            // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PTMemDataInterface> CallFunc_GetPTMemInterface_retValue;               // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlCharData                           CallFunc_BI_GetBtlCharaData_ReturnValue;           // 0x0050(0x0148)()
	TScriptInterface<class IBPI_PTUtilInterface>  CallFunc_GetPTUtilInterface_retValue;              // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<int32>                                 CallFunc_BI_GetSideIsInFieldList_ReturnValue;      // 0x01A8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleAICommand_C_Chk_PLLvOver) == 0x000008, "Wrong alignment on BattleAICommand_C_Chk_PLLvOver");
static_assert(sizeof(BattleAICommand_C_Chk_PLLvOver) == 0x0001C8, "Wrong size on BattleAICommand_C_Chk_PLLvOver");
static_assert(offsetof(BattleAICommand_C_Chk_PLLvOver, Level) == 0x000000, "Member 'BattleAICommand_C_Chk_PLLvOver::Level' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLLvOver, RetValue) == 0x000004, "Member 'BattleAICommand_C_Chk_PLLvOver::RetValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLLvOver, Lo_ActList) == 0x000008, "Member 'BattleAICommand_C_Chk_PLLvOver::Lo_ActList' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLLvOver, Lo_Ave) == 0x000018, "Member 'BattleAICommand_C_Chk_PLLvOver::Lo_Ave' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLLvOver, Lo_Cnt) == 0x00001C, "Member 'BattleAICommand_C_Chk_PLLvOver::Lo_Cnt' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLLvOver, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BattleAICommand_C_Chk_PLLvOver::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLLvOver, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BattleAICommand_C_Chk_PLLvOver::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLLvOver, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BattleAICommand_C_Chk_PLLvOver::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLLvOver, Temp_int_Variable) == 0x00002C, "Member 'BattleAICommand_C_Chk_PLLvOver::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLLvOver, CallFunc_Array_Get_Item) == 0x000030, "Member 'BattleAICommand_C_Chk_PLLvOver::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLLvOver, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'BattleAICommand_C_Chk_PLLvOver::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLLvOver, CallFunc_GetPTMemInterface_retValue) == 0x000038, "Member 'BattleAICommand_C_Chk_PLLvOver::CallFunc_GetPTMemInterface_retValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLLvOver, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BattleAICommand_C_Chk_PLLvOver::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLLvOver, CallFunc_BI_GetBtlCharaData_ReturnValue) == 0x000050, "Member 'BattleAICommand_C_Chk_PLLvOver::CallFunc_BI_GetBtlCharaData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLLvOver, CallFunc_GetPTUtilInterface_retValue) == 0x000198, "Member 'BattleAICommand_C_Chk_PLLvOver::CallFunc_GetPTUtilInterface_retValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLLvOver, CallFunc_BI_GetSideIsInFieldList_ReturnValue) == 0x0001A8, "Member 'BattleAICommand_C_Chk_PLLvOver::CallFunc_BI_GetSideIsInFieldList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLLvOver, CallFunc_Divide_IntInt_ReturnValue) == 0x0001B8, "Member 'BattleAICommand_C_Chk_PLLvOver::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLLvOver, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001BC, "Member 'BattleAICommand_C_Chk_PLLvOver::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLLvOver, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001C0, "Member 'BattleAICommand_C_Chk_PLLvOver::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleAICommand_C_Chk_PLLvOver, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001C4, "Member 'BattleAICommand_C_Chk_PLLvOver::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function BattleAICommand.BattleAICommand_C.Chk_ENLvOver
// 0x01C8 (0x01C8 - 0x0000)
struct BattleAICommand_C_Chk_ENLvOver final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Lo_ActList;                                        // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         Lo_Ave;                                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_Cnt;                                            // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PTMemDataInterface> CallFunc_GetPTMemInterface_retValue;               // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlCharData                           CallFunc_BI_GetBtlCharaData_ReturnValue;           // 0x0050(0x0148)()
	TScriptInterface<class IBPI_PTUtilInterface>  CallFunc_GetPTUtilInterface_retValue;              // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
