#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleSkillHitStop_T

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct BattleSkillHitStop_T.BattleSkillHitStop_T
// 0x0038 (0x0038 - 0x0000)
struct FBattleSkillHitStop_T final
{
public:
	class UCurveFloat*                            HitStopDilation_2_ADC4AC734F19DE1B660921BA07C28AA1; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            PostProsessWeight_4_261336FA41FF9B1D98831EA9F6E650A3; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveLinearColor*                      PostProcessFogColor_20_2437FBB147EED07093945F84F39F1584; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            CameraFovy_6_8BAA27FB4B5692EEB926B0B28606894E;     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveVector*                           Fresnel_13_64963F68411A823BF618CCBA3B3EE641;       // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveLinearColor*                      FresnelColor_14_015DDCF744042AEAE8D2238A86A223DA;  // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveLinearColor*                      SilhouetteColor_17_6124740B42AB64751F7AAA926A9E5E5F; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FBattleSkillHitStop_T) == 0x000008, "Wrong alignment on FBattleSkillHitStop_T");
static_assert(sizeof(FBattleSkillHitStop_T) == 0x000038, "Wrong size on FBattleSkillHitStop_T");
static_assert(offsetof(FBattleSkillHitStop_T, HitStopDilation_2_ADC4AC734F19DE1B660921BA07C28AA1) == 0x000000, "Member 'FBattleSkillHitStop_T::HitStopDilation_2_ADC4AC734F19DE1B660921BA07C28AA1' has a wrong offset!");
static_assert(offsetof(FBattleSkillHitStop_T, PostProsessWeight_4_261336FA41FF9B1D98831EA9F6E650A3) == 0x000008, "Member 'FBattleSkillHitStop_T::PostProsessWeight_4_261336FA41FF9B1D98831EA9F6E650A3' has a wrong offset!");
static_assert(offsetof(FBattleSkillHitStop_T, PostProcessFogColor_20_2437FBB147EED07093945F84F39F1584) == 0x000010, "Member 'FBattleSkillHitStop_T::PostProcessFogColor_20_2437FBB147EED07093945F84F39F1584' has a wrong offset!");
static_assert(offsetof(FBattleSkillHitStop_T, CameraFovy_6_8BAA27FB4B5692EEB926B0B28606894E) == 0x000018, "Member 'FBattleSkillHitStop_T::CameraFovy_6_8BAA27FB4B5692EEB926B0B28606894E' has a wrong offset!");
static_assert(offsetof(FBattleSkillHitStop_T, Fresnel_13_64963F68411A823BF618CCBA3B3EE641) == 0x000020, "Member 'FBattleSkillHitStop_T::Fresnel_13_64963F68411A823BF618CCBA3B3EE641' has a wrong offset!");
static_assert(offsetof(FBattleSkillHitStop_T, FresnelColor_14_015DDCF744042AEAE8D2238A86A223DA) == 0x000028, "Member 'FBattleSkillHitStop_T::FresnelColor_14_015DDCF744042AEAE8D2238A86A223DA' has a wrong offset!");
static_assert(offsetof(FBattleSkillHitStop_T, SilhouetteColor_17_6124740B42AB64751F7AAA926A9E5E5F) == 0x000030, "Member 'FBattleSkillHitStop_T::SilhouetteColor_17_6124740B42AB64751F7AAA926A9E5E5F' has a wrong offset!");

}

