#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleEffectManager

#include "Basic.hpp"

#include "BTL_EFFECT_DATA_structs.hpp"
#include "Project_structs.hpp"
#include "BattleResidentEffect_structs.hpp"
#include "BTL_EFFECT_PLAY_PARAM_structs.hpp"
#include "BadStatusParticles_T_structs.hpp"
#include "BTL_LIGHT_PLAY_PARAM_structs.hpp"


namespace SDK::Params
{

// Function BattleEffectManager.BattleEffectManager_C.ExecuteUbergraph_BattleEffectManager
// 0x05E0 (0x05E0 - 0x0000)
struct BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F6B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleMain_C*                          CallFunc_GetMainWork_retValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBattleActionTaskFactory_C*             CallFunc_GetTaskFactory_retValue;                  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          K2Node_DynamicCast_AsSound_Atom_Cue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F6C[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkillActionEffect                     K2Node_MakeStruct_SkillActionEffect;               // 0x0038(0x0038)()
	struct FBattleResidentEffect                  K2Node_MakeStruct_BattleResidentEffect;            // 0x0070(0x0038)(HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsBattle_Skill_Action_Base; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F6D[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F6E[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkillActionEffect                     K2Node_MakeStruct_SkillActionEffect_1;             // 0x00E8(0x0038)()
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0120(0x0010)(ReferenceParm)
	struct FBattleResidentEffect                  K2Node_MakeStruct_BattleResidentEffect_1;          // 0x0130(0x0038)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F6F[0x3];                                     // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0170(0x0010)(ZeroConstructor, NoDestructor)
	struct FBadStatusParticles_T                  CallFunc_GetDataTableRowFromName_OutRow;           // 0x0180(0x0060)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F70[0x3];                                     // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x01E4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_2; // 0x01F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_3; // 0x01F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x01FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F71[0x4];                                     // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0208(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F72[0x4];                                     // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_2;                            // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          K2Node_DynamicCast_AsSound_Atom_Cue_1;             // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F73[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkillActionDesc                       K2Node_CustomEvent_desc;                           // 0x0238(0x0090)()
	bool                                          K2Node_CustomEvent_isCounterActor;                 // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsSkillSkip;                    // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F74[0x6];                                     // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBTL_EFFECT_PLAY_PARAM>         K2Node_CustomEvent_EffectPlayParam;                // 0x02D0(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FBTL_LIGHT_PLAY_PARAM>          K2Node_CustomEvent_LightPlayParam;                 // 0x02E0(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_CustomEvent_IsUsedAnimCam;                  // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F75[0x7];                                     // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_CustomEvent_TrashActors;                    // 0x02F8(0x0010)(ConstParm, ReferenceParm)
	TArray<class UActorComponent*>                K2Node_CustomEvent_TrashComponent;                 // 0x0308(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x0318(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0328(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F76[0x7];                                     // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_ItemGetEffectName_ReturnValue;            // 0x0340(0x0018)(ConstParm)
	class FText                                   CallFunc_GetSkillEffectName_ReturnValue;           // 0x0358(0x0018)(ConstParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F77[0x7];                                     // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaBase_C*                           CallFunc_FindUnit_Unit;                            // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0390(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABattleMain_C*                          CallFunc_GetMainWork_retValue_1;                   // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleSkillActionBase_C*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x03C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x03D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x03E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x03F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System_1;            // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F78[0x7];                                     // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0418(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSkillActionEffect                     K2Node_MakeStruct_SkillActionEffect_2;             // 0x0428(0x0038)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0460(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBattleResidentEffect                  K2Node_MakeStruct_BattleResidentEffect_2;          // 0x0470(0x0038)(HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x04A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x04B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x04C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x04D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_4;                       // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x04F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0500(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0518(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x0528(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_GetSkillData_AssetData;                   // 0x0538(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetSkillData_isVald;                      // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F79[0x7];                                     // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CallFunc_GetSkillData_AssetData_1;                 // 0x0568(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetSkillData_isVald_1;                    // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F7A[0x3];                                     // 0x0591(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0594(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5F7B[0x4];                                     // 0x05A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASk_DamageResultOnly_C*                 K2Node_DynamicCast_AsSk_Damage_Result_Only;        // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F7C[0x7];                                     // 0x05B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x05B8(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F7D[0x3];                                     // 0x05D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BattleDesignDebugIsDrawInfo_IsDraw;       // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager) == 0x000008, "Wrong alignment on BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager");
static_assert(sizeof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager) == 0x0005E0, "Wrong size on BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, EntryPoint) == 0x000000, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_GetMainWork_retValue) == 0x000008, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_GetMainWork_retValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_CustomEvent_Loaded_1) == 0x000010, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_GetTaskFactory_retValue) == 0x000018, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_GetTaskFactory_retValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, Temp_object_Variable) == 0x000020, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_DynamicCast_AsSound_Atom_Cue) == 0x000028, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_DynamicCast_AsSound_Atom_Cue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_MakeStruct_SkillActionEffect) == 0x000038, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_MakeStruct_SkillActionEffect' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_MakeStruct_BattleResidentEffect) == 0x000070, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_MakeStruct_BattleResidentEffect' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_CustomEvent_Loaded) == 0x0000A8, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_Conv_StringToName_ReturnValue) == 0x0000B0, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, Temp_class_Variable) == 0x0000B8, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_ClassDynamicCast_AsBattle_Skill_Action_Base) == 0x0000C0, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_ClassDynamicCast_AsBattle_Skill_Action_Base' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_ClassDynamicCast_bSuccess) == 0x0000C8, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, Temp_int_Variable) == 0x0000CC, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, Temp_object_Variable_1) == 0x0000D0, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_DynamicCast_AsParticle_System) == 0x0000D8, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_DynamicCast_AsParticle_System' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_MakeStruct_SkillActionEffect_1) == 0x0000E8, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_MakeStruct_SkillActionEffect_1' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000120, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_MakeStruct_BattleResidentEffect_1) == 0x000130, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_MakeStruct_BattleResidentEffect_1' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_Array_Length_ReturnValue) == 0x000168, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_Greater_IntInt_ReturnValue) == 0x00016C, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_CreateDelegate_OutputDelegate) == 0x000170, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_GetDataTableRowFromName_OutRow) == 0x000180, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001E0, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001E4, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0001F4, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x0001F5, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_IsValidSoftObjectReference_ReturnValue_2) == 0x0001F6, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_IsValidSoftObjectReference_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_IsValidSoftObjectReference_ReturnValue_3) == 0x0001F7, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_IsValidSoftObjectReference_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_BooleanAND_ReturnValue) == 0x0001F8, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_SwitchEnum_CmpSuccess) == 0x0001F9, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_SwitchEnum_CmpSuccess_1) == 0x0001FA, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_SwitchEnum_CmpSuccess_2) == 0x0001FB, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_CustomEvent_Loaded_2) == 0x000200, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_CreateDelegate_OutputDelegate_2) == 0x000208, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_Add_IntInt_ReturnValue) == 0x000218, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, Temp_object_Variable_2) == 0x000220, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_DynamicCast_AsSound_Atom_Cue_1) == 0x000228, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_DynamicCast_AsSound_Atom_Cue_1' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_DynamicCast_bSuccess_2) == 0x000230, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_CustomEvent_desc) == 0x000238, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_CustomEvent_desc' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_CustomEvent_isCounterActor) == 0x0002C8, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_CustomEvent_isCounterActor' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_CustomEvent_IsSkillSkip) == 0x0002C9, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_CustomEvent_IsSkillSkip' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_CustomEvent_EffectPlayParam) == 0x0002D0, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_CustomEvent_EffectPlayParam' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_CustomEvent_LightPlayParam) == 0x0002E0, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_CustomEvent_LightPlayParam' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_CustomEvent_IsUsedAnimCam) == 0x0002F0, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_CustomEvent_IsUsedAnimCam' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_CustomEvent_TrashActors) == 0x0002F8, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_CustomEvent_TrashActors' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_CustomEvent_TrashComponent) == 0x000308, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_CustomEvent_TrashComponent' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_CreateDelegate_OutputDelegate_3) == 0x000318, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000328, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000338, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_ItemGetEffectName_ReturnValue) == 0x000340, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_ItemGetEffectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_GetSkillEffectName_ReturnValue) == 0x000358, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_GetSkillEffectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000370, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_FindUnit_Unit) == 0x000378, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_FindUnit_Unit' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_Conv_IntToString_ReturnValue) == 0x000380, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000390, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_GetMainWork_retValue_1) == 0x0003A0, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_GetMainWork_retValue_1' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_CustomEvent_Loaded_3) == 0x0003A8, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0003B0, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_FinishSpawningActor_ReturnValue) == 0x0003B8, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_Conv_TextToString_ReturnValue) == 0x0003C0, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_Concat_StrStr_ReturnValue) == 0x0003D0, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0003E0, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, Temp_object_Variable_3) == 0x0003F0, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0003F8, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_DynamicCast_AsParticle_System_1) == 0x000408, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_DynamicCast_AsParticle_System_1' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_DynamicCast_bSuccess_3) == 0x000410, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000418, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_MakeStruct_SkillActionEffect_2) == 0x000428, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_MakeStruct_SkillActionEffect_2' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000460, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_MakeStruct_BattleResidentEffect_2) == 0x000470, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_MakeStruct_BattleResidentEffect_2' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0004A8, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0004B8, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_Concat_StrStr_ReturnValue_7) == 0x0004C8, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_Concat_StrStr_ReturnValue_8) == 0x0004D8, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_CustomEvent_Loaded_4) == 0x0004E8, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_CustomEvent_Loaded_4' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0004F0, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_Conv_NameToString_ReturnValue) == 0x000500, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000510, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000518, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_Concat_StrStr_ReturnValue_10) == 0x000528, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_Concat_StrStr_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_GetSkillData_AssetData) == 0x000538, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_GetSkillData_AssetData' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_GetSkillData_isVald) == 0x000560, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_GetSkillData_isVald' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_GetSkillData_AssetData_1) == 0x000568, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_GetSkillData_AssetData_1' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_GetSkillData_isVald_1) == 0x000590, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_GetSkillData_isVald_1' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_CreateDelegate_OutputDelegate_4) == 0x000594, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_DynamicCast_AsSk_Damage_Result_Only) == 0x0005A8, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_DynamicCast_AsSk_Damage_Result_Only' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_DynamicCast_bSuccess_4) == 0x0005B0, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_MakeLiteralText_ReturnValue) == 0x0005B8, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_EqualEqual_TextText_ReturnValue) == 0x0005D0, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, K2Node_Event_DeltaSeconds) == 0x0005D4, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager, CallFunc_BattleDesignDebugIsDrawInfo_IsDraw) == 0x0005D8, "Member 'BattleEffectManager_C_ExecuteUbergraph_BattleEffectManager::CallFunc_BattleDesignDebugIsDrawInfo_IsDraw' has a wrong offset!");

// Function BattleEffectManager.BattleEffectManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BattleEffectManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleEffectManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BattleEffectManager_C_ReceiveTick");
static_assert(sizeof(BattleEffectManager_C_ReceiveTick) == 0x000004, "Wrong size on BattleEffectManager_C_ReceiveTick");
static_assert(offsetof(BattleEffectManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BattleEffectManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BattleEffectManager.BattleEffectManager_C.Evt_LoadSkillAction
// 0x00E0 (0x00E0 - 0x0000)
struct BattleEffectManager_C_Evt_LoadSkillAction final
{
public:
	struct FSkillActionDesc                       Desc;                                              // 0x0000(0x0090)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsCounterActor;                                    // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsSkillSkip;                                       // 0x0091(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F7E[0x6];                                     // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBTL_EFFECT_PLAY_PARAM>         EffectPlayParam;                                   // 0x0098(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FBTL_LIGHT_PLAY_PARAM>          LightPlayParam;                                    // 0x00A8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          IsUsedAnimCam;                                     // 0x00B8(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F7F[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         TrashActors;                                       // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UActorComponent*>                TrashComponent;                                    // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BattleEffectManager_C_Evt_LoadSkillAction) == 0x000008, "Wrong alignment on BattleEffectManager_C_Evt_LoadSkillAction");
static_assert(sizeof(BattleEffectManager_C_Evt_LoadSkillAction) == 0x0000E0, "Wrong size on BattleEffectManager_C_Evt_LoadSkillAction");
static_assert(offsetof(BattleEffectManager_C_Evt_LoadSkillAction, Desc) == 0x000000, "Member 'BattleEffectManager_C_Evt_LoadSkillAction::Desc' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_Evt_LoadSkillAction, IsCounterActor) == 0x000090, "Member 'BattleEffectManager_C_Evt_LoadSkillAction::IsCounterActor' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_Evt_LoadSkillAction, IsSkillSkip) == 0x000091, "Member 'BattleEffectManager_C_Evt_LoadSkillAction::IsSkillSkip' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_Evt_LoadSkillAction, EffectPlayParam) == 0x000098, "Member 'BattleEffectManager_C_Evt_LoadSkillAction::EffectPlayParam' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_Evt_LoadSkillAction, LightPlayParam) == 0x0000A8, "Member 'BattleEffectManager_C_Evt_LoadSkillAction::LightPlayParam' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_Evt_LoadSkillAction, IsUsedAnimCam) == 0x0000B8, "Member 'BattleEffectManager_C_Evt_LoadSkillAction::IsUsedAnimCam' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_Evt_LoadSkillAction, TrashActors) == 0x0000C0, "Member 'BattleEffectManager_C_Evt_LoadSkillAction::TrashActors' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_Evt_LoadSkillAction, TrashComponent) == 0x0000D0, "Member 'BattleEffectManager_C_Evt_LoadSkillAction::TrashComponent' has a wrong offset!");

// Function BattleEffectManager.BattleEffectManager_C.OnLoaded_3970EED74387B1CC6618A583E794A76F
// 0x0008 (0x0008 - 0x0000)
struct BattleEffectManager_C_OnLoaded_3970EED74387B1CC6618A583E794A76F final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BattleEffectManager_C_OnLoaded_3970EED74387B1CC6618A583E794A76F) == 0x000008, "Wrong alignment on BattleEffectManager_C_OnLoaded_3970EED74387B1CC6618A583E794A76F");
static_assert(sizeof(BattleEffectManager_C_OnLoaded_3970EED74387B1CC6618A583E794A76F) == 0x000008, "Wrong size on BattleEffectManager_C_OnLoaded_3970EED74387B1CC6618A583E794A76F");
static_assert(offsetof(BattleEffectManager_C_OnLoaded_3970EED74387B1CC6618A583E794A76F, Loaded) == 0x000000, "Member 'BattleEffectManager_C_OnLoaded_3970EED74387B1CC6618A583E794A76F::Loaded' has a wrong offset!");

// Function BattleEffectManager.BattleEffectManager_C.OnLoaded_1EC0815A4A7AAF6BC7D42D9DA55555F3
// 0x0008 (0x0008 - 0x0000)
struct BattleEffectManager_C_OnLoaded_1EC0815A4A7AAF6BC7D42D9DA55555F3 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleEffectManager_C_OnLoaded_1EC0815A4A7AAF6BC7D42D9DA55555F3) == 0x000008, "Wrong alignment on BattleEffectManager_C_OnLoaded_1EC0815A4A7AAF6BC7D42D9DA55555F3");
static_assert(sizeof(BattleEffectManager_C_OnLoaded_1EC0815A4A7AAF6BC7D42D9DA55555F3) == 0x000008, "Wrong size on BattleEffectManager_C_OnLoaded_1EC0815A4A7AAF6BC7D42D9DA55555F3");
static_assert(offsetof(BattleEffectManager_C_OnLoaded_1EC0815A4A7AAF6BC7D42D9DA55555F3, Loaded) == 0x000000, "Member 'BattleEffectManager_C_OnLoaded_1EC0815A4A7AAF6BC7D42D9DA55555F3::Loaded' has a wrong offset!");

// Function BattleEffectManager.BattleEffectManager_C.OnLoaded_0CAB10844DC8B1F0C9C27EA96E427DAC
// 0x0008 (0x0008 - 0x0000)
struct BattleEffectManager_C_OnLoaded_0CAB10844DC8B1F0C9C27EA96E427DAC final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleEffectManager_C_OnLoaded_0CAB10844DC8B1F0C9C27EA96E427DAC) == 0x000008, "Wrong alignment on BattleEffectManager_C_OnLoaded_0CAB10844DC8B1F0C9C27EA96E427DAC");
static_assert(sizeof(BattleEffectManager_C_OnLoaded_0CAB10844DC8B1F0C9C27EA96E427DAC) == 0x000008, "Wrong size on BattleEffectManager_C_OnLoaded_0CAB10844DC8B1F0C9C27EA96E427DAC");
static_assert(offsetof(BattleEffectManager_C_OnLoaded_0CAB10844DC8B1F0C9C27EA96E427DAC, Loaded) == 0x000000, "Member 'BattleEffectManager_C_OnLoaded_0CAB10844DC8B1F0C9C27EA96E427DAC::Loaded' has a wrong offset!");

// Function BattleEffectManager.BattleEffectManager_C.OnLoaded_42B764784DB221504DD75A9AE0BC76C5
// 0x0008 (0x0008 - 0x0000)
struct BattleEffectManager_C_OnLoaded_42B764784DB221504DD75A9AE0BC76C5 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleEffectManager_C_OnLoaded_42B764784DB221504DD75A9AE0BC76C5) == 0x000008, "Wrong alignment on BattleEffectManager_C_OnLoaded_42B764784DB221504DD75A9AE0BC76C5");
static_assert(sizeof(BattleEffectManager_C_OnLoaded_42B764784DB221504DD75A9AE0BC76C5) == 0x000008, "Wrong size on BattleEffectManager_C_OnLoaded_42B764784DB221504DD75A9AE0BC76C5");
static_assert(offsetof(BattleEffectManager_C_OnLoaded_42B764784DB221504DD75A9AE0BC76C5, Loaded) == 0x000000, "Member 'BattleEffectManager_C_OnLoaded_42B764784DB221504DD75A9AE0BC76C5::Loaded' has a wrong offset!");

// Function BattleEffectManager.BattleEffectManager_C.OnLoaded_CB3676884CCB4AD97D27E5A6AE69F634
// 0x0008 (0x0008 - 0x0000)
struct BattleEffectManager_C_OnLoaded_CB3676884CCB4AD97D27E5A6AE69F634 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleEffectManager_C_OnLoaded_CB3676884CCB4AD97D27E5A6AE69F634) == 0x000008, "Wrong alignment on BattleEffectManager_C_OnLoaded_CB3676884CCB4AD97D27E5A6AE69F634");
static_assert(sizeof(BattleEffectManager_C_OnLoaded_CB3676884CCB4AD97D27E5A6AE69F634) == 0x000008, "Wrong size on BattleEffectManager_C_OnLoaded_CB3676884CCB4AD97D27E5A6AE69F634");
static_assert(offsetof(BattleEffectManager_C_OnLoaded_CB3676884CCB4AD97D27E5A6AE69F634, Loaded) == 0x000000, "Member 'BattleEffectManager_C_OnLoaded_CB3676884CCB4AD97D27E5A6AE69F634::Loaded' has a wrong offset!");

// Function BattleEffectManager.BattleEffectManager_C.GetResidentAssetByName
// 0x0078 (0x0078 - 0x0000)
struct BattleEffectManager_C_GetResidentAssetByName final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        RetValue;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBattleResidentEffect                  CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x0038)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F80[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0058(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleEffectManager_C_GetResidentAssetByName) == 0x000008, "Wrong alignment on BattleEffectManager_C_GetResidentAssetByName");
static_assert(sizeof(BattleEffectManager_C_GetResidentAssetByName) == 0x000078, "Wrong size on BattleEffectManager_C_GetResidentAssetByName");
static_assert(offsetof(BattleEffectManager_C_GetResidentAssetByName, Param_Name) == 0x000000, "Member 'BattleEffectManager_C_GetResidentAssetByName::Param_Name' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_GetResidentAssetByName, RetValue) == 0x000008, "Member 'BattleEffectManager_C_GetResidentAssetByName::RetValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_GetResidentAssetByName, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'BattleEffectManager_C_GetResidentAssetByName::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_GetResidentAssetByName, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000048, "Member 'BattleEffectManager_C_GetResidentAssetByName::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_GetResidentAssetByName, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'BattleEffectManager_C_GetResidentAssetByName::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_GetResidentAssetByName, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'BattleEffectManager_C_GetResidentAssetByName::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_GetResidentAssetByName, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BattleEffectManager_C_GetResidentAssetByName::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_GetResidentAssetByName, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000058, "Member 'BattleEffectManager_C_GetResidentAssetByName::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_GetResidentAssetByName, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'BattleEffectManager_C_GetResidentAssetByName::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_GetResidentAssetByName, CallFunc_Array_Get_Item) == 0x00006C, "Member 'BattleEffectManager_C_GetResidentAssetByName::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_GetResidentAssetByName, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'BattleEffectManager_C_GetResidentAssetByName::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEffectManager_C_GetResidentAssetByName, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000075, "Member 'BattleEffectManager_C_GetResidentAssetByName::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function BattleEffectManager.BattleEffectManager_C.IsExistSkillAction
// 0x0030 (0x0030 - 0x0000)
struct BattleEffectManager_C_IsExistSkillAction final
{
public:
	int32                                         SkillId;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F81[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
