#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePerformanceSpeedCtrl

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BattlePerformanceSpeedCtrl.BattlePerformanceSpeedCtrl_C
// 0x0010 (0x00C0 - 0x00B0)
class UBattlePerformanceSpeedCtrl_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          M_IsTempoUp;                                       // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7661[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         M_CurrentTempo;                                    // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BattlePerformanceSpeedCtrl(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UpdatePerformanceSpeed();
	void Initialize();
	void Finalize();
	void FindUnit(TScriptInterface<class IBPI_BattleParty_C> BPI_BattleParty, int32 PartyIndex, class ACharaBase_C** Unit);
	bool IsEnableVoiceProtection();
	void UpdateComponent(float Delta, bool* ContinueUpdate);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattlePerformanceSpeedCtrl_C">();
	}
	static class UBattlePerformanceSpeedCtrl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePerformanceSpeedCtrl_C>();
	}
};
static_assert(alignof(UBattlePerformanceSpeedCtrl_C) == 0x000008, "Wrong alignment on UBattlePerformanceSpeedCtrl_C");
static_assert(sizeof(UBattlePerformanceSpeedCtrl_C) == 0x0000C0, "Wrong size on UBattlePerformanceSpeedCtrl_C");
static_assert(offsetof(UBattlePerformanceSpeedCtrl_C, UberGraphFrame) == 0x0000B0, "Member 'UBattlePerformanceSpeedCtrl_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattlePerformanceSpeedCtrl_C, M_IsTempoUp) == 0x0000B8, "Member 'UBattlePerformanceSpeedCtrl_C::M_IsTempoUp' has a wrong offset!");
static_assert(offsetof(UBattlePerformanceSpeedCtrl_C, M_CurrentTempo) == 0x0000BC, "Member 'UBattlePerformanceSpeedCtrl_C::M_CurrentTempo' has a wrong offset!");

}

