#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleMain

#include "Basic.hpp"

#include "BattleBGMType_structs.hpp"
#include "Project_structs.hpp"
#include "E_BTL_PTYPNL_TYPE_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BattleResidentEffect_structs.hpp"
#include "UMG_structs.hpp"
#include "E_MoonAgeAnimationState_structs.hpp"
#include "Engine_structs.hpp"
#include "BTL_DESC_structs.hpp"


namespace SDK::Params
{

// Function BattleMain.BattleMain_C.ExecuteUbergraph_BattleMain
// 0x0660 (0x0660 - 0x0000)
struct BattleMain_C_ExecuteUbergraph_BattleMain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleMessage_C>  K2Node_DynamicCast_AsBPI_Battle_Message;           // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue;              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_1;                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_1;             // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_2;                    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BPI_GetBossRushFieldCtrl_Actor;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_2;             // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetBossRushFieldCtrl_Actor_1;         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_LoadBossRushField_C> K2Node_DynamicCast_AsBPI_Load_Boss_Rush_Field;     // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00F0(0x0030)(IsPlainOldData, NoDestructor)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_1;                       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInitialized_retValue;                   // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EncountSceneCtrl_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Temp_wildcard_Variable;                            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_LoadBossRushField_C> K2Node_DynamicCast_AsBPI_Load_Boss_Rush_Field_1;   // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_LoadBossRushField_C> K2Node_DynamicCast_AsBPI_Load_Boss_Rush_Field_2;   // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_Completed_ReadyBossRushField_Completed; // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_LoadBossRushField_C> K2Node_DynamicCast_AsBPI_Load_Boss_Rush_Field_3;   // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0xF];                                      // 0x01D1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_BPI_GetBossRushFieldPos_EncountPos;       // 0x01E0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_BPI_GetBossRushFieldPos_LevelPos;         // 0x0210(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_3;                    // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_3;             // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetBossRushFieldCtrl_Actor_2;         // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_LoadBossRushField_C> K2Node_DynamicCast_AsBPI_Load_Boss_Rush_Field_4;   // 0x0270(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_Completed_FinishBossRushField_Completed; // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_283[0x1];                                      // 0x0283(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_EncountID;                      // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventEncountData                      CallFunc_GetEvtEncountData_ReturnValue;            // 0x0288(0x0068)(ConstParm)
	int32                                         CallFunc_EncountIsEvent_ReturnValue;               // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_2;                             // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsWB_Btl_Info_Mess;        // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_2;                // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_BtlInfoMess_C*                      CallFunc_Create_ReturnValue_1;                     // 0x0318(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventEncountData                      CallFunc_GetEvtEncountData_ReturnValue_1;          // 0x0328(0x0068)(ConstParm)
	bool                                          CallFunc_IsGameOver_retValue;                      // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventEncountData                      CallFunc_GetEvtEncountData_ReturnValue_2;          // 0x0398(0x0068)(ConstParm)
	class AActor*                                 CallFunc_GetMapCommon_rerutn_4;                    // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_4;             // 0x0410(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetBossRushFieldCtrl_Actor_3;         // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_2;                       // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TScriptInterface<class IBPI_LoadBossRushField_C> K2Node_DynamicCast_AsBPI_Load_Boss_Rush_Field_5;   // 0x0438(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetBattleResultEnable_ReturnValue;        // 0x044A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44B[0x5];                                      // 0x044B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_PopResultMainActor_ReturnValue;           // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ResultMain_C*                       K2Node_DynamicCast_AsBP_Result_Main;               // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsEndInTransition_IsEnd;               // 0x0461(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Initialize_Success;                       // 0x0462(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0463(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_464[0xC];                                      // 0x0464(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0470(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ResultMain_C*                       CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_5;                    // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_5;             // 0x04C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetBossRushFieldCtrl_Actor_4;         // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_LoadBossRushField_C> K2Node_DynamicCast_AsBPI_Load_Boss_Rush_Field_6;   // 0x04E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_Completed_FinishBossRushField_Completed_1; // 0x04F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x04F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInitialized_retValue_1;                 // 0x04F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaTime;                            // 0x04F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDebugMenuOpen_retValue;                 // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable_3;                             // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C[0x4];                                      // 0x050C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsActor_1;                 // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_3;                // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_519[0x7];                                      // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_SetBossRushFieldCtrl_NewParam;        // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_531[0x3];                                      // 0x0531(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BattleDebugAutoFirstUnLock_Ret;           // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_3;                       // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IS_SHIPPING_BUILD_ReturnValue;            // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_549[0x3];                                      // 0x0549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0550(0x0010)(ZeroConstructor, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMouseCursorState                      CallFunc_PopShowMouseCursor_ReturnValue;           // 0x0568(0x0018)()
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bActive;                              // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_589[0x3];                                      // 0x0589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x058C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_59C[0x4];                                      // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_SetMainWork_mainWork_CastInput;           // 0x05A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x05B0(0x0010)(ZeroConstructor, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_3;              // 0x05C0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BattleCharaPanelCtrl_C*             K2Node_DynamicCast_AsBP_Battle_Chara_Panel_Ctrl;   // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_609[0x7];                                      // 0x0609(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleCharaPanelCtrl_C> K2Node_DynamicCast_AsBPI_Battle_Chara_Panel_Ctrl;  // 0x0610(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_BI_GetPartySystem_ret;                    // 0x0628(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0638(0x0010)(ZeroConstructor, NoDestructor)
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_IBattleCharaPanelSetBattleInterface_InBPIBattleMain_CastInput; // 0x0648(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleMain_C_ExecuteUbergraph_BattleMain) == 0x000010, "Wrong alignment on BattleMain_C_ExecuteUbergraph_BattleMain");
static_assert(sizeof(BattleMain_C_ExecuteUbergraph_BattleMain) == 0x000660, "Wrong size on BattleMain_C_ExecuteUbergraph_BattleMain");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, EntryPoint) == 0x000000, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, Temp_class_Variable) == 0x000008, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_ClassDynamicCast_AsActor) == 0x000010, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_ClassDynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_ClassDynamicCast_bSuccess) == 0x000018, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_CustomEvent_Loaded) == 0x000020, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, Temp_class_Variable_1) == 0x000028, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_ClassDynamicCast_AsUser_Widget) == 0x000030, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_ClassDynamicCast_AsUser_Widget' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_ClassDynamicCast_bSuccess_1) == 0x000038, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_ClassDynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_Create_ReturnValue) == 0x000040, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_GetMapCommon_rerutn) == 0x000048, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_AsBPI_Map_Common) == 0x000050, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_AsBPI_Battle_Message) == 0x000068, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_AsBPI_Battle_Message' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_AddToWidgetPrio_ReturnValue) == 0x000079, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_AddToWidgetPrio_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_GetMapCommon_rerutn_1) == 0x000080, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_GetMapCommon_rerutn_1' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_AsBPI_Map_Common_1) == 0x000088, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_AsBPI_Map_Common_1' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_GetMapCommon_rerutn_2) == 0x0000A0, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_GetMapCommon_rerutn_2' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_BPI_GetBossRushFieldCtrl_Actor) == 0x0000A8, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_BPI_GetBossRushFieldCtrl_Actor' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_AsBPI_Map_Common_2) == 0x0000B0, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_AsBPI_Map_Common_2' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_bSuccess_3) == 0x0000C0, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_BPI_GetBossRushFieldCtrl_Actor_1) == 0x0000C8, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_BPI_GetBossRushFieldCtrl_Actor_1' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_AsBPI_Load_Boss_Rush_Field) == 0x0000D8, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_AsBPI_Load_Boss_Rush_Field' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_bSuccess_4) == 0x0000E8, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_IsValid_ReturnValue_1) == 0x0000E9, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_MakeTransform_ReturnValue) == 0x0000F0, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_CustomEvent_Loaded_1) == 0x000120, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_CreateDelegate_OutputDelegate) == 0x000128, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_MakeTransform_ReturnValue_1) == 0x000140, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_IsInitialized_retValue) == 0x000170, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_IsInitialized_retValue' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000178, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_FinishSpawningActor_ReturnValue) == 0x000180, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, Temp_wildcard_Variable) == 0x000188, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_AsBPI_Load_Boss_Rush_Field_1) == 0x000190, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_AsBPI_Load_Boss_Rush_Field_1' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_bSuccess_5) == 0x0001A0, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_AsBPI_Load_Boss_Rush_Field_2) == 0x0001A8, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_AsBPI_Load_Boss_Rush_Field_2' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_bSuccess_6) == 0x0001B8, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_BPI_Completed_ReadyBossRushField_Completed) == 0x0001B9, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_BPI_Completed_ReadyBossRushField_Completed' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_AsBPI_Load_Boss_Rush_Field_3) == 0x0001C0, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_AsBPI_Load_Boss_Rush_Field_3' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_bSuccess_7) == 0x0001D0, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_BPI_GetBossRushFieldPos_EncountPos) == 0x0001E0, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_BPI_GetBossRushFieldPos_EncountPos' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_BPI_GetBossRushFieldPos_LevelPos) == 0x000210, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_BPI_GetBossRushFieldPos_LevelPos' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_IsValid_ReturnValue_2) == 0x000240, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_GetMapCommon_rerutn_3) == 0x000248, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_GetMapCommon_rerutn_3' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_AsBPI_Map_Common_3) == 0x000250, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_AsBPI_Map_Common_3' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_bSuccess_8) == 0x000260, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_BPI_GetBossRushFieldCtrl_Actor_2) == 0x000268, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_BPI_GetBossRushFieldCtrl_Actor_2' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_AsBPI_Load_Boss_Rush_Field_4) == 0x000270, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_AsBPI_Load_Boss_Rush_Field_4' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_bSuccess_9) == 0x000280, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_IsValid_ReturnValue_3) == 0x000281, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_BPI_Completed_FinishBossRushField_Completed) == 0x000282, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_BPI_Completed_FinishBossRushField_Completed' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_CustomEvent_EncountID) == 0x000284, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_CustomEvent_EncountID' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_GetEvtEncountData_ReturnValue) == 0x000288, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_GetEvtEncountData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_EncountIsEvent_ReturnValue) == 0x0002F0, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_EncountIsEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0002F4, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_CustomEvent_DestroyedActor) == 0x0002F8, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, Temp_class_Variable_2) == 0x000300, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_ClassDynamicCast_AsWB_Btl_Info_Mess) == 0x000308, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_ClassDynamicCast_AsWB_Btl_Info_Mess' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_ClassDynamicCast_bSuccess_2) == 0x000310, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_ClassDynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_Add_IntInt_ReturnValue) == 0x000314, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_Create_ReturnValue_1) == 0x000318, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_Greater_IntInt_ReturnValue) == 0x000320, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_GetEvtEncountData_ReturnValue_1) == 0x000328, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_GetEvtEncountData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_IsGameOver_retValue) == 0x000390, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_IsGameOver_retValue' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_GetEvtEncountData_ReturnValue_2) == 0x000398, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_GetEvtEncountData_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_GetMapCommon_rerutn_4) == 0x000400, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_GetMapCommon_rerutn_4' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000408, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_AsBPI_Map_Common_4) == 0x000410, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_AsBPI_Map_Common_4' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_bSuccess_10) == 0x000420, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_BPI_GetBossRushFieldCtrl_Actor_3) == 0x000428, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_BPI_GetBossRushFieldCtrl_Actor_3' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_CustomEvent_Loaded_2) == 0x000430, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_AsBPI_Load_Boss_Rush_Field_5) == 0x000438, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_AsBPI_Load_Boss_Rush_Field_5' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_bSuccess_11) == 0x000448, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_IsValid_ReturnValue_4) == 0x000449, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_GetBattleResultEnable_ReturnValue) == 0x00044A, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_GetBattleResultEnable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_PopResultMainActor_ReturnValue) == 0x000450, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_PopResultMainActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_AsBP_Result_Main) == 0x000458, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_AsBP_Result_Main' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_bSuccess_12) == 0x000460, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_GetIsEndInTransition_IsEnd) == 0x000461, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_GetIsEndInTransition_IsEnd' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_Initialize_Success) == 0x000462, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_Initialize_Success' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_IsValid_ReturnValue_5) == 0x000463, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_MakeTransform_ReturnValue_2) == 0x000470, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0004A0, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0004A8, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_Add_IntInt_ReturnValue_1) == 0x0004B0, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_GetMapCommon_rerutn_5) == 0x0004B8, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_GetMapCommon_rerutn_5' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_AsBPI_Map_Common_5) == 0x0004C0, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_AsBPI_Map_Common_5' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_bSuccess_13) == 0x0004D0, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_BPI_GetBossRushFieldCtrl_Actor_4) == 0x0004D8, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_BPI_GetBossRushFieldCtrl_Actor_4' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_AsBPI_Load_Boss_Rush_Field_6) == 0x0004E0, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_AsBPI_Load_Boss_Rush_Field_6' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_bSuccess_14) == 0x0004F0, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_BPI_Completed_FinishBossRushField_Completed_1) == 0x0004F1, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_BPI_Completed_FinishBossRushField_Completed_1' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_IsValid_ReturnValue_6) == 0x0004F2, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_IsInitialized_retValue_1) == 0x0004F3, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_IsInitialized_retValue_1' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_Event_DeltaTime) == 0x0004F4, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_IsDebugMenuOpen_retValue) == 0x0004F8, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_IsDebugMenuOpen_retValue' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, Temp_class_Variable_3) == 0x000500, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::Temp_class_Variable_3' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, Temp_int_Variable) == 0x000508, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_ClassDynamicCast_AsActor_1) == 0x000510, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_ClassDynamicCast_AsActor_1' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_ClassDynamicCast_bSuccess_3) == 0x000518, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_ClassDynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000520, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000528, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_BPI_SetBossRushFieldCtrl_NewParam) == 0x000530, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_BPI_SetBossRushFieldCtrl_NewParam' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, Temp_int_Variable_1) == 0x000534, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_BattleDebugAutoFirstUnLock_Ret) == 0x000538, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_BattleDebugAutoFirstUnLock_Ret' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_CustomEvent_Loaded_3) == 0x000540, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_IS_SHIPPING_BUILD_ReturnValue) == 0x000548, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_IS_SHIPPING_BUILD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_Event_DeltaSeconds) == 0x00054C, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_CreateDelegate_OutputDelegate_1) == 0x000550, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_Event_EndPlayReason) == 0x000560, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_PopShowMouseCursor_ReturnValue) == 0x000568, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_PopShowMouseCursor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_Get_ReturnValue) == 0x000580, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_Event_bActive) == 0x000588, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_Event_bActive' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_CreateDelegate_OutputDelegate_2) == 0x00058C, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_SetMainWork_mainWork_CastInput) == 0x0005A0, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_SetMainWork_mainWork_CastInput' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_CreateDelegate_OutputDelegate_3) == 0x0005B0, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_MakeTransform_ReturnValue_3) == 0x0005C0, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_MakeTransform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3) == 0x0005F0, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_FinishSpawningActor_ReturnValue_3) == 0x0005F8, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_FinishSpawningActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_AsBP_Battle_Chara_Panel_Ctrl) == 0x000600, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_AsBP_Battle_Chara_Panel_Ctrl' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_bSuccess_15) == 0x000608, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_bSuccess_15' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_AsBPI_Battle_Chara_Panel_Ctrl) == 0x000610, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_AsBPI_Battle_Chara_Panel_Ctrl' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_DynamicCast_bSuccess_16) == 0x000620, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_DynamicCast_bSuccess_16' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_BI_GetPartySystem_ret) == 0x000628, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_BI_GetPartySystem_ret' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, K2Node_CreateDelegate_OutputDelegate_4) == 0x000638, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BattleMain_C_ExecuteUbergraph_BattleMain, CallFunc_IBattleCharaPanelSetBattleInterface_InBPIBattleMain_CastInput) == 0x000648, "Member 'BattleMain_C_ExecuteUbergraph_BattleMain::CallFunc_IBattleCharaPanelSetBattleInterface_InBPIBattleMain_CastInput' has a wrong offset!");

// Function BattleMain.BattleMain_C.OnWindowActivationChanged
// 0x0001 (0x0001 - 0x0000)
struct BattleMain_C_OnWindowActivationChanged final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleMain_C_OnWindowActivationChanged) == 0x000001, "Wrong alignment on BattleMain_C_OnWindowActivationChanged");
static_assert(sizeof(BattleMain_C_OnWindowActivationChanged) == 0x000001, "Wrong size on BattleMain_C_OnWindowActivationChanged");
static_assert(offsetof(BattleMain_C_OnWindowActivationChanged, bActive) == 0x000000, "Member 'BattleMain_C_OnWindowActivationChanged::bActive' has a wrong offset!");

// Function BattleMain.BattleMain_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BattleMain_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleMain_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BattleMain_C_ReceiveEndPlay");
static_assert(sizeof(BattleMain_C_ReceiveEndPlay) == 0x000001, "Wrong size on BattleMain_C_ReceiveEndPlay");
static_assert(offsetof(BattleMain_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BattleMain_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BattleMain.BattleMain_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BattleMain_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleMain_C_ReceiveTick) == 0x000004, "Wrong alignment on BattleMain_C_ReceiveTick");
static_assert(sizeof(BattleMain_C_ReceiveTick) == 0x000004, "Wrong size on BattleMain_C_ReceiveTick");
