#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleUIManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Project_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BattleUIManager.BattleUIManager_C
// 0x00A8 (0x0158 - 0x00B0)
class UBattleUIManager_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class ABattleNumberActor_C*>           M_NumberActor;                                     // 0x00B8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         M_SpawnIndex;                                      // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          M_InitializeFinished;                              // 0x00CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3124[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   M_ObjectName;                                      // 0x00D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 M_ObjectClass;                                     // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABattleUtilIconActor_C*>         M_UtilIconActor;                                   // 0x0100(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TSoftClassPtr<class UClass>                   M_IconObjectName;                                  // 0x0110(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 M_IconObjectClass;                                 // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_PressIcon_C*                        M_PressIcon;                                       // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_MagatsuhiGauge_C*                   M_UpliftingGauge;                                  // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_TurnChange_C*                       M_TurnChange;                                      // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BattleUIManager(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void OnLoaded_480EF4F74D1735F8C80EB88B12F10B00(TSubclassOf<class UObject> Loaded);
	void OnLoaded_2D1128B94EA6152C05F061AD7E8976BF(TSubclassOf<class UObject> Loaded);
	void GetMainWork(class ABattleMain_C** RetValue);
	void Initialize();
	void GetBlankNumber(class ABattleNumberActor_C** RetValue);
	void ShowBlankNumber(int32 HP_Value, int32 MP_Value, E_BTL_UTIL_ICON_TYPE HitType, int32 Level, E_BTL_NUMEFF NumEffectType, const struct FVector& SocketLocation, const struct FVector2D& PosOffset, int32 Ratio, float PlayRate, float SizeRatio, int32 PartyIndex, class ABattleNumberActor_C** RetValue);
	void HideNumber(class ABattleNumberActor_C* NumberActor);
	void IsInitialized(bool* RetValue);
	void GetBlankIcon(class ABattleUtilIconActor_C** RetValue);
	void HideIcon(class ABattleUtilIconActor_C* IconActor);
	void ShowBlankIconByPartyIndex(E_BTL_UTIL_ICON_TYPE Type, float PlayRate, int32 PartyIndex, class FName SocketName, class ABattleUtilIconActor_C** RetValue);
	void SetPressIconVisibility(bool IsVisible);
	void SetUpliftingGaugeVisibility(bool IsVisible);
	void SetDamageVisibility(bool IsVisible);
	void IsDisappearedMainUI(bool* IsDisappeared);
	void GetMainUIDisappear(bool* PressIcon, bool* Uplifting);
	void BI_PressIconSlideOut(bool* Ret);
	void BI_PressIconSlideIn(bool* Ret);
	void BI_UpliftingGaugeSlideOut(bool* Ret);
	void BI_UpliftingGaugeSlideIn(bool* Ret);
	void BI_ShowBlankNumber(int32 HP_Value, int32 MP_Value, E_BTL_UTIL_ICON_TYPE HitType, int32 Level, E_BTL_NUMEFF NumEffectType, const struct FVector& SocketLocation, struct FVector2D& PosOffset, const int32& Ratio_, float PlayRate, float SizeRate, int32 PartyIndex, TScriptInterface<class IBPI_BattleNumberActor_C>* Number);
	void BI_HideNumber(TScriptInterface<class IBPI_BattleNumberActor_C> Number, bool* NoUse);
	void BI_UtilIconShowByPartyIndex(E_BTL_UTIL_ICON_TYPE Type, float PlayRate, int32 PartyIndex, class FName SocketName, TScriptInterface<class IBPI_BattleUtilIconActor_C>* Icon);
	void BI_UtilIconHide(TScriptInterface<class IBPI_BattleUtilIconActor_C> Icon, bool* NoUse);
	void BI_PressIconIsWorking(bool* IsWorking);
	void BI_IsDisappearedMainUI(bool* IsDisappeared);
	void BI_GetMainUIDisappeared(bool* PressIcon, bool* Uplifting);
	void BI_PressIconAreAllShown(bool* Shown);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattleUIManager_C">();
	}
	static class UBattleUIManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleUIManager_C>();
	}
};
static_assert(alignof(UBattleUIManager_C) == 0x000008, "Wrong alignment on UBattleUIManager_C");
static_assert(sizeof(UBattleUIManager_C) == 0x000158, "Wrong size on UBattleUIManager_C");
static_assert(offsetof(UBattleUIManager_C, UberGraphFrame) == 0x0000B0, "Member 'UBattleUIManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattleUIManager_C, M_NumberActor) == 0x0000B8, "Member 'UBattleUIManager_C::M_NumberActor' has a wrong offset!");
static_assert(offsetof(UBattleUIManager_C, M_SpawnIndex) == 0x0000C8, "Member 'UBattleUIManager_C::M_SpawnIndex' has a wrong offset!");
static_assert(offsetof(UBattleUIManager_C, M_InitializeFinished) == 0x0000CC, "Member 'UBattleUIManager_C::M_InitializeFinished' has a wrong offset!");
static_assert(offsetof(UBattleUIManager_C, M_ObjectName) == 0x0000D0, "Member 'UBattleUIManager_C::M_ObjectName' has a wrong offset!");
static_assert(offsetof(UBattleUIManager_C, M_ObjectClass) == 0x0000F8, "Member 'UBattleUIManager_C::M_ObjectClass' has a wrong offset!");
static_assert(offsetof(UBattleUIManager_C, M_UtilIconActor) == 0x000100, "Member 'UBattleUIManager_C::M_UtilIconActor' has a wrong offset!");
static_assert(offsetof(UBattleUIManager_C, M_IconObjectName) == 0x000110, "Member 'UBattleUIManager_C::M_IconObjectName' has a wrong offset!");
static_assert(offsetof(UBattleUIManager_C, M_IconObjectClass) == 0x000138, "Member 'UBattleUIManager_C::M_IconObjectClass' has a wrong offset!");
static_assert(offsetof(UBattleUIManager_C, M_PressIcon) == 0x000140, "Member 'UBattleUIManager_C::M_PressIcon' has a wrong offset!");
static_assert(offsetof(UBattleUIManager_C, M_UpliftingGauge) == 0x000148, "Member 'UBattleUIManager_C::M_UpliftingGauge' has a wrong offset!");
static_assert(offsetof(UBattleUIManager_C, M_TurnChange) == 0x000150, "Member 'UBattleUIManager_C::M_TurnChange' has a wrong offset!");

}

