#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleResult

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Project_structs.hpp"
#include "Project_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BattleResult.BattleResult_C
// 0x00A8 (0x01D0 - 0x0128)
class UBattleResult_C final : public UBattleResultActorComponentBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0128(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBtlResultData                         M_ResultData;                                      // 0x0130(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FBtlParty>                      M_ResultParty;                                     // 0x0180(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsFinish;                                          // 0x0190(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5DDD[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             NewStartDispatcher;                                // 0x0198(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ABP_ResultMain_C*                       M_NewResultMain;                                   // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<uint8>                                 Playerdevilarray;                                  // 0x01B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             RenzokuEncountDispatcher;                          // 0x01C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void NewStartDispatcher__DelegateSignature();
	void RenzokuEncountDispatcher__DelegateSignature();
	void ExecuteUbergraph_BattleResult(int32 EntryPoint);
	void NewResultEnd();
	void RenzokuEncountResult();
	void ReceiveBeginPlay();
	void NewResultStart();
	void GetMainWork(class ABattleMain_C** RetValue);
	void GetPartySystem(class UBattlePartySystem_C** RetValue);
	bool IsFinished();
	void ApplyPartyData();
	void ClearResult();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattleResult_C">();
	}
	static class UBattleResult_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleResult_C>();
	}
};
static_assert(alignof(UBattleResult_C) == 0x000008, "Wrong alignment on UBattleResult_C");
static_assert(sizeof(UBattleResult_C) == 0x0001D0, "Wrong size on UBattleResult_C");
static_assert(offsetof(UBattleResult_C, UberGraphFrame) == 0x000128, "Member 'UBattleResult_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattleResult_C, M_ResultData) == 0x000130, "Member 'UBattleResult_C::M_ResultData' has a wrong offset!");
static_assert(offsetof(UBattleResult_C, M_ResultParty) == 0x000180, "Member 'UBattleResult_C::M_ResultParty' has a wrong offset!");
static_assert(offsetof(UBattleResult_C, IsFinish) == 0x000190, "Member 'UBattleResult_C::IsFinish' has a wrong offset!");
static_assert(offsetof(UBattleResult_C, NewStartDispatcher) == 0x000198, "Member 'UBattleResult_C::NewStartDispatcher' has a wrong offset!");
static_assert(offsetof(UBattleResult_C, M_NewResultMain) == 0x0001A8, "Member 'UBattleResult_C::M_NewResultMain' has a wrong offset!");
static_assert(offsetof(UBattleResult_C, Playerdevilarray) == 0x0001B0, "Member 'UBattleResult_C::Playerdevilarray' has a wrong offset!");
static_assert(offsetof(UBattleResult_C, RenzokuEncountDispatcher) == 0x0001C0, "Member 'UBattleResult_C::RenzokuEncountDispatcher' has a wrong offset!");

}

