#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleActionTask

#include "Basic.hpp"

#include "BTL_ADD_DECAL_TASK_DATA_structs.hpp"
#include "MaterialAnimSetting_T_structs.hpp"
#include "CamShakeTable_t_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "BTL_TASK_RECEIVED_STREAM_DATA_structs.hpp"
#include "E_TutorialWindow_WidgetState_structs.hpp"


namespace SDK::Params
{

// Function BattleActionTask.BattleActionTask_C.ExecuteUbergraph_BattleActionTask
// 0x03D0 (0x03D0 - 0x0000)
struct BattleActionTask_C_ExecuteUbergraph_BattleActionTask final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6008[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsMatinee_Camera_Shake;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6009[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_1;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsMatinee_Camera_Shake_1;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_600A[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_2;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsChara_Base;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_2;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_600B[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_2;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Scale_1;                        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0070(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate;              // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	struct FCamShakeTable_t                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0098(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_600C[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_600D[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_GetBIMainWork_retValue;                   // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_SetBattleCameraShake_retValue;         // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_600E[0x6];                                     // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_RowName;                        // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Scale;                          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_600F[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCamShakeTable_t                       CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0148(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6010[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_GetBIMainWork_retValue_1;                 // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_SetBattleCameraShake_retValue_1;       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6011[0x3];                                     // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_DevilId;                        // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_CHAR_TYPE                               K2Node_CustomEvent_InTYpe;                         // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6012[0xF];                                     // 0x0191(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_transform;                      // 0x01A0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ACharaBase_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharaBaseAccessor_C> CallFunc_BI_AdjustMeshScale_self_CastInput;        // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_CharaBaseAccessor_C> CallFunc_BI_SetDevilRootMotion_self_CastInput;     // 0x0210(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_CharaBaseAccessor_C> CallFunc_BI_SetEnableChangeMotion_self_CastInput;  // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_SetEnableChangeMotion_NoUse;           // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6013[0x3];                                     // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleRadius_ReturnValue;       // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6014[0x3];                                     // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x026C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6015[0x3];                                     // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CallFunc_GetDevilAssetClassData_ClassAssetID;      // 0x02F8(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_GetDevilAssetClassData_PlayerBaseAssetID; // 0x0320(0x0028)(HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0348(0x0010)(ZeroConstructor, NoDestructor)
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_GetBIMainWork_retValue_2;                 // 0x0358(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_CharaBaseAccessor_C> CallFunc_BI_TaskUnitModelAdd_inUnit_CastInput;     // 0x0368(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TaskUnitModelAdd_retValue;             // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6016[0x3];                                     // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6017[0x4];                                     // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleSkillActionBase_C> K2Node_DynamicCast_AsBPI_Battle_Skill_Action_Base; // 0x0390(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6018[0x7];                                     // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6019[0x3];                                     // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601A[0x3];                                     // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_601B[0x3];                                     // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask) == 0x000010, "Wrong alignment on BattleActionTask_C_ExecuteUbergraph_BattleActionTask");
static_assert(sizeof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask) == 0x0003D0, "Wrong size on BattleActionTask_C_ExecuteUbergraph_BattleActionTask");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, EntryPoint) == 0x000000, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, Temp_class_Variable) == 0x000008, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_ClassDynamicCast_AsMatinee_Camera_Shake) == 0x000010, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_ClassDynamicCast_AsMatinee_Camera_Shake' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_ClassDynamicCast_bSuccess) == 0x000018, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_CustomEvent_Loaded_1) == 0x000020, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, Temp_class_Variable_1) == 0x000028, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_ClassDynamicCast_AsMatinee_Camera_Shake_1) == 0x000030, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_ClassDynamicCast_AsMatinee_Camera_Shake_1' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_ClassDynamicCast_bSuccess_1) == 0x000038, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_ClassDynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_CustomEvent_Loaded) == 0x000040, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, Temp_class_Variable_2) == 0x000048, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_ClassDynamicCast_AsChara_Base) == 0x000050, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_ClassDynamicCast_AsChara_Base' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_ClassDynamicCast_bSuccess_2) == 0x000058, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_ClassDynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_CustomEvent_Loaded_2) == 0x000060, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_CustomEvent_Index) == 0x000068, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_CustomEvent_Scale_1) == 0x00006C, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_CustomEvent_Scale_1' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000070, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_Array_Get_Item) == 0x000080, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_CreateDelegate_OutputDelegate) == 0x000088, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_GetDataTableRowFromName_OutRow) == 0x000098, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000C0, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_Conv_NameToString_ReturnValue) == 0x0000C8, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_Concat_StrStr_ReturnValue) == 0x0000D8, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_Array_Length_ReturnValue) == 0x0000E8, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_GetBIMainWork_retValue) == 0x0000F0, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_GetBIMainWork_retValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_Greater_IntInt_ReturnValue) == 0x000100, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_BI_SetBattleCameraShake_retValue) == 0x000101, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_BI_SetBattleCameraShake_retValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_CustomEvent_RowName) == 0x000108, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_CustomEvent_RowName' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_CustomEvent_Scale) == 0x000118, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_CustomEvent_Scale' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000120, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_CreateDelegate_OutputDelegate_1) == 0x000130, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_Conv_StringToName_ReturnValue) == 0x000140, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000148, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000170, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_GetBIMainWork_retValue_1) == 0x000178, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_GetBIMainWork_retValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_BI_SetBattleCameraShake_retValue_1) == 0x000188, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_BI_SetBattleCameraShake_retValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_CustomEvent_DevilId) == 0x00018C, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_CustomEvent_DevilId' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_CustomEvent_InTYpe) == 0x000190, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_CustomEvent_InTYpe' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_CustomEvent_transform) == 0x0001A0, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_CustomEvent_transform' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001D0, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_Conv_IntToString_ReturnValue) == 0x0001D8, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0001E8, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001F8, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_BI_AdjustMeshScale_self_CastInput) == 0x000200, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_BI_AdjustMeshScale_self_CastInput' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_BI_SetDevilRootMotion_self_CastInput) == 0x000210, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_BI_SetDevilRootMotion_self_CastInput' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_BI_SetEnableChangeMotion_self_CastInput) == 0x000220, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_BI_SetEnableChangeMotion_self_CastInput' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_BI_SetEnableChangeMotion_NoUse) == 0x000230, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_BI_SetEnableChangeMotion_NoUse' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000234, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_GetUpVector_ReturnValue) == 0x000240, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_GetScaledCapsuleRadius_ReturnValue) == 0x00024C, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_GetScaledCapsuleRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000250, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_Add_VectorVector_ReturnValue) == 0x00025C, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_IsValid_ReturnValue) == 0x000268, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x00026C, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0002F4, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_GetDevilAssetClassData_ClassAssetID) == 0x0002F8, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_GetDevilAssetClassData_ClassAssetID' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_GetDevilAssetClassData_PlayerBaseAssetID) == 0x000320, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_GetDevilAssetClassData_PlayerBaseAssetID' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_CreateDelegate_OutputDelegate_2) == 0x000348, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_GetBIMainWork_retValue_2) == 0x000358, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_GetBIMainWork_retValue_2' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_BI_TaskUnitModelAdd_inUnit_CastInput) == 0x000368, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_BI_TaskUnitModelAdd_inUnit_CastInput' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_BI_TaskUnitModelAdd_retValue) == 0x000378, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_BI_TaskUnitModelAdd_retValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_Event_DeltaSeconds) == 0x00037C, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, Temp_int_Array_Index_Variable) == 0x000380, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_Array_Get_Item_1) == 0x000388, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_DynamicCast_AsBPI_Battle_Skill_Action_Base) == 0x000390, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_DynamicCast_AsBPI_Battle_Skill_Action_Base' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_DynamicCast_bSuccess) == 0x0003A0, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_DynamicCast_AsActor) == 0x0003A8, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_DynamicCast_bSuccess_1) == 0x0003B0, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_Array_Length_ReturnValue_1) == 0x0003B4, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, K2Node_Event_EndPlayReason) == 0x0003B8, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, Temp_int_Loop_Counter_Variable) == 0x0003BC, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_Less_IntInt_ReturnValue) == 0x0003C0, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_ExecuteUbergraph_BattleActionTask, CallFunc_Add_IntInt_ReturnValue) == 0x0003C4, "Member 'BattleActionTask_C_ExecuteUbergraph_BattleActionTask::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BattleActionTask.BattleActionTask_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BattleActionTask_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleActionTask_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BattleActionTask_C_ReceiveEndPlay");
static_assert(sizeof(BattleActionTask_C_ReceiveEndPlay) == 0x000001, "Wrong size on BattleActionTask_C_ReceiveEndPlay");
static_assert(offsetof(BattleActionTask_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BattleActionTask_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BattleActionTask.BattleActionTask_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BattleActionTask_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleActionTask_C_ReceiveTick) == 0x000004, "Wrong alignment on BattleActionTask_C_ReceiveTick");
static_assert(sizeof(BattleActionTask_C_ReceiveTick) == 0x000004, "Wrong size on BattleActionTask_C_ReceiveTick");
static_assert(offsetof(BattleActionTask_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BattleActionTask_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BattleActionTask.BattleActionTask_C.LoadDevil
// 0x0040 (0x0040 - 0x0000)
struct BattleActionTask_C_LoadDevil final
{
public:
	int32                                         DevilID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_CHAR_TYPE                               InType;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601C[0xB];                                     // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleActionTask_C_LoadDevil) == 0x000010, "Wrong alignment on BattleActionTask_C_LoadDevil");
static_assert(sizeof(BattleActionTask_C_LoadDevil) == 0x000040, "Wrong size on BattleActionTask_C_LoadDevil");
static_assert(offsetof(BattleActionTask_C_LoadDevil, DevilID) == 0x000000, "Member 'BattleActionTask_C_LoadDevil::DevilID' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_LoadDevil, InType) == 0x000004, "Member 'BattleActionTask_C_LoadDevil::InType' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_LoadDevil, Transform) == 0x000010, "Member 'BattleActionTask_C_LoadDevil::Transform' has a wrong offset!");

// Function BattleActionTask.BattleActionTask_C.LoadCamShakeByName
// 0x0018 (0x0018 - 0x0000)
struct BattleActionTask_C_LoadCamShakeByName final
{
public:
	class FString                                 RowName;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	float                                         Scale;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleActionTask_C_LoadCamShakeByName) == 0x000008, "Wrong alignment on BattleActionTask_C_LoadCamShakeByName");
static_assert(sizeof(BattleActionTask_C_LoadCamShakeByName) == 0x000018, "Wrong size on BattleActionTask_C_LoadCamShakeByName");
static_assert(offsetof(BattleActionTask_C_LoadCamShakeByName, RowName) == 0x000000, "Member 'BattleActionTask_C_LoadCamShakeByName::RowName' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_LoadCamShakeByName, Scale) == 0x000010, "Member 'BattleActionTask_C_LoadCamShakeByName::Scale' has a wrong offset!");

// Function BattleActionTask.BattleActionTask_C.LoadCamShake
// 0x0008 (0x0008 - 0x0000)
struct BattleActionTask_C_LoadCamShake final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scale;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleActionTask_C_LoadCamShake) == 0x000004, "Wrong alignment on BattleActionTask_C_LoadCamShake");
static_assert(sizeof(BattleActionTask_C_LoadCamShake) == 0x000008, "Wrong size on BattleActionTask_C_LoadCamShake");
static_assert(offsetof(BattleActionTask_C_LoadCamShake, Param_Index) == 0x000000, "Member 'BattleActionTask_C_LoadCamShake::Param_Index' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_LoadCamShake, Scale) == 0x000004, "Member 'BattleActionTask_C_LoadCamShake::Scale' has a wrong offset!");

// Function BattleActionTask.BattleActionTask_C.OnLoaded_334C0E52408A33DBB72A5B83630212D3
// 0x0008 (0x0008 - 0x0000)
struct BattleActionTask_C_OnLoaded_334C0E52408A33DBB72A5B83630212D3 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BattleActionTask_C_OnLoaded_334C0E52408A33DBB72A5B83630212D3) == 0x000008, "Wrong alignment on BattleActionTask_C_OnLoaded_334C0E52408A33DBB72A5B83630212D3");
static_assert(sizeof(BattleActionTask_C_OnLoaded_334C0E52408A33DBB72A5B83630212D3) == 0x000008, "Wrong size on BattleActionTask_C_OnLoaded_334C0E52408A33DBB72A5B83630212D3");
static_assert(offsetof(BattleActionTask_C_OnLoaded_334C0E52408A33DBB72A5B83630212D3, Loaded) == 0x000000, "Member 'BattleActionTask_C_OnLoaded_334C0E52408A33DBB72A5B83630212D3::Loaded' has a wrong offset!");

// Function BattleActionTask.BattleActionTask_C.OnLoaded_31D473D448F67A6FE11186B14EA62705
// 0x0008 (0x0008 - 0x0000)
struct BattleActionTask_C_OnLoaded_31D473D448F67A6FE11186B14EA62705 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BattleActionTask_C_OnLoaded_31D473D448F67A6FE11186B14EA62705) == 0x000008, "Wrong alignment on BattleActionTask_C_OnLoaded_31D473D448F67A6FE11186B14EA62705");
static_assert(sizeof(BattleActionTask_C_OnLoaded_31D473D448F67A6FE11186B14EA62705) == 0x000008, "Wrong size on BattleActionTask_C_OnLoaded_31D473D448F67A6FE11186B14EA62705");
static_assert(offsetof(BattleActionTask_C_OnLoaded_31D473D448F67A6FE11186B14EA62705, Loaded) == 0x000000, "Member 'BattleActionTask_C_OnLoaded_31D473D448F67A6FE11186B14EA62705::Loaded' has a wrong offset!");

// Function BattleActionTask.BattleActionTask_C.OnLoaded_DBC923BD4A1BC09E4C36A3A658C84A18
// 0x0008 (0x0008 - 0x0000)
struct BattleActionTask_C_OnLoaded_DBC923BD4A1BC09E4C36A3A658C84A18 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BattleActionTask_C_OnLoaded_DBC923BD4A1BC09E4C36A3A658C84A18) == 0x000008, "Wrong alignment on BattleActionTask_C_OnLoaded_DBC923BD4A1BC09E4C36A3A658C84A18");
static_assert(sizeof(BattleActionTask_C_OnLoaded_DBC923BD4A1BC09E4C36A3A658C84A18) == 0x000008, "Wrong size on BattleActionTask_C_OnLoaded_DBC923BD4A1BC09E4C36A3A658C84A18");
static_assert(offsetof(BattleActionTask_C_OnLoaded_DBC923BD4A1BC09E4C36A3A658C84A18, Loaded) == 0x000000, "Member 'BattleActionTask_C_OnLoaded_DBC923BD4A1BC09E4C36A3A658C84A18::Loaded' has a wrong offset!");

// Function BattleActionTask.BattleActionTask_C.UserConstructionScript
// 0x0060 (0x0060 - 0x0000)
struct BattleActionTask_C_UserConstructionScript final
{
public:
	TArray<E_BTL_TASK_COM>                        K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ConstParm, ReferenceParm)
	TArray<E_BTL_TASK_COM>                        K2Node_MakeArray_Array_1;                          // 0x0010(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_601D[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_BTL_TASK_COM>                        K2Node_MakeArray_Array_2;                          // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TArray<E_BTL_TASK_COM>                        K2Node_MakeArray_Array_3;                          // 0x0038(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_601E[0x2];                                     // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_2;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_3;             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_601F[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_3;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleActionTask_C_UserConstructionScript) == 0x000008, "Wrong alignment on BattleActionTask_C_UserConstructionScript");
static_assert(sizeof(BattleActionTask_C_UserConstructionScript) == 0x000060, "Wrong size on BattleActionTask_C_UserConstructionScript");
static_assert(offsetof(BattleActionTask_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000000, "Member 'BattleActionTask_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_UserConstructionScript, K2Node_MakeArray_Array_1) == 0x000010, "Member 'BattleActionTask_C_UserConstructionScript::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_UserConstructionScript, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000020, "Member 'BattleActionTask_C_UserConstructionScript::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_UserConstructionScript, K2Node_MakeArray_Array_2) == 0x000028, "Member 'BattleActionTask_C_UserConstructionScript::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_UserConstructionScript, K2Node_MakeArray_Array_3) == 0x000038, "Member 'BattleActionTask_C_UserConstructionScript::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_UserConstructionScript, CallFunc_Array_Contains_ReturnValue) == 0x000048, "Member 'BattleActionTask_C_UserConstructionScript::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_UserConstructionScript, CallFunc_Array_Contains_ReturnValue_1) == 0x000049, "Member 'BattleActionTask_C_UserConstructionScript::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_UserConstructionScript, CallFunc_SelectInt_ReturnValue) == 0x00004C, "Member 'BattleActionTask_C_UserConstructionScript::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_UserConstructionScript, CallFunc_Array_Contains_ReturnValue_2) == 0x000050, "Member 'BattleActionTask_C_UserConstructionScript::CallFunc_Array_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_UserConstructionScript, CallFunc_Array_Contains_ReturnValue_3) == 0x000051, "Member 'BattleActionTask_C_UserConstructionScript::CallFunc_Array_Contains_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_UserConstructionScript, CallFunc_SelectInt_ReturnValue_1) == 0x000054, "Member 'BattleActionTask_C_UserConstructionScript::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_UserConstructionScript, CallFunc_SelectInt_ReturnValue_2) == 0x000058, "Member 'BattleActionTask_C_UserConstructionScript::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_UserConstructionScript, CallFunc_SelectInt_ReturnValue_3) == 0x00005C, "Member 'BattleActionTask_C_UserConstructionScript::CallFunc_SelectInt_ReturnValue_3' has a wrong offset!");

// Function BattleActionTask.BattleActionTask_C.CallFrameEvent
// 0x0001 (0x0001 - 0x0000)
struct BattleActionTask_C_CallFrameEvent final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleActionTask_C_CallFrameEvent) == 0x000001, "Wrong alignment on BattleActionTask_C_CallFrameEvent");
static_assert(sizeof(BattleActionTask_C_CallFrameEvent) == 0x000001, "Wrong size on BattleActionTask_C_CallFrameEvent");
static_assert(offsetof(BattleActionTask_C_CallFrameEvent, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'BattleActionTask_C_CallFrameEvent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BattleActionTask.BattleActionTask_C.IsFinished
// 0x0002 (0x0002 - 0x0000)
struct BattleActionTask_C_IsFinished final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleActionTask_C_IsFinished) == 0x000001, "Wrong alignment on BattleActionTask_C_IsFinished");
static_assert(sizeof(BattleActionTask_C_IsFinished) == 0x000002, "Wrong size on BattleActionTask_C_IsFinished");
static_assert(offsetof(BattleActionTask_C_IsFinished, RetValue) == 0x000000, "Member 'BattleActionTask_C_IsFinished::RetValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_IsFinished, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BattleActionTask_C_IsFinished::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BattleActionTask.BattleActionTask_C.AddWaitTask
// 0x000C (0x000C - 0x0000)
struct BattleActionTask_C_AddWaitTask final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleActionTask_C_AddWaitTask) == 0x000004, "Wrong alignment on BattleActionTask_C_AddWaitTask");
static_assert(sizeof(BattleActionTask_C_AddWaitTask) == 0x00000C, "Wrong size on BattleActionTask_C_AddWaitTask");
static_assert(offsetof(BattleActionTask_C_AddWaitTask, InValue) == 0x000000, "Member 'BattleActionTask_C_AddWaitTask::InValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_AddWaitTask, CallFunc_Array_Add_ReturnValue) == 0x000004, "Member 'BattleActionTask_C_AddWaitTask::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_AddWaitTask, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000008, "Member 'BattleActionTask_C_AddWaitTask::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BattleActionTask.BattleActionTask_C.CheckWait
// 0x0030 (0x0030 - 0x0000)
struct BattleActionTask_C_CheckWait final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6020[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6021[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsExistWaitPecID_retValue;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6022[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleActionTask_C_CheckWait) == 0x000004, "Wrong alignment on BattleActionTask_C_CheckWait");
static_assert(sizeof(BattleActionTask_C_CheckWait) == 0x000030, "Wrong size on BattleActionTask_C_CheckWait");
static_assert(offsetof(BattleActionTask_C_CheckWait, RetValue) == 0x000000, "Member 'BattleActionTask_C_CheckWait::RetValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_CheckWait, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BattleActionTask_C_CheckWait::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_CheckWait, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'BattleActionTask_C_CheckWait::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_CheckWait, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00000C, "Member 'BattleActionTask_C_CheckWait::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_CheckWait, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000010, "Member 'BattleActionTask_C_CheckWait::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_CheckWait, CallFunc_Greater_IntInt_ReturnValue) == 0x000014, "Member 'BattleActionTask_C_CheckWait::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_CheckWait, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BattleActionTask_C_CheckWait::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_CheckWait, CallFunc_Array_Get_Item) == 0x00001C, "Member 'BattleActionTask_C_CheckWait::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_CheckWait, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'BattleActionTask_C_CheckWait::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_CheckWait, CallFunc_IsExistWaitPecID_retValue) == 0x000021, "Member 'BattleActionTask_C_CheckWait::CallFunc_IsExistWaitPecID_retValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_CheckWait, CallFunc_Array_Length_ReturnValue_1) == 0x000024, "Member 'BattleActionTask_C_CheckWait::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_CheckWait, CallFunc_Array_Length_ReturnValue_2) == 0x000028, "Member 'BattleActionTask_C_CheckWait::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_CheckWait, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00002C, "Member 'BattleActionTask_C_CheckWait::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_CheckWait, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002D, "Member 'BattleActionTask_C_CheckWait::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTask_C_CheckWait, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00002E, "Member 'BattleActionTask_C_CheckWait::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function BattleActionTask.BattleActionTask_C.GetPecID
// 0x0004 (0x0004 - 0x0000)
struct BattleActionTask_C_GetPecID final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleActionTask_C_GetPecID) == 0x000004, "Wrong alignment on BattleActionTask_C_GetPecID");
static_assert(sizeof(BattleActionTask_C_GetPecID) == 0x000004, "Wrong size on BattleActionTask_C_GetPecID");
static_assert(offsetof(BattleActionTask_C_GetPecID, RetValue) == 0x000000, "Member 'BattleActionTask_C_GetPecID::RetValue' has a wrong offset!");

// Function BattleActionTask.BattleActionTask_C.IsExistWaitPecID
// 0x0030 (0x0030 - 0x0000)
struct BattleActionTask_C_IsExistWaitPecID final
{
public:
	int32                                         InPecID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
