#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleTempParticleActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BattleTempParticleActor.BattleTempParticleActor_C.SetParticle
// 0x00D0 (0x00D0 - 0x0000)
struct BattleTempParticleActor_C_SetParticle final
{
public:
	class UParticleSystem*                        Particle;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4788[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4789[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0044(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BattleTempParticleActor_C_SetParticle) == 0x000010, "Wrong alignment on BattleTempParticleActor_C_SetParticle");
static_assert(sizeof(BattleTempParticleActor_C_SetParticle) == 0x0000D0, "Wrong size on BattleTempParticleActor_C_SetParticle");
static_assert(offsetof(BattleTempParticleActor_C_SetParticle, Particle) == 0x000000, "Member 'BattleTempParticleActor_C_SetParticle::Particle' has a wrong offset!");
static_assert(offsetof(BattleTempParticleActor_C_SetParticle, Transform) == 0x000010, "Member 'BattleTempParticleActor_C_SetParticle::Transform' has a wrong offset!");
static_assert(offsetof(BattleTempParticleActor_C_SetParticle, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BattleTempParticleActor_C_SetParticle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTempParticleActor_C_SetParticle, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000044, "Member 'BattleTempParticleActor_C_SetParticle::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");

}

