#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleActionTaskFactory

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BTL_ADD_DECAL_TASK_DATA_structs.hpp"
#include "BTL_CTRL_POST_PROCESS_DATA_structs.hpp"
#include "MaterialAnimSetting_T_structs.hpp"
#include "Project_structs.hpp"
#include "BTL_ADD_SKILL_LIGHT_TASK_DATA_structs.hpp"
#include "BTL_ADD_ANIM_CAM_TASK_DATA_structs.hpp"
#include "BTL_ADD_PLAY_EFFECT_TASK_DATA_structs.hpp"
#include "BadStatusParticles_T_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BattleActionTaskFactory.BattleActionTaskFactory_C.ExecuteUbergraph_BattleActionTaskFactory
// 0x0290 (0x0290 - 0x0000)
struct BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_1;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleActionTask_C*                    CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            K2Node_DynamicCast_AsCurve_Float;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BattleDesignDebugIsDrawInfo_IsDraw;       // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugBattleTaskInfo                   K2Node_MakeStruct_DebugBattleTaskInfo;             // 0x00A0(0x00E0)()
	TSoftObjectPtr<class UParticleSystem>         CallFunc_Array_Get_Item_1;                         // 0x0180(0x0028)(HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          K2Node_DynamicCast_AsSound_Atom_Cue;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundAtomCue>           CallFunc_Array_Get_Item_2;                         // 0x01F8(0x0028)(HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_2;                            // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System;              // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCurveFloat>             CallFunc_Array_Get_Item_3;                         // 0x0258(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory) == 0x000010, "Wrong alignment on BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory");
static_assert(sizeof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory) == 0x000290, "Wrong size on BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, EntryPoint) == 0x000000, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, Temp_int_Variable) == 0x000010, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, Temp_int_Variable_1) == 0x000024, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00002C, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, K2Node_CustomEvent_Loaded_2) == 0x000030, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_Array_Get_Item) == 0x000038, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000048, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, Temp_object_Variable) == 0x000058, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, Temp_int_Variable_2) == 0x000060, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, K2Node_DynamicCast_AsCurve_Float) == 0x000068, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::K2Node_DynamicCast_AsCurve_Float' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, K2Node_CustomEvent_Loaded) == 0x000078, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, K2Node_Event_DeltaSeconds) == 0x000080, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_BattleDesignDebugIsDrawInfo_IsDraw) == 0x000084, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_BattleDesignDebugIsDrawInfo_IsDraw' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_Concat_StrStr_ReturnValue) == 0x000088, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, K2Node_MakeStruct_DebugBattleTaskInfo) == 0x0000A0, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::K2Node_MakeStruct_DebugBattleTaskInfo' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_Array_Get_Item_1) == 0x000180, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001A8, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_Array_Length_ReturnValue_2) == 0x0001B8, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001BC, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001C0, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, Temp_object_Variable_1) == 0x0001C8, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, K2Node_DynamicCast_AsSound_Atom_Cue) == 0x0001D0, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::K2Node_DynamicCast_AsSound_Atom_Cue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, K2Node_DynamicCast_bSuccess_1) == 0x0001D8, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, K2Node_CustomEvent_Loaded_1) == 0x0001E0, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001E8, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_Array_Length_ReturnValue_3) == 0x0001EC, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_Array_Add_ReturnValue) == 0x0001F0, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001F4, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_Array_Get_Item_2) == 0x0001F8, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, K2Node_CreateDelegate_OutputDelegate_2) == 0x000220, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_Add_IntInt_ReturnValue_3) == 0x000230, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, Temp_object_Variable_2) == 0x000238, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, K2Node_DynamicCast_AsParticle_System) == 0x000240, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::K2Node_DynamicCast_AsParticle_System' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, K2Node_DynamicCast_bSuccess_2) == 0x000248, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_Array_Add_ReturnValue_1) == 0x00024C, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_Array_Length_ReturnValue_4) == 0x000250, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_Array_Get_Item_3) == 0x000258, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_Less_IntInt_ReturnValue_3) == 0x000280, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, CallFunc_Array_Add_ReturnValue_2) == 0x000284, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory, K2Node_Event_EndPlayReason) == 0x000288, "Member 'BattleActionTaskFactory_C_ExecuteUbergraph_BattleActionTaskFactory::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BattleActionTaskFactory.BattleActionTaskFactory_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BattleActionTaskFactory_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleActionTaskFactory_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BattleActionTaskFactory_C_ReceiveEndPlay");
static_assert(sizeof(BattleActionTaskFactory_C_ReceiveEndPlay) == 0x000001, "Wrong size on BattleActionTaskFactory_C_ReceiveEndPlay");
static_assert(offsetof(BattleActionTaskFactory_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BattleActionTaskFactory_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BattleActionTaskFactory.BattleActionTaskFactory_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BattleActionTaskFactory_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleActionTaskFactory_C_ReceiveTick) == 0x000004, "Wrong alignment on BattleActionTaskFactory_C_ReceiveTick");
static_assert(sizeof(BattleActionTaskFactory_C_ReceiveTick) == 0x000004, "Wrong size on BattleActionTaskFactory_C_ReceiveTick");
static_assert(offsetof(BattleActionTaskFactory_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BattleActionTaskFactory_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BattleActionTaskFactory.BattleActionTaskFactory_C.OnLoaded_430CAF474B0F79C3F98FD98578ADF046
// 0x0008 (0x0008 - 0x0000)
struct BattleActionTaskFactory_C_OnLoaded_430CAF474B0F79C3F98FD98578ADF046 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleActionTaskFactory_C_OnLoaded_430CAF474B0F79C3F98FD98578ADF046) == 0x000008, "Wrong alignment on BattleActionTaskFactory_C_OnLoaded_430CAF474B0F79C3F98FD98578ADF046");
static_assert(sizeof(BattleActionTaskFactory_C_OnLoaded_430CAF474B0F79C3F98FD98578ADF046) == 0x000008, "Wrong size on BattleActionTaskFactory_C_OnLoaded_430CAF474B0F79C3F98FD98578ADF046");
static_assert(offsetof(BattleActionTaskFactory_C_OnLoaded_430CAF474B0F79C3F98FD98578ADF046, Loaded) == 0x000000, "Member 'BattleActionTaskFactory_C_OnLoaded_430CAF474B0F79C3F98FD98578ADF046::Loaded' has a wrong offset!");

// Function BattleActionTaskFactory.BattleActionTaskFactory_C.OnLoaded_7D84137042529291144500850D49C96D
// 0x0008 (0x0008 - 0x0000)
struct BattleActionTaskFactory_C_OnLoaded_7D84137042529291144500850D49C96D final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleActionTaskFactory_C_OnLoaded_7D84137042529291144500850D49C96D) == 0x000008, "Wrong alignment on BattleActionTaskFactory_C_OnLoaded_7D84137042529291144500850D49C96D");
static_assert(sizeof(BattleActionTaskFactory_C_OnLoaded_7D84137042529291144500850D49C96D) == 0x000008, "Wrong size on BattleActionTaskFactory_C_OnLoaded_7D84137042529291144500850D49C96D");
static_assert(offsetof(BattleActionTaskFactory_C_OnLoaded_7D84137042529291144500850D49C96D, Loaded) == 0x000000, "Member 'BattleActionTaskFactory_C_OnLoaded_7D84137042529291144500850D49C96D::Loaded' has a wrong offset!");

// Function BattleActionTaskFactory.BattleActionTaskFactory_C.OnLoaded_55EF183A4BDF28D25C43F1BD691A7361
// 0x0008 (0x0008 - 0x0000)
struct BattleActionTaskFactory_C_OnLoaded_55EF183A4BDF28D25C43F1BD691A7361 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleActionTaskFactory_C_OnLoaded_55EF183A4BDF28D25C43F1BD691A7361) == 0x000008, "Wrong alignment on BattleActionTaskFactory_C_OnLoaded_55EF183A4BDF28D25C43F1BD691A7361");
static_assert(sizeof(BattleActionTaskFactory_C_OnLoaded_55EF183A4BDF28D25C43F1BD691A7361) == 0x000008, "Wrong size on BattleActionTaskFactory_C_OnLoaded_55EF183A4BDF28D25C43F1BD691A7361");
static_assert(offsetof(BattleActionTaskFactory_C_OnLoaded_55EF183A4BDF28D25C43F1BD691A7361, Loaded) == 0x000000, "Member 'BattleActionTaskFactory_C_OnLoaded_55EF183A4BDF28D25C43F1BD691A7361::Loaded' has a wrong offset!");

// Function BattleActionTaskFactory.BattleActionTaskFactory_C.CheckTask
// 0x0060 (0x0060 - 0x0000)
struct BattleActionTaskFactory_C_CheckTask final
{
public:
	bool                                          CallFunc_BattleDesignDebugIsUseOldTaskSystem_Enable; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BattleDesignDebugIsDrawInfo_IsDraw;       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleActionTask_C*                    CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleActionTask_C*                    CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleActionTaskFactory_C_CheckTask) == 0x000008, "Wrong alignment on BattleActionTaskFactory_C_CheckTask");
static_assert(sizeof(BattleActionTaskFactory_C_CheckTask) == 0x000060, "Wrong size on BattleActionTaskFactory_C_CheckTask");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, CallFunc_BattleDesignDebugIsUseOldTaskSystem_Enable) == 0x000000, "Member 'BattleActionTaskFactory_C_CheckTask::CallFunc_BattleDesignDebugIsUseOldTaskSystem_Enable' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BattleActionTaskFactory_C_CheckTask::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BattleActionTaskFactory_C_CheckTask::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, CallFunc_BattleDesignDebugIsDrawInfo_IsDraw) == 0x00000C, "Member 'BattleActionTaskFactory_C_CheckTask::CallFunc_BattleDesignDebugIsDrawInfo_IsDraw' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, CallFunc_Array_Length_ReturnValue_1) == 0x000010, "Member 'BattleActionTaskFactory_C_CheckTask::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000014, "Member 'BattleActionTaskFactory_C_CheckTask::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, CallFunc_Array_Length_ReturnValue_2) == 0x000018, "Member 'BattleActionTaskFactory_C_CheckTask::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, CallFunc_BooleanAND_ReturnValue) == 0x00001C, "Member 'BattleActionTaskFactory_C_CheckTask::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, CallFunc_Greater_IntInt_ReturnValue) == 0x00001D, "Member 'BattleActionTaskFactory_C_CheckTask::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, CallFunc_Array_Length_ReturnValue_3) == 0x000020, "Member 'BattleActionTaskFactory_C_CheckTask::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000024, "Member 'BattleActionTaskFactory_C_CheckTask::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, CallFunc_BooleanAND_ReturnValue_1) == 0x000025, "Member 'BattleActionTaskFactory_C_CheckTask::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BattleActionTaskFactory_C_CheckTask::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BattleActionTaskFactory_C_CheckTask::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BattleActionTaskFactory_C_CheckTask::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, CallFunc_Array_Get_Item) == 0x000038, "Member 'BattleActionTaskFactory_C_CheckTask::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, CallFunc_Array_Length_ReturnValue_4) == 0x000040, "Member 'BattleActionTaskFactory_C_CheckTask::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, CallFunc_Array_RemoveItem_ReturnValue) == 0x000044, "Member 'BattleActionTaskFactory_C_CheckTask::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, Temp_int_Loop_Counter_Variable_1) == 0x000048, "Member 'BattleActionTaskFactory_C_CheckTask::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, Temp_int_Array_Index_Variable_1) == 0x00004C, "Member 'BattleActionTaskFactory_C_CheckTask::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'BattleActionTaskFactory_C_CheckTask::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, CallFunc_Less_IntInt_ReturnValue_1) == 0x000058, "Member 'BattleActionTaskFactory_C_CheckTask::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_CheckTask, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'BattleActionTaskFactory_C_CheckTask::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BattleActionTaskFactory.BattleActionTaskFactory_C.GetParentNameTaskCnt
// 0x0068 (0x0068 - 0x0000)
struct BattleActionTaskFactory_C_GetParentNameTaskCnt final
{
public:
	class FString                                 ParentName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         RetCnt;                                            // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_Cnt;                                            // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleActionTask_C*                    CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleActionTask_C*                    CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleActionTaskFactory_C_GetParentNameTaskCnt) == 0x000008, "Wrong alignment on BattleActionTaskFactory_C_GetParentNameTaskCnt");
static_assert(sizeof(BattleActionTaskFactory_C_GetParentNameTaskCnt) == 0x000068, "Wrong size on BattleActionTaskFactory_C_GetParentNameTaskCnt");
static_assert(offsetof(BattleActionTaskFactory_C_GetParentNameTaskCnt, ParentName) == 0x000000, "Member 'BattleActionTaskFactory_C_GetParentNameTaskCnt::ParentName' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_GetParentNameTaskCnt, RetCnt) == 0x000010, "Member 'BattleActionTaskFactory_C_GetParentNameTaskCnt::RetCnt' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_GetParentNameTaskCnt, Lo_Cnt) == 0x000014, "Member 'BattleActionTaskFactory_C_GetParentNameTaskCnt::Lo_Cnt' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_GetParentNameTaskCnt, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BattleActionTaskFactory_C_GetParentNameTaskCnt::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_GetParentNameTaskCnt, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BattleActionTaskFactory_C_GetParentNameTaskCnt::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_GetParentNameTaskCnt, Temp_int_Variable) == 0x000020, "Member 'BattleActionTaskFactory_C_GetParentNameTaskCnt::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_GetParentNameTaskCnt, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BattleActionTaskFactory_C_GetParentNameTaskCnt::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_GetParentNameTaskCnt, Temp_int_Loop_Counter_Variable_1) == 0x000028, "Member 'BattleActionTaskFactory_C_GetParentNameTaskCnt::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_GetParentNameTaskCnt, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'BattleActionTaskFactory_C_GetParentNameTaskCnt::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_GetParentNameTaskCnt, Temp_int_Array_Index_Variable_1) == 0x000030, "Member 'BattleActionTaskFactory_C_GetParentNameTaskCnt::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_GetParentNameTaskCnt, Temp_int_Variable_1) == 0x000034, "Member 'BattleActionTaskFactory_C_GetParentNameTaskCnt::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_GetParentNameTaskCnt, CallFunc_Array_Get_Item) == 0x000038, "Member 'BattleActionTaskFactory_C_GetParentNameTaskCnt::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_GetParentNameTaskCnt, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BattleActionTaskFactory_C_GetParentNameTaskCnt::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_GetParentNameTaskCnt, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'BattleActionTaskFactory_C_GetParentNameTaskCnt::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_GetParentNameTaskCnt, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000045, "Member 'BattleActionTaskFactory_C_GetParentNameTaskCnt::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_GetParentNameTaskCnt, CallFunc_Add_IntInt_ReturnValue_2) == 0x000048, "Member 'BattleActionTaskFactory_C_GetParentNameTaskCnt::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_GetParentNameTaskCnt, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'BattleActionTaskFactory_C_GetParentNameTaskCnt::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_GetParentNameTaskCnt, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'BattleActionTaskFactory_C_GetParentNameTaskCnt::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_GetParentNameTaskCnt, CallFunc_Less_IntInt_ReturnValue_1) == 0x00005C, "Member 'BattleActionTaskFactory_C_GetParentNameTaskCnt::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_GetParentNameTaskCnt, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x00005D, "Member 'BattleActionTaskFactory_C_GetParentNameTaskCnt::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_GetParentNameTaskCnt, CallFunc_Add_IntInt_ReturnValue_3) == 0x000060, "Member 'BattleActionTaskFactory_C_GetParentNameTaskCnt::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");

// Function BattleActionTaskFactory.BattleActionTaskFactory_C.SpawnActionTaskActor
// 0x0120 (0x0120 - 0x0000)
struct BattleActionTaskFactory_C_SpawnActionTaskActor final
{
public:
	struct FBtlTaskDesc                           InDesc;                                            // 0x0000(0x00A0)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<int32>                                 TaskWaitList;                                      // 0x00A0(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 ParentName;                                        // 0x00B0(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                Data;                                              // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ClassData;                                         // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TaskDuration;                                      // 0x00D0(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleActionTask_C*                    RetValue;                                          // 0x00D8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x00E0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BattleDesignDebugIsUseOldTaskSystem_Enable; // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BattleDesignDebugIsDrawInfo_IsDraw;       // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleMain_C*                          CallFunc_GetMainWork_retValue;                     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleActionTask_C*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleActionTaskFactory_C_SpawnActionTaskActor) == 0x000010, "Wrong alignment on BattleActionTaskFactory_C_SpawnActionTaskActor");
static_assert(sizeof(BattleActionTaskFactory_C_SpawnActionTaskActor) == 0x000120, "Wrong size on BattleActionTaskFactory_C_SpawnActionTaskActor");
static_assert(offsetof(BattleActionTaskFactory_C_SpawnActionTaskActor, InDesc) == 0x000000, "Member 'BattleActionTaskFactory_C_SpawnActionTaskActor::InDesc' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_SpawnActionTaskActor, TaskWaitList) == 0x0000A0, "Member 'BattleActionTaskFactory_C_SpawnActionTaskActor::TaskWaitList' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_SpawnActionTaskActor, ParentName) == 0x0000B0, "Member 'BattleActionTaskFactory_C_SpawnActionTaskActor::ParentName' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_SpawnActionTaskActor, Data) == 0x0000C0, "Member 'BattleActionTaskFactory_C_SpawnActionTaskActor::Data' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_SpawnActionTaskActor, ClassData) == 0x0000C8, "Member 'BattleActionTaskFactory_C_SpawnActionTaskActor::ClassData' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_SpawnActionTaskActor, TaskDuration) == 0x0000D0, "Member 'BattleActionTaskFactory_C_SpawnActionTaskActor::TaskDuration' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_SpawnActionTaskActor, RetValue) == 0x0000D8, "Member 'BattleActionTaskFactory_C_SpawnActionTaskActor::RetValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_SpawnActionTaskActor, Temp_byte_Variable) == 0x0000E0, "Member 'BattleActionTaskFactory_C_SpawnActionTaskActor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_SpawnActionTaskActor, CallFunc_BattleDesignDebugIsUseOldTaskSystem_Enable) == 0x0000E1, "Member 'BattleActionTaskFactory_C_SpawnActionTaskActor::CallFunc_BattleDesignDebugIsUseOldTaskSystem_Enable' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_SpawnActionTaskActor, CallFunc_Array_Length_ReturnValue) == 0x0000E4, "Member 'BattleActionTaskFactory_C_SpawnActionTaskActor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_SpawnActionTaskActor, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E8, "Member 'BattleActionTaskFactory_C_SpawnActionTaskActor::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_SpawnActionTaskActor, CallFunc_BattleDesignDebugIsDrawInfo_IsDraw) == 0x0000E9, "Member 'BattleActionTaskFactory_C_SpawnActionTaskActor::CallFunc_BattleDesignDebugIsDrawInfo_IsDraw' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_SpawnActionTaskActor, CallFunc_Array_Length_ReturnValue_1) == 0x0000EC, "Member 'BattleActionTaskFactory_C_SpawnActionTaskActor::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_SpawnActionTaskActor, CallFunc_GetMainWork_retValue) == 0x0000F0, "Member 'BattleActionTaskFactory_C_SpawnActionTaskActor::CallFunc_GetMainWork_retValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_SpawnActionTaskActor, CallFunc_Array_Add_ReturnValue) == 0x0000F8, "Member 'BattleActionTaskFactory_C_SpawnActionTaskActor::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_SpawnActionTaskActor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000100, "Member 'BattleActionTaskFactory_C_SpawnActionTaskActor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_SpawnActionTaskActor, CallFunc_FinishSpawningActor_ReturnValue) == 0x000108, "Member 'BattleActionTaskFactory_C_SpawnActionTaskActor::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_SpawnActionTaskActor, CallFunc_Array_Add_ReturnValue_1) == 0x000110, "Member 'BattleActionTaskFactory_C_SpawnActionTaskActor::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleActionTaskFactory_C_SpawnActionTaskActor, CallFunc_Array_Add_ReturnValue_2) == 0x000114, "Member 'BattleActionTaskFactory_C_SpawnActionTaskActor::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");

// Function BattleActionTaskFactory.BattleActionTaskFactory_C.MakeCureTask
// 0x00D8 (0x00D8 - 0x0000)
struct BattleActionTaskFactory_C_MakeCureTask final
{
public:
	TArray<int32>                                 WaitTaskList;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 ParentName;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         SrcPartyIndex;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DstPartyIndex;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_CURE                                    Type;                                              // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
