#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePartySystem

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "BTL_DESC_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BattlePartySystem.BattlePartySystem_C.ExecuteUbergraph_BattlePartySystem
// 0x0008 (0x0008 - 0x0000)
struct BattlePartySystem_C_ExecuteUbergraph_BattlePartySystem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePartySystem_C_ExecuteUbergraph_BattlePartySystem) == 0x000004, "Wrong alignment on BattlePartySystem_C_ExecuteUbergraph_BattlePartySystem");
static_assert(sizeof(BattlePartySystem_C_ExecuteUbergraph_BattlePartySystem) == 0x000008, "Wrong size on BattlePartySystem_C_ExecuteUbergraph_BattlePartySystem");
static_assert(offsetof(BattlePartySystem_C_ExecuteUbergraph_BattlePartySystem, EntryPoint) == 0x000000, "Member 'BattlePartySystem_C_ExecuteUbergraph_BattlePartySystem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_ExecuteUbergraph_BattlePartySystem, K2Node_Event_EndPlayReason) == 0x000004, "Member 'BattlePartySystem_C_ExecuteUbergraph_BattlePartySystem::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BattlePartySystem_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePartySystem_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BattlePartySystem_C_ReceiveEndPlay");
static_assert(sizeof(BattlePartySystem_C_ReceiveEndPlay) == 0x000001, "Wrong size on BattlePartySystem_C_ReceiveEndPlay");
static_assert(offsetof(BattlePartySystem_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BattlePartySystem_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.GetMainWork
// 0x0020 (0x0020 - 0x0000)
struct BattlePartySystem_C_GetMainWork final
{
public:
	class ABattleMain_C*                          RetValue;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleMain_C*                          K2Node_DynamicCast_AsBattle_Main;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePartySystem_C_GetMainWork) == 0x000008, "Wrong alignment on BattlePartySystem_C_GetMainWork");
static_assert(sizeof(BattlePartySystem_C_GetMainWork) == 0x000020, "Wrong size on BattlePartySystem_C_GetMainWork");
static_assert(offsetof(BattlePartySystem_C_GetMainWork, RetValue) == 0x000000, "Member 'BattlePartySystem_C_GetMainWork::RetValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetMainWork, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BattlePartySystem_C_GetMainWork::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetMainWork, K2Node_DynamicCast_AsBattle_Main) == 0x000010, "Member 'BattlePartySystem_C_GetMainWork::K2Node_DynamicCast_AsBattle_Main' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetMainWork, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BattlePartySystem_C_GetMainWork::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.const_GetPartyStart
// 0x0004 (0x0004 - 0x0000)
struct BattlePartySystem_C_Const_GetPartyStart final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePartySystem_C_Const_GetPartyStart) == 0x000004, "Wrong alignment on BattlePartySystem_C_Const_GetPartyStart");
static_assert(sizeof(BattlePartySystem_C_Const_GetPartyStart) == 0x000004, "Wrong size on BattlePartySystem_C_Const_GetPartyStart");
static_assert(offsetof(BattlePartySystem_C_Const_GetPartyStart, RetValue) == 0x000000, "Member 'BattlePartySystem_C_Const_GetPartyStart::RetValue' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.const_GetPartyLoopMax
// 0x0008 (0x0008 - 0x0000)
struct BattlePartySystem_C_Const_GetPartyLoopMax final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePartySystem_C_Const_GetPartyLoopMax) == 0x000004, "Wrong alignment on BattlePartySystem_C_Const_GetPartyLoopMax");
static_assert(sizeof(BattlePartySystem_C_Const_GetPartyLoopMax) == 0x000008, "Wrong size on BattlePartySystem_C_Const_GetPartyLoopMax");
static_assert(offsetof(BattlePartySystem_C_Const_GetPartyLoopMax, RetValue) == 0x000000, "Member 'BattlePartySystem_C_Const_GetPartyLoopMax::RetValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_Const_GetPartyLoopMax, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'BattlePartySystem_C_Const_GetPartyLoopMax::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.const_GetEnemyStart
// 0x0004 (0x0004 - 0x0000)
struct BattlePartySystem_C_Const_GetEnemyStart final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePartySystem_C_Const_GetEnemyStart) == 0x000004, "Wrong alignment on BattlePartySystem_C_Const_GetEnemyStart");
static_assert(sizeof(BattlePartySystem_C_Const_GetEnemyStart) == 0x000004, "Wrong size on BattlePartySystem_C_Const_GetEnemyStart");
static_assert(offsetof(BattlePartySystem_C_Const_GetEnemyStart, RetValue) == 0x000000, "Member 'BattlePartySystem_C_Const_GetEnemyStart::RetValue' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.const_GetEnemyNum
// 0x0004 (0x0004 - 0x0000)
struct BattlePartySystem_C_Const_GetEnemyNum final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePartySystem_C_Const_GetEnemyNum) == 0x000004, "Wrong alignment on BattlePartySystem_C_Const_GetEnemyNum");
static_assert(sizeof(BattlePartySystem_C_Const_GetEnemyNum) == 0x000004, "Wrong size on BattlePartySystem_C_Const_GetEnemyNum");
static_assert(offsetof(BattlePartySystem_C_Const_GetEnemyNum, RetValue) == 0x000000, "Member 'BattlePartySystem_C_Const_GetEnemyNum::RetValue' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.const_GetPlayerLoopMax
// 0x0008 (0x0008 - 0x0000)
struct BattlePartySystem_C_Const_GetPlayerLoopMax final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePartySystem_C_Const_GetPlayerLoopMax) == 0x000004, "Wrong alignment on BattlePartySystem_C_Const_GetPlayerLoopMax");
static_assert(sizeof(BattlePartySystem_C_Const_GetPlayerLoopMax) == 0x000008, "Wrong size on BattlePartySystem_C_Const_GetPlayerLoopMax");
static_assert(offsetof(BattlePartySystem_C_Const_GetPlayerLoopMax, RetValue) == 0x000000, "Member 'BattlePartySystem_C_Const_GetPlayerLoopMax::RetValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_Const_GetPlayerLoopMax, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'BattlePartySystem_C_Const_GetPlayerLoopMax::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.const_GetEnemyLoopMax
// 0x000C (0x000C - 0x0000)
struct BattlePartySystem_C_Const_GetEnemyLoopMax final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePartySystem_C_Const_GetEnemyLoopMax) == 0x000004, "Wrong alignment on BattlePartySystem_C_Const_GetEnemyLoopMax");
static_assert(sizeof(BattlePartySystem_C_Const_GetEnemyLoopMax) == 0x00000C, "Wrong size on BattlePartySystem_C_Const_GetEnemyLoopMax");
static_assert(offsetof(BattlePartySystem_C_Const_GetEnemyLoopMax, RetValue) == 0x000000, "Member 'BattlePartySystem_C_Const_GetEnemyLoopMax::RetValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_Const_GetEnemyLoopMax, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BattlePartySystem_C_Const_GetEnemyLoopMax::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_Const_GetEnemyLoopMax, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'BattlePartySystem_C_Const_GetEnemyLoopMax::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.GetPartyUnit
// 0x0028 (0x0028 - 0x0000)
struct BattlePartySystem_C_GetPartyUnit final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E2E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaBase_C*                           RetValue;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetUnit_ReturnValue;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           K2Node_DynamicCast_AsChara_Base;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePartySystem_C_GetPartyUnit) == 0x000008, "Wrong alignment on BattlePartySystem_C_GetPartyUnit");
static_assert(sizeof(BattlePartySystem_C_GetPartyUnit) == 0x000028, "Wrong size on BattlePartySystem_C_GetPartyUnit");
static_assert(offsetof(BattlePartySystem_C_GetPartyUnit, Param_Index) == 0x000000, "Member 'BattlePartySystem_C_GetPartyUnit::Param_Index' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetPartyUnit, RetValue) == 0x000008, "Member 'BattlePartySystem_C_GetPartyUnit::RetValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetPartyUnit, CallFunc_GetUnit_ReturnValue) == 0x000010, "Member 'BattlePartySystem_C_GetPartyUnit::CallFunc_GetUnit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetPartyUnit, K2Node_DynamicCast_AsChara_Base) == 0x000018, "Member 'BattlePartySystem_C_GetPartyUnit::K2Node_DynamicCast_AsChara_Base' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetPartyUnit, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BattlePartySystem_C_GetPartyUnit::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.IsExistNoLost
// 0x000C (0x000C - 0x0000)
struct BattlePartySystem_C_IsExistNoLost final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckFlag_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsExist_ReturnValue;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePartySystem_C_IsExistNoLost) == 0x000004, "Wrong alignment on BattlePartySystem_C_IsExistNoLost");
static_assert(sizeof(BattlePartySystem_C_IsExistNoLost) == 0x00000C, "Wrong size on BattlePartySystem_C_IsExistNoLost");
static_assert(offsetof(BattlePartySystem_C_IsExistNoLost, Param_Index) == 0x000000, "Member 'BattlePartySystem_C_IsExistNoLost::Param_Index' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_IsExistNoLost, RetValue) == 0x000004, "Member 'BattlePartySystem_C_IsExistNoLost::RetValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_IsExistNoLost, CallFunc_CheckFlag_ReturnValue) == 0x000005, "Member 'BattlePartySystem_C_IsExistNoLost::CallFunc_CheckFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_IsExistNoLost, CallFunc_IsExist_ReturnValue) == 0x000006, "Member 'BattlePartySystem_C_IsExistNoLost::CallFunc_IsExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_IsExistNoLost, CallFunc_Not_PreBool_ReturnValue) == 0x000007, "Member 'BattlePartySystem_C_IsExistNoLost::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_IsExistNoLost, CallFunc_BooleanAND_ReturnValue) == 0x000008, "Member 'BattlePartySystem_C_IsExistNoLost::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.ClearNowCommandAll
// 0x0020 (0x0020 - 0x0000)
struct BattlePartySystem_C_ClearNowCommandAll final
{
public:
	bool                                          IsPlayer;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E2F[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_const_GetEnemyLoopMax_retValue;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_const_GetPlayerLoopMax_retValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E30[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePartySystem_C_ClearNowCommandAll) == 0x000004, "Wrong alignment on BattlePartySystem_C_ClearNowCommandAll");
static_assert(sizeof(BattlePartySystem_C_ClearNowCommandAll) == 0x000020, "Wrong size on BattlePartySystem_C_ClearNowCommandAll");
static_assert(offsetof(BattlePartySystem_C_ClearNowCommandAll, IsPlayer) == 0x000000, "Member 'BattlePartySystem_C_ClearNowCommandAll::IsPlayer' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_ClearNowCommandAll, Temp_int_Variable) == 0x000004, "Member 'BattlePartySystem_C_ClearNowCommandAll::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_ClearNowCommandAll, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BattlePartySystem_C_ClearNowCommandAll::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_ClearNowCommandAll, CallFunc_const_GetEnemyLoopMax_retValue) == 0x00000C, "Member 'BattlePartySystem_C_ClearNowCommandAll::CallFunc_const_GetEnemyLoopMax_retValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_ClearNowCommandAll, Temp_int_Variable_1) == 0x000010, "Member 'BattlePartySystem_C_ClearNowCommandAll::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_ClearNowCommandAll, CallFunc_const_GetPlayerLoopMax_retValue) == 0x000014, "Member 'BattlePartySystem_C_ClearNowCommandAll::CallFunc_const_GetPlayerLoopMax_retValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_ClearNowCommandAll, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'BattlePartySystem_C_ClearNowCommandAll::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_ClearNowCommandAll, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000019, "Member 'BattlePartySystem_C_ClearNowCommandAll::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_ClearNowCommandAll, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'BattlePartySystem_C_ClearNowCommandAll::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.isEnemy
// 0x0008 (0x0008 - 0x0000)
struct BattlePartySystem_C_IsEnemy final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckFlag_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePartySystem_C_IsEnemy) == 0x000004, "Wrong alignment on BattlePartySystem_C_IsEnemy");
static_assert(sizeof(BattlePartySystem_C_IsEnemy) == 0x000008, "Wrong size on BattlePartySystem_C_IsEnemy");
static_assert(offsetof(BattlePartySystem_C_IsEnemy, Param_Index) == 0x000000, "Member 'BattlePartySystem_C_IsEnemy::Param_Index' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_IsEnemy, RetValue) == 0x000004, "Member 'BattlePartySystem_C_IsEnemy::RetValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_IsEnemy, CallFunc_CheckFlag_ReturnValue) == 0x000005, "Member 'BattlePartySystem_C_IsEnemy::CallFunc_CheckFlag_ReturnValue' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.IsHero
// 0x0008 (0x0008 - 0x0000)
struct BattlePartySystem_C_IsHero final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckFlag_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePartySystem_C_IsHero) == 0x000004, "Wrong alignment on BattlePartySystem_C_IsHero");
static_assert(sizeof(BattlePartySystem_C_IsHero) == 0x000008, "Wrong size on BattlePartySystem_C_IsHero");
static_assert(offsetof(BattlePartySystem_C_IsHero, Param_Index) == 0x000000, "Member 'BattlePartySystem_C_IsHero::Param_Index' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_IsHero, RetValue) == 0x000004, "Member 'BattlePartySystem_C_IsHero::RetValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_IsHero, CallFunc_CheckFlag_ReturnValue) == 0x000005, "Member 'BattlePartySystem_C_IsHero::CallFunc_CheckFlag_ReturnValue' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.IsNkm
// 0x0008 (0x0008 - 0x0000)
struct BattlePartySystem_C_IsNkm final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckFlag_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePartySystem_C_IsNkm) == 0x000004, "Wrong alignment on BattlePartySystem_C_IsNkm");
static_assert(sizeof(BattlePartySystem_C_IsNkm) == 0x000008, "Wrong size on BattlePartySystem_C_IsNkm");
static_assert(offsetof(BattlePartySystem_C_IsNkm, Param_Index) == 0x000000, "Member 'BattlePartySystem_C_IsNkm::Param_Index' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_IsNkm, RetValue) == 0x000004, "Member 'BattlePartySystem_C_IsNkm::RetValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_IsNkm, CallFunc_CheckFlag_ReturnValue) == 0x000005, "Member 'BattlePartySystem_C_IsNkm::CallFunc_CheckFlag_ReturnValue' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.GetCharID
// 0x0010 (0x0010 - 0x0000)
struct BattlePartySystem_C_GetCharID final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetValue;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharaID_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_retValue;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNKM_retValue;                           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHero_retValue;                          // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePartySystem_C_GetCharID) == 0x000004, "Wrong alignment on BattlePartySystem_C_GetCharID");
static_assert(sizeof(BattlePartySystem_C_GetCharID) == 0x000010, "Wrong size on BattlePartySystem_C_GetCharID");
static_assert(offsetof(BattlePartySystem_C_GetCharID, Param_Index) == 0x000000, "Member 'BattlePartySystem_C_GetCharID::Param_Index' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetCharID, RetValue) == 0x000004, "Member 'BattlePartySystem_C_GetCharID::RetValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetCharID, CallFunc_GetCharaID_ReturnValue) == 0x000008, "Member 'BattlePartySystem_C_GetCharID::CallFunc_GetCharaID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetCharID, CallFunc_IsEnemy_retValue) == 0x00000C, "Member 'BattlePartySystem_C_GetCharID::CallFunc_IsEnemy_retValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetCharID, CallFunc_IsNKM_retValue) == 0x00000D, "Member 'BattlePartySystem_C_GetCharID::CallFunc_IsNKM_retValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetCharID, CallFunc_IsHero_retValue) == 0x00000E, "Member 'BattlePartySystem_C_GetCharID::CallFunc_IsHero_retValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetCharID, CallFunc_BooleanOR_ReturnValue) == 0x00000F, "Member 'BattlePartySystem_C_GetCharID::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.CanAct
// 0x000C (0x000C - 0x0000)
struct BattlePartySystem_C_CanAct final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckFlag2_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckFlag_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckFlag_ReturnValue_1;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePartySystem_C_CanAct) == 0x000004, "Wrong alignment on BattlePartySystem_C_CanAct");
static_assert(sizeof(BattlePartySystem_C_CanAct) == 0x00000C, "Wrong size on BattlePartySystem_C_CanAct");
static_assert(offsetof(BattlePartySystem_C_CanAct, Param_Index) == 0x000000, "Member 'BattlePartySystem_C_CanAct::Param_Index' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_CanAct, RetValue) == 0x000004, "Member 'BattlePartySystem_C_CanAct::RetValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_CanAct, CallFunc_CheckFlag2_ReturnValue) == 0x000005, "Member 'BattlePartySystem_C_CanAct::CallFunc_CheckFlag2_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_CanAct, CallFunc_CheckFlag_ReturnValue) == 0x000006, "Member 'BattlePartySystem_C_CanAct::CallFunc_CheckFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_CanAct, CallFunc_CheckFlag_ReturnValue_1) == 0x000007, "Member 'BattlePartySystem_C_CanAct::CallFunc_CheckFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_CanAct, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'BattlePartySystem_C_CanAct::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_CanAct, CallFunc_BooleanOR_ReturnValue) == 0x000009, "Member 'BattlePartySystem_C_CanAct::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_CanAct, CallFunc_BooleanOR_ReturnValue_1) == 0x00000A, "Member 'BattlePartySystem_C_CanAct::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.CanTurnAct
// 0x0020 (0x0020 - 0x0000)
struct BattlePartySystem_C_CanTurnAct final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E31[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetCanActList_ReturnValue;                // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePartySystem_C_CanTurnAct) == 0x000008, "Wrong alignment on BattlePartySystem_C_CanTurnAct");
static_assert(sizeof(BattlePartySystem_C_CanTurnAct) == 0x000020, "Wrong size on BattlePartySystem_C_CanTurnAct");
static_assert(offsetof(BattlePartySystem_C_CanTurnAct, Param_Index) == 0x000000, "Member 'BattlePartySystem_C_CanTurnAct::Param_Index' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_CanTurnAct, RetValue) == 0x000004, "Member 'BattlePartySystem_C_CanTurnAct::RetValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_CanTurnAct, CallFunc_GetCanActList_ReturnValue) == 0x000008, "Member 'BattlePartySystem_C_CanTurnAct::CallFunc_GetCanActList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_CanTurnAct, CallFunc_Array_Find_ReturnValue) == 0x000018, "Member 'BattlePartySystem_C_CanTurnAct::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_CanTurnAct, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00001C, "Member 'BattlePartySystem_C_CanTurnAct::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.AddFlagPartyAll
// 0x0048 (0x0048 - 0x0000)
struct BattlePartySystem_C_AddFlagPartyAll final
{
public:
	E_BTL_PARTY_STAT                              InFlag;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E32[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Lo_ActList;                                        // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E33[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetActListAll_retValue;                   // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePartySystem_C_AddFlagPartyAll) == 0x000008, "Wrong alignment on BattlePartySystem_C_AddFlagPartyAll");
static_assert(sizeof(BattlePartySystem_C_AddFlagPartyAll) == 0x000048, "Wrong size on BattlePartySystem_C_AddFlagPartyAll");
static_assert(offsetof(BattlePartySystem_C_AddFlagPartyAll, InFlag) == 0x000000, "Member 'BattlePartySystem_C_AddFlagPartyAll::InFlag' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_AddFlagPartyAll, Lo_ActList) == 0x000008, "Member 'BattlePartySystem_C_AddFlagPartyAll::Lo_ActList' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_AddFlagPartyAll, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BattlePartySystem_C_AddFlagPartyAll::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_AddFlagPartyAll, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BattlePartySystem_C_AddFlagPartyAll::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_AddFlagPartyAll, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BattlePartySystem_C_AddFlagPartyAll::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_AddFlagPartyAll, CallFunc_GetActListAll_retValue) == 0x000028, "Member 'BattlePartySystem_C_AddFlagPartyAll::CallFunc_GetActListAll_retValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_AddFlagPartyAll, CallFunc_Array_Get_Item) == 0x000038, "Member 'BattlePartySystem_C_AddFlagPartyAll::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_AddFlagPartyAll, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BattlePartySystem_C_AddFlagPartyAll::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_AddFlagPartyAll, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BattlePartySystem_C_AddFlagPartyAll::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.AddFlag2PartyAll
// 0x0048 (0x0048 - 0x0000)
struct BattlePartySystem_C_AddFlag2PartyAll final
{
public:
	E_BTL_PARTY_STAT2                             InFlag;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E34[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Lo_ActList;                                        // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E35[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetActListAll_retValue;                   // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePartySystem_C_AddFlag2PartyAll) == 0x000008, "Wrong alignment on BattlePartySystem_C_AddFlag2PartyAll");
static_assert(sizeof(BattlePartySystem_C_AddFlag2PartyAll) == 0x000048, "Wrong size on BattlePartySystem_C_AddFlag2PartyAll");
static_assert(offsetof(BattlePartySystem_C_AddFlag2PartyAll, InFlag) == 0x000000, "Member 'BattlePartySystem_C_AddFlag2PartyAll::InFlag' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_AddFlag2PartyAll, Lo_ActList) == 0x000008, "Member 'BattlePartySystem_C_AddFlag2PartyAll::Lo_ActList' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_AddFlag2PartyAll, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BattlePartySystem_C_AddFlag2PartyAll::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_AddFlag2PartyAll, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BattlePartySystem_C_AddFlag2PartyAll::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_AddFlag2PartyAll, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BattlePartySystem_C_AddFlag2PartyAll::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_AddFlag2PartyAll, CallFunc_GetActListAll_retValue) == 0x000028, "Member 'BattlePartySystem_C_AddFlag2PartyAll::CallFunc_GetActListAll_retValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_AddFlag2PartyAll, CallFunc_Array_Get_Item) == 0x000038, "Member 'BattlePartySystem_C_AddFlag2PartyAll::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_AddFlag2PartyAll, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BattlePartySystem_C_AddFlag2PartyAll::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_AddFlag2PartyAll, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BattlePartySystem_C_AddFlag2PartyAll::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.DelFlagPartyAll
// 0x0048 (0x0048 - 0x0000)
struct BattlePartySystem_C_DelFlagPartyAll final
{
public:
	E_BTL_PARTY_STAT                              InFlag;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E36[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Lo_ActList;                                        // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E37[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetActListAll_retValue;                   // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePartySystem_C_DelFlagPartyAll) == 0x000008, "Wrong alignment on BattlePartySystem_C_DelFlagPartyAll");
static_assert(sizeof(BattlePartySystem_C_DelFlagPartyAll) == 0x000048, "Wrong size on BattlePartySystem_C_DelFlagPartyAll");
static_assert(offsetof(BattlePartySystem_C_DelFlagPartyAll, InFlag) == 0x000000, "Member 'BattlePartySystem_C_DelFlagPartyAll::InFlag' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_DelFlagPartyAll, Lo_ActList) == 0x000008, "Member 'BattlePartySystem_C_DelFlagPartyAll::Lo_ActList' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_DelFlagPartyAll, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BattlePartySystem_C_DelFlagPartyAll::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_DelFlagPartyAll, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BattlePartySystem_C_DelFlagPartyAll::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_DelFlagPartyAll, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BattlePartySystem_C_DelFlagPartyAll::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_DelFlagPartyAll, CallFunc_GetActListAll_retValue) == 0x000028, "Member 'BattlePartySystem_C_DelFlagPartyAll::CallFunc_GetActListAll_retValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_DelFlagPartyAll, CallFunc_Array_Get_Item) == 0x000038, "Member 'BattlePartySystem_C_DelFlagPartyAll::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_DelFlagPartyAll, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BattlePartySystem_C_DelFlagPartyAll::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_DelFlagPartyAll, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BattlePartySystem_C_DelFlagPartyAll::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.DelFlag2PartyAll
// 0x0048 (0x0048 - 0x0000)
struct BattlePartySystem_C_DelFlag2PartyAll final
{
public:
	E_BTL_PARTY_STAT2                             InFlag;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E38[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Lo_ActList;                                        // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E39[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetActListAll_retValue;                   // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePartySystem_C_DelFlag2PartyAll) == 0x000008, "Wrong alignment on BattlePartySystem_C_DelFlag2PartyAll");
static_assert(sizeof(BattlePartySystem_C_DelFlag2PartyAll) == 0x000048, "Wrong size on BattlePartySystem_C_DelFlag2PartyAll");
static_assert(offsetof(BattlePartySystem_C_DelFlag2PartyAll, InFlag) == 0x000000, "Member 'BattlePartySystem_C_DelFlag2PartyAll::InFlag' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_DelFlag2PartyAll, Lo_ActList) == 0x000008, "Member 'BattlePartySystem_C_DelFlag2PartyAll::Lo_ActList' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_DelFlag2PartyAll, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BattlePartySystem_C_DelFlag2PartyAll::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_DelFlag2PartyAll, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BattlePartySystem_C_DelFlag2PartyAll::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_DelFlag2PartyAll, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BattlePartySystem_C_DelFlag2PartyAll::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_DelFlag2PartyAll, CallFunc_GetActListAll_retValue) == 0x000028, "Member 'BattlePartySystem_C_DelFlag2PartyAll::CallFunc_GetActListAll_retValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_DelFlag2PartyAll, CallFunc_Array_Get_Item) == 0x000038, "Member 'BattlePartySystem_C_DelFlag2PartyAll::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_DelFlag2PartyAll, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BattlePartySystem_C_DelFlag2PartyAll::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_DelFlag2PartyAll, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BattlePartySystem_C_DelFlag2PartyAll::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.GetSideFirstActIndex
// 0x0058 (0x0058 - 0x0000)
struct BattlePartySystem_C_GetSideFirstActIndex final
{
public:
	bool                                          IsPlayer;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsCounter;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E3A[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RetValue;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 Lo_ActList;                                        // 0x0008(0x0010)(Edit, BlueprintVisible)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E3B[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_GetSideIsInFieldList_ReturnValue;         // 0x0028(0x0010)(ReferenceParm)
	TArray<int32>                                 CallFunc_GetSideIsInFieldList_ReturnValue_1;       // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckFlag2_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePartySystem_C_GetSideFirstActIndex) == 0x000008, "Wrong alignment on BattlePartySystem_C_GetSideFirstActIndex");
static_assert(sizeof(BattlePartySystem_C_GetSideFirstActIndex) == 0x000058, "Wrong size on BattlePartySystem_C_GetSideFirstActIndex");
static_assert(offsetof(BattlePartySystem_C_GetSideFirstActIndex, IsPlayer) == 0x000000, "Member 'BattlePartySystem_C_GetSideFirstActIndex::IsPlayer' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetSideFirstActIndex, IsCounter) == 0x000001, "Member 'BattlePartySystem_C_GetSideFirstActIndex::IsCounter' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetSideFirstActIndex, RetValue) == 0x000004, "Member 'BattlePartySystem_C_GetSideFirstActIndex::RetValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetSideFirstActIndex, Lo_ActList) == 0x000008, "Member 'BattlePartySystem_C_GetSideFirstActIndex::Lo_ActList' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetSideFirstActIndex, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'BattlePartySystem_C_GetSideFirstActIndex::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetSideFirstActIndex, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BattlePartySystem_C_GetSideFirstActIndex::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetSideFirstActIndex, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BattlePartySystem_C_GetSideFirstActIndex::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetSideFirstActIndex, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BattlePartySystem_C_GetSideFirstActIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetSideFirstActIndex, CallFunc_GetSideIsInFieldList_ReturnValue) == 0x000028, "Member 'BattlePartySystem_C_GetSideFirstActIndex::CallFunc_GetSideIsInFieldList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetSideFirstActIndex, CallFunc_GetSideIsInFieldList_ReturnValue_1) == 0x000038, "Member 'BattlePartySystem_C_GetSideFirstActIndex::CallFunc_GetSideIsInFieldList_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetSideFirstActIndex, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BattlePartySystem_C_GetSideFirstActIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetSideFirstActIndex, CallFunc_Array_Get_Item) == 0x00004C, "Member 'BattlePartySystem_C_GetSideFirstActIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetSideFirstActIndex, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BattlePartySystem_C_GetSideFirstActIndex::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetSideFirstActIndex, CallFunc_CheckFlag2_ReturnValue) == 0x000051, "Member 'BattlePartySystem_C_GetSideFirstActIndex::CallFunc_CheckFlag2_ReturnValue' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.GetSideActList
// 0x0028 (0x0028 - 0x0000)
struct BattlePartySystem_C_GetSideActList final
{
public:
	E_BTL_SIDE                                    Side;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E3C[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 RetValue;                                          // 0x0008(0x0010)(Parm, OutParm)
	TArray<int32>                                 CallFunc_GetSideIsInFieldList_ReturnValue;         // 0x0018(0x0010)(ReferenceParm)
};
static_assert(alignof(BattlePartySystem_C_GetSideActList) == 0x000008, "Wrong alignment on BattlePartySystem_C_GetSideActList");
static_assert(sizeof(BattlePartySystem_C_GetSideActList) == 0x000028, "Wrong size on BattlePartySystem_C_GetSideActList");
static_assert(offsetof(BattlePartySystem_C_GetSideActList, Side) == 0x000000, "Member 'BattlePartySystem_C_GetSideActList::Side' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetSideActList, RetValue) == 0x000008, "Member 'BattlePartySystem_C_GetSideActList::RetValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_GetSideActList, CallFunc_GetSideIsInFieldList_ReturnValue) == 0x000018, "Member 'BattlePartySystem_C_GetSideActList::CallFunc_GetSideIsInFieldList_ReturnValue' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.IsAllDeadSide
// 0x0020 (0x0020 - 0x0000)
struct BattlePartySystem_C_IsAllDeadSide final
{
public:
	bool                                          IsPlayer;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEnemyLoseBattleEnd_ReturnValue;      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E3D[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetSideIsInFieldList_ReturnValue;         // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePartySystem_C_IsAllDeadSide) == 0x000008, "Wrong alignment on BattlePartySystem_C_IsAllDeadSide");
static_assert(sizeof(BattlePartySystem_C_IsAllDeadSide) == 0x000020, "Wrong size on BattlePartySystem_C_IsAllDeadSide");
static_assert(offsetof(BattlePartySystem_C_IsAllDeadSide, IsPlayer) == 0x000000, "Member 'BattlePartySystem_C_IsAllDeadSide::IsPlayer' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_IsAllDeadSide, RetValue) == 0x000001, "Member 'BattlePartySystem_C_IsAllDeadSide::RetValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_IsAllDeadSide, CallFunc_CheckEnemyLoseBattleEnd_ReturnValue) == 0x000002, "Member 'BattlePartySystem_C_IsAllDeadSide::CallFunc_CheckEnemyLoseBattleEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_IsAllDeadSide, CallFunc_GetSideIsInFieldList_ReturnValue) == 0x000008, "Member 'BattlePartySystem_C_IsAllDeadSide::CallFunc_GetSideIsInFieldList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_IsAllDeadSide, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BattlePartySystem_C_IsAllDeadSide::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePartySystem_C_IsAllDeadSide, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'BattlePartySystem_C_IsAllDeadSide::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BattlePartySystem.BattlePartySystem_C.DbgPrint_Combo
// 0x0080 (0x0080 - 0x0000)
struct BattlePartySystem_C_DbgPrint_Combo final
{
public:
	TArray<int32>                                 Lo_List;                                           // 0x0000(0x0010)(Edit, BlueprintVisible)
