#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleSkillLight_t

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct BattleSkillLight_t.BattleSkillLight_t
// 0x0058 (0x0058 - 0x0000)
struct FBattleSkillLight_t final
{
public:
	E_SKILL_HIT_STAMP_TYPE                        SkillHitStamp_16_A6D944F74BAC1196FF95199D402692CC; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4939[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      LightMaterial_15_50B2C8A9477276A64A589CAC5B55ED01; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LightColor_9_2DEFFC6C496E50E37F8A639DB6FFBDF2;     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 SocketName_12_3D9CCE1640D33EDF1ABF448C7A68D757;    // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                Offset_25_E267616E4F38245C442F03A4B2E49A4D;        // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_493A[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            IntensityCurve_20_28CCCFAE42A0DA13CAE0E2905531C6A7; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            RadiusCurve_22_6057213C434E9B5F3E6B549771167787;   // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            LightFalloffExponent_28_8E6E8A9A49FAE7CED1DF10B9CAF70E5A; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FBattleSkillLight_t) == 0x000008, "Wrong alignment on FBattleSkillLight_t");
static_assert(sizeof(FBattleSkillLight_t) == 0x000058, "Wrong size on FBattleSkillLight_t");
static_assert(offsetof(FBattleSkillLight_t, SkillHitStamp_16_A6D944F74BAC1196FF95199D402692CC) == 0x000000, "Member 'FBattleSkillLight_t::SkillHitStamp_16_A6D944F74BAC1196FF95199D402692CC' has a wrong offset!");
static_assert(offsetof(FBattleSkillLight_t, LightMaterial_15_50B2C8A9477276A64A589CAC5B55ED01) == 0x000008, "Member 'FBattleSkillLight_t::LightMaterial_15_50B2C8A9477276A64A589CAC5B55ED01' has a wrong offset!");
static_assert(offsetof(FBattleSkillLight_t, LightColor_9_2DEFFC6C496E50E37F8A639DB6FFBDF2) == 0x000010, "Member 'FBattleSkillLight_t::LightColor_9_2DEFFC6C496E50E37F8A639DB6FFBDF2' has a wrong offset!");
static_assert(offsetof(FBattleSkillLight_t, SocketName_12_3D9CCE1640D33EDF1ABF448C7A68D757) == 0x000020, "Member 'FBattleSkillLight_t::SocketName_12_3D9CCE1640D33EDF1ABF448C7A68D757' has a wrong offset!");
static_assert(offsetof(FBattleSkillLight_t, Offset_25_E267616E4F38245C442F03A4B2E49A4D) == 0x000030, "Member 'FBattleSkillLight_t::Offset_25_E267616E4F38245C442F03A4B2E49A4D' has a wrong offset!");
static_assert(offsetof(FBattleSkillLight_t, IntensityCurve_20_28CCCFAE42A0DA13CAE0E2905531C6A7) == 0x000040, "Member 'FBattleSkillLight_t::IntensityCurve_20_28CCCFAE42A0DA13CAE0E2905531C6A7' has a wrong offset!");
static_assert(offsetof(FBattleSkillLight_t, RadiusCurve_22_6057213C434E9B5F3E6B549771167787) == 0x000048, "Member 'FBattleSkillLight_t::RadiusCurve_22_6057213C434E9B5F3E6B549771167787' has a wrong offset!");
static_assert(offsetof(FBattleSkillLight_t, LightFalloffExponent_28_8E6E8A9A49FAE7CED1DF10B9CAF70E5A) == 0x000050, "Member 'FBattleSkillLight_t::LightFalloffExponent_28_8E6E8A9A49FAE7CED1DF10B9CAF70E5A' has a wrong offset!");

}

