#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePostProcessActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BattlePostProcessActor.BattlePostProcessActor_C.ExecuteUbergraph_BattlePostProcessActor
// 0x0060 (0x0060 - 0x0000)
struct BattlePostProcessActor_C_ExecuteUbergraph_BattlePostProcessActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D74[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D75[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattlePostProcessVolume*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePostProcessActor_C_ExecuteUbergraph_BattlePostProcessActor) == 0x000010, "Wrong alignment on BattlePostProcessActor_C_ExecuteUbergraph_BattlePostProcessActor");
static_assert(sizeof(BattlePostProcessActor_C_ExecuteUbergraph_BattlePostProcessActor) == 0x000060, "Wrong size on BattlePostProcessActor_C_ExecuteUbergraph_BattlePostProcessActor");
static_assert(offsetof(BattlePostProcessActor_C_ExecuteUbergraph_BattlePostProcessActor, EntryPoint) == 0x000000, "Member 'BattlePostProcessActor_C_ExecuteUbergraph_BattlePostProcessActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattlePostProcessActor_C_ExecuteUbergraph_BattlePostProcessActor, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BattlePostProcessActor_C_ExecuteUbergraph_BattlePostProcessActor::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessActor_C_ExecuteUbergraph_BattlePostProcessActor, K2Node_Event_EndPlayReason) == 0x000040, "Member 'BattlePostProcessActor_C_ExecuteUbergraph_BattlePostProcessActor::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BattlePostProcessActor_C_ExecuteUbergraph_BattlePostProcessActor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000048, "Member 'BattlePostProcessActor_C_ExecuteUbergraph_BattlePostProcessActor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePostProcessActor_C_ExecuteUbergraph_BattlePostProcessActor, CallFunc_FinishSpawningActor_ReturnValue) == 0x000050, "Member 'BattlePostProcessActor_C_ExecuteUbergraph_BattlePostProcessActor::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BattlePostProcessActor.BattlePostProcessActor_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BattlePostProcessActor_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePostProcessActor_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BattlePostProcessActor_C_ReceiveEndPlay");
static_assert(sizeof(BattlePostProcessActor_C_ReceiveEndPlay) == 0x000001, "Wrong size on BattlePostProcessActor_C_ReceiveEndPlay");
static_assert(offsetof(BattlePostProcessActor_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BattlePostProcessActor_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

