#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleTargetDevilInfoActor

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BattleTargetDevilInfoActor.BattleTargetDevilInfoActor_C.ExecuteUbergraph_BattleTargetDevilInfoActor
// 0x03D0 (0x03D0 - 0x0000)
struct BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4022[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtlTargetDevil_Aishou_C*            CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4023[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtlTargetDevil_AishouNotice_C*      CallFunc_Create_ReturnValue_1;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue_1;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4024[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4025[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaBase_C*                           CallFunc_FindUnit_retValue;                        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue_2;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4026[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtlTargetDevil_HP_C*                CallFunc_Create_ReturnValue_2;                     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue_3;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4027[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtlTargetDevil_Info_C*              CallFunc_Create_ReturnValue_3;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4028[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_GetBIPartySystem_ret;                     // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(int32 PartyIndex)>             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4029[0x8];                                     // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlParty                              CallFunc_BI_GetPartyData_retValue;                 // 0x00A0(0x0320)()
	TDelegate<void(int32 PartyIndex)>             K2Node_CreateDelegate_OutputDelegate_2;            // 0x03C0(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor) == 0x000010, "Wrong alignment on BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor");
static_assert(sizeof(BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor) == 0x0003D0, "Wrong size on BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor");
static_assert(offsetof(BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor, EntryPoint) == 0x000000, "Member 'BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor, CallFunc_Create_ReturnValue) == 0x000018, "Member 'BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor, CallFunc_AddToWidgetPrio_ReturnValue) == 0x000020, "Member 'BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor::CallFunc_AddToWidgetPrio_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor, CallFunc_Create_ReturnValue_1) == 0x000028, "Member 'BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor, CallFunc_AddToWidgetPrio_ReturnValue_1) == 0x000030, "Member 'BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor::CallFunc_AddToWidgetPrio_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor, K2Node_Event_DeltaSeconds) == 0x000034, "Member 'BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000038, "Member 'BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00003C, "Member 'BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000040, "Member 'BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor, CallFunc_FindUnit_retValue) == 0x000048, "Member 'BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor::CallFunc_FindUnit_retValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor, CallFunc_AddToWidgetPrio_ReturnValue_2) == 0x000050, "Member 'BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor::CallFunc_AddToWidgetPrio_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor, CallFunc_Create_ReturnValue_2) == 0x000058, "Member 'BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor, CallFunc_AddToWidgetPrio_ReturnValue_3) == 0x000060, "Member 'BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor::CallFunc_AddToWidgetPrio_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor, CallFunc_Create_ReturnValue_3) == 0x000068, "Member 'BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor, K2Node_Event_EndPlayReason) == 0x000070, "Member 'BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor, CallFunc_GetBIPartySystem_ret) == 0x000078, "Member 'BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor::CallFunc_GetBIPartySystem_ret' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor, K2Node_CreateDelegate_OutputDelegate_1) == 0x000088, "Member 'BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor, CallFunc_BI_GetPartyData_retValue) == 0x0000A0, "Member 'BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor::CallFunc_BI_GetPartyData_retValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor, K2Node_CreateDelegate_OutputDelegate_2) == 0x0003C0, "Member 'BattleTargetDevilInfoActor_C_ExecuteUbergraph_BattleTargetDevilInfoActor::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function BattleTargetDevilInfoActor.BattleTargetDevilInfoActor_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BattleTargetDevilInfoActor_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleTargetDevilInfoActor_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BattleTargetDevilInfoActor_C_ReceiveEndPlay");
static_assert(sizeof(BattleTargetDevilInfoActor_C_ReceiveEndPlay) == 0x000001, "Wrong size on BattleTargetDevilInfoActor_C_ReceiveEndPlay");
static_assert(offsetof(BattleTargetDevilInfoActor_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BattleTargetDevilInfoActor_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BattleTargetDevilInfoActor.BattleTargetDevilInfoActor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BattleTargetDevilInfoActor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleTargetDevilInfoActor_C_ReceiveTick) == 0x000004, "Wrong alignment on BattleTargetDevilInfoActor_C_ReceiveTick");
static_assert(sizeof(BattleTargetDevilInfoActor_C_ReceiveTick) == 0x000004, "Wrong size on BattleTargetDevilInfoActor_C_ReceiveTick");
static_assert(offsetof(BattleTargetDevilInfoActor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BattleTargetDevilInfoActor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BattleTargetDevilInfoActor.BattleTargetDevilInfoActor_C.GetBIMainWork
// 0x0030 (0x0030 - 0x0000)
struct BattleTargetDevilInfoActor_C_GetBIMainWork final
{
public:
	TScriptInterface<class IBPI_BattleMain_C>     RetValue;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleMain_C>     K2Node_DynamicCast_AsBPI_Battle_Main;              // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleTargetDevilInfoActor_C_GetBIMainWork) == 0x000008, "Wrong alignment on BattleTargetDevilInfoActor_C_GetBIMainWork");
static_assert(sizeof(BattleTargetDevilInfoActor_C_GetBIMainWork) == 0x000030, "Wrong size on BattleTargetDevilInfoActor_C_GetBIMainWork");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetBIMainWork, RetValue) == 0x000000, "Member 'BattleTargetDevilInfoActor_C_GetBIMainWork::RetValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetBIMainWork, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BattleTargetDevilInfoActor_C_GetBIMainWork::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetBIMainWork, K2Node_DynamicCast_AsBPI_Battle_Main) == 0x000018, "Member 'BattleTargetDevilInfoActor_C_GetBIMainWork::K2Node_DynamicCast_AsBPI_Battle_Main' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetBIMainWork, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BattleTargetDevilInfoActor_C_GetBIMainWork::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BattleTargetDevilInfoActor.BattleTargetDevilInfoActor_C.GetBIPartySystem
// 0x0030 (0x0030 - 0x0000)
struct BattleTargetDevilInfoActor_C_GetBIPartySystem final
{
public:
	TScriptInterface<class IBPI_BattleParty_C>    Ret;                                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_GetBIMainWork_retValue;                   // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_BI_GetPartySystem_ret;                    // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleTargetDevilInfoActor_C_GetBIPartySystem) == 0x000008, "Wrong alignment on BattleTargetDevilInfoActor_C_GetBIPartySystem");
static_assert(sizeof(BattleTargetDevilInfoActor_C_GetBIPartySystem) == 0x000030, "Wrong size on BattleTargetDevilInfoActor_C_GetBIPartySystem");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetBIPartySystem, Ret) == 0x000000, "Member 'BattleTargetDevilInfoActor_C_GetBIPartySystem::Ret' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetBIPartySystem, CallFunc_GetBIMainWork_retValue) == 0x000010, "Member 'BattleTargetDevilInfoActor_C_GetBIPartySystem::CallFunc_GetBIMainWork_retValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetBIPartySystem, CallFunc_BI_GetPartySystem_ret) == 0x000020, "Member 'BattleTargetDevilInfoActor_C_GetBIPartySystem::CallFunc_BI_GetPartySystem_ret' has a wrong offset!");

// Function BattleTargetDevilInfoActor.BattleTargetDevilInfoActor_C.PlayHpBar
// 0x0020 (0x0020 - 0x0000)
struct BattleTargetDevilInfoActor_C_PlayHpBar final
{
public:
	int32                                         AddParam;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimTime;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Overflow;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_402A[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtlTargetDevil_HP_C*                CallFunc_GetWidget_HPBar_Widget;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleTargetDevilInfoActor_C_PlayHpBar) == 0x000008, "Wrong alignment on BattleTargetDevilInfoActor_C_PlayHpBar");
static_assert(sizeof(BattleTargetDevilInfoActor_C_PlayHpBar) == 0x000020, "Wrong size on BattleTargetDevilInfoActor_C_PlayHpBar");
static_assert(offsetof(BattleTargetDevilInfoActor_C_PlayHpBar, AddParam) == 0x000000, "Member 'BattleTargetDevilInfoActor_C_PlayHpBar::AddParam' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_PlayHpBar, AnimTime) == 0x000004, "Member 'BattleTargetDevilInfoActor_C_PlayHpBar::AnimTime' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_PlayHpBar, Overflow) == 0x000008, "Member 'BattleTargetDevilInfoActor_C_PlayHpBar::Overflow' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_PlayHpBar, CallFunc_GetWidget_HPBar_Widget) == 0x000010, "Member 'BattleTargetDevilInfoActor_C_PlayHpBar::CallFunc_GetWidget_HPBar_Widget' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_PlayHpBar, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BattleTargetDevilInfoActor_C_PlayHpBar::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BattleTargetDevilInfoActor.BattleTargetDevilInfoActor_C.GetWidget_HPBar
// 0x0008 (0x0008 - 0x0000)
struct BattleTargetDevilInfoActor_C_GetWidget_HPBar final
{
public:
	class UWB_BtlTargetDevil_HP_C*                Widget;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleTargetDevilInfoActor_C_GetWidget_HPBar) == 0x000008, "Wrong alignment on BattleTargetDevilInfoActor_C_GetWidget_HPBar");
static_assert(sizeof(BattleTargetDevilInfoActor_C_GetWidget_HPBar) == 0x000008, "Wrong size on BattleTargetDevilInfoActor_C_GetWidget_HPBar");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetWidget_HPBar, Widget) == 0x000000, "Member 'BattleTargetDevilInfoActor_C_GetWidget_HPBar::Widget' has a wrong offset!");

// Function BattleTargetDevilInfoActor.BattleTargetDevilInfoActor_C.IsPlayHpBar
// 0x0018 (0x0018 - 0x0000)
struct BattleTargetDevilInfoActor_C_IsPlayHpBar final
{
public:
	bool                                          IsPlay;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_402B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtlTargetDevil_HP_C*                CallFunc_GetWidget_HPBar_Widget;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayDamageAnim_m_PlayDamageAnim;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleTargetDevilInfoActor_C_IsPlayHpBar) == 0x000008, "Wrong alignment on BattleTargetDevilInfoActor_C_IsPlayHpBar");
static_assert(sizeof(BattleTargetDevilInfoActor_C_IsPlayHpBar) == 0x000018, "Wrong size on BattleTargetDevilInfoActor_C_IsPlayHpBar");
static_assert(offsetof(BattleTargetDevilInfoActor_C_IsPlayHpBar, IsPlay) == 0x000000, "Member 'BattleTargetDevilInfoActor_C_IsPlayHpBar::IsPlay' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_IsPlayHpBar, CallFunc_GetWidget_HPBar_Widget) == 0x000008, "Member 'BattleTargetDevilInfoActor_C_IsPlayHpBar::CallFunc_GetWidget_HPBar_Widget' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_IsPlayHpBar, CallFunc_IsPlayDamageAnim_m_PlayDamageAnim) == 0x000010, "Member 'BattleTargetDevilInfoActor_C_IsPlayHpBar::CallFunc_IsPlayDamageAnim_m_PlayDamageAnim' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_IsPlayHpBar, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BattleTargetDevilInfoActor_C_IsPlayHpBar::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BattleTargetDevilInfoActor.BattleTargetDevilInfoActor_C.StopPlayHpBar
// 0x0010 (0x0010 - 0x0000)
struct BattleTargetDevilInfoActor_C_StopPlayHpBar final
{
public:
	class UWB_BtlTargetDevil_HP_C*                CallFunc_GetWidget_HPBar_Widget;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleTargetDevilInfoActor_C_StopPlayHpBar) == 0x000008, "Wrong alignment on BattleTargetDevilInfoActor_C_StopPlayHpBar");
static_assert(sizeof(BattleTargetDevilInfoActor_C_StopPlayHpBar) == 0x000010, "Wrong size on BattleTargetDevilInfoActor_C_StopPlayHpBar");
static_assert(offsetof(BattleTargetDevilInfoActor_C_StopPlayHpBar, CallFunc_GetWidget_HPBar_Widget) == 0x000000, "Member 'BattleTargetDevilInfoActor_C_StopPlayHpBar::CallFunc_GetWidget_HPBar_Widget' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_StopPlayHpBar, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BattleTargetDevilInfoActor_C_StopPlayHpBar::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BattleTargetDevilInfoActor.BattleTargetDevilInfoActor_C.DrawSwitch_HpBar
// 0x0030 (0x0030 - 0x0000)
struct BattleTargetDevilInfoActor_C_DrawSwitch_HpBar final
{
public:
	bool                                          Sw;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UsingDamage;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Use2Line;                                          // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Immediately;                                       // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsUseSkipTarget;                                   // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Lo_Switch;                                         // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_402C[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtlTargetDevil_HP_C*                CallFunc_GetWidget_HPBar_Widget;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IWBPI_BtlCommon_C>     CallFunc_Disappear_self_CastInput;                 // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IWBPI_BtlCommon_C>     CallFunc_Appear_self_CastInput;                    // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleTargetDevilInfoActor_C_DrawSwitch_HpBar) == 0x000008, "Wrong alignment on BattleTargetDevilInfoActor_C_DrawSwitch_HpBar");
static_assert(sizeof(BattleTargetDevilInfoActor_C_DrawSwitch_HpBar) == 0x000030, "Wrong size on BattleTargetDevilInfoActor_C_DrawSwitch_HpBar");
static_assert(offsetof(BattleTargetDevilInfoActor_C_DrawSwitch_HpBar, Sw) == 0x000000, "Member 'BattleTargetDevilInfoActor_C_DrawSwitch_HpBar::Sw' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_DrawSwitch_HpBar, UsingDamage) == 0x000001, "Member 'BattleTargetDevilInfoActor_C_DrawSwitch_HpBar::UsingDamage' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_DrawSwitch_HpBar, Use2Line) == 0x000002, "Member 'BattleTargetDevilInfoActor_C_DrawSwitch_HpBar::Use2Line' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_DrawSwitch_HpBar, Immediately) == 0x000003, "Member 'BattleTargetDevilInfoActor_C_DrawSwitch_HpBar::Immediately' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_DrawSwitch_HpBar, IsUseSkipTarget) == 0x000004, "Member 'BattleTargetDevilInfoActor_C_DrawSwitch_HpBar::IsUseSkipTarget' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_DrawSwitch_HpBar, Lo_Switch) == 0x000005, "Member 'BattleTargetDevilInfoActor_C_DrawSwitch_HpBar::Lo_Switch' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_DrawSwitch_HpBar, CallFunc_GetWidget_HPBar_Widget) == 0x000008, "Member 'BattleTargetDevilInfoActor_C_DrawSwitch_HpBar::CallFunc_GetWidget_HPBar_Widget' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_DrawSwitch_HpBar, CallFunc_Disappear_self_CastInput) == 0x000010, "Member 'BattleTargetDevilInfoActor_C_DrawSwitch_HpBar::CallFunc_Disappear_self_CastInput' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_DrawSwitch_HpBar, CallFunc_Appear_self_CastInput) == 0x000020, "Member 'BattleTargetDevilInfoActor_C_DrawSwitch_HpBar::CallFunc_Appear_self_CastInput' has a wrong offset!");

// Function BattleTargetDevilInfoActor.BattleTargetDevilInfoActor_C.GetPartyData_Hp
// 0x04C0 (0x04C0 - 0x0000)
struct BattleTargetDevilInfoActor_C_GetPartyData_Hp final
{
public:
	int32                                         PartyIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Hp;                                                // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HpMax;                                             // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAnalyzed;                                        // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Lo_Analyzed;                                       // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_GetBIMainWork_retValue;                   // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_CheckBossRushChallengeMode_ret;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_402D[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_GetBIPartySystem_ret;                     // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_CheckMagatsuhiDevil_ret;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_402E[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnalyzeData                           CallFunc_BI_GetMitamaAnalyzeData_analyzeData;      // 0x0040(0x0050)()
	bool                                          CallFunc_BI_CheckMitama_ret;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_402F[0x6];                                     // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_GetBIPartySystem_ret_1;                   // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4030[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlParty                              CallFunc_BI_GetPartyData_retValue;                 // 0x00B0(0x0320)()
	bool                                          CallFunc_Analyze_CheckIsOpenAnalyze_ReturnValue;   // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4031[0x7];                                     // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEnemyData                             CallFunc_GetEnemyBaseData_ReturnValue;             // 0x03D8(0x00D8)(ConstParm)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x04B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x04B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x04B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x04B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleTargetDevilInfoActor_C_GetPartyData_Hp) == 0x000010, "Wrong alignment on BattleTargetDevilInfoActor_C_GetPartyData_Hp");
static_assert(sizeof(BattleTargetDevilInfoActor_C_GetPartyData_Hp) == 0x0004C0, "Wrong size on BattleTargetDevilInfoActor_C_GetPartyData_Hp");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, PartyIndex) == 0x000000, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::PartyIndex' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, Hp) == 0x000004, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::Hp' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, HpMax) == 0x000008, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::HpMax' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, IsAnalyzed) == 0x00000C, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::IsAnalyzed' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, Lo_Analyzed) == 0x00000D, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::Lo_Analyzed' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, Temp_bool_Variable) == 0x00000E, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, Temp_bool_Variable_1) == 0x00000F, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, CallFunc_GetBIMainWork_retValue) == 0x000010, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::CallFunc_GetBIMainWork_retValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, CallFunc_BI_CheckBossRushChallengeMode_ret) == 0x000020, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::CallFunc_BI_CheckBossRushChallengeMode_ret' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, CallFunc_GetBIPartySystem_ret) == 0x000028, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::CallFunc_GetBIPartySystem_ret' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, CallFunc_BI_CheckMagatsuhiDevil_ret) == 0x000038, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::CallFunc_BI_CheckMagatsuhiDevil_ret' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000039, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, CallFunc_BI_GetMitamaAnalyzeData_analyzeData) == 0x000040, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::CallFunc_BI_GetMitamaAnalyzeData_analyzeData' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, CallFunc_BI_CheckMitama_ret) == 0x000090, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::CallFunc_BI_CheckMitama_ret' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, CallFunc_BooleanOR_ReturnValue) == 0x000091, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, CallFunc_GetBIPartySystem_ret_1) == 0x000098, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::CallFunc_GetBIPartySystem_ret_1' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, CallFunc_BooleanOR_ReturnValue_1) == 0x0000A8, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, CallFunc_BI_GetPartyData_retValue) == 0x0000B0, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::CallFunc_BI_GetPartyData_retValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, CallFunc_Analyze_CheckIsOpenAnalyze_ReturnValue) == 0x0003D0, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::CallFunc_Analyze_CheckIsOpenAnalyze_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, CallFunc_GetEnemyBaseData_ReturnValue) == 0x0003D8, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::CallFunc_GetEnemyBaseData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0004B0, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, CallFunc_Conv_IntToBool_ReturnValue) == 0x0004B4, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, CallFunc_Not_PreBool_ReturnValue) == 0x0004B5, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, CallFunc_BooleanAND_ReturnValue) == 0x0004B6, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetPartyData_Hp, K2Node_Select_Default) == 0x0004B7, "Member 'BattleTargetDevilInfoActor_C_GetPartyData_Hp::K2Node_Select_Default' has a wrong offset!");

// Function BattleTargetDevilInfoActor.BattleTargetDevilInfoActor_C.UpDateHpBar
// 0x0020 (0x0020 - 0x0000)
struct BattleTargetDevilInfoActor_C_UpDateHpBar final
{
public:
	bool                                          UpdateHPGauge;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4032[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtlTargetDevil_HP_C*                CallFunc_GetWidget_HPBar_Widget;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4033[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPartyData_Hp_Hp;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPartyData_Hp_HpMax;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPartyData_Hp_IsAnalyzed;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleTargetDevilInfoActor_C_UpDateHpBar) == 0x000008, "Wrong alignment on BattleTargetDevilInfoActor_C_UpDateHpBar");
static_assert(sizeof(BattleTargetDevilInfoActor_C_UpDateHpBar) == 0x000020, "Wrong size on BattleTargetDevilInfoActor_C_UpDateHpBar");
static_assert(offsetof(BattleTargetDevilInfoActor_C_UpDateHpBar, UpdateHPGauge) == 0x000000, "Member 'BattleTargetDevilInfoActor_C_UpDateHpBar::UpdateHPGauge' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_UpDateHpBar, CallFunc_GetWidget_HPBar_Widget) == 0x000008, "Member 'BattleTargetDevilInfoActor_C_UpDateHpBar::CallFunc_GetWidget_HPBar_Widget' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_UpDateHpBar, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BattleTargetDevilInfoActor_C_UpDateHpBar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_UpDateHpBar, CallFunc_GetPartyData_Hp_Hp) == 0x000014, "Member 'BattleTargetDevilInfoActor_C_UpDateHpBar::CallFunc_GetPartyData_Hp_Hp' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_UpDateHpBar, CallFunc_GetPartyData_Hp_HpMax) == 0x000018, "Member 'BattleTargetDevilInfoActor_C_UpDateHpBar::CallFunc_GetPartyData_Hp_HpMax' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_UpDateHpBar, CallFunc_GetPartyData_Hp_IsAnalyzed) == 0x00001C, "Member 'BattleTargetDevilInfoActor_C_UpDateHpBar::CallFunc_GetPartyData_Hp_IsAnalyzed' has a wrong offset!");

// Function BattleTargetDevilInfoActor.BattleTargetDevilInfoActor_C.DrawSwitch_HpBarIsDraw
// 0x0030 (0x0030 - 0x0000)
struct BattleTargetDevilInfoActor_C_DrawSwitch_HpBarIsDraw final
{
public:
	bool                                          Sw;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4034[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtlTargetDevil_HP_C*                CallFunc_GetWidget_HPBar_Widget;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IWBPI_BtlCommon_C>     CallFunc_Disappear_self_CastInput;                 // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IWBPI_BtlCommon_C>     CallFunc_Appear_self_CastInput;                    // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleTargetDevilInfoActor_C_DrawSwitch_HpBarIsDraw) == 0x000008, "Wrong alignment on BattleTargetDevilInfoActor_C_DrawSwitch_HpBarIsDraw");
static_assert(sizeof(BattleTargetDevilInfoActor_C_DrawSwitch_HpBarIsDraw) == 0x000030, "Wrong size on BattleTargetDevilInfoActor_C_DrawSwitch_HpBarIsDraw");
static_assert(offsetof(BattleTargetDevilInfoActor_C_DrawSwitch_HpBarIsDraw, Sw) == 0x000000, "Member 'BattleTargetDevilInfoActor_C_DrawSwitch_HpBarIsDraw::Sw' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_DrawSwitch_HpBarIsDraw, CallFunc_GetWidget_HPBar_Widget) == 0x000008, "Member 'BattleTargetDevilInfoActor_C_DrawSwitch_HpBarIsDraw::CallFunc_GetWidget_HPBar_Widget' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_DrawSwitch_HpBarIsDraw, CallFunc_Disappear_self_CastInput) == 0x000010, "Member 'BattleTargetDevilInfoActor_C_DrawSwitch_HpBarIsDraw::CallFunc_Disappear_self_CastInput' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_DrawSwitch_HpBarIsDraw, CallFunc_Appear_self_CastInput) == 0x000020, "Member 'BattleTargetDevilInfoActor_C_DrawSwitch_HpBarIsDraw::CallFunc_Appear_self_CastInput' has a wrong offset!");

// Function BattleTargetDevilInfoActor.BattleTargetDevilInfoActor_C.SetCharaData
// 0x0520 (0x0520 - 0x0000)
struct BattleTargetDevilInfoActor_C_SetCharaData final
{
public:
	E_UI_STATUS_ESSENCE_ICON                      CallFunc_Calc_Utsusemi_status_Status;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUtsusemiInShop_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4035[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPartyData_Hp_Hp;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPartyData_Hp_HpMax;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPartyData_Hp_IsAnalyzed;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckUniteBibleEntry_ReturnValue;         // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4036[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaBase_C*                           CallFunc_FindUnit_retValue;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0090(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4037[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x0120(0x0030)(IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UWB_BtlTargetDevil_HP_C*                CallFunc_GetWidget_HPBar_Widget;                   // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UWB_BtlTargetDevil_Info_C*              CallFunc_GetWidget_Name_Widget;                    // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_GetBIPartySystem_ret;                     // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_GetBIPartySystem_ret_1;                   // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_IsUplifting_Ret;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_IsExistInParty_IsExist;                // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4038[0x2];                                     // 0x01C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BI_GetBadStatus_retValue;                 // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4039[0x4];                                     // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlParty                              CallFunc_BI_GetPartyData_retValue;                 // 0x01D0(0x0320)()
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x04F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BI_GetCharaID_retValue;                   // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_403A[0x4];                                     // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_GetBIPartySystem_ret_2;                   // 0x0500(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BTL_SIDE                                    CallFunc_BI_GetSide_side;                          // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleTargetDevilInfoActor_C_SetCharaData) == 0x000010, "Wrong alignment on BattleTargetDevilInfoActor_C_SetCharaData");
static_assert(sizeof(BattleTargetDevilInfoActor_C_SetCharaData) == 0x000520, "Wrong size on BattleTargetDevilInfoActor_C_SetCharaData");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_Calc_Utsusemi_status_Status) == 0x000000, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_Calc_Utsusemi_status_Status' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_IsUtsusemiInShop_ReturnValue) == 0x000001, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_IsUtsusemiInShop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_GetPartyData_Hp_Hp) == 0x000018, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_GetPartyData_Hp_Hp' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_GetPartyData_Hp_HpMax) == 0x00001C, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_GetPartyData_Hp_HpMax' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_GetPartyData_Hp_IsAnalyzed) == 0x000020, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_GetPartyData_Hp_IsAnalyzed' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_Less_IntInt_ReturnValue) == 0x000022, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_CheckUniteBibleEntry_ReturnValue) == 0x000023, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_CheckUniteBibleEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_FindUnit_retValue) == 0x000028, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_FindUnit_retValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_GetSocketTransform_ReturnValue) == 0x000060, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000090, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000118, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_GetSocketTransform_ReturnValue_1) == 0x000120, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_GetSocketTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_Conv_IntToString_ReturnValue) == 0x000150, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_GetWidget_HPBar_Widget) == 0x000160, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_GetWidget_HPBar_Widget' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_Concat_StrStr_ReturnValue) == 0x000168, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000178, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_GetWidget_Name_Widget) == 0x000188, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_GetWidget_Name_Widget' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000190, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_GetBIPartySystem_ret) == 0x0001A0, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_GetBIPartySystem_ret' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_GetBIPartySystem_ret_1) == 0x0001B0, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_GetBIPartySystem_ret_1' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_BI_IsUplifting_Ret) == 0x0001C0, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_BI_IsUplifting_Ret' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_BI_IsExistInParty_IsExist) == 0x0001C1, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_BI_IsExistInParty_IsExist' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_BI_GetBadStatus_retValue) == 0x0001C4, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_BI_GetBadStatus_retValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_SelectInt_ReturnValue) == 0x0001C8, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_BI_GetPartyData_retValue) == 0x0001D0, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_BI_GetPartyData_retValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_SelectInt_ReturnValue_1) == 0x0004F0, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_SelectInt_ReturnValue_2) == 0x0004F4, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_BI_GetCharaID_retValue) == 0x0004F8, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_BI_GetCharaID_retValue' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_GetBIPartySystem_ret_2) == 0x000500, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_GetBIPartySystem_ret_2' has a wrong offset!");
static_assert(offsetof(BattleTargetDevilInfoActor_C_SetCharaData, CallFunc_BI_GetSide_side) == 0x000510, "Member 'BattleTargetDevilInfoActor_C_SetCharaData::CallFunc_BI_GetSide_side' has a wrong offset!");

// Function BattleTargetDevilInfoActor.BattleTargetDevilInfoActor_C.GetWidget_Name
// 0x0008 (0x0008 - 0x0000)
struct BattleTargetDevilInfoActor_C_GetWidget_Name final
{
public:
	class UWB_BtlTargetDevil_Info_C*              Widget;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleTargetDevilInfoActor_C_GetWidget_Name) == 0x000008, "Wrong alignment on BattleTargetDevilInfoActor_C_GetWidget_Name");
static_assert(sizeof(BattleTargetDevilInfoActor_C_GetWidget_Name) == 0x000008, "Wrong size on BattleTargetDevilInfoActor_C_GetWidget_Name");
static_assert(offsetof(BattleTargetDevilInfoActor_C_GetWidget_Name, Widget) == 0x000000, "Member 'BattleTargetDevilInfoActor_C_GetWidget_Name::Widget' has a wrong offset!");

// Function BattleTargetDevilInfoActor.BattleTargetDevilInfoActor_C.DrawSwitch_Name
// 0x0030 (0x0030 - 0x0000)
struct BattleTargetDevilInfoActor_C_DrawSwitch_Name final
{
public:
	bool                                          Sw;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
