#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleEventBase

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "E_MoonAgeAnimationState_structs.hpp"
#include "BattleMapDark_T_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BattleEventBase.BattleEventBase_C.ExecuteUbergraph_BattleEventBase
// 0x0228 (0x0228 - 0x0000)
struct BattleEventBase_C_ExecuteUbergraph_BattleEventBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3922[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3923[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Step;                           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Step)>                   K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Com_CallSkillPerformance_ComIndex;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3924[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleTaskFactory_C> CallFunc_BIGetTaskFactory_retValue;                // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_DestroyTaskForPecID_isSuccess;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3925[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3926[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_BIGetMainWork_NewParam;                   // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BI_BattleCameraCurrentForce_retValue;     // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3927[0x6];                                     // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_OPTION_COMMON_SELECT_TYPE                   CallFunc_GetSkillDisplayPanelType_ReturnValue;     // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3928[0x5];                                     // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_BIGetMainWork_NewParam_1;                 // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_PartyPanelSetVisibility_retValue;      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3929[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_BIGetMainWork_NewParam_2;                 // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_392A[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleUIManager_C> CallFunc_BI_GetBattleUIManager_Ret;                // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_UpliftingGaugeSlideIn_Ret;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_PressIconSlideIn_Ret;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_392B[0x1];                                     // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_BIGetMainWork_NewParam_3;                 // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_CustomEvent_MapDarkID;                      // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BI_BattleUISwitch_NoUse;                  // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_392C[0x3];                                     // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBattleMapDark_T                       CallFunc_GetMapDark_MapDark;                       // 0x00F8(0x0060)(HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	class AEncountActor_New_C*                    CallFunc_GetActorOfClass_ReturnValue;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_BIGetPartySystem_retValue;                // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_UnitSetVisibility_retValue;            // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_392D[0x4];                                     // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_BIGetPartySystem_retValue_1;              // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_BIGetMainWork_NewParam_4;                 // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BI_GetEnemyLeaderIndex_PartyIndex;        // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_392E[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleUIManager_C> CallFunc_BI_GetBattleUIManager_Ret_1;              // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_GetMainUIDisappeared_PressIcon;        // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_GetMainUIDisappeared_Uplifting;        // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_MoonAgeAnimationState                       CallFunc_MoonAge_getAnimationState_outState;       // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x01C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_392F[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialParameterApplier*              K2Node_DynamicCast_AsMaterial_Parameter_Applier;   // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3930[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_BIGetMainWork_NewParam_5;                 // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_BattleUIManager_C> CallFunc_BI_GetBattleUIManager_Ret_2;              // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_PressIconAreAllShown_Shown;            // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3931[0x5];                                     // 0x0203(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3932[0x3];                                     // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0214(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase) == 0x000008, "Wrong alignment on BattleEventBase_C_ExecuteUbergraph_BattleEventBase");
static_assert(sizeof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase) == 0x000228, "Wrong size on BattleEventBase_C_ExecuteUbergraph_BattleEventBase");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, EntryPoint) == 0x000000, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, Temp_object_Variable) == 0x000010, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, K2Node_DynamicCast_AsParticle_System) == 0x000018, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::K2Node_DynamicCast_AsParticle_System' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, K2Node_CustomEvent_Step) == 0x00002C, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::K2Node_CustomEvent_Step' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_Com_CallSkillPerformance_ComIndex) == 0x000040, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_Com_CallSkillPerformance_ComIndex' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BIGetTaskFactory_retValue) == 0x000048, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BIGetTaskFactory_retValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BI_DestroyTaskForPecID_isSuccess) == 0x000058, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BI_DestroyTaskForPecID_isSuccess' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_Array_Get_Item) == 0x000060, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BIGetMainWork_NewParam) == 0x000070, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BIGetMainWork_NewParam' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, K2Node_Event_EndPlayReason) == 0x000080, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BI_BattleCameraCurrentForce_retValue) == 0x000081, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BI_BattleCameraCurrentForce_retValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_Get_ReturnValue) == 0x000088, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_IsValid_ReturnValue_1) == 0x000090, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_GetSkillDisplayPanelType_ReturnValue) == 0x000091, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_GetSkillDisplayPanelType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000092, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BIGetMainWork_NewParam_1) == 0x000098, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BIGetMainWork_NewParam_1' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BI_PartyPanelSetVisibility_retValue) == 0x0000A8, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BI_PartyPanelSetVisibility_retValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BIGetMainWork_NewParam_2) == 0x0000B0, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BIGetMainWork_NewParam_2' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, Temp_int_Loop_Counter_Variable) == 0x0000C0, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BI_GetBattleUIManager_Ret) == 0x0000C8, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BI_GetBattleUIManager_Ret' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BI_UpliftingGaugeSlideIn_Ret) == 0x0000D8, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BI_UpliftingGaugeSlideIn_Ret' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BI_PressIconSlideIn_Ret) == 0x0000D9, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BI_PressIconSlideIn_Ret' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_Less_IntInt_ReturnValue) == 0x0000DA, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_Add_IntInt_ReturnValue) == 0x0000DC, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BIGetMainWork_NewParam_3) == 0x0000E0, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BIGetMainWork_NewParam_3' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, K2Node_CustomEvent_MapDarkID) == 0x0000F0, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::K2Node_CustomEvent_MapDarkID' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BI_BattleUISwitch_NoUse) == 0x0000F4, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BI_BattleUISwitch_NoUse' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_GetMapDark_MapDark) == 0x0000F8, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_GetMapDark_MapDark' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x000158, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_GetActorOfClass_ReturnValue) == 0x000168, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BIGetPartySystem_retValue) == 0x000170, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BIGetPartySystem_retValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_IsValid_ReturnValue_2) == 0x000180, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000181, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000182, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BI_UnitSetVisibility_retValue) == 0x000183, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BI_UnitSetVisibility_retValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BIGetPartySystem_retValue_1) == 0x000188, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BIGetPartySystem_retValue_1' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BIGetMainWork_NewParam_4) == 0x000198, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BIGetMainWork_NewParam_4' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BI_GetEnemyLeaderIndex_PartyIndex) == 0x0001A8, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BI_GetEnemyLeaderIndex_PartyIndex' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BI_GetBattleUIManager_Ret_1) == 0x0001B0, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BI_GetBattleUIManager_Ret_1' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BI_GetMainUIDisappeared_PressIcon) == 0x0001C0, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BI_GetMainUIDisappeared_PressIcon' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BI_GetMainUIDisappeared_Uplifting) == 0x0001C1, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BI_GetMainUIDisappeared_Uplifting' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_MoonAge_getAnimationState_outState) == 0x0001C2, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_MoonAge_getAnimationState_outState' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0001C3, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, Temp_object_Variable_1) == 0x0001C8, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, K2Node_DynamicCast_AsMaterial_Parameter_Applier) == 0x0001D0, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::K2Node_DynamicCast_AsMaterial_Parameter_Applier' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, K2Node_DynamicCast_bSuccess_1) == 0x0001D8, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BIGetMainWork_NewParam_5) == 0x0001E0, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BIGetMainWork_NewParam_5' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BI_GetBattleUIManager_Ret_2) == 0x0001F0, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BI_GetBattleUIManager_Ret_2' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BI_PressIconAreAllShown_Shown) == 0x000200, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BI_PressIconAreAllShown_Shown' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000201, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000202, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, K2Node_CustomEvent_Loaded_1) == 0x000208, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, CallFunc_BooleanOR_ReturnValue) == 0x000210, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_ExecuteUbergraph_BattleEventBase, K2Node_CreateDelegate_OutputDelegate_2) == 0x000214, "Member 'BattleEventBase_C_ExecuteUbergraph_BattleEventBase::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function BattleEventBase.BattleEventBase_C.ChangeMapDark
// 0x0004 (0x0004 - 0x0000)
struct BattleEventBase_C_ChangeMapDark final
{
public:
	int32                                         MapDarkID;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleEventBase_C_ChangeMapDark) == 0x000004, "Wrong alignment on BattleEventBase_C_ChangeMapDark");
static_assert(sizeof(BattleEventBase_C_ChangeMapDark) == 0x000004, "Wrong size on BattleEventBase_C_ChangeMapDark");
static_assert(offsetof(BattleEventBase_C_ChangeMapDark, MapDarkID) == 0x000000, "Member 'BattleEventBase_C_ChangeMapDark::MapDarkID' has a wrong offset!");

// Function BattleEventBase.BattleEventBase_C.SkillPerformance
// 0x0004 (0x0004 - 0x0000)
struct BattleEventBase_C_SkillPerformance final
{
public:
	int32                                         Step;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleEventBase_C_SkillPerformance) == 0x000004, "Wrong alignment on BattleEventBase_C_SkillPerformance");
static_assert(sizeof(BattleEventBase_C_SkillPerformance) == 0x000004, "Wrong size on BattleEventBase_C_SkillPerformance");
static_assert(offsetof(BattleEventBase_C_SkillPerformance, Step) == 0x000000, "Member 'BattleEventBase_C_SkillPerformance::Step' has a wrong offset!");

// Function BattleEventBase.BattleEventBase_C.OnLoaded_95DAFE7A4A94AE576557D68F5830014E
// 0x0008 (0x0008 - 0x0000)
struct BattleEventBase_C_OnLoaded_95DAFE7A4A94AE576557D68F5830014E final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleEventBase_C_OnLoaded_95DAFE7A4A94AE576557D68F5830014E) == 0x000008, "Wrong alignment on BattleEventBase_C_OnLoaded_95DAFE7A4A94AE576557D68F5830014E");
static_assert(sizeof(BattleEventBase_C_OnLoaded_95DAFE7A4A94AE576557D68F5830014E) == 0x000008, "Wrong size on BattleEventBase_C_OnLoaded_95DAFE7A4A94AE576557D68F5830014E");
static_assert(offsetof(BattleEventBase_C_OnLoaded_95DAFE7A4A94AE576557D68F5830014E, Loaded) == 0x000000, "Member 'BattleEventBase_C_OnLoaded_95DAFE7A4A94AE576557D68F5830014E::Loaded' has a wrong offset!");

// Function BattleEventBase.BattleEventBase_C.OnLoaded_72AB40BC4E27ED6497B1CE842D1E4D51
// 0x0008 (0x0008 - 0x0000)
struct BattleEventBase_C_OnLoaded_72AB40BC4E27ED6497B1CE842D1E4D51 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleEventBase_C_OnLoaded_72AB40BC4E27ED6497B1CE842D1E4D51) == 0x000008, "Wrong alignment on BattleEventBase_C_OnLoaded_72AB40BC4E27ED6497B1CE842D1E4D51");
static_assert(sizeof(BattleEventBase_C_OnLoaded_72AB40BC4E27ED6497B1CE842D1E4D51) == 0x000008, "Wrong size on BattleEventBase_C_OnLoaded_72AB40BC4E27ED6497B1CE842D1E4D51");
static_assert(offsetof(BattleEventBase_C_OnLoaded_72AB40BC4E27ED6497B1CE842D1E4D51, Loaded) == 0x000000, "Member 'BattleEventBase_C_OnLoaded_72AB40BC4E27ED6497B1CE842D1E4D51::Loaded' has a wrong offset!");

// Function BattleEventBase.BattleEventBase_C.StartEvent
// 0x00F0 (0x00F0 - 0x0000)
struct BattleEventBase_C_StartEvent final
{
public:
	class UDataTable*                             ScriptDataTable;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MessageAsset;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBossRush_BossRush;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBossRush_BossRush_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3933[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActorPartyIndex_index;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           CallFunc_FindUnit_Unit;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3934[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameVolume_ReturnValue;                // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3935[0xB];                                     // 0x00A5(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventScript_C*                      CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleEventBase_C_StartEvent) == 0x000010, "Wrong alignment on BattleEventBase_C_StartEvent");
static_assert(sizeof(BattleEventBase_C_StartEvent) == 0x0000F0, "Wrong size on BattleEventBase_C_StartEvent");
static_assert(offsetof(BattleEventBase_C_StartEvent, ScriptDataTable) == 0x000000, "Member 'BattleEventBase_C_StartEvent::ScriptDataTable' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_StartEvent, MessageAsset) == 0x000008, "Member 'BattleEventBase_C_StartEvent::MessageAsset' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_StartEvent, CallFunc_IsBossRush_BossRush) == 0x000010, "Member 'BattleEventBase_C_StartEvent::CallFunc_IsBossRush_BossRush' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_StartEvent, CallFunc_IsBossRush_BossRush_1) == 0x000011, "Member 'BattleEventBase_C_StartEvent::CallFunc_IsBossRush_BossRush_1' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_StartEvent, CallFunc_GetActorPartyIndex_index) == 0x000014, "Member 'BattleEventBase_C_StartEvent::CallFunc_GetActorPartyIndex_index' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_StartEvent, CallFunc_FindUnit_Unit) == 0x000018, "Member 'BattleEventBase_C_StartEvent::CallFunc_FindUnit_Unit' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_StartEvent, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'BattleEventBase_C_StartEvent::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_StartEvent, CallFunc_GetViewTarget_ReturnValue) == 0x000028, "Member 'BattleEventBase_C_StartEvent::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_StartEvent, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'BattleEventBase_C_StartEvent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_StartEvent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000038, "Member 'BattleEventBase_C_StartEvent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_StartEvent, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000040, "Member 'BattleEventBase_C_StartEvent::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_StartEvent, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'BattleEventBase_C_StartEvent::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_StartEvent, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'BattleEventBase_C_StartEvent::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_StartEvent, CallFunc_GetPlayerController_ReturnValue_1) == 0x000080, "Member 'BattleEventBase_C_StartEvent::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_StartEvent, CallFunc_Get_ReturnValue) == 0x000088, "Member 'BattleEventBase_C_StartEvent::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_StartEvent, CallFunc_GetGameVolume_ReturnValue) == 0x000090, "Member 'BattleEventBase_C_StartEvent::CallFunc_GetGameVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_StartEvent, K2Node_CreateDelegate_OutputDelegate) == 0x000094, "Member 'BattleEventBase_C_StartEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_StartEvent, CallFunc_IsValid_ReturnValue) == 0x0000A4, "Member 'BattleEventBase_C_StartEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_StartEvent, CallFunc_MakeTransform_ReturnValue) == 0x0000B0, "Member 'BattleEventBase_C_StartEvent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_StartEvent, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0000E0, "Member 'BattleEventBase_C_StartEvent::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_StartEvent, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0000E8, "Member 'BattleEventBase_C_StartEvent::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");

// Function BattleEventBase.BattleEventBase_C.AddCamera
// 0x05F0 (0x05F0 - 0x0000)
struct BattleEventBase_C_AddCamera final
{
public:
	struct FTransform                             WorldTransform;                                    // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class FName                                   Tag;                                               // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Lo_Tag;                                            // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ACameraActor*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings;             // 0x0080(0x0560)()
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3936[0x3];                                     // 0x05E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleEventBase_C_AddCamera) == 0x000010, "Wrong alignment on BattleEventBase_C_AddCamera");
static_assert(sizeof(BattleEventBase_C_AddCamera) == 0x0005F0, "Wrong size on BattleEventBase_C_AddCamera");
static_assert(offsetof(BattleEventBase_C_AddCamera, WorldTransform) == 0x000000, "Member 'BattleEventBase_C_AddCamera::WorldTransform' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_AddCamera, Tag) == 0x000030, "Member 'BattleEventBase_C_AddCamera::Tag' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_AddCamera, Lo_Tag) == 0x000038, "Member 'BattleEventBase_C_AddCamera::Lo_Tag' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_AddCamera, CallFunc_Conv_NameToString_ReturnValue) == 0x000040, "Member 'BattleEventBase_C_AddCamera::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_AddCamera, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'BattleEventBase_C_AddCamera::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_AddCamera, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'BattleEventBase_C_AddCamera::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_AddCamera, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000068, "Member 'BattleEventBase_C_AddCamera::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_AddCamera, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'BattleEventBase_C_AddCamera::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_AddCamera, K2Node_MakeStruct_PostProcessSettings) == 0x000080, "Member 'BattleEventBase_C_AddCamera::K2Node_MakeStruct_PostProcessSettings' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_AddCamera, CallFunc_Array_AddUnique_ReturnValue) == 0x0005E0, "Member 'BattleEventBase_C_AddCamera::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_AddCamera, CallFunc_Array_AddUnique_ReturnValue_1) == 0x0005E4, "Member 'BattleEventBase_C_AddCamera::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_AddCamera, CallFunc_Array_Contains_ReturnValue) == 0x0005E8, "Member 'BattleEventBase_C_AddCamera::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_AddCamera, CallFunc_Array_Add_ReturnValue) == 0x0005EC, "Member 'BattleEventBase_C_AddCamera::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BattleEventBase.BattleEventBase_C.CalcEnemyWorldTrans
// 0x0190 (0x0190 - 0x0000)
struct BattleEventBase_C_CalcEnemyWorldTrans final
{
public:
	class FName                                   LookAtSocket;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OffsetLocation;                                    // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3937[0xC];                                     // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trans;                                             // 0x0020(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
	struct FVector                                Lo_CameraPos;                                      // 0x0050(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Lo_EnemyCenter;                                    // 0x005C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 Lo_ExistEnemies;                                   // 0x0068(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	float                                         CallFunc_BreakVector_X;                            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromXZ_ReturnValue;                // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3938[0x8];                                     // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_BIGetPartySystem_retValue;                // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_IsExist_retValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3939[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BI_const_GetEnemyLoopMax_retValue;        // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_393A[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BI_const_GetEnemyStart_retValue;          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTargetCenter_Pos;                      // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTargetCenter_Normal;                   // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTargetCenter_forward;                  // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTargetCenter_DefenseArea;              // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleEventBase_C_CalcEnemyWorldTrans) == 0x000010, "Wrong alignment on BattleEventBase_C_CalcEnemyWorldTrans");
static_assert(sizeof(BattleEventBase_C_CalcEnemyWorldTrans) == 0x000190, "Wrong size on BattleEventBase_C_CalcEnemyWorldTrans");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, LookAtSocket) == 0x000000, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::LookAtSocket' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, OffsetLocation) == 0x000008, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::OffsetLocation' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, Trans) == 0x000020, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::Trans' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, Lo_CameraPos) == 0x000050, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::Lo_CameraPos' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, Lo_EnemyCenter) == 0x00005C, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::Lo_EnemyCenter' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, Lo_ExistEnemies) == 0x000068, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::Lo_ExistEnemies' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_BreakVector_X) == 0x000078, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_BreakVector_Y) == 0x00007C, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_BreakVector_Z) == 0x000080, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000084, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, Temp_int_Variable) == 0x000088, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_MakeVector_ReturnValue) == 0x000090, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00009C, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_MakeRotFromXZ_ReturnValue) == 0x0000A8, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_MakeRotFromXZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_Array_AddUnique_ReturnValue) == 0x0000B4, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_MakeTransform_ReturnValue) == 0x0000C0, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_BIGetPartySystem_retValue) == 0x0000F0, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_BIGetPartySystem_retValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_BI_IsExist_retValue) == 0x000100, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_BI_IsExist_retValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_BI_const_GetEnemyLoopMax_retValue) == 0x000104, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_BI_const_GetEnemyLoopMax_retValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000108, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_BI_const_GetEnemyStart_retValue) == 0x00010C, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_BI_const_GetEnemyStart_retValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_GetTargetCenter_Pos) == 0x000110, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_GetTargetCenter_Pos' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_GetTargetCenter_Normal) == 0x00011C, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_GetTargetCenter_Normal' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_GetTargetCenter_forward) == 0x000128, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_GetTargetCenter_forward' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_GetTargetCenter_DefenseArea) == 0x000134, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_GetTargetCenter_DefenseArea' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_Cross_VectorVector_ReturnValue) == 0x000138, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000144, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000150, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattleEventBase_C_CalcEnemyWorldTrans, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x00015C, "Member 'BattleEventBase_C_CalcEnemyWorldTrans::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
