#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePerformanceSpeedCtrl

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BattlePerformanceSpeedCtrl.BattlePerformanceSpeedCtrl_C.ExecuteUbergraph_BattlePerformanceSpeedCtrl
// 0x000C (0x000C - 0x0000)
struct BattlePerformanceSpeedCtrl_C_ExecuteUbergraph_BattlePerformanceSpeedCtrl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePerformanceSpeedCtrl_C_ExecuteUbergraph_BattlePerformanceSpeedCtrl) == 0x000004, "Wrong alignment on BattlePerformanceSpeedCtrl_C_ExecuteUbergraph_BattlePerformanceSpeedCtrl");
static_assert(sizeof(BattlePerformanceSpeedCtrl_C_ExecuteUbergraph_BattlePerformanceSpeedCtrl) == 0x00000C, "Wrong size on BattlePerformanceSpeedCtrl_C_ExecuteUbergraph_BattlePerformanceSpeedCtrl");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_ExecuteUbergraph_BattlePerformanceSpeedCtrl, EntryPoint) == 0x000000, "Member 'BattlePerformanceSpeedCtrl_C_ExecuteUbergraph_BattlePerformanceSpeedCtrl::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_ExecuteUbergraph_BattlePerformanceSpeedCtrl, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BattlePerformanceSpeedCtrl_C_ExecuteUbergraph_BattlePerformanceSpeedCtrl::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_ExecuteUbergraph_BattlePerformanceSpeedCtrl, K2Node_Event_EndPlayReason) == 0x000008, "Member 'BattlePerformanceSpeedCtrl_C_ExecuteUbergraph_BattlePerformanceSpeedCtrl::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BattlePerformanceSpeedCtrl.BattlePerformanceSpeedCtrl_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BattlePerformanceSpeedCtrl_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePerformanceSpeedCtrl_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BattlePerformanceSpeedCtrl_C_ReceiveEndPlay");
static_assert(sizeof(BattlePerformanceSpeedCtrl_C_ReceiveEndPlay) == 0x000001, "Wrong size on BattlePerformanceSpeedCtrl_C_ReceiveEndPlay");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BattlePerformanceSpeedCtrl_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BattlePerformanceSpeedCtrl.BattlePerformanceSpeedCtrl_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BattlePerformanceSpeedCtrl_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePerformanceSpeedCtrl_C_ReceiveTick) == 0x000004, "Wrong alignment on BattlePerformanceSpeedCtrl_C_ReceiveTick");
static_assert(sizeof(BattlePerformanceSpeedCtrl_C_ReceiveTick) == 0x000004, "Wrong size on BattlePerformanceSpeedCtrl_C_ReceiveTick");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BattlePerformanceSpeedCtrl_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BattlePerformanceSpeedCtrl.BattlePerformanceSpeedCtrl_C.UpdatePerformanceSpeed
// 0x0038 (0x0038 - 0x0000)
struct BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed final
{
public:
	bool                                          Lo_MuteOff;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Lo_MuteOn;                                         // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E25[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Lo_Tempo;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E26[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_BPL_GetBIBattleMain_retValue;             // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPL_GetBIBattleMain_success;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E27[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BI_SetBattlePlayRate_NoUse;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E28[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBattleTempo_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed) == 0x000008, "Wrong alignment on BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed");
static_assert(sizeof(BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed) == 0x000038, "Wrong size on BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed, Lo_MuteOff) == 0x000000, "Member 'BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed::Lo_MuteOff' has a wrong offset!");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed, Lo_MuteOn) == 0x000001, "Member 'BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed::Lo_MuteOn' has a wrong offset!");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed, Lo_Tempo) == 0x000004, "Member 'BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed::Lo_Tempo' has a wrong offset!");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000008, "Member 'BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed, CallFunc_BPL_GetBIBattleMain_retValue) == 0x000010, "Member 'BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed::CallFunc_BPL_GetBIBattleMain_retValue' has a wrong offset!");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed, CallFunc_BPL_GetBIBattleMain_success) == 0x000020, "Member 'BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed::CallFunc_BPL_GetBIBattleMain_success' has a wrong offset!");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000028, "Member 'BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed, CallFunc_BI_SetBattlePlayRate_NoUse) == 0x00002C, "Member 'BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed::CallFunc_BI_SetBattlePlayRate_NoUse' has a wrong offset!");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed, CallFunc_GetBattleTempo_ReturnValue) == 0x000030, "Member 'BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed::CallFunc_GetBattleTempo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000034, "Member 'BattlePerformanceSpeedCtrl_C_UpdatePerformanceSpeed::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function BattlePerformanceSpeedCtrl.BattlePerformanceSpeedCtrl_C.FindUnit
// 0x0040 (0x0040 - 0x0000)
struct BattlePerformanceSpeedCtrl_C_FindUnit final
{
public:
	TScriptInterface<class IBPI_BattleParty_C>    BPI_BattleParty;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         PartyIndex;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E29[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaBase_C*                           Unit;                                              // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharaBaseAccessor_C> CallFunc_BI_GetPartyUnit_retValue;                 // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ACharaBase_C*                           K2Node_DynamicCast_AsChara_Base;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePerformanceSpeedCtrl_C_FindUnit) == 0x000008, "Wrong alignment on BattlePerformanceSpeedCtrl_C_FindUnit");
static_assert(sizeof(BattlePerformanceSpeedCtrl_C_FindUnit) == 0x000040, "Wrong size on BattlePerformanceSpeedCtrl_C_FindUnit");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_FindUnit, BPI_BattleParty) == 0x000000, "Member 'BattlePerformanceSpeedCtrl_C_FindUnit::BPI_BattleParty' has a wrong offset!");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_FindUnit, PartyIndex) == 0x000010, "Member 'BattlePerformanceSpeedCtrl_C_FindUnit::PartyIndex' has a wrong offset!");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_FindUnit, Unit) == 0x000018, "Member 'BattlePerformanceSpeedCtrl_C_FindUnit::Unit' has a wrong offset!");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_FindUnit, CallFunc_BI_GetPartyUnit_retValue) == 0x000020, "Member 'BattlePerformanceSpeedCtrl_C_FindUnit::CallFunc_BI_GetPartyUnit_retValue' has a wrong offset!");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_FindUnit, K2Node_DynamicCast_AsChara_Base) == 0x000030, "Member 'BattlePerformanceSpeedCtrl_C_FindUnit::K2Node_DynamicCast_AsChara_Base' has a wrong offset!");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_FindUnit, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BattlePerformanceSpeedCtrl_C_FindUnit::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BattlePerformanceSpeedCtrl.BattlePerformanceSpeedCtrl_C.IsEnableVoiceProtection
// 0x0020 (0x0020 - 0x0000)
struct BattlePerformanceSpeedCtrl_C_IsEnableVoiceProtection final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E2A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleMain_C*                          K2Node_DynamicCast_AsBattle_Main;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePerformanceSpeedCtrl_C_IsEnableVoiceProtection) == 0x000008, "Wrong alignment on BattlePerformanceSpeedCtrl_C_IsEnableVoiceProtection");
static_assert(sizeof(BattlePerformanceSpeedCtrl_C_IsEnableVoiceProtection) == 0x000020, "Wrong size on BattlePerformanceSpeedCtrl_C_IsEnableVoiceProtection");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_IsEnableVoiceProtection, ReturnValue) == 0x000000, "Member 'BattlePerformanceSpeedCtrl_C_IsEnableVoiceProtection::ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_IsEnableVoiceProtection, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BattlePerformanceSpeedCtrl_C_IsEnableVoiceProtection::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_IsEnableVoiceProtection, K2Node_DynamicCast_AsBattle_Main) == 0x000010, "Member 'BattlePerformanceSpeedCtrl_C_IsEnableVoiceProtection::K2Node_DynamicCast_AsBattle_Main' has a wrong offset!");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_IsEnableVoiceProtection, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BattlePerformanceSpeedCtrl_C_IsEnableVoiceProtection::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BattlePerformanceSpeedCtrl.BattlePerformanceSpeedCtrl_C.UpdateComponent
// 0x0008 (0x0008 - 0x0000)
struct BattlePerformanceSpeedCtrl_C_UpdateComponent final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ContinueUpdate;                                    // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableVoiceProtection_ReturnValue;      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePerformanceSpeedCtrl_C_UpdateComponent) == 0x000004, "Wrong alignment on BattlePerformanceSpeedCtrl_C_UpdateComponent");
static_assert(sizeof(BattlePerformanceSpeedCtrl_C_UpdateComponent) == 0x000008, "Wrong size on BattlePerformanceSpeedCtrl_C_UpdateComponent");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_UpdateComponent, Delta) == 0x000000, "Member 'BattlePerformanceSpeedCtrl_C_UpdateComponent::Delta' has a wrong offset!");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_UpdateComponent, ContinueUpdate) == 0x000004, "Member 'BattlePerformanceSpeedCtrl_C_UpdateComponent::ContinueUpdate' has a wrong offset!");
static_assert(offsetof(BattlePerformanceSpeedCtrl_C_UpdateComponent, CallFunc_IsEnableVoiceProtection_ReturnValue) == 0x000005, "Member 'BattlePerformanceSpeedCtrl_C_UpdateComponent::CallFunc_IsEnableVoiceProtection_ReturnValue' has a wrong offset!");

}

