#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BossRushTalk_Struct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct BossRushTalk_Struct.BossRushTalk_Struct
// 0x0090 (0x0090 - 0x0000)
struct FBossRushTalk_Struct final
{
public:
	int32                                         Event_encount_id_8_D75459D94E1868A75B4C2BA113C832C6; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Select_label_47_BCF8B42D4FBCAD45140B2D916EF1F951;  // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Enemy_explain_label_100_8C2470E845C66874BEA55482A2A59F79; // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Open_flag_42_B83551B349E4612869D33BB598DECBAB;     // 0x0014(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Finish_flag_44_3F338DCB4E3142D61F3DCDBADAE35C25;   // 0x001C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24DB[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             Talk_koshimizu_56_05AD939A47B82F6C6E2C5FBCF09CDE2D; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Talk_tsukuyomi_52_8705F35443581630CB711493C988B89D; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Kenkyuin_flag_60_450124BD4C5C29DA53F42FA04CCEF2F0; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Talk_kenkyuin_55_B50391D449834ED8D5B111B8B7540305; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Timing_flag_old_62_83CC52E944DAAEA51A87DAA01924CDB7; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Timing_flag_new_68_001A4517467DCE692F006CBFFCEB2424; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Talk_koshimizu_before_timing_72_A06C3C394F58C72163FEFCB86520E50B; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Talk_tsukuyomi_before_timing_73_7C4D8A7B4CD7937AD4B2AAB3B38F4B62; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Kenkyuin_flag_before_74_8BE57F3248F056E59280E9AD2AA2FFC5; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Talk_kenkyuin_before_75_9E49FCF14B2C4B19C4B0FB906E28048F; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Prise_item_id_80_3C64B12541EBCB062C571298D831145E; // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Prise_item_num_83_BB69C662490AF6EBE28D5996E3720174; // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Prise_item_id_creation_96_9AC688FD4F4D5B64FD80228C25B97417; // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Prise_item_num_creation_97_408960E64394D6B5106B3D8B12195ABD; // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Challenge_cleared_flag_104_7E120AF345763F90C9EE17B2CF0C2137; // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FBossRushTalk_Struct) == 0x000008, "Wrong alignment on FBossRushTalk_Struct");
static_assert(sizeof(FBossRushTalk_Struct) == 0x000090, "Wrong size on FBossRushTalk_Struct");
static_assert(offsetof(FBossRushTalk_Struct, Event_encount_id_8_D75459D94E1868A75B4C2BA113C832C6) == 0x000000, "Member 'FBossRushTalk_Struct::Event_encount_id_8_D75459D94E1868A75B4C2BA113C832C6' has a wrong offset!");
static_assert(offsetof(FBossRushTalk_Struct, Select_label_47_BCF8B42D4FBCAD45140B2D916EF1F951) == 0x000004, "Member 'FBossRushTalk_Struct::Select_label_47_BCF8B42D4FBCAD45140B2D916EF1F951' has a wrong offset!");
static_assert(offsetof(FBossRushTalk_Struct, Enemy_explain_label_100_8C2470E845C66874BEA55482A2A59F79) == 0x00000C, "Member 'FBossRushTalk_Struct::Enemy_explain_label_100_8C2470E845C66874BEA55482A2A59F79' has a wrong offset!");
static_assert(offsetof(FBossRushTalk_Struct, Open_flag_42_B83551B349E4612869D33BB598DECBAB) == 0x000014, "Member 'FBossRushTalk_Struct::Open_flag_42_B83551B349E4612869D33BB598DECBAB' has a wrong offset!");
static_assert(offsetof(FBossRushTalk_Struct, Finish_flag_44_3F338DCB4E3142D61F3DCDBADAE35C25) == 0x00001C, "Member 'FBossRushTalk_Struct::Finish_flag_44_3F338DCB4E3142D61F3DCDBADAE35C25' has a wrong offset!");
static_assert(offsetof(FBossRushTalk_Struct, Talk_koshimizu_56_05AD939A47B82F6C6E2C5FBCF09CDE2D) == 0x000028, "Member 'FBossRushTalk_Struct::Talk_koshimizu_56_05AD939A47B82F6C6E2C5FBCF09CDE2D' has a wrong offset!");
static_assert(offsetof(FBossRushTalk_Struct, Talk_tsukuyomi_52_8705F35443581630CB711493C988B89D) == 0x000030, "Member 'FBossRushTalk_Struct::Talk_tsukuyomi_52_8705F35443581630CB711493C988B89D' has a wrong offset!");
static_assert(offsetof(FBossRushTalk_Struct, Kenkyuin_flag_60_450124BD4C5C29DA53F42FA04CCEF2F0) == 0x000038, "Member 'FBossRushTalk_Struct::Kenkyuin_flag_60_450124BD4C5C29DA53F42FA04CCEF2F0' has a wrong offset!");
static_assert(offsetof(FBossRushTalk_Struct, Talk_kenkyuin_55_B50391D449834ED8D5B111B8B7540305) == 0x000040, "Member 'FBossRushTalk_Struct::Talk_kenkyuin_55_B50391D449834ED8D5B111B8B7540305' has a wrong offset!");
static_assert(offsetof(FBossRushTalk_Struct, Timing_flag_old_62_83CC52E944DAAEA51A87DAA01924CDB7) == 0x000048, "Member 'FBossRushTalk_Struct::Timing_flag_old_62_83CC52E944DAAEA51A87DAA01924CDB7' has a wrong offset!");
static_assert(offsetof(FBossRushTalk_Struct, Timing_flag_new_68_001A4517467DCE692F006CBFFCEB2424) == 0x000050, "Member 'FBossRushTalk_Struct::Timing_flag_new_68_001A4517467DCE692F006CBFFCEB2424' has a wrong offset!");
static_assert(offsetof(FBossRushTalk_Struct, Talk_koshimizu_before_timing_72_A06C3C394F58C72163FEFCB86520E50B) == 0x000058, "Member 'FBossRushTalk_Struct::Talk_koshimizu_before_timing_72_A06C3C394F58C72163FEFCB86520E50B' has a wrong offset!");
static_assert(offsetof(FBossRushTalk_Struct, Talk_tsukuyomi_before_timing_73_7C4D8A7B4CD7937AD4B2AAB3B38F4B62) == 0x000060, "Member 'FBossRushTalk_Struct::Talk_tsukuyomi_before_timing_73_7C4D8A7B4CD7937AD4B2AAB3B38F4B62' has a wrong offset!");
static_assert(offsetof(FBossRushTalk_Struct, Kenkyuin_flag_before_74_8BE57F3248F056E59280E9AD2AA2FFC5) == 0x000068, "Member 'FBossRushTalk_Struct::Kenkyuin_flag_before_74_8BE57F3248F056E59280E9AD2AA2FFC5' has a wrong offset!");
static_assert(offsetof(FBossRushTalk_Struct, Talk_kenkyuin_before_75_9E49FCF14B2C4B19C4B0FB906E28048F) == 0x000070, "Member 'FBossRushTalk_Struct::Talk_kenkyuin_before_75_9E49FCF14B2C4B19C4B0FB906E28048F' has a wrong offset!");
static_assert(offsetof(FBossRushTalk_Struct, Prise_item_id_80_3C64B12541EBCB062C571298D831145E) == 0x000078, "Member 'FBossRushTalk_Struct::Prise_item_id_80_3C64B12541EBCB062C571298D831145E' has a wrong offset!");
static_assert(offsetof(FBossRushTalk_Struct, Prise_item_num_83_BB69C662490AF6EBE28D5996E3720174) == 0x00007C, "Member 'FBossRushTalk_Struct::Prise_item_num_83_BB69C662490AF6EBE28D5996E3720174' has a wrong offset!");
static_assert(offsetof(FBossRushTalk_Struct, Prise_item_id_creation_96_9AC688FD4F4D5B64FD80228C25B97417) == 0x000080, "Member 'FBossRushTalk_Struct::Prise_item_id_creation_96_9AC688FD4F4D5B64FD80228C25B97417' has a wrong offset!");
static_assert(offsetof(FBossRushTalk_Struct, Prise_item_num_creation_97_408960E64394D6B5106B3D8B12195ABD) == 0x000084, "Member 'FBossRushTalk_Struct::Prise_item_num_creation_97_408960E64394D6B5106B3D8B12195ABD' has a wrong offset!");
static_assert(offsetof(FBossRushTalk_Struct, Challenge_cleared_flag_104_7E120AF345763F90C9EE17B2CF0C2137) == 0x000088, "Member 'FBossRushTalk_Struct::Challenge_cleared_flag_104_7E120AF345763F90C9EE17B2CF0C2137' has a wrong offset!");

}

