#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AchievementLogSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AchievementLogSpawner.BP_AchievementLogSpawner_C
// 0x0038 (0x0258 - 0x0220)
class ABP_AchievementLogSpawner_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   LogCtrl;                                           // 0x0230(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AchievementLogSpawner(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnLoaded_0265AEB74227922734FB54A0ECA1A13E(TSubclassOf<class UObject> Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AchievementLogSpawner_C">();
	}
	static class ABP_AchievementLogSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AchievementLogSpawner_C>();
	}
};
static_assert(alignof(ABP_AchievementLogSpawner_C) == 0x000008, "Wrong alignment on ABP_AchievementLogSpawner_C");
static_assert(sizeof(ABP_AchievementLogSpawner_C) == 0x000258, "Wrong size on ABP_AchievementLogSpawner_C");
static_assert(offsetof(ABP_AchievementLogSpawner_C, UberGraphFrame) == 0x000220, "Member 'ABP_AchievementLogSpawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AchievementLogSpawner_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_AchievementLogSpawner_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_AchievementLogSpawner_C, LogCtrl) == 0x000230, "Member 'ABP_AchievementLogSpawner_C::LogCtrl' has a wrong offset!");

}

