#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AogamiDebris

#include "Basic.hpp"

#include "E_MapGimmickHideReason_structs.hpp"
#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AogamiDebrisPose_structs.hpp"


namespace SDK::Params
{

// Function BP_AogamiDebris.BP_AogamiDebris_C.ExecuteUbergraph_BP_AogamiDebris
// 0x0610 (0x0610 - 0x0000)
struct BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9548[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_AddComponent_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9549[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          K2Node_DynamicCast_AsSound_Atom_Cue;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_954A[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          K2Node_DynamicCast_AsSound_Atom_Cue_1;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_954B[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          K2Node_DynamicCast_AsSound_Atom_Cue_2;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_954C[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BIT_AND_ReturnValue;                      // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BIT_AND_ReturnValue_1;                    // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_954D[0x5];                                     // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable_1;                              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BIT_AND_ReturnValue_2;                    // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAogamiDebrisIgnore_ignore;              // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_MapGimmickHideReason                        K2Node_Event_HideReason_1;                         // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MapGimmickHideReason                        K2Node_Event_HideReason;                           // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_954E[0x2];                                     // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BIT_DEL_ReturnValue;                      // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAogamiDebrisGetCounter_ReturnValue;    // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BIT_ADD_ReturnValue;                      // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_954F[0x6];                                     // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_3;                            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_DynamicCast_AsAnim_Sequence;                // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9550[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9551[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGazeTargetHolder*                      CallFunc_GetGazeTargetHolder_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGazeTarget>           CallFunc_RegisterGazeTarget_InTarget_CastInput;    // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	class UGazeTargetHolder*                      CallFunc_GetGazeTargetHolder_ReturnValue_1;        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_4;                            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGazeTarget>           CallFunc_UnregisterGazeTarget_InTarget_CastInput;  // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9552[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_4;                       // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9553[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGazeTargetHolder*                      CallFunc_GetGazeTargetHolder_ReturnValue_2;        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGazeTarget>           CallFunc_UnregisterGazeTarget_InTarget_CastInput_1; // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9554[0x3];                                     // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x01D4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BPI_CheckMapPause_IsPause;                // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9555[0x2];                                     // 0x01E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x01E8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetMapID_ReturnValue;                     // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckAogamiDebrisFlag_ReturnValue;        // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckAogamiDebrisFlag_ReturnValue_1;      // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ItemIsFullHave_ReturnValue;               // 0x01FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9556[0x3];                                     // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9557[0x4];                                     // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0210(0x0030)(IsPlainOldData, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x0240(0x0010)(ZeroConstructor, NoDestructor)
	class USkeletalMeshComponent*                 CallFunc_AddComponent_ReturnValue_1;               // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAogamiDebrisTimer_ReturnValue;         // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0278(0x0018)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0300(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0310(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0340(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn_1;                    // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_1;             // 0x0358(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_CheckMapPause_IsPause_1;              // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9558[0x6];                                     // 0x036A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0370(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPieceData                             K2Node_MakeStruct_PieceData;                       // 0x03A8(0x000C)(NoDestructor)
	uint8                                         Pad_9559[0x4];                                     // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Gimic_Chest_Piece_C*                CallFunc_FinishSpawningActor_ReturnValue;          // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_955A[0x7];                                     // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckAogamiDebrisFlag_ReturnValue_2;      // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_955B[0x3];                                     // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visible_1;                      // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x03DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_955C[0x4];                                     // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USkeletalMesh>           CallFunc_GetSkeletalMesh_Soft_Mesh;                // 0x03E0(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           CallFunc_GetAnimation_Soft_Anim;                   // 0x0408(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_955D[0x3];                                     // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_955E[0x4];                                     // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0440(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visible;                        // 0x0454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Anim;                           // 0x0455(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_955F[0x2];                                     // 0x0456(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BIT_AND_ReturnValue_3;                    // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9560[0x3];                                     // 0x045D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9561[0x3];                                     // 0x0475(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0492(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0493(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FAogamiDebrisData                      CallFunc_GetAogamiDebrisData_FromTableIndex_ReturnValue; // 0x0494(0x0014)(ConstParm, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9562[0x2];                                     // 0x04AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_2;                           // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAogamiDebrisTableIndex_ReturnValue;    // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x04B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BIT_AND_ReturnValue_4;                    // 0x04B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9563[0x2];                                     // 0x04B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_And_IntInt_ReturnValue;                   // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_And_IntInt_ReturnValue_1;                 // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x04C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x04CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9564[0x1];                                     // 0x04CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x04CC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x04DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BIT_AND_ReturnValue_5;                    // 0x04DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9565[0x2];                                     // 0x04DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x04E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9566[0x3];                                     // 0x04E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x04EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9567[0x3];                                     // 0x04ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x04F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9568[0x3];                                     // 0x04F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x04F8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0509(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x050A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9569[0x1];                                     // 0x050B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_CameraPos;                            // 0x050C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0518(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0524(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_956A[0x4];                                     // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_2;                         // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_LineTraceComponent_HitLocation;        // 0x0540(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_LineTraceComponent_HitNormal;          // 0x054C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_K2_LineTraceComponent_BoneName;           // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_LineTraceComponent_OutHit;             // 0x0560(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_LineTraceComponent_ReturnValue;        // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_956B[0x7];                                     // 0x05E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x05FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_956C[0x3];                                     // 0x05FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris) == 0x000010, "Wrong alignment on BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris");
static_assert(sizeof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris) == 0x000610, "Wrong size on BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, EntryPoint) == 0x000000, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, Temp_bool_Variable) == 0x000005, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, Temp_float_Variable) == 0x000008, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, Temp_float_Variable_1) == 0x00000C, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_AddComponent_ReturnValue) == 0x000040, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000048, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_CustomEvent_Loaded_2) == 0x000050, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, Temp_object_Variable) == 0x000058, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_DynamicCast_AsSound_Atom_Cue) == 0x000060, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_DynamicCast_AsSound_Atom_Cue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_CustomEvent_Loaded_1) == 0x000070, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, Temp_object_Variable_1) == 0x000078, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_DynamicCast_AsSound_Atom_Cue_1) == 0x000080, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_DynamicCast_AsSound_Atom_Cue_1' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_CustomEvent_Loaded) == 0x000090, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, Temp_object_Variable_2) == 0x000098, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_DynamicCast_AsSound_Atom_Cue_2) == 0x0000A0, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_DynamicCast_AsSound_Atom_Cue_2' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_MakeVector_ReturnValue) == 0x0000AC, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, Temp_float_Variable_2) == 0x0000B8, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, Temp_float_Variable_3) == 0x0000BC, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x0000C0, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_BIT_AND_ReturnValue) == 0x0000C1, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_BIT_AND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_BIT_AND_ReturnValue_1) == 0x0000C2, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_BIT_AND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_MakeArray_Array) == 0x0000C8, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, Temp_bool_Variable_1) == 0x0000D8, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x0000D9, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000DA, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_BIT_AND_ReturnValue_2) == 0x0000DB, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_BIT_AND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_IsAogamiDebrisIgnore_ignore) == 0x0000DC, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_IsAogamiDebrisIgnore_ignore' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_Event_HideReason_1) == 0x0000DD, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_Event_HideReason_1' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_Event_HideReason) == 0x0000DE, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_Event_HideReason' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000DF, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000E0, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x0000E1, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_BIT_DEL_ReturnValue) == 0x0000E4, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_BIT_DEL_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_GetAogamiDebrisGetCounter_ReturnValue) == 0x0000E8, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_GetAogamiDebrisGetCounter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_BIT_ADD_ReturnValue) == 0x0000EC, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_BIT_ADD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000F0, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_BooleanOR_ReturnValue) == 0x0000F1, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, Temp_object_Variable_3) == 0x0000F8, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_CustomEvent_Loaded_3) == 0x000100, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_DynamicCast_AsAnim_Sequence) == 0x000108, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_DynamicCast_AsAnim_Sequence' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_DynamicCast_bSuccess_3) == 0x000110, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, Temp_int_Array_Index_Variable) == 0x000114, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_CreateDelegate_OutputDelegate) == 0x000118, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_Not_PreBool_ReturnValue) == 0x000128, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_GetGazeTargetHolder_ReturnValue) == 0x000130, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_GetGazeTargetHolder_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_RegisterGazeTarget_InTarget_CastInput) == 0x000138, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_RegisterGazeTarget_InTarget_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_GetGazeTargetHolder_ReturnValue_1) == 0x000148, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_GetGazeTargetHolder_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, Temp_object_Variable_4) == 0x000150, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_UnregisterGazeTarget_InTarget_CastInput) == 0x000158, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_UnregisterGazeTarget_InTarget_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x000168, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_DynamicCast_bSuccess_4) == 0x000170, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_CustomEvent_Loaded_4) == 0x000178, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_CustomEvent_Loaded_4' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, Temp_int_Loop_Counter_Variable) == 0x000180, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_Add_IntInt_ReturnValue) == 0x000184, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_Event_EndPlayReason) == 0x000188, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_GetGazeTargetHolder_ReturnValue_2) == 0x000190, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_GetGazeTargetHolder_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_UnregisterGazeTarget_InTarget_CastInput_1) == 0x000198, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_UnregisterGazeTarget_InTarget_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001A8, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_GetMapCommon_rerutn) == 0x0001B8, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_DynamicCast_AsBPI_Map_Common) == 0x0001C0, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_DynamicCast_bSuccess_5) == 0x0001D0, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001D4, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_BPI_CheckMapPause_IsPause) == 0x0001E4, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_BPI_CheckMapPause_IsPause' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001E5, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001E8, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_GetMapID_ReturnValue) == 0x0001F8, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_GetMapID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_CheckAogamiDebrisFlag_ReturnValue) == 0x0001FC, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_CheckAogamiDebrisFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_CheckAogamiDebrisFlag_ReturnValue_1) == 0x0001FD, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_CheckAogamiDebrisFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001FE, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_ItemIsFullHave_ReturnValue) == 0x0001FF, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_ItemIsFullHave_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_Not_PreBool_ReturnValue_3) == 0x000200, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000204, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_Event_DeltaSeconds) == 0x000208, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_MakeTransform_ReturnValue_1) == 0x000210, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, K2Node_CreateDelegate_OutputDelegate_4) == 0x000240, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_AddComponent_ReturnValue_1) == 0x000250, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000258, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_Add_VectorVector_ReturnValue) == 0x000264, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_GetAogamiDebrisTimer_ReturnValue) == 0x000270, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_GetAogamiDebrisTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_Multiply_IntInt_ReturnValue) == 0x000274, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_Conv_FloatToText_ReturnValue) == 0x000278, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_Conv_IntToString_ReturnValue) == 0x000290, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_Conv_TextToString_ReturnValue) == 0x0002A0, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_Conv_IntToString_ReturnValue_1) == 0x0002B0, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_Conv_IntToString_ReturnValue_2) == 0x0002C0, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_Concat_StrStr_ReturnValue) == 0x0002D0, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0002E0, "Member 'BP_AogamiDebris_C_ExecuteUbergraph_BP_AogamiDebris::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
