#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BGMArea

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BGMArea.BP_BGMArea_C.ExecuteUbergraph_BP_BGMArea
// 0x0218 (0x0218 - 0x0000)
struct BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C933[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_GetOverlappingComponents_OutOverlappingComponents; // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1; // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C934[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C935[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0048(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C936[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProjectGameMode_C*                     K2Node_DynamicCast_AsProject_Game_Mode;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C937[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C938[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            CallFunc_GetOverlappingComponents_OutOverlappingComponents_1; // 0x0200(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea) == 0x000008, "Wrong alignment on BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea");
static_assert(sizeof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea) == 0x000218, "Wrong size on BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, EntryPoint) == 0x000000, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, CallFunc_GetOverlappingComponents_OutOverlappingComponents) == 0x000008, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::CallFunc_GetOverlappingComponents_OutOverlappingComponents' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, Temp_bool_IsClosed_Variable) == 0x00001D, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, Temp_bool_IsClosed_Variable_1) == 0x00001E, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, Temp_bool_Has_Been_Initd_Variable_1) == 0x00001F, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, Temp_bool_Has_Been_Initd_Variable_2) == 0x000020, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000021, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, Temp_bool_IsClosed_Variable_2) == 0x000022, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1) == 0x000023, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, Temp_bool_Has_Been_Initd_Variable_3) == 0x000024, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::Temp_bool_Has_Been_Initd_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000028, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000030, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000038, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000040, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, K2Node_ComponentBoundEvent_bFromSweep) == 0x000044, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, K2Node_ComponentBoundEvent_SweepResult) == 0x000048, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000D0, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, K2Node_ComponentBoundEvent_OtherActor) == 0x0000D8, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, K2Node_ComponentBoundEvent_OtherComp) == 0x0000E0, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0000E8, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, CallFunc_GetGameMode_ReturnValue) == 0x0000F0, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, K2Node_DynamicCast_AsProject_Game_Mode) == 0x0000F8, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::K2Node_DynamicCast_AsProject_Game_Mode' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, CallFunc_GetDisplayName_ReturnValue) == 0x000108, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, CallFunc_Concat_StrStr_ReturnValue) == 0x000118, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000128, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, CallFunc_GetDisplayName_ReturnValue_1) == 0x000138, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000148, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000158, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, CallFunc_GetDisplayName_ReturnValue_2) == 0x000168, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::CallFunc_GetDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000178, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, CallFunc_Conv_IntToString_ReturnValue) == 0x000188, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000198, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0001A8, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0001B8, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, Temp_bool_IsClosed_Variable_3) == 0x0001C8, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::Temp_bool_IsClosed_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, CallFunc_Concat_StrStr_ReturnValue_7) == 0x0001D0, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, CallFunc_Concat_StrStr_ReturnValue_8) == 0x0001E0, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, CallFunc_Concat_StrStr_ReturnValue_9) == 0x0001F0, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, CallFunc_GetOverlappingComponents_OutOverlappingComponents_1) == 0x000200, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::CallFunc_GetOverlappingComponents_OutOverlappingComponents_1' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, CallFunc_Array_Length_ReturnValue_1) == 0x000210, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000214, "Member 'BP_BGMArea_C_ExecuteUbergraph_BP_BGMArea::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_BGMArea.BP_BGMArea_C.BndEvt__OuterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_BGMArea_C_BndEvt__OuterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BGMArea_C_BndEvt__OuterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_BGMArea_C_BndEvt__OuterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_BGMArea_C_BndEvt__OuterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_BGMArea_C_BndEvt__OuterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_BGMArea_C_BndEvt__OuterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_BGMArea_C_BndEvt__OuterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_BndEvt__OuterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_BGMArea_C_BndEvt__OuterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_BndEvt__OuterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_BGMArea_C_BndEvt__OuterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_BndEvt__OuterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_BGMArea_C_BndEvt__OuterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_BGMArea.BP_BGMArea_C.BndEvt__InnerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_BGMArea_C_BndEvt__InnerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C939[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_BGMArea_C_BndEvt__InnerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_BGMArea_C_BndEvt__InnerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_BGMArea_C_BndEvt__InnerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_BGMArea_C_BndEvt__InnerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_BGMArea_C_BndEvt__InnerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_BGMArea_C_BndEvt__InnerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_BndEvt__InnerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_BGMArea_C_BndEvt__InnerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_BndEvt__InnerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_BGMArea_C_BndEvt__InnerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_BndEvt__InnerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_BGMArea_C_BndEvt__InnerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_BndEvt__InnerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_BGMArea_C_BndEvt__InnerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_BndEvt__InnerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_BGMArea_C_BndEvt__InnerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_BGMArea.BP_BGMArea_C.UserConstructionScript
// 0x0040 (0x0040 - 0x0000)
struct BP_BGMArea_C_UserConstructionScript final
{
public:
	float                                         RandomH;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_HSVToRGB_ReturnValue;                     // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_HSVToRGB_ReturnValue_1;                   // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_Conv_LinearColorToColor_ReturnValue;      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_Conv_LinearColorToColor_ReturnValue_1;    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IS_EDITOR_BUILD_ReturnValue;              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C93A[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CreateRandomSeedFromString_ReturnValue;   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          CallFunc_MakeRandomStream_ReturnValue;             // 0x0034(0x0008)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BGMArea_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_BGMArea_C_UserConstructionScript");
static_assert(sizeof(BP_BGMArea_C_UserConstructionScript) == 0x000040, "Wrong size on BP_BGMArea_C_UserConstructionScript");
static_assert(offsetof(BP_BGMArea_C_UserConstructionScript, RandomH) == 0x000000, "Member 'BP_BGMArea_C_UserConstructionScript::RandomH' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_UserConstructionScript, CallFunc_HSVToRGB_ReturnValue) == 0x000004, "Member 'BP_BGMArea_C_UserConstructionScript::CallFunc_HSVToRGB_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BGMArea_C_UserConstructionScript, CallFunc_HSVToRGB_ReturnValue_1) == 0x000014, "Member 'BP_BGMArea_C_UserConstructionScript::CallFunc_HSVToRGB_ReturnValue_1' has a wrong offset!");
