#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtnHelpCtrl2

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "ST_BtnHelp_ChangeInfo2_structs.hpp"
#include "Slate_structs.hpp"
#include "ST_BtnHelp_ColorInfo_byIdx_structs.hpp"
#include "ST_BtnHelp_ColorInfo_byEnum_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BtnHelpCtrl2.BP_BtnHelpCtrl2_C.ExecuteUbergraph_BP_BtnHelpCtrl2
// 0x001C (0x001C - 0x0000)
struct BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E5B[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckGamePadUI_Gamepad;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckGamePadUI_Gamepad_1;                 // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetIconMode_NotUse;                       // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetIconMode_NotUse_1;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_KeyboardLanguage                            CallFunc_GetKeyboardLanguage_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_KeyboardLanguage                            CallFunc_GetKeyboardLanguage_ReturnValue_1;        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_KeyboardLanguage                            CallFunc_GetKeyboardLanguage_ReturnValue_2;        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckGamePadUI_Gamepad_2;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInViewport_ReturnValue_1;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInfo_PresetPattern_NotUse;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInfo_PresetPattern_NotUse_1;           // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue_1;            // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2) == 0x000004, "Wrong alignment on BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2");
static_assert(sizeof(BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2) == 0x00001C, "Wrong size on BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2, EntryPoint) == 0x000000, "Member 'BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2, CallFunc_AddToWidgetPrio_ReturnValue) == 0x000004, "Member 'BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2::CallFunc_AddToWidgetPrio_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2, K2Node_Event_EndPlayReason) == 0x00000C, "Member 'BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2, CallFunc_CheckGamePadUI_Gamepad) == 0x00000D, "Member 'BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2::CallFunc_CheckGamePadUI_Gamepad' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2, CallFunc_CheckGamePadUI_Gamepad_1) == 0x00000E, "Member 'BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2::CallFunc_CheckGamePadUI_Gamepad_1' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2, CallFunc_SetIconMode_NotUse) == 0x00000F, "Member 'BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2::CallFunc_SetIconMode_NotUse' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2, CallFunc_SetIconMode_NotUse_1) == 0x000010, "Member 'BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2::CallFunc_SetIconMode_NotUse_1' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2, CallFunc_GetKeyboardLanguage_ReturnValue) == 0x000011, "Member 'BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2::CallFunc_GetKeyboardLanguage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2, CallFunc_GetKeyboardLanguage_ReturnValue_1) == 0x000012, "Member 'BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2::CallFunc_GetKeyboardLanguage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000013, "Member 'BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2, CallFunc_GetKeyboardLanguage_ReturnValue_2) == 0x000014, "Member 'BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2::CallFunc_GetKeyboardLanguage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2, CallFunc_CheckGamePadUI_Gamepad_2) == 0x000015, "Member 'BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2::CallFunc_CheckGamePadUI_Gamepad_2' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2, CallFunc_IsInViewport_ReturnValue) == 0x000016, "Member 'BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000017, "Member 'BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2, CallFunc_IsInViewport_ReturnValue_1) == 0x000018, "Member 'BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2::CallFunc_IsInViewport_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2, CallFunc_SetInfo_PresetPattern_NotUse) == 0x000019, "Member 'BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2::CallFunc_SetInfo_PresetPattern_NotUse' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2, CallFunc_SetInfo_PresetPattern_NotUse_1) == 0x00001A, "Member 'BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2::CallFunc_SetInfo_PresetPattern_NotUse_1' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2, CallFunc_AddToWidgetPrio_ReturnValue_1) == 0x00001B, "Member 'BP_BtnHelpCtrl2_C_ExecuteUbergraph_BP_BtnHelpCtrl2::CallFunc_AddToWidgetPrio_ReturnValue_1' has a wrong offset!");

// Function BP_BtnHelpCtrl2.BP_BtnHelpCtrl2_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_BtnHelpCtrl2_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtnHelpCtrl2_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_BtnHelpCtrl2_C_ReceiveEndPlay");
static_assert(sizeof(BP_BtnHelpCtrl2_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_BtnHelpCtrl2_C_ReceiveEndPlay");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_BtnHelpCtrl2_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_BtnHelpCtrl2.BP_BtnHelpCtrl2_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_BtnHelpCtrl2_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtnHelpCtrl2_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_BtnHelpCtrl2_C_ReceiveTick");
static_assert(sizeof(BP_BtnHelpCtrl2_C_ReceiveTick) == 0x000004, "Wrong size on BP_BtnHelpCtrl2_C_ReceiveTick");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_BtnHelpCtrl2_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_BtnHelpCtrl2.BP_BtnHelpCtrl2_C.Init
// 0x0010 (0x0010 - 0x0000)
struct BP_BtnHelpCtrl2_C_Init final
{
public:
	class UWB_BtnHelp2_C*                         CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_BtnHelp2_C*                         CallFunc_Create_ReturnValue_1;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtnHelpCtrl2_C_Init) == 0x000008, "Wrong alignment on BP_BtnHelpCtrl2_C_Init");
static_assert(sizeof(BP_BtnHelpCtrl2_C_Init) == 0x000010, "Wrong size on BP_BtnHelpCtrl2_C_Init");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Init, CallFunc_Create_ReturnValue) == 0x000000, "Member 'BP_BtnHelpCtrl2_C_Init::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Init, CallFunc_Create_ReturnValue_1) == 0x000008, "Member 'BP_BtnHelpCtrl2_C_Init::CallFunc_Create_ReturnValue_1' has a wrong offset!");

// Function BP_BtnHelpCtrl2.BP_BtnHelpCtrl2_C.End
// 0x0038 (0x0038 - 0x0000)
struct BP_BtnHelpCtrl2_C_End final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E5C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_BtnHelp2_C*>                 K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWB_BtnHelp2_C*                         CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E5D[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E5E[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtnHelpCtrl2_C_End) == 0x000008, "Wrong alignment on BP_BtnHelpCtrl2_C_End");
static_assert(sizeof(BP_BtnHelpCtrl2_C_End) == 0x000038, "Wrong size on BP_BtnHelpCtrl2_C_End");
static_assert(offsetof(BP_BtnHelpCtrl2_C_End, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_BtnHelpCtrl2_C_End::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_End, K2Node_MakeArray_Array) == 0x000008, "Member 'BP_BtnHelpCtrl2_C_End::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_End, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_BtnHelpCtrl2_C_End::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_End, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_BtnHelpCtrl2_C_End::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_End, CallFunc_IsInViewport_ReturnValue) == 0x000024, "Member 'BP_BtnHelpCtrl2_C_End::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_End, CallFunc_IsValid_ReturnValue) == 0x000025, "Member 'BP_BtnHelpCtrl2_C_End::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_End, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_BtnHelpCtrl2_C_End::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_End, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_BtnHelpCtrl2_C_End::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_End, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_BtnHelpCtrl2_C_End::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_BtnHelpCtrl2.BP_BtnHelpCtrl2_C.SetMainAnimState
// 0x0028 (0x0028 - 0x0000)
struct BP_BtnHelpCtrl2_C_SetMainAnimState final
{
public:
	E_BTN_HELP_DIR                                InDirectionType;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTN_HELP_UI_STATE                           InState;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTN_HELP_UI_STATE                           L_OldState;                                        // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E5F[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtnHelp2_C*                         L_TargetWidget;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTN_HELP_DIR                                Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTN_HELP_DIR                                Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BTN_HELP_DIR                                Temp_byte_Variable_2;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTN_HELP_UI_STATE                           K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E60[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtnHelp2_C*                         K2Node_Select_Default_1;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTN_HELP_UI_STATE                           K2Node_Select_Default_2;                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtnHelpCtrl2_C_SetMainAnimState) == 0x000008, "Wrong alignment on BP_BtnHelpCtrl2_C_SetMainAnimState");
static_assert(sizeof(BP_BtnHelpCtrl2_C_SetMainAnimState) == 0x000028, "Wrong size on BP_BtnHelpCtrl2_C_SetMainAnimState");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetMainAnimState, InDirectionType) == 0x000000, "Member 'BP_BtnHelpCtrl2_C_SetMainAnimState::InDirectionType' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetMainAnimState, InState) == 0x000001, "Member 'BP_BtnHelpCtrl2_C_SetMainAnimState::InState' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetMainAnimState, L_OldState) == 0x000002, "Member 'BP_BtnHelpCtrl2_C_SetMainAnimState::L_OldState' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetMainAnimState, L_TargetWidget) == 0x000008, "Member 'BP_BtnHelpCtrl2_C_SetMainAnimState::L_TargetWidget' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetMainAnimState, Temp_byte_Variable) == 0x000010, "Member 'BP_BtnHelpCtrl2_C_SetMainAnimState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetMainAnimState, Temp_byte_Variable_1) == 0x000011, "Member 'BP_BtnHelpCtrl2_C_SetMainAnimState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetMainAnimState, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000012, "Member 'BP_BtnHelpCtrl2_C_SetMainAnimState::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetMainAnimState, Temp_byte_Variable_2) == 0x000013, "Member 'BP_BtnHelpCtrl2_C_SetMainAnimState::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetMainAnimState, K2Node_Select_Default) == 0x000014, "Member 'BP_BtnHelpCtrl2_C_SetMainAnimState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetMainAnimState, K2Node_Select_Default_1) == 0x000018, "Member 'BP_BtnHelpCtrl2_C_SetMainAnimState::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetMainAnimState, K2Node_Select_Default_2) == 0x000020, "Member 'BP_BtnHelpCtrl2_C_SetMainAnimState::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetMainAnimState, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'BP_BtnHelpCtrl2_C_SetMainAnimState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetMainAnimState, K2Node_SwitchEnum_CmpSuccess_1) == 0x000022, "Member 'BP_BtnHelpCtrl2_C_SetMainAnimState::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function BP_BtnHelpCtrl2.BP_BtnHelpCtrl2_C.Tick_Base
// 0x0002 (0x0002 - 0x0000)
struct BP_BtnHelpCtrl2_C_Tick_Base final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtnHelpCtrl2_C_Tick_Base) == 0x000001, "Wrong alignment on BP_BtnHelpCtrl2_C_Tick_Base");
static_assert(sizeof(BP_BtnHelpCtrl2_C_Tick_Base) == 0x000002, "Wrong size on BP_BtnHelpCtrl2_C_Tick_Base");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_Base, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'BP_BtnHelpCtrl2_C_Tick_Base::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_Base, K2Node_SwitchEnum_CmpSuccess_1) == 0x000001, "Member 'BP_BtnHelpCtrl2_C_Tick_Base::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function BP_BtnHelpCtrl2.BP_BtnHelpCtrl2_C.Tick_FrameIn
// 0x0020 (0x0020 - 0x0000)
struct BP_BtnHelpCtrl2_C_Tick_FrameIn final
{
public:
	E_BTN_HELP_DIR                                InDirectionType;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTN_HELP_DIR                                Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E61[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtnHelp2_C*                         K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetNowAssignAnim_AnimationName;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNowAssignAnim_IsPlaying;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtnHelpCtrl2_C_Tick_FrameIn) == 0x000008, "Wrong alignment on BP_BtnHelpCtrl2_C_Tick_FrameIn");
static_assert(sizeof(BP_BtnHelpCtrl2_C_Tick_FrameIn) == 0x000020, "Wrong size on BP_BtnHelpCtrl2_C_Tick_FrameIn");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_FrameIn, InDirectionType) == 0x000000, "Member 'BP_BtnHelpCtrl2_C_Tick_FrameIn::InDirectionType' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_FrameIn, Temp_byte_Variable) == 0x000001, "Member 'BP_BtnHelpCtrl2_C_Tick_FrameIn::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_FrameIn, K2Node_Select_Default) == 0x000008, "Member 'BP_BtnHelpCtrl2_C_Tick_FrameIn::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_FrameIn, CallFunc_GetNowAssignAnim_AnimationName) == 0x000010, "Member 'BP_BtnHelpCtrl2_C_Tick_FrameIn::CallFunc_GetNowAssignAnim_AnimationName' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_FrameIn, CallFunc_GetNowAssignAnim_IsPlaying) == 0x000018, "Member 'BP_BtnHelpCtrl2_C_Tick_FrameIn::CallFunc_GetNowAssignAnim_IsPlaying' has a wrong offset!");

// Function BP_BtnHelpCtrl2.BP_BtnHelpCtrl2_C.Tick_FrameOut
// 0x0020 (0x0020 - 0x0000)
struct BP_BtnHelpCtrl2_C_Tick_FrameOut final
{
public:
	E_BTN_HELP_DIR                                InDirectionType;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTN_HELP_DIR                                Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E62[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtnHelp2_C*                         K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetNowAssignAnim_AnimationName;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNowAssignAnim_IsPlaying;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtnHelpCtrl2_C_Tick_FrameOut) == 0x000008, "Wrong alignment on BP_BtnHelpCtrl2_C_Tick_FrameOut");
static_assert(sizeof(BP_BtnHelpCtrl2_C_Tick_FrameOut) == 0x000020, "Wrong size on BP_BtnHelpCtrl2_C_Tick_FrameOut");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_FrameOut, InDirectionType) == 0x000000, "Member 'BP_BtnHelpCtrl2_C_Tick_FrameOut::InDirectionType' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_FrameOut, Temp_byte_Variable) == 0x000001, "Member 'BP_BtnHelpCtrl2_C_Tick_FrameOut::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_FrameOut, K2Node_Select_Default) == 0x000008, "Member 'BP_BtnHelpCtrl2_C_Tick_FrameOut::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_FrameOut, CallFunc_GetNowAssignAnim_AnimationName) == 0x000010, "Member 'BP_BtnHelpCtrl2_C_Tick_FrameOut::CallFunc_GetNowAssignAnim_AnimationName' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_FrameOut, CallFunc_GetNowAssignAnim_IsPlaying) == 0x000018, "Member 'BP_BtnHelpCtrl2_C_Tick_FrameOut::CallFunc_GetNowAssignAnim_IsPlaying' has a wrong offset!");

// Function BP_BtnHelpCtrl2.BP_BtnHelpCtrl2_C.ReflectReserveColorInfo
// 0x0004 (0x0004 - 0x0000)
struct BP_BtnHelpCtrl2_C_ReflectReserveColorInfo final
{
public:
	E_BTN_HELP_DIR                                InDirectionType;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetActiveColors_byIdx_NotUse;             // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetActiveColors_byIdx_NotUse_1;           // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtnHelpCtrl2_C_ReflectReserveColorInfo) == 0x000001, "Wrong alignment on BP_BtnHelpCtrl2_C_ReflectReserveColorInfo");
static_assert(sizeof(BP_BtnHelpCtrl2_C_ReflectReserveColorInfo) == 0x000004, "Wrong size on BP_BtnHelpCtrl2_C_ReflectReserveColorInfo");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ReflectReserveColorInfo, InDirectionType) == 0x000000, "Member 'BP_BtnHelpCtrl2_C_ReflectReserveColorInfo::InDirectionType' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ReflectReserveColorInfo, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'BP_BtnHelpCtrl2_C_ReflectReserveColorInfo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ReflectReserveColorInfo, CallFunc_SetActiveColors_byIdx_NotUse) == 0x000002, "Member 'BP_BtnHelpCtrl2_C_ReflectReserveColorInfo::CallFunc_SetActiveColors_byIdx_NotUse' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_ReflectReserveColorInfo, CallFunc_SetActiveColors_byIdx_NotUse_1) == 0x000003, "Member 'BP_BtnHelpCtrl2_C_ReflectReserveColorInfo::CallFunc_SetActiveColors_byIdx_NotUse_1' has a wrong offset!");

// Function BP_BtnHelpCtrl2.BP_BtnHelpCtrl2_C.Tick_ChangeFrameOut
// 0x0088 (0x0088 - 0x0000)
struct BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut final
{
public:
	E_BTN_HELP_DIR                                InDirectionType;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E63[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_BtnHelp_ChangeInfo2                L_ChangeInfo;                                      // 0x0008(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetHoldEffect_All2_NotUse;                // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BTN_HELP_DIR                                Temp_byte_Variable;                                // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTN_HELP_DIR                                Temp_byte_Variable_1;                              // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveColors_All_NotUse;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BTN_HELP_DIR                                Temp_byte_Variable_2;                              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FrameIn_NotUse;                           // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E64[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtnHelp2_C*                         K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetNowAssignAnim_AnimationName;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNowAssignAnim_IsPlaying;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInfo_PresetPattern_NotUse;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInfo_ManualPattern_NotUse;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BTN_HELP_DIR                                Temp_byte_Variable_3;                              // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E65[0x1];                                     // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_BtnHelp_ChangeInfo2                K2Node_Select_Default_2;                           // 0x0050(0x0020)(HasGetValueTypeHash)
	class UWB_BtnHelp2_C*                         K2Node_Select_Default_3;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetNowAssignAnim_AnimationName_1;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNowAssignAnim_IsPlaying_1;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut) == 0x000008, "Wrong alignment on BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut");
static_assert(sizeof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut) == 0x000088, "Wrong size on BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, InDirectionType) == 0x000000, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::InDirectionType' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, L_ChangeInfo) == 0x000008, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::L_ChangeInfo' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, CallFunc_SetHoldEffect_All2_NotUse) == 0x00002D, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::CallFunc_SetHoldEffect_All2_NotUse' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, Temp_byte_Variable) == 0x00002E, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, Temp_byte_Variable_1) == 0x00002F, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, CallFunc_SetActiveColors_All_NotUse) == 0x000030, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::CallFunc_SetActiveColors_All_NotUse' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, K2Node_SwitchEnum_CmpSuccess) == 0x000031, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, Temp_byte_Variable_2) == 0x000032, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, CallFunc_FrameIn_NotUse) == 0x000033, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::CallFunc_FrameIn_NotUse' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, K2Node_Select_Default) == 0x000038, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, CallFunc_GetNowAssignAnim_AnimationName) == 0x000040, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::CallFunc_GetNowAssignAnim_AnimationName' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, CallFunc_GetNowAssignAnim_IsPlaying) == 0x000048, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::CallFunc_GetNowAssignAnim_IsPlaying' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, CallFunc_SetInfo_PresetPattern_NotUse) == 0x000049, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::CallFunc_SetInfo_PresetPattern_NotUse' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00004A, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, CallFunc_BooleanAND_ReturnValue) == 0x00004B, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, CallFunc_SetInfo_ManualPattern_NotUse) == 0x00004C, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::CallFunc_SetInfo_ManualPattern_NotUse' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, Temp_byte_Variable_3) == 0x00004D, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, K2Node_Select_Default_1) == 0x00004E, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, K2Node_Select_Default_2) == 0x000050, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, K2Node_Select_Default_3) == 0x000070, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, CallFunc_GetNowAssignAnim_AnimationName_1) == 0x000078, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::CallFunc_GetNowAssignAnim_AnimationName_1' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut, CallFunc_GetNowAssignAnim_IsPlaying_1) == 0x000080, "Member 'BP_BtnHelpCtrl2_C_Tick_ChangeFrameOut::CallFunc_GetNowAssignAnim_IsPlaying_1' has a wrong offset!");

// Function BP_BtnHelpCtrl2.BP_BtnHelpCtrl2_C.GetKeyboardBG
// 0x0008 (0x0008 - 0x0000)
struct BP_BtnHelpCtrl2_C_GetKeyboardBG final
{
public:
	class UMaterialInstance*                      Resource;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtnHelpCtrl2_C_GetKeyboardBG) == 0x000008, "Wrong alignment on BP_BtnHelpCtrl2_C_GetKeyboardBG");
static_assert(sizeof(BP_BtnHelpCtrl2_C_GetKeyboardBG) == 0x000008, "Wrong size on BP_BtnHelpCtrl2_C_GetKeyboardBG");
static_assert(offsetof(BP_BtnHelpCtrl2_C_GetKeyboardBG, Resource) == 0x000000, "Member 'BP_BtnHelpCtrl2_C_GetKeyboardBG::Resource' has a wrong offset!");

// Function BP_BtnHelpCtrl2.BP_BtnHelpCtrl2_C.SetActiveColors_All
// 0x0010 (0x0010 - 0x0000)
struct BP_BtnHelpCtrl2_C_SetActiveColors_All final
{
public:
	E_BTN_HELP_DIR                                InDirectionType;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NotUse;                                            // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BTN_HELP_DIR                                InDIr;                                             // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BTN_HELP_DIR                                Temp_byte_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_BtnHelp2_C*                         K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtnHelpCtrl2_C_SetActiveColors_All) == 0x000008, "Wrong alignment on BP_BtnHelpCtrl2_C_SetActiveColors_All");
static_assert(sizeof(BP_BtnHelpCtrl2_C_SetActiveColors_All) == 0x000010, "Wrong size on BP_BtnHelpCtrl2_C_SetActiveColors_All");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_All, InDirectionType) == 0x000000, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_All::InDirectionType' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_All, IsActive) == 0x000001, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_All::IsActive' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_All, NotUse) == 0x000002, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_All::NotUse' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_All, InDIr) == 0x000003, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_All::InDIr' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_All, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_All::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_All, K2Node_SwitchEnum_CmpSuccess_1) == 0x000005, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_All::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_All, K2Node_SwitchEnum_CmpSuccess_2) == 0x000006, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_All::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_All, Temp_byte_Variable) == 0x000007, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_All::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_All, K2Node_Select_Default) == 0x000008, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_All::K2Node_Select_Default' has a wrong offset!");

// Function BP_BtnHelpCtrl2.BP_BtnHelpCtrl2_C.SetActiveColors_byIdx
// 0x0088 (0x0088 - 0x0000)
struct BP_BtnHelpCtrl2_C_SetActiveColors_byIdx final
{
public:
	E_BTN_HELP_DIR                                InDirectionType;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E66[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FST_BtnHelp_ColorInfo_byIdx>    InActiveColorInfo;                                 // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          NotUse;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BTN_HELP_DIR                                L_InDirection;                                     // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E67[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FST_BtnHelp_ColorInfo_byIdx>    L_InColorInfo;                                     // 0x0020(0x0010)(Edit, BlueprintVisible)
	class UWB_BtnHelp2_C*                         L_TmpWidget;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E68[0x1];                                     // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBtnHelpInfo>                   CallFunc_GetHelpInfo_ReturnValue;                  // 0x0040(0x0010)(ReferenceParm)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E69[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E6A[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTN_HELP_DIR                                Temp_byte_Variable;                                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E6B[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBtnHelpInfo>                   CallFunc_GetHelpInfo_ReturnValue_1;                // 0x0068(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E6C[0x2];                                     // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtnHelp2_C*                         K2Node_Select_Default;                             // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx) == 0x000008, "Wrong alignment on BP_BtnHelpCtrl2_C_SetActiveColors_byIdx");
static_assert(sizeof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx) == 0x000088, "Wrong size on BP_BtnHelpCtrl2_C_SetActiveColors_byIdx");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx, InDirectionType) == 0x000000, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_byIdx::InDirectionType' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx, InActiveColorInfo) == 0x000008, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_byIdx::InActiveColorInfo' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx, NotUse) == 0x000018, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_byIdx::NotUse' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx, L_InDirection) == 0x000019, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_byIdx::L_InDirection' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx, L_InColorInfo) == 0x000020, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_byIdx::L_InColorInfo' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx, L_TmpWidget) == 0x000030, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_byIdx::L_TmpWidget' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx, K2Node_SwitchEnum_CmpSuccess) == 0x000038, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_byIdx::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx, K2Node_SwitchEnum_CmpSuccess_1) == 0x000039, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_byIdx::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx, K2Node_SwitchEnum_CmpSuccess_2) == 0x00003A, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_byIdx::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_byIdx::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx, CallFunc_GetHelpInfo_ReturnValue) == 0x000040, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_byIdx::CallFunc_GetHelpInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000050, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_byIdx::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx, CallFunc_Array_Length_ReturnValue_1) == 0x000054, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_byIdx::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000058, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_byIdx::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx, Temp_int_Variable) == 0x00005C, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_byIdx::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_byIdx::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx, Temp_byte_Variable) == 0x000064, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_byIdx::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx, CallFunc_GetHelpInfo_ReturnValue_1) == 0x000068, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_byIdx::CallFunc_GetHelpInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx, CallFunc_Array_LastIndex_ReturnValue) == 0x000078, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_byIdx::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x00007C, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_byIdx::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00007D, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_byIdx::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetActiveColors_byIdx, K2Node_Select_Default) == 0x000080, "Member 'BP_BtnHelpCtrl2_C_SetActiveColors_byIdx::K2Node_Select_Default' has a wrong offset!");

// Function BP_BtnHelpCtrl2.BP_BtnHelpCtrl2_C.SetInfo_ManualPattern
// 0x0028 (0x0028 - 0x0000)
struct BP_BtnHelpCtrl2_C_SetInfo_ManualPattern final
{
public:
	E_BTN_HELP_DIR                                InDirectionType;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E6D[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBtnHelpInfo>                   InHelpPattern;                                     // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          NotUse;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BTN_HELP_DIR                                Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E6E[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtnHelp2_C*                         K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtnHelpCtrl2_C_SetInfo_ManualPattern) == 0x000008, "Wrong alignment on BP_BtnHelpCtrl2_C_SetInfo_ManualPattern");
static_assert(sizeof(BP_BtnHelpCtrl2_C_SetInfo_ManualPattern) == 0x000028, "Wrong size on BP_BtnHelpCtrl2_C_SetInfo_ManualPattern");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetInfo_ManualPattern, InDirectionType) == 0x000000, "Member 'BP_BtnHelpCtrl2_C_SetInfo_ManualPattern::InDirectionType' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetInfo_ManualPattern, InHelpPattern) == 0x000008, "Member 'BP_BtnHelpCtrl2_C_SetInfo_ManualPattern::InHelpPattern' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetInfo_ManualPattern, NotUse) == 0x000018, "Member 'BP_BtnHelpCtrl2_C_SetInfo_ManualPattern::NotUse' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetInfo_ManualPattern, Temp_byte_Variable) == 0x000019, "Member 'BP_BtnHelpCtrl2_C_SetInfo_ManualPattern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetInfo_ManualPattern, K2Node_Select_Default) == 0x000020, "Member 'BP_BtnHelpCtrl2_C_SetInfo_ManualPattern::K2Node_Select_Default' has a wrong offset!");

// Function BP_BtnHelpCtrl2.BP_BtnHelpCtrl2_C.SetInfo_PresetPattern
// 0x0028 (0x0028 - 0x0000)
struct BP_BtnHelpCtrl2_C_SetInfo_PresetPattern final
{
public:
	E_BTN_HELP_DIR                                InDirectionType;                                   // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTN_HELP_SET                                InHelpPattern;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NotUse;                                            // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BTN_HELP_DIR                                L_HelpDir;                                         // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E6F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBtnHelpInfo>                   CallFunc_GetHelpInfo_ReturnValue;                  // 0x0008(0x0010)(ReferenceParm)
	E_BTN_HELP_DIR                                Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E70[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtnHelp2_C*                         K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtnHelpCtrl2_C_SetInfo_PresetPattern) == 0x000008, "Wrong alignment on BP_BtnHelpCtrl2_C_SetInfo_PresetPattern");
static_assert(sizeof(BP_BtnHelpCtrl2_C_SetInfo_PresetPattern) == 0x000028, "Wrong size on BP_BtnHelpCtrl2_C_SetInfo_PresetPattern");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetInfo_PresetPattern, InDirectionType) == 0x000000, "Member 'BP_BtnHelpCtrl2_C_SetInfo_PresetPattern::InDirectionType' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetInfo_PresetPattern, InHelpPattern) == 0x000001, "Member 'BP_BtnHelpCtrl2_C_SetInfo_PresetPattern::InHelpPattern' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetInfo_PresetPattern, NotUse) == 0x000002, "Member 'BP_BtnHelpCtrl2_C_SetInfo_PresetPattern::NotUse' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetInfo_PresetPattern, L_HelpDir) == 0x000003, "Member 'BP_BtnHelpCtrl2_C_SetInfo_PresetPattern::L_HelpDir' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetInfo_PresetPattern, CallFunc_GetHelpInfo_ReturnValue) == 0x000008, "Member 'BP_BtnHelpCtrl2_C_SetInfo_PresetPattern::CallFunc_GetHelpInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetInfo_PresetPattern, Temp_byte_Variable) == 0x000018, "Member 'BP_BtnHelpCtrl2_C_SetInfo_PresetPattern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtnHelpCtrl2_C_SetInfo_PresetPattern, K2Node_Select_Default) == 0x000020, "Member 'BP_BtnHelpCtrl2_C_SetInfo_PresetPattern::K2Node_Select_Default' has a wrong offset!");

// Function BP_BtnHelpCtrl2.BP_BtnHelpCtrl2_C.SetPositionType
// 0x0010 (0x0010 - 0x0000)
struct BP_BtnHelpCtrl2_C_SetPositionType final
{
public:
