#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharaPanelVNumberCtrl

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CharaPanelVNumberCtrl.BP_CharaPanelVNumberCtrl_C.ExecuteUbergraph_BP_CharaPanelVNumberCtrl
// 0x00B0 (0x00B0 - 0x0000)
struct BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSignPosition_ReturnValue;              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetCenterPosition_ReturnValue;            // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_WIDGET_PRIO                                 K2Node_CustomEvent_InPrio;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_CustomEvent_InPosition;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InIndex;                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InDataType;                           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InIndex_1;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InDataType_1;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InNumber;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StopVNumberAnimation_ReturnValue;         // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_UIManager_C*                        K2Node_DynamicCast_AsBP_UIManager;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_InStartTime;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_InAddVec;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartVNumberAnimation_ReturnValue;        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_1;                        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_UIManager_C*                        K2Node_DynamicCast_AsBP_UIManager_1;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue;              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVNumberAnimation_ReturnValue;           // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DeleteVNumberList_ReturnValue;            // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CharaPanelVNumber_C*                CallFunc_Create_ReturnValue;                       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartFadeOut_ReturnValue;                 // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationEnd_OutFinished;               // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl) == 0x000008, "Wrong alignment on BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl");
static_assert(sizeof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl) == 0x0000B0, "Wrong size on BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, EntryPoint) == 0x000000, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, CallFunc_GetSignPosition_ReturnValue) == 0x000004, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::CallFunc_GetSignPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, CallFunc_GetCenterPosition_ReturnValue) == 0x00000C, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::CallFunc_GetCenterPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, K2Node_CustomEvent_InPrio) == 0x000014, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::K2Node_CustomEvent_InPrio' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, K2Node_CustomEvent_InPosition) == 0x000018, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::K2Node_CustomEvent_InPosition' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, K2Node_Event_InIndex) == 0x000020, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::K2Node_Event_InIndex' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, K2Node_Event_InDataType) == 0x000024, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::K2Node_Event_InDataType' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, K2Node_Event_InIndex_1) == 0x000028, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::K2Node_Event_InIndex_1' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, K2Node_Event_InDataType_1) == 0x00002C, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::K2Node_Event_InDataType_1' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, K2Node_Event_InNumber) == 0x000030, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::K2Node_Event_InNumber' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, CallFunc_StopVNumberAnimation_ReturnValue) == 0x000034, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::CallFunc_StopVNumberAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, CallFunc_Get_ReturnValue) == 0x000038, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, K2Node_DynamicCast_AsBP_UIManager) == 0x000040, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::K2Node_DynamicCast_AsBP_UIManager' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, K2Node_CustomEvent_InStartTime) == 0x00004C, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::K2Node_CustomEvent_InStartTime' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, K2Node_CustomEvent_InAddVec) == 0x000050, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::K2Node_CustomEvent_InAddVec' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000058, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, CallFunc_StartVNumberAnimation_ReturnValue) == 0x000060, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::CallFunc_StartVNumberAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, CallFunc_Get_ReturnValue_1) == 0x000068, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, K2Node_DynamicCast_AsBP_UIManager_1) == 0x000070, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::K2Node_DynamicCast_AsBP_UIManager_1' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000079, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, K2Node_Event_DeltaSeconds) == 0x00007C, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, CallFunc_AddToWidgetPrio_ReturnValue) == 0x000080, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::CallFunc_AddToWidgetPrio_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, K2Node_Event_EndPlayReason) == 0x000081, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, CallFunc_IsValid_ReturnValue) == 0x000082, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, CallFunc_IsVNumberAnimation_ReturnValue) == 0x000083, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::CallFunc_IsVNumberAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, CallFunc_DeleteVNumberList_ReturnValue) == 0x000084, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::CallFunc_DeleteVNumberList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, CallFunc_Create_ReturnValue) == 0x000088, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, K2Node_CreateDelegate_OutputDelegate) == 0x000090, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, K2Node_SwitchInteger_CmpSuccess) == 0x0000A0, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, CallFunc_StartFadeOut_ReturnValue) == 0x0000A1, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::CallFunc_StartFadeOut_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, CallFunc_IsAnimationEnd_OutFinished) == 0x0000A2, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::CallFunc_IsAnimationEnd_OutFinished' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000A4, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000A8, "Member 'BP_CharaPanelVNumberCtrl_C_ExecuteUbergraph_BP_CharaPanelVNumberCtrl::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_CharaPanelVNumberCtrl.BP_CharaPanelVNumberCtrl_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_CharaPanelVNumberCtrl_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaPanelVNumberCtrl_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_CharaPanelVNumberCtrl_C_ReceiveEndPlay");
static_assert(sizeof(BP_CharaPanelVNumberCtrl_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_CharaPanelVNumberCtrl_C_ReceiveEndPlay");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_CharaPanelVNumberCtrl_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_CharaPanelVNumberCtrl.BP_CharaPanelVNumberCtrl_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CharaPanelVNumberCtrl_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaPanelVNumberCtrl_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CharaPanelVNumberCtrl_C_ReceiveTick");
static_assert(sizeof(BP_CharaPanelVNumberCtrl_C_ReceiveTick) == 0x000004, "Wrong size on BP_CharaPanelVNumberCtrl_C_ReceiveTick");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CharaPanelVNumberCtrl_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_CharaPanelVNumberCtrl.BP_CharaPanelVNumberCtrl_C.StartNumberAnimation
// 0x000C (0x000C - 0x0000)
struct BP_CharaPanelVNumberCtrl_C_StartNumberAnimation final
{
public:
	float                                         InStartTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              InAddVec;                                          // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaPanelVNumberCtrl_C_StartNumberAnimation) == 0x000004, "Wrong alignment on BP_CharaPanelVNumberCtrl_C_StartNumberAnimation");
static_assert(sizeof(BP_CharaPanelVNumberCtrl_C_StartNumberAnimation) == 0x00000C, "Wrong size on BP_CharaPanelVNumberCtrl_C_StartNumberAnimation");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_StartNumberAnimation, InStartTime) == 0x000000, "Member 'BP_CharaPanelVNumberCtrl_C_StartNumberAnimation::InStartTime' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_StartNumberAnimation, InAddVec) == 0x000004, "Member 'BP_CharaPanelVNumberCtrl_C_StartNumberAnimation::InAddVec' has a wrong offset!");

// Function BP_CharaPanelVNumberCtrl.BP_CharaPanelVNumberCtrl_C.BIESetStartFadeOutVNumberAnimation
// 0x0008 (0x0008 - 0x0000)
struct BP_CharaPanelVNumberCtrl_C_BIESetStartFadeOutVNumberAnimation final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InDataType;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaPanelVNumberCtrl_C_BIESetStartFadeOutVNumberAnimation) == 0x000004, "Wrong alignment on BP_CharaPanelVNumberCtrl_C_BIESetStartFadeOutVNumberAnimation");
static_assert(sizeof(BP_CharaPanelVNumberCtrl_C_BIESetStartFadeOutVNumberAnimation) == 0x000008, "Wrong size on BP_CharaPanelVNumberCtrl_C_BIESetStartFadeOutVNumberAnimation");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_BIESetStartFadeOutVNumberAnimation, InIndex) == 0x000000, "Member 'BP_CharaPanelVNumberCtrl_C_BIESetStartFadeOutVNumberAnimation::InIndex' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_BIESetStartFadeOutVNumberAnimation, InDataType) == 0x000004, "Member 'BP_CharaPanelVNumberCtrl_C_BIESetStartFadeOutVNumberAnimation::InDataType' has a wrong offset!");

// Function BP_CharaPanelVNumberCtrl.BP_CharaPanelVNumberCtrl_C.SetWidgetData
// 0x000C (0x000C - 0x0000)
struct BP_CharaPanelVNumberCtrl_C_SetWidgetData final
{
public:
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              InPosition;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaPanelVNumberCtrl_C_SetWidgetData) == 0x000004, "Wrong alignment on BP_CharaPanelVNumberCtrl_C_SetWidgetData");
static_assert(sizeof(BP_CharaPanelVNumberCtrl_C_SetWidgetData) == 0x00000C, "Wrong size on BP_CharaPanelVNumberCtrl_C_SetWidgetData");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_SetWidgetData, InPrio) == 0x000000, "Member 'BP_CharaPanelVNumberCtrl_C_SetWidgetData::InPrio' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_SetWidgetData, InPosition) == 0x000004, "Member 'BP_CharaPanelVNumberCtrl_C_SetWidgetData::InPosition' has a wrong offset!");

// Function BP_CharaPanelVNumberCtrl.BP_CharaPanelVNumberCtrl_C.BIESetInitializeVNumberAnimation
// 0x000C (0x000C - 0x0000)
struct BP_CharaPanelVNumberCtrl_C_BIESetInitializeVNumberAnimation final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InDataType;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InNumber;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaPanelVNumberCtrl_C_BIESetInitializeVNumberAnimation) == 0x000004, "Wrong alignment on BP_CharaPanelVNumberCtrl_C_BIESetInitializeVNumberAnimation");
static_assert(sizeof(BP_CharaPanelVNumberCtrl_C_BIESetInitializeVNumberAnimation) == 0x00000C, "Wrong size on BP_CharaPanelVNumberCtrl_C_BIESetInitializeVNumberAnimation");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_BIESetInitializeVNumberAnimation, InIndex) == 0x000000, "Member 'BP_CharaPanelVNumberCtrl_C_BIESetInitializeVNumberAnimation::InIndex' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_BIESetInitializeVNumberAnimation, InDataType) == 0x000004, "Member 'BP_CharaPanelVNumberCtrl_C_BIESetInitializeVNumberAnimation::InDataType' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_BIESetInitializeVNumberAnimation, InNumber) == 0x000008, "Member 'BP_CharaPanelVNumberCtrl_C_BIESetInitializeVNumberAnimation::InNumber' has a wrong offset!");

// Function BP_CharaPanelVNumberCtrl.BP_CharaPanelVNumberCtrl_C.GetMovePosition
// 0x0008 (0x0008 - 0x0000)
struct BP_CharaPanelVNumberCtrl_C_GetMovePosition final
{
public:
	float                                         OutYPosition;                                      // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaPanelVNumberCtrl_C_GetMovePosition) == 0x000004, "Wrong alignment on BP_CharaPanelVNumberCtrl_C_GetMovePosition");
static_assert(sizeof(BP_CharaPanelVNumberCtrl_C_GetMovePosition) == 0x000008, "Wrong size on BP_CharaPanelVNumberCtrl_C_GetMovePosition");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_GetMovePosition, OutYPosition) == 0x000000, "Member 'BP_CharaPanelVNumberCtrl_C_GetMovePosition::OutYPosition' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_GetMovePosition, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_CharaPanelVNumberCtrl_C_GetMovePosition::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_CharaPanelVNumberCtrl.BP_CharaPanelVNumberCtrl_C.CalcMove
// 0x000C (0x000C - 0x0000)
struct BP_CharaPanelVNumberCtrl_C_CalcMove final
{
public:
	int32                                         CallFunc_GetVNumberMode_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMovePosition_OutYPosition;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaPanelVNumberCtrl_C_CalcMove) == 0x000004, "Wrong alignment on BP_CharaPanelVNumberCtrl_C_CalcMove");
static_assert(sizeof(BP_CharaPanelVNumberCtrl_C_CalcMove) == 0x00000C, "Wrong size on BP_CharaPanelVNumberCtrl_C_CalcMove");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_CalcMove, CallFunc_GetVNumberMode_ReturnValue) == 0x000000, "Member 'BP_CharaPanelVNumberCtrl_C_CalcMove::CallFunc_GetVNumberMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_CalcMove, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'BP_CharaPanelVNumberCtrl_C_CalcMove::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_CalcMove, CallFunc_GetMovePosition_OutYPosition) == 0x000008, "Member 'BP_CharaPanelVNumberCtrl_C_CalcMove::CallFunc_GetMovePosition_OutYPosition' has a wrong offset!");

// Function BP_CharaPanelVNumberCtrl.BP_CharaPanelVNumberCtrl_C.SetAnimationRate
// 0x0008 (0x0008 - 0x0000)
struct BP_CharaPanelVNumberCtrl_C_SetAnimationRate final
{
public:
	float                                         InRate;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CharaPanelVNumberCtrl_C_SetAnimationRate) == 0x000004, "Wrong alignment on BP_CharaPanelVNumberCtrl_C_SetAnimationRate");
static_assert(sizeof(BP_CharaPanelVNumberCtrl_C_SetAnimationRate) == 0x000008, "Wrong size on BP_CharaPanelVNumberCtrl_C_SetAnimationRate");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_SetAnimationRate, InRate) == 0x000000, "Member 'BP_CharaPanelVNumberCtrl_C_SetAnimationRate::InRate' has a wrong offset!");
static_assert(offsetof(BP_CharaPanelVNumberCtrl_C_SetAnimationRate, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_CharaPanelVNumberCtrl_C_SetAnimationRate::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

