#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CampTopCtrl

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "E_SaveLoadEndType_structs.hpp"
#include "ST_BtnHelp_ColorInfo_byIdx_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_CAMP_SYSTEM_STATE_structs.hpp"
#include "E_CampQuest_CtrlState_structs.hpp"
#include "E_CAMPTOPCTRL_GSTATUS_structs.hpp"


namespace SDK::Params
{

// Function BP_CampTopCtrl.BP_CampTopCtrl_C.ICampTopIsReturnTitle
// 0x0001 (0x0001 - 0x0000)
struct BP_CampTopCtrl_C_ICampTopIsReturnTitle final
{
public:
	bool                                          OutReturnTitle;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampTopCtrl_C_ICampTopIsReturnTitle) == 0x000001, "Wrong alignment on BP_CampTopCtrl_C_ICampTopIsReturnTitle");
static_assert(sizeof(BP_CampTopCtrl_C_ICampTopIsReturnTitle) == 0x000001, "Wrong size on BP_CampTopCtrl_C_ICampTopIsReturnTitle");
static_assert(offsetof(BP_CampTopCtrl_C_ICampTopIsReturnTitle, OutReturnTitle) == 0x000000, "Member 'BP_CampTopCtrl_C_ICampTopIsReturnTitle::OutReturnTitle' has a wrong offset!");

// Function BP_CampTopCtrl.BP_CampTopCtrl_C.ICampTopGetUsedPillar
// 0x0001 (0x0001 - 0x0000)
struct BP_CampTopCtrl_C_ICampTopGetUsedPillar final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampTopCtrl_C_ICampTopGetUsedPillar) == 0x000001, "Wrong alignment on BP_CampTopCtrl_C_ICampTopGetUsedPillar");
static_assert(sizeof(BP_CampTopCtrl_C_ICampTopGetUsedPillar) == 0x000001, "Wrong size on BP_CampTopCtrl_C_ICampTopGetUsedPillar");
static_assert(offsetof(BP_CampTopCtrl_C_ICampTopGetUsedPillar, OutParam) == 0x000000, "Member 'BP_CampTopCtrl_C_ICampTopGetUsedPillar::OutParam' has a wrong offset!");

// Function BP_CampTopCtrl.BP_CampTopCtrl_C.ICampTopIsFinished
// 0x0001 (0x0001 - 0x0000)
struct BP_CampTopCtrl_C_ICampTopIsFinished final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampTopCtrl_C_ICampTopIsFinished) == 0x000001, "Wrong alignment on BP_CampTopCtrl_C_ICampTopIsFinished");
static_assert(sizeof(BP_CampTopCtrl_C_ICampTopIsFinished) == 0x000001, "Wrong size on BP_CampTopCtrl_C_ICampTopIsFinished");
static_assert(offsetof(BP_CampTopCtrl_C_ICampTopIsFinished, OutFinished) == 0x000000, "Member 'BP_CampTopCtrl_C_ICampTopIsFinished::OutFinished' has a wrong offset!");

// Function BP_CampTopCtrl.BP_CampTopCtrl_C.GSubstatus_CampChangeParameter
// 0x0080 (0x0080 - 0x0000)
struct BP_CampTopCtrl_C_GSubstatus_CampChangeParameter final
{
public:
	bool                                          OurFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BC3[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectGCManager*                      CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CampResult_C>     K2Node_DynamicCast_AsBPI_Camp_Result;              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartHeroParamReassignment_Success;       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ICampCharaPanelRestartLevelUpVisible_OutFlag; // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ICampItemAllOn_OutValue;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ICampItemALLOff_OutValue;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ICampCharaPanelLevelUpVisibleOff_OutFlag; // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_isPlaying;                      // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BC4[0x1];                                     // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ScreenTransition_isFadeFinish_outValue;   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BC5[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CampResult_C>     K2Node_DynamicCast_AsBPI_Camp_Result_1;            // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEndCampResult_IsEnd;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BC6[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BC7[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter) == 0x000008, "Wrong alignment on BP_CampTopCtrl_C_GSubstatus_CampChangeParameter");
static_assert(sizeof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter) == 0x000080, "Wrong size on BP_CampTopCtrl_C_GSubstatus_CampChangeParameter");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, OurFinished) == 0x000000, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::OurFinished' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, CallFunc_Get_ReturnValue) == 0x000008, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, K2Node_DynamicCast_AsBPI_Camp_Result) == 0x000010, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::K2Node_DynamicCast_AsBPI_Camp_Result' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, CallFunc_StartHeroParamReassignment_Success) == 0x000021, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::CallFunc_StartHeroParamReassignment_Success' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, CallFunc_ICampCharaPanelRestartLevelUpVisible_OutFlag) == 0x000022, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::CallFunc_ICampCharaPanelRestartLevelUpVisible_OutFlag' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, CallFunc_ICampItemAllOn_OutValue) == 0x000023, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::CallFunc_ICampItemAllOn_OutValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, Temp_int_Variable) == 0x000024, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, CallFunc_ICampItemALLOff_OutValue) == 0x00002C, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::CallFunc_ICampItemALLOff_OutValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, CallFunc_ICampCharaPanelLevelUpVisibleOff_OutFlag) == 0x00002D, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::CallFunc_ICampCharaPanelLevelUpVisibleOff_OutFlag' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, CallFunc_IsPlaying_isPlaying) == 0x00002E, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::CallFunc_IsPlaying_isPlaying' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, Temp_int_Variable_1) == 0x000030, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, Temp_int_Variable_2) == 0x000034, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, CallFunc_ScreenTransition_isFadeFinish_outValue) == 0x00003C, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::CallFunc_ScreenTransition_isFadeFinish_outValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, K2Node_DynamicCast_AsBPI_Camp_Result_1) == 0x000040, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::K2Node_DynamicCast_AsBPI_Camp_Result_1' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, CallFunc_IsEndCampResult_IsEnd) == 0x000051, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::CallFunc_IsEndCampResult_IsEnd' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, Temp_int_Variable_3) == 0x000054, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, Temp_int_Variable_4) == 0x000058, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, Temp_int_Variable_5) == 0x00005C, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, CallFunc_Add_IntInt_ReturnValue_2) == 0x000064, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, Temp_int_Variable_6) == 0x000068, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, CallFunc_Add_IntInt_ReturnValue_3) == 0x00006C, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, CallFunc_Add_IntInt_ReturnValue_4) == 0x000070, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, CallFunc_Add_IntInt_ReturnValue_5) == 0x000074, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, CallFunc_Add_IntInt_ReturnValue_6) == 0x000078, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampChangeParameter, K2Node_SwitchInteger_CmpSuccess) == 0x00007C, "Member 'BP_CampTopCtrl_C_GSubstatus_CampChangeParameter::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function BP_CampTopCtrl.BP_CampTopCtrl_C.GSubstatus_CampResult
// 0x00B0 (0x00B0 - 0x0000)
struct BP_CampTopCtrl_C_GSubstatus_CampResult final
{
public:
	bool                                          OurFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BC8[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectGCManager*                      CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ICampCharaPanelRestartLevelUpVisible_OutFlag; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ICampItemAllOn_OutValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BC9[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8BCA[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CampResult_C>     K2Node_DynamicCast_AsBPI_Camp_Result;              // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BCB[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ICampCharaPanelGetPartyNkmIndex_OutNkmIndex; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ICampCharaPanelGetMaxNumberOfItem_OutLevel; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartCampResult_Success;                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ICampItemALLOff_OutValue;                 // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ICampCharaPanelLevelUpVisibleOff_OutFlag; // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_isPlaying;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BCC[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ScreenTransition_isFadeFinish_outValue;   // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BCD[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CampResult_C>     K2Node_DynamicCast_AsBPI_Camp_Result_1;            // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEndCampResult_IsEnd;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BCE[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CampResult_C>     K2Node_DynamicCast_AsBPI_Camp_Result_2;            // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartCampResult_Success_1;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BCF[0x2];                                     // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BD0[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampTopCtrl_C_GSubstatus_CampResult) == 0x000008, "Wrong alignment on BP_CampTopCtrl_C_GSubstatus_CampResult");
static_assert(sizeof(BP_CampTopCtrl_C_GSubstatus_CampResult) == 0x0000B0, "Wrong size on BP_CampTopCtrl_C_GSubstatus_CampResult");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, OurFinished) == 0x000000, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::OurFinished' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, CallFunc_Get_ReturnValue) == 0x000008, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, CallFunc_ICampCharaPanelRestartLevelUpVisible_OutFlag) == 0x000010, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::CallFunc_ICampCharaPanelRestartLevelUpVisible_OutFlag' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, CallFunc_ICampItemAllOn_OutValue) == 0x000011, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::CallFunc_ICampItemAllOn_OutValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, Temp_int_Variable) == 0x000014, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, K2Node_DynamicCast_AsBPI_Camp_Result) == 0x000020, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::K2Node_DynamicCast_AsBPI_Camp_Result' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, CallFunc_ICampCharaPanelGetPartyNkmIndex_OutNkmIndex) == 0x000034, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::CallFunc_ICampCharaPanelGetPartyNkmIndex_OutNkmIndex' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, CallFunc_ICampCharaPanelGetMaxNumberOfItem_OutLevel) == 0x000038, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::CallFunc_ICampCharaPanelGetMaxNumberOfItem_OutLevel' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00003C, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, CallFunc_StartCampResult_Success) == 0x00003D, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::CallFunc_StartCampResult_Success' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, CallFunc_ICampItemALLOff_OutValue) == 0x00003E, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::CallFunc_ICampItemALLOff_OutValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, CallFunc_ICampCharaPanelLevelUpVisibleOff_OutFlag) == 0x00003F, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::CallFunc_ICampCharaPanelLevelUpVisibleOff_OutFlag' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, CallFunc_IsPlaying_isPlaying) == 0x000040, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::CallFunc_IsPlaying_isPlaying' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, Temp_int_Variable_1) == 0x000044, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, CallFunc_ScreenTransition_isFadeFinish_outValue) == 0x00004C, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::CallFunc_ScreenTransition_isFadeFinish_outValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, K2Node_DynamicCast_AsBPI_Camp_Result_1) == 0x000050, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::K2Node_DynamicCast_AsBPI_Camp_Result_1' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, CallFunc_IsEndCampResult_IsEnd) == 0x000061, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::CallFunc_IsEndCampResult_IsEnd' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, K2Node_DynamicCast_AsBPI_Camp_Result_2) == 0x000068, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::K2Node_DynamicCast_AsBPI_Camp_Result_2' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, CallFunc_StartCampResult_Success_1) == 0x000079, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::CallFunc_StartCampResult_Success_1' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, Temp_int_Variable_2) == 0x00007C, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, Temp_int_Variable_3) == 0x000080, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, Temp_int_Variable_4) == 0x000084, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, Temp_int_Variable_5) == 0x000088, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, CallFunc_IsValid_ReturnValue) == 0x00008C, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, CallFunc_Add_IntInt_ReturnValue_2) == 0x000090, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, Temp_int_Variable_6) == 0x000094, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, CallFunc_Add_IntInt_ReturnValue_3) == 0x000098, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, CallFunc_Add_IntInt_ReturnValue_4) == 0x00009C, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, CallFunc_Add_IntInt_ReturnValue_5) == 0x0000A0, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, CallFunc_Add_IntInt_ReturnValue_6) == 0x0000A4, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubstatus_CampResult, K2Node_SwitchInteger_CmpSuccess) == 0x0000A8, "Member 'BP_CampTopCtrl_C_GSubstatus_CampResult::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function BP_CampTopCtrl.BP_CampTopCtrl_C.CalcIconHelp
// 0x0003 (0x0003 - 0x0000)
struct BP_CampTopCtrl_C_CalcIconHelp final
{
public:
	bool                                          OutProc;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLoadedCtrl_OutFinished;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBootingIconHelp_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampTopCtrl_C_CalcIconHelp) == 0x000001, "Wrong alignment on BP_CampTopCtrl_C_CalcIconHelp");
static_assert(sizeof(BP_CampTopCtrl_C_CalcIconHelp) == 0x000003, "Wrong size on BP_CampTopCtrl_C_CalcIconHelp");
static_assert(offsetof(BP_CampTopCtrl_C_CalcIconHelp, OutProc) == 0x000000, "Member 'BP_CampTopCtrl_C_CalcIconHelp::OutProc' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_CalcIconHelp, CallFunc_IsLoadedCtrl_OutFinished) == 0x000001, "Member 'BP_CampTopCtrl_C_CalcIconHelp::CallFunc_IsLoadedCtrl_OutFinished' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_CalcIconHelp, CallFunc_IsBootingIconHelp_ReturnValue) == 0x000002, "Member 'BP_CampTopCtrl_C_CalcIconHelp::CallFunc_IsBootingIconHelp_ReturnValue' has a wrong offset!");

// Function BP_CampTopCtrl.BP_CampTopCtrl_C.CloseMiitsuWindow
// 0x0002 (0x0002 - 0x0000)
struct BP_CampTopCtrl_C_CloseMiitsuWindow final
{
public:
	bool                                          InSkipAnimation;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampTopCtrl_C_CloseMiitsuWindow) == 0x000001, "Wrong alignment on BP_CampTopCtrl_C_CloseMiitsuWindow");
static_assert(sizeof(BP_CampTopCtrl_C_CloseMiitsuWindow) == 0x000002, "Wrong size on BP_CampTopCtrl_C_CloseMiitsuWindow");
static_assert(offsetof(BP_CampTopCtrl_C_CloseMiitsuWindow, InSkipAnimation) == 0x000000, "Member 'BP_CampTopCtrl_C_CloseMiitsuWindow::InSkipAnimation' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_CloseMiitsuWindow, CallFunc_CheckEventFlag_ReturnValue) == 0x000001, "Member 'BP_CampTopCtrl_C_CloseMiitsuWindow::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");

// Function BP_CampTopCtrl.BP_CampTopCtrl_C.OpenMiitsuWindow
// 0x000C (0x000C - 0x0000)
struct BP_CampTopCtrl_C_OpenMiitsuWindow final
{
public:
	bool                                          InSkipAnimation;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BD1[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGodParameterPoint_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampTopCtrl_C_OpenMiitsuWindow) == 0x000004, "Wrong alignment on BP_CampTopCtrl_C_OpenMiitsuWindow");
static_assert(sizeof(BP_CampTopCtrl_C_OpenMiitsuWindow) == 0x00000C, "Wrong size on BP_CampTopCtrl_C_OpenMiitsuWindow");
static_assert(offsetof(BP_CampTopCtrl_C_OpenMiitsuWindow, InSkipAnimation) == 0x000000, "Member 'BP_CampTopCtrl_C_OpenMiitsuWindow::InSkipAnimation' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_OpenMiitsuWindow, CallFunc_GetGodParameterPoint_ReturnValue) == 0x000004, "Member 'BP_CampTopCtrl_C_OpenMiitsuWindow::CallFunc_GetGodParameterPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_OpenMiitsuWindow, CallFunc_CheckEventFlag_ReturnValue) == 0x000008, "Member 'BP_CampTopCtrl_C_OpenMiitsuWindow::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");

// Function BP_CampTopCtrl.BP_CampTopCtrl_C.GSubStatus_Help
// 0x002C (0x002C - 0x0000)
struct BP_CampTopCtrl_C_GSubStatus_Help final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInitializedOpenTopMenu_IsOpened;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BD2[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ICampHelpProc_OutFinished;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BD3[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInitializedOpenTopMenu_IsOpened_1;      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInitializedOpenTopMenu_IsOpened_2;      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ICampCharaPanelIsFinishedCharaPanel_OutFinished; // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BD4[0x1];                                     // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampTopCtrl_C_GSubStatus_Help) == 0x000004, "Wrong alignment on BP_CampTopCtrl_C_GSubStatus_Help");
static_assert(sizeof(BP_CampTopCtrl_C_GSubStatus_Help) == 0x00002C, "Wrong size on BP_CampTopCtrl_C_GSubStatus_Help");
static_assert(offsetof(BP_CampTopCtrl_C_GSubStatus_Help, Temp_int_Variable) == 0x000000, "Member 'BP_CampTopCtrl_C_GSubStatus_Help::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubStatus_Help, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_CampTopCtrl_C_GSubStatus_Help::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubStatus_Help, CallFunc_IsInitializedOpenTopMenu_IsOpened) == 0x000008, "Member 'BP_CampTopCtrl_C_GSubStatus_Help::CallFunc_IsInitializedOpenTopMenu_IsOpened' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubStatus_Help, Temp_int_Variable_1) == 0x00000C, "Member 'BP_CampTopCtrl_C_GSubStatus_Help::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubStatus_Help, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'BP_CampTopCtrl_C_GSubStatus_Help::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubStatus_Help, CallFunc_ICampHelpProc_OutFinished) == 0x000014, "Member 'BP_CampTopCtrl_C_GSubStatus_Help::CallFunc_ICampHelpProc_OutFinished' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubStatus_Help, Temp_int_Variable_2) == 0x000018, "Member 'BP_CampTopCtrl_C_GSubStatus_Help::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubStatus_Help, CallFunc_IsInitializedOpenTopMenu_IsOpened_1) == 0x00001C, "Member 'BP_CampTopCtrl_C_GSubStatus_Help::CallFunc_IsInitializedOpenTopMenu_IsOpened_1' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubStatus_Help, CallFunc_IsInitializedOpenTopMenu_IsOpened_2) == 0x00001D, "Member 'BP_CampTopCtrl_C_GSubStatus_Help::CallFunc_IsInitializedOpenTopMenu_IsOpened_2' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubStatus_Help, CallFunc_ICampCharaPanelIsFinishedCharaPanel_OutFinished) == 0x00001E, "Member 'BP_CampTopCtrl_C_GSubStatus_Help::CallFunc_ICampCharaPanelIsFinishedCharaPanel_OutFinished' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubStatus_Help, CallFunc_Add_IntInt_ReturnValue_2) == 0x000020, "Member 'BP_CampTopCtrl_C_GSubStatus_Help::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubStatus_Help, CallFunc_Add_IntInt_ReturnValue_3) == 0x000024, "Member 'BP_CampTopCtrl_C_GSubStatus_Help::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_GSubStatus_Help, K2Node_SwitchInteger_CmpSuccess) == 0x000028, "Member 'BP_CampTopCtrl_C_GSubStatus_Help::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function BP_CampTopCtrl.BP_CampTopCtrl_C.SystemMenuMouseMove
// 0x0038 (0x0038 - 0x0000)
struct BP_CampTopCtrl_C_SystemMenuMouseMove final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Oldcursor;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetMovingCursor_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BD5[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetSubMenuCursorIndex_ReturnValue;        // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSystemMenuFocus_OutFocus;               // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BD6[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSubMenuColor_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalcSubMenuCursor_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSubMenuColor_ReturnValue_1;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampTopCtrl_C_SystemMenuMouseMove) == 0x000008, "Wrong alignment on BP_CampTopCtrl_C_SystemMenuMouseMove");
static_assert(sizeof(BP_CampTopCtrl_C_SystemMenuMouseMove) == 0x000038, "Wrong size on BP_CampTopCtrl_C_SystemMenuMouseMove");
static_assert(offsetof(BP_CampTopCtrl_C_SystemMenuMouseMove, InIndex) == 0x000000, "Member 'BP_CampTopCtrl_C_SystemMenuMouseMove::InIndex' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_SystemMenuMouseMove, Oldcursor) == 0x000004, "Member 'BP_CampTopCtrl_C_SystemMenuMouseMove::Oldcursor' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_SystemMenuMouseMove, CallFunc_SetMovingCursor_ReturnValue) == 0x000008, "Member 'BP_CampTopCtrl_C_SystemMenuMouseMove::CallFunc_SetMovingCursor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_SystemMenuMouseMove, CallFunc_Get_ReturnValue) == 0x000010, "Member 'BP_CampTopCtrl_C_SystemMenuMouseMove::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_SystemMenuMouseMove, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_CampTopCtrl_C_SystemMenuMouseMove::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_SystemMenuMouseMove, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00001C, "Member 'BP_CampTopCtrl_C_SystemMenuMouseMove::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_SystemMenuMouseMove, CallFunc_SetSubMenuCursorIndex_ReturnValue) == 0x00001D, "Member 'BP_CampTopCtrl_C_SystemMenuMouseMove::CallFunc_SetSubMenuCursorIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_SystemMenuMouseMove, CallFunc_IsSystemMenuFocus_OutFocus) == 0x00001E, "Member 'BP_CampTopCtrl_C_SystemMenuMouseMove::CallFunc_IsSystemMenuFocus_OutFocus' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_SystemMenuMouseMove, CallFunc_BooleanOR_ReturnValue) == 0x00001F, "Member 'BP_CampTopCtrl_C_SystemMenuMouseMove::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_SystemMenuMouseMove, CallFunc_BooleanOR_ReturnValue_1) == 0x000020, "Member 'BP_CampTopCtrl_C_SystemMenuMouseMove::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_SystemMenuMouseMove, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'BP_CampTopCtrl_C_SystemMenuMouseMove::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_SystemMenuMouseMove, CallFunc_GetSubMenuColor_ReturnValue) == 0x000028, "Member 'BP_CampTopCtrl_C_SystemMenuMouseMove::CallFunc_GetSubMenuColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_SystemMenuMouseMove, CallFunc_CalcSubMenuCursor_ReturnValue) == 0x00002C, "Member 'BP_CampTopCtrl_C_SystemMenuMouseMove::CallFunc_CalcSubMenuCursor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_SystemMenuMouseMove, CallFunc_GetSubMenuColor_ReturnValue_1) == 0x000030, "Member 'BP_CampTopCtrl_C_SystemMenuMouseMove::CallFunc_GetSubMenuColor_ReturnValue_1' has a wrong offset!");

// Function BP_CampTopCtrl.BP_CampTopCtrl_C.IsSystemMenuFocus
// 0x0003 (0x0003 - 0x0000)
struct BP_CampTopCtrl_C_IsSystemMenuFocus final
{
public:
	bool                                          OutFocus;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Retfocus;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampTopCtrl_C_IsSystemMenuFocus) == 0x000001, "Wrong alignment on BP_CampTopCtrl_C_IsSystemMenuFocus");
static_assert(sizeof(BP_CampTopCtrl_C_IsSystemMenuFocus) == 0x000003, "Wrong size on BP_CampTopCtrl_C_IsSystemMenuFocus");
static_assert(offsetof(BP_CampTopCtrl_C_IsSystemMenuFocus, OutFocus) == 0x000000, "Member 'BP_CampTopCtrl_C_IsSystemMenuFocus::OutFocus' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_IsSystemMenuFocus, Retfocus) == 0x000001, "Member 'BP_CampTopCtrl_C_IsSystemMenuFocus::Retfocus' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_IsSystemMenuFocus, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'BP_CampTopCtrl_C_IsSystemMenuFocus::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_CampTopCtrl.BP_CampTopCtrl_C.IsTopMenuFocus
// 0x0004 (0x0004 - 0x0000)
struct BP_CampTopCtrl_C_IsTopMenuFocus final
{
public:
	bool                                          RetForcus;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Retparam;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampTopCtrl_C_IsTopMenuFocus) == 0x000001, "Wrong alignment on BP_CampTopCtrl_C_IsTopMenuFocus");
static_assert(sizeof(BP_CampTopCtrl_C_IsTopMenuFocus) == 0x000004, "Wrong size on BP_CampTopCtrl_C_IsTopMenuFocus");
static_assert(offsetof(BP_CampTopCtrl_C_IsTopMenuFocus, RetForcus) == 0x000000, "Member 'BP_CampTopCtrl_C_IsTopMenuFocus::RetForcus' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_IsTopMenuFocus, Retparam) == 0x000001, "Member 'BP_CampTopCtrl_C_IsTopMenuFocus::Retparam' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_IsTopMenuFocus, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000002, "Member 'BP_CampTopCtrl_C_IsTopMenuFocus::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_IsTopMenuFocus, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000003, "Member 'BP_CampTopCtrl_C_IsTopMenuFocus::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_CampTopCtrl.BP_CampTopCtrl_C.SetTopMenuMouseMove
// 0x0028 (0x0028 - 0x0000)
struct BP_CampTopCtrl_C_SetTopMenuMouseMove final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Oldcursor;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetMovingCursor_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BD7[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTopMenuFocus_RetForcus;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BD8[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CalcTopMenuCursor_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetTopMenuCursorIndex_ReturnValue;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampTopCtrl_C_SetTopMenuMouseMove) == 0x000008, "Wrong alignment on BP_CampTopCtrl_C_SetTopMenuMouseMove");
static_assert(sizeof(BP_CampTopCtrl_C_SetTopMenuMouseMove) == 0x000028, "Wrong size on BP_CampTopCtrl_C_SetTopMenuMouseMove");
static_assert(offsetof(BP_CampTopCtrl_C_SetTopMenuMouseMove, InIndex) == 0x000000, "Member 'BP_CampTopCtrl_C_SetTopMenuMouseMove::InIndex' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_SetTopMenuMouseMove, Oldcursor) == 0x000004, "Member 'BP_CampTopCtrl_C_SetTopMenuMouseMove::Oldcursor' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_SetTopMenuMouseMove, CallFunc_SetMovingCursor_ReturnValue) == 0x000008, "Member 'BP_CampTopCtrl_C_SetTopMenuMouseMove::CallFunc_SetMovingCursor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_SetTopMenuMouseMove, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'BP_CampTopCtrl_C_SetTopMenuMouseMove::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_SetTopMenuMouseMove, CallFunc_IsTopMenuFocus_RetForcus) == 0x000010, "Member 'BP_CampTopCtrl_C_SetTopMenuMouseMove::CallFunc_IsTopMenuFocus_RetForcus' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_SetTopMenuMouseMove, CallFunc_CalcTopMenuCursor_ReturnValue) == 0x000014, "Member 'BP_CampTopCtrl_C_SetTopMenuMouseMove::CallFunc_CalcTopMenuCursor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_SetTopMenuMouseMove, CallFunc_Get_ReturnValue) == 0x000018, "Member 'BP_CampTopCtrl_C_SetTopMenuMouseMove::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_SetTopMenuMouseMove, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000020, "Member 'BP_CampTopCtrl_C_SetTopMenuMouseMove::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampTopCtrl_C_SetTopMenuMouseMove, CallFunc_SetTopMenuCursorIndex_ReturnValue) == 0x000021, "Member 'BP_CampTopCtrl_C_SetTopMenuMouseMove::CallFunc_SetTopMenuCursorIndex_ReturnValue' has a wrong offset!");

// Function BP_CampTopCtrl.BP_CampTopCtrl_C.GSubstatus_Save
// 0x0098 (0x0098 - 0x0000)
struct BP_CampTopCtrl_C_GSubstatus_Save final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInitializedOpenTopMenu_IsOpened;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInitializedOpenTopMenu_IsOpened_1;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInitializedOpenTopMenu_IsOpened_2;      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BD9[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SaveLoadCtrl_C>   K2Node_DynamicCast_AsBPI_Save_Load_Ctrl;           // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BDA[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8BDB[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SaveLoadCtrl_C>   K2Node_DynamicCast_AsBPI_Save_Load_Ctrl_1;         // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BDC[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SaveLoadEndType                             CallFunc_isEndSaveLoad_outEndType;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BDD[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SaveLoadCtrl_C>   K2Node_DynamicCast_AsBPI_Save_Load_Ctrl_2;         // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BDE[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
