#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CampQuestCtrl2

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "E_CampQuest_CtrlState_structs.hpp"
#include "E_CATEGORYWINDOW_MOUSE_EVENT_TYPE_structs.hpp"
#include "ST_BtnHelp_ColorInfo_byIdx_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CampQuestCtrl2.BP_CampQuestCtrl2_C.CampQuest_GetSubState
// 0x0004 (0x0004 - 0x0000)
struct BP_CampQuestCtrl2_C_CampQuest_GetSubState final
{
public:
	int32                                         Param_SubState;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampQuestCtrl2_C_CampQuest_GetSubState) == 0x000004, "Wrong alignment on BP_CampQuestCtrl2_C_CampQuest_GetSubState");
static_assert(sizeof(BP_CampQuestCtrl2_C_CampQuest_GetSubState) == 0x000004, "Wrong size on BP_CampQuestCtrl2_C_CampQuest_GetSubState");
static_assert(offsetof(BP_CampQuestCtrl2_C_CampQuest_GetSubState, Param_SubState) == 0x000000, "Member 'BP_CampQuestCtrl2_C_CampQuest_GetSubState::Param_SubState' has a wrong offset!");

// Function BP_CampQuestCtrl2.BP_CampQuestCtrl2_C.CampQuest_GetState
// 0x0001 (0x0001 - 0x0000)
struct BP_CampQuestCtrl2_C_CampQuest_GetState final
{
public:
	E_CampQuest_CtrlState                         CampQuestState;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampQuestCtrl2_C_CampQuest_GetState) == 0x000001, "Wrong alignment on BP_CampQuestCtrl2_C_CampQuest_GetState");
static_assert(sizeof(BP_CampQuestCtrl2_C_CampQuest_GetState) == 0x000001, "Wrong size on BP_CampQuestCtrl2_C_CampQuest_GetState");
static_assert(offsetof(BP_CampQuestCtrl2_C_CampQuest_GetState, CampQuestState) == 0x000000, "Member 'BP_CampQuestCtrl2_C_CampQuest_GetState::CampQuestState' has a wrong offset!");

// Function BP_CampQuestCtrl2.BP_CampQuestCtrl2_C.CampQuest_IsExistNewIcon
// 0x0002 (0x0002 - 0x0000)
struct BP_CampQuestCtrl2_C_CampQuest_IsExistNewIcon final
{
public:
	bool                                          ExistNewIcon;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsExistNewQuest_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampQuestCtrl2_C_CampQuest_IsExistNewIcon) == 0x000001, "Wrong alignment on BP_CampQuestCtrl2_C_CampQuest_IsExistNewIcon");
static_assert(sizeof(BP_CampQuestCtrl2_C_CampQuest_IsExistNewIcon) == 0x000002, "Wrong size on BP_CampQuestCtrl2_C_CampQuest_IsExistNewIcon");
static_assert(offsetof(BP_CampQuestCtrl2_C_CampQuest_IsExistNewIcon, ExistNewIcon) == 0x000000, "Member 'BP_CampQuestCtrl2_C_CampQuest_IsExistNewIcon::ExistNewIcon' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CampQuest_IsExistNewIcon, CallFunc_IsExistNewQuest_ReturnValue) == 0x000001, "Member 'BP_CampQuestCtrl2_C_CampQuest_IsExistNewIcon::CallFunc_IsExistNewQuest_ReturnValue' has a wrong offset!");

// Function BP_CampQuestCtrl2.BP_CampQuestCtrl2_C.PadCheck_Purpose
// 0x0108 (0x0108 - 0x0000)
struct BP_CampQuestCtrl2_C_PadCheck_Purpose final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_905F[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9060[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DialogCtrl_C>     CallFunc_BPI_GetDialogWindowCtrl_OutActor;         // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IIsClosedDialogWindow_OutFinished;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9061[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9062[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_1;                        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9063[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9064[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DialogCtrl_C>     CallFunc_BPI_GetDialogWindowCtrl_OutActor_1;       // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_2;                        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IWasConfirmedByMouse_bConfirmed;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9065[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IWasConfirmedByMouse_ItemIndex;           // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_3;                        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9066[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DialogCtrl_C>     CallFunc_BPI_GetDialogWindowCtrl_OutActor_2;       // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9067[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_4;                        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_3;              // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9068[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DialogCtrl_C>     CallFunc_BPI_GetDialogWindowCtrl_OutActor_3;       // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IIsOpenedDialogWindow_OutFinished;        // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampQuestCtrl2_C_PadCheck_Purpose) == 0x000008, "Wrong alignment on BP_CampQuestCtrl2_C_PadCheck_Purpose");
static_assert(sizeof(BP_CampQuestCtrl2_C_PadCheck_Purpose) == 0x000108, "Wrong size on BP_CampQuestCtrl2_C_PadCheck_Purpose");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, Temp_int_Variable) == 0x000000, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, Temp_int_Variable_1) == 0x000004, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, CallFunc_IsActionPadCheck_Success) == 0x000008, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, CallFunc_Get_ReturnValue) == 0x000010, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, CallFunc_BPI_GetDialogWindowCtrl_OutActor) == 0x000030, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::CallFunc_BPI_GetDialogWindowCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, CallFunc_IIsClosedDialogWindow_OutFinished) == 0x000040, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::CallFunc_IIsClosedDialogWindow_OutFinished' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, CallFunc_IsActionPadCheck_Success_1) == 0x000048, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::CallFunc_IsActionPadCheck_Success_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, CallFunc_Get_ReturnValue_1) == 0x000050, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, CallFunc_BooleanOR_ReturnValue) == 0x000058, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000060, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, CallFunc_BPI_GetDialogWindowCtrl_OutActor_1) == 0x000078, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::CallFunc_BPI_GetDialogWindowCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, CallFunc_Get_ReturnValue_2) == 0x000088, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, CallFunc_IWasConfirmedByMouse_bConfirmed) == 0x000090, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::CallFunc_IWasConfirmedByMouse_bConfirmed' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, CallFunc_IWasConfirmedByMouse_ItemIndex) == 0x000094, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::CallFunc_IWasConfirmedByMouse_ItemIndex' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, CallFunc_Get_ReturnValue_3) == 0x000098, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::CallFunc_Get_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, K2Node_DynamicCast_AsBPI_UIManager_2) == 0x0000A0, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::K2Node_DynamicCast_AsBPI_UIManager_2' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, CallFunc_BPI_GetDialogWindowCtrl_OutActor_2) == 0x0000B8, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::CallFunc_BPI_GetDialogWindowCtrl_OutActor_2' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C8, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, CallFunc_Get_ReturnValue_4) == 0x0000D0, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::CallFunc_Get_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, K2Node_DynamicCast_AsBPI_UIManager_3) == 0x0000D8, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::K2Node_DynamicCast_AsBPI_UIManager_3' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, K2Node_DynamicCast_bSuccess_3) == 0x0000E8, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, CallFunc_BPI_GetDialogWindowCtrl_OutActor_3) == 0x0000F0, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::CallFunc_BPI_GetDialogWindowCtrl_OutActor_3' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, K2Node_SwitchInteger_CmpSuccess) == 0x000100, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, CallFunc_IIsOpenedDialogWindow_OutFinished) == 0x000101, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::CallFunc_IIsOpenedDialogWindow_OutFinished' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_PadCheck_Purpose, K2Node_SwitchEnum_CmpSuccess) == 0x000102, "Member 'BP_CampQuestCtrl2_C_PadCheck_Purpose::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_CampQuestCtrl2.BP_CampQuestCtrl2_C.OnCategoryWIndouMouseEvent
// 0x0030 (0x0030 - 0x0000)
struct BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent final
{
public:
	E_CATEGORYWINDOW_MOUSE_EVENT_TYPE             InMouseEventType;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9069[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InSelectCategoryIcon;                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_906A[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CategoryWindow_getCursorIndex_CursorIndex; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_906B[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_906C[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLastSelectIdx_SlotDrawNum;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_INOUT_IsAnimPlaying;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_INOUT_IsAnimPlaying_1;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent) == 0x000008, "Wrong alignment on BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent");
static_assert(sizeof(BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent) == 0x000030, "Wrong size on BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent, InMouseEventType) == 0x000000, "Member 'BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent::InMouseEventType' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent, InSelectCategoryIcon) == 0x000004, "Member 'BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent::InSelectCategoryIcon' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent, K2Node_SwitchInteger_CmpSuccess) == 0x000009, "Member 'BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent, CallFunc_CategoryWindow_getCursorIndex_CursorIndex) == 0x00000C, "Member 'BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent::CallFunc_CategoryWindow_getCursorIndex_CursorIndex' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000010, "Member 'BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent, K2Node_SwitchEnum_CmpSuccess_1) == 0x000011, "Member 'BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent, CallFunc_SpawnSound2D_ReturnValue) == 0x000018, "Member 'BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent, K2Node_SwitchEnum_CmpSuccess_2) == 0x000020, "Member 'BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent, CallFunc_GetLastSelectIdx_SlotDrawNum) == 0x000024, "Member 'BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent::CallFunc_GetLastSelectIdx_SlotDrawNum' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent, CallFunc_IsPlaying_INOUT_IsAnimPlaying) == 0x000028, "Member 'BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent::CallFunc_IsPlaying_INOUT_IsAnimPlaying' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent, K2Node_SwitchEnum_CmpSuccess_3) == 0x000029, "Member 'BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent, CallFunc_IsPlaying_INOUT_IsAnimPlaying_1) == 0x00002A, "Member 'BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent::CallFunc_IsPlaying_INOUT_IsAnimPlaying_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent, K2Node_SwitchEnum_CmpSuccess_4) == 0x00002B, "Member 'BP_CampQuestCtrl2_C_OnCategoryWIndouMouseEvent::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");

// Function BP_CampQuestCtrl2.BP_CampQuestCtrl2_C.OnMovedSummaryScrollBar_ByMouse
// 0x0040 (0x0040 - 0x0000)
struct BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse final
{
public:
	float                                         InScrollRate;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_NewOffset;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSummaryScrollState_IsScroll;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_906D[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSummaryScrollState_ScrollRate;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSummaryScrollState_ScrollOffset;       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_906E[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxSummaryScrollOffset_MaxOffset;      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSummaryScrollState_IsScroll_1;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_906F[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSummaryScrollState_ScrollRate_1;       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSummaryScrollState_ScrollOffset_1;     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse) == 0x000008, "Wrong alignment on BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse");
static_assert(sizeof(BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse) == 0x000040, "Wrong size on BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse, InScrollRate) == 0x000000, "Member 'BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse::InScrollRate' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse, L_NewOffset) == 0x000004, "Member 'BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse::L_NewOffset' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse, CallFunc_GetSummaryScrollState_IsScroll) == 0x000008, "Member 'BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse::CallFunc_GetSummaryScrollState_IsScroll' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse, CallFunc_GetSummaryScrollState_ScrollRate) == 0x00000C, "Member 'BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse::CallFunc_GetSummaryScrollState_ScrollRate' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse, CallFunc_GetSummaryScrollState_ScrollOffset) == 0x000010, "Member 'BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse::CallFunc_GetSummaryScrollState_ScrollOffset' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse, CallFunc_SpawnSound2D_ReturnValue) == 0x000018, "Member 'BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse, CallFunc_GetMaxSummaryScrollOffset_MaxOffset) == 0x000020, "Member 'BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse::CallFunc_GetMaxSummaryScrollOffset_MaxOffset' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000024, "Member 'BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse, CallFunc_GetSummaryScrollState_IsScroll_1) == 0x000028, "Member 'BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse::CallFunc_GetSummaryScrollState_IsScroll_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse, CallFunc_GetSummaryScrollState_ScrollRate_1) == 0x00002C, "Member 'BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse::CallFunc_GetSummaryScrollState_ScrollRate_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse, CallFunc_GetSummaryScrollState_ScrollOffset_1) == 0x000030, "Member 'BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse::CallFunc_GetSummaryScrollState_ScrollOffset_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000034, "Member 'BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse, CallFunc_Round_ReturnValue) == 0x000038, "Member 'BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse, K2Node_SwitchEnum_CmpSuccess) == 0x00003C, "Member 'BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00003D, "Member 'BP_CampQuestCtrl2_C_OnMovedSummaryScrollBar_ByMouse::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CampQuestCtrl2.BP_CampQuestCtrl2_C.OnMovedSlotListScrollBar_ByMouse
// 0x0078 (0x0078 - 0x0000)
struct BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse final
{
public:
	float                                         InScrollRate;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9070[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ScrollBar_C*                        CallFunc_GetScrollBarWidget_ScrollBar_Quest;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ScrollBar_C*                        CallFunc_GetScrollBarWidget_ScrollBar_Summary;     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotMaxDraw_MaxDrawNum;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9071[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCampQuestListData>             CallFunc_GetDataList_ReturnValue;                  // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BarPositionToTopIndex_OutTopIndex;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9072[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDIspMaxOffset_DispMaxOffset;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9073[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCampQuestListData>             CallFunc_GetDataList_ReturnValue_1;                // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCursorIndex_SlotIndex;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9074[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDIspMaxOffset_DispMaxOffset_1;         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse) == 0x000008, "Wrong alignment on BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse");
static_assert(sizeof(BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse) == 0x000078, "Wrong size on BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse, InScrollRate) == 0x000000, "Member 'BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse::InScrollRate' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse, CallFunc_GetScrollBarWidget_ScrollBar_Quest) == 0x000008, "Member 'BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse::CallFunc_GetScrollBarWidget_ScrollBar_Quest' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse, CallFunc_GetScrollBarWidget_ScrollBar_Summary) == 0x000010, "Member 'BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse::CallFunc_GetScrollBarWidget_ScrollBar_Summary' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse, CallFunc_GetSlotMaxDraw_MaxDrawNum) == 0x000018, "Member 'BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse::CallFunc_GetSlotMaxDraw_MaxDrawNum' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse, CallFunc_GetDataList_ReturnValue) == 0x000020, "Member 'BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse::CallFunc_GetDataList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse, CallFunc_BarPositionToTopIndex_OutTopIndex) == 0x000034, "Member 'BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse::CallFunc_BarPositionToTopIndex_OutTopIndex' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00003C, "Member 'BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse, CallFunc_GetDIspMaxOffset_DispMaxOffset) == 0x000040, "Member 'BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse::CallFunc_GetDIspMaxOffset_DispMaxOffset' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000044, "Member 'BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse, CallFunc_GetDataList_ReturnValue_1) == 0x000048, "Member 'BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse::CallFunc_GetDataList_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse, CallFunc_Array_LastIndex_ReturnValue) == 0x000058, "Member 'BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse, CallFunc_GetCursorIndex_SlotIndex) == 0x00005C, "Member 'BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse::CallFunc_GetCursorIndex_SlotIndex' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse, CallFunc_Get_ReturnValue) == 0x000068, "Member 'BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse, CallFunc_GetDIspMaxOffset_DispMaxOffset_1) == 0x000070, "Member 'BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse::CallFunc_GetDIspMaxOffset_DispMaxOffset_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000075, "Member 'BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse, K2Node_SwitchEnum_CmpSuccess) == 0x000076, "Member 'BP_CampQuestCtrl2_C_OnMovedSlotListScrollBar_ByMouse::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_CampQuestCtrl2.BP_CampQuestCtrl2_C.OnHoveredMouseToSlot
// 0x0020 (0x0020 - 0x0000)
struct BP_CampQuestCtrl2_C_OnHoveredMouseToSlot final
{
public:
	int32                                         InSlotIdx;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCursorIndex_SlotIndex;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9075[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampQuestCtrl2_C_OnHoveredMouseToSlot) == 0x000008, "Wrong alignment on BP_CampQuestCtrl2_C_OnHoveredMouseToSlot");
static_assert(sizeof(BP_CampQuestCtrl2_C_OnHoveredMouseToSlot) == 0x000020, "Wrong size on BP_CampQuestCtrl2_C_OnHoveredMouseToSlot");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnHoveredMouseToSlot, InSlotIdx) == 0x000000, "Member 'BP_CampQuestCtrl2_C_OnHoveredMouseToSlot::InSlotIdx' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnHoveredMouseToSlot, CallFunc_GetCursorIndex_SlotIndex) == 0x000004, "Member 'BP_CampQuestCtrl2_C_OnHoveredMouseToSlot::CallFunc_GetCursorIndex_SlotIndex' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnHoveredMouseToSlot, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_CampQuestCtrl2_C_OnHoveredMouseToSlot::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnHoveredMouseToSlot, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000009, "Member 'BP_CampQuestCtrl2_C_OnHoveredMouseToSlot::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnHoveredMouseToSlot, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'BP_CampQuestCtrl2_C_OnHoveredMouseToSlot::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnHoveredMouseToSlot, K2Node_SwitchEnum_CmpSuccess) == 0x00000B, "Member 'BP_CampQuestCtrl2_C_OnHoveredMouseToSlot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnHoveredMouseToSlot, CallFunc_Get_ReturnValue) == 0x000010, "Member 'BP_CampQuestCtrl2_C_OnHoveredMouseToSlot::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_OnHoveredMouseToSlot, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_CampQuestCtrl2_C_OnHoveredMouseToSlot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CampQuestCtrl2.BP_CampQuestCtrl2_C.CheckMouseWheel
// 0x0060 (0x0060 - 0x0000)
struct BP_CampQuestCtrl2_C_CheckMouseWheel final
{
public:
	float                                         L_MouseFocusRate_Summary;                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_MouseFocusRate_Slot;                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMouseWheelAxis_Axis;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableMouseWheel_IsEnableScroll_L;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableMouseWheel_IsEnableScroll_R;      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetMouseWheelAxis_Axis_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetButtonS5ExclusiveDragging_ReturnValue; // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9076[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSummaryScrollState_IsScroll;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9077[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSummaryScrollState_ScrollRate;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSummaryScrollState_ScrollOffset;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSummaryScrollState_IsScroll_1;         // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9078[0x1];                                     // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSummaryScrollState_ScrollRate_1;       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSummaryScrollState_ScrollOffset_1;     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_3;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableMouseWheel_IsEnableScroll_L_1;    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableMouseWheel_IsEnableScroll_R_1;    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9079[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDIspMaxOffset_DispMaxOffset;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_907A[0x2];                                     // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCursorIndex_SlotIndex;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampQuestCtrl2_C_CheckMouseWheel) == 0x000008, "Wrong alignment on BP_CampQuestCtrl2_C_CheckMouseWheel");
static_assert(sizeof(BP_CampQuestCtrl2_C_CheckMouseWheel) == 0x000060, "Wrong size on BP_CampQuestCtrl2_C_CheckMouseWheel");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, L_MouseFocusRate_Summary) == 0x000000, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::L_MouseFocusRate_Summary' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, L_MouseFocusRate_Slot) == 0x000004, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::L_MouseFocusRate_Slot' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_GetMouseWheelAxis_Axis) == 0x000008, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_GetMouseWheelAxis_Axis' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_IsEnableMouseWheel_IsEnableScroll_L) == 0x00000C, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_IsEnableMouseWheel_IsEnableScroll_L' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_IsEnableMouseWheel_IsEnableScroll_R) == 0x00000D, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_IsEnableMouseWheel_IsEnableScroll_R' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_Less_FloatFloat_ReturnValue) == 0x00000E, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000F, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_GetMouseWheelAxis_Axis_1) == 0x000010, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_GetMouseWheelAxis_Axis_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000014, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000015, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_GetButtonS5ExclusiveDragging_ReturnValue) == 0x000016, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_GetButtonS5ExclusiveDragging_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_SpawnSound2D_ReturnValue) == 0x000018, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_GetSummaryScrollState_IsScroll) == 0x000020, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_GetSummaryScrollState_IsScroll' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_GetSummaryScrollState_ScrollRate) == 0x000024, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_GetSummaryScrollState_ScrollRate' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_GetSummaryScrollState_ScrollOffset) == 0x000028, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_GetSummaryScrollState_ScrollOffset' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x00002C, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_BooleanAND_ReturnValue) == 0x00002D, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_GetSummaryScrollState_IsScroll_1) == 0x00002E, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_GetSummaryScrollState_IsScroll_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_GetSummaryScrollState_ScrollRate_1) == 0x000030, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_GetSummaryScrollState_ScrollRate_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_GetSummaryScrollState_ScrollOffset_1) == 0x000034, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_GetSummaryScrollState_ScrollOffset_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_Less_FloatFloat_ReturnValue_3) == 0x000038, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_Less_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_IsEnableMouseWheel_IsEnableScroll_L_1) == 0x000039, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_IsEnableMouseWheel_IsEnableScroll_L_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_IsEnableMouseWheel_IsEnableScroll_R_1) == 0x00003A, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_IsEnableMouseWheel_IsEnableScroll_R_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_BooleanAND_ReturnValue_1) == 0x00003B, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00003C, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_GetDIspMaxOffset_DispMaxOffset) == 0x000040, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_GetDIspMaxOffset_DispMaxOffset' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_Less_IntInt_ReturnValue_1) == 0x000045, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_Get_ReturnValue) == 0x000048, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_GetCursorIndex_SlotIndex) == 0x000050, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_GetCursorIndex_SlotIndex' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_Add_IntInt_ReturnValue_1) == 0x000058, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampQuestCtrl2_C_CheckMouseWheel, CallFunc_Subtract_IntInt_ReturnValue) == 0x00005C, "Member 'BP_CampQuestCtrl2_C_CheckMouseWheel::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CampQuestCtrl2.BP_CampQuestCtrl2_C.BindMouseInputEvent
// 0x0030 (0x0030 - 0x0000)
struct BP_CampQuestCtrl2_C_BindMouseInputEvent final
{
public:
	TDelegate<void(float ScrollRate)>             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(float ScrollRate)>             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 SlotIdx)>                K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_CampQuestCtrl2_C_BindMouseInputEvent) == 0x000004, "Wrong alignment on BP_CampQuestCtrl2_C_BindMouseInputEvent");
static_assert(sizeof(BP_CampQuestCtrl2_C_BindMouseInputEvent) == 0x000030, "Wrong size on BP_CampQuestCtrl2_C_BindMouseInputEvent");
