#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CampItemCtrl

#include "Basic.hpp"

#include "E_CATEGORYWINDOW_MOUSE_EVENT_TYPE_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_CAMPITEMCTRL_GSTATUS_structs.hpp"
#include "Project_structs.hpp"
#include "E_SORTWINDOW_MOUSE_EVENT_TYPE_structs.hpp"


namespace SDK::Params
{

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.ICampItemAllOn
// 0x0030 (0x0030 - 0x0000)
struct BP_CampItemCtrl_C_ICampItemAllOn final
{
public:
	bool                                          OutValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46AF[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CommonUI_EventCtrl_C*               CallFunc_GetCommonUI_EventCtrl_outActor;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(E_CATEGORYWINDOW_MOUSE_EVENT_TYPE MouseEventType, int32 SelectCategoryIcon)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector2D                              CallFunc_GetCategoryPosition_OutVector2D;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemType_ReturnValue;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampItemCtrl_C_ICampItemAllOn) == 0x000008, "Wrong alignment on BP_CampItemCtrl_C_ICampItemAllOn");
static_assert(sizeof(BP_CampItemCtrl_C_ICampItemAllOn) == 0x000030, "Wrong size on BP_CampItemCtrl_C_ICampItemAllOn");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemAllOn, OutValue) == 0x000000, "Member 'BP_CampItemCtrl_C_ICampItemAllOn::OutValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemAllOn, CallFunc_GetCommonUI_EventCtrl_outActor) == 0x000008, "Member 'BP_CampItemCtrl_C_ICampItemAllOn::CallFunc_GetCommonUI_EventCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemAllOn, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_CampItemCtrl_C_ICampItemAllOn::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemAllOn, CallFunc_GetCategoryPosition_OutVector2D) == 0x000020, "Member 'BP_CampItemCtrl_C_ICampItemAllOn::CallFunc_GetCategoryPosition_OutVector2D' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemAllOn, CallFunc_GetItemType_ReturnValue) == 0x000028, "Member 'BP_CampItemCtrl_C_ICampItemAllOn::CallFunc_GetItemType_ReturnValue' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.ICampItemALLOff
// 0x0001 (0x0001 - 0x0000)
struct BP_CampItemCtrl_C_ICampItemALLOff final
{
public:
	bool                                          OutValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_ICampItemALLOff) == 0x000001, "Wrong alignment on BP_CampItemCtrl_C_ICampItemALLOff");
static_assert(sizeof(BP_CampItemCtrl_C_ICampItemALLOff) == 0x000001, "Wrong size on BP_CampItemCtrl_C_ICampItemALLOff");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemALLOff, OutValue) == 0x000000, "Member 'BP_CampItemCtrl_C_ICampItemALLOff::OutValue' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.ICampItemIsInSortMenu
// 0x0003 (0x0003 - 0x0000)
struct BP_CampItemCtrl_C_ICampItemIsInSortMenu final
{
public:
	bool                                          OutSort;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RetFlag;                                           // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_ICampItemIsInSortMenu) == 0x000001, "Wrong alignment on BP_CampItemCtrl_C_ICampItemIsInSortMenu");
static_assert(sizeof(BP_CampItemCtrl_C_ICampItemIsInSortMenu) == 0x000003, "Wrong size on BP_CampItemCtrl_C_ICampItemIsInSortMenu");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemIsInSortMenu, OutSort) == 0x000000, "Member 'BP_CampItemCtrl_C_ICampItemIsInSortMenu::OutSort' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemIsInSortMenu, RetFlag) == 0x000001, "Member 'BP_CampItemCtrl_C_ICampItemIsInSortMenu::RetFlag' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemIsInSortMenu, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'BP_CampItemCtrl_C_ICampItemIsInSortMenu::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.ICampItemCalcReselectItem
// 0x0002 (0x0002 - 0x0000)
struct BP_CampItemCtrl_C_ICampItemCalcReselectItem final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CalcReselectItem_OutFinished;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_ICampItemCalcReselectItem) == 0x000001, "Wrong alignment on BP_CampItemCtrl_C_ICampItemCalcReselectItem");
static_assert(sizeof(BP_CampItemCtrl_C_ICampItemCalcReselectItem) == 0x000002, "Wrong size on BP_CampItemCtrl_C_ICampItemCalcReselectItem");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemCalcReselectItem, OutFinished) == 0x000000, "Member 'BP_CampItemCtrl_C_ICampItemCalcReselectItem::OutFinished' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemCalcReselectItem, CallFunc_CalcReselectItem_OutFinished) == 0x000001, "Member 'BP_CampItemCtrl_C_ICampItemCalcReselectItem::CallFunc_CalcReselectItem_OutFinished' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.ICampItemReselectItem
// 0x0008 (0x0008 - 0x0000)
struct BP_CampItemCtrl_C_ICampItemReselectItem final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutFinished;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CreateReselectItem_OutFinished;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_ICampItemReselectItem) == 0x000004, "Wrong alignment on BP_CampItemCtrl_C_ICampItemReselectItem");
static_assert(sizeof(BP_CampItemCtrl_C_ICampItemReselectItem) == 0x000008, "Wrong size on BP_CampItemCtrl_C_ICampItemReselectItem");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemReselectItem, InType) == 0x000000, "Member 'BP_CampItemCtrl_C_ICampItemReselectItem::InType' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemReselectItem, OutFinished) == 0x000004, "Member 'BP_CampItemCtrl_C_ICampItemReselectItem::OutFinished' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemReselectItem, CallFunc_CreateReselectItem_OutFinished) == 0x000005, "Member 'BP_CampItemCtrl_C_ICampItemReselectItem::CallFunc_CreateReselectItem_OutFinished' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.ICampItemSetItemSelectButtonHelp
// 0x0008 (0x0008 - 0x0000)
struct BP_CampItemCtrl_C_ICampItemSetItemSelectButtonHelp final
{
public:
	int32                                         InPartyNumber;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InInitialize;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OutParam;                                          // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_ICampItemSetItemSelectButtonHelp) == 0x000004, "Wrong alignment on BP_CampItemCtrl_C_ICampItemSetItemSelectButtonHelp");
static_assert(sizeof(BP_CampItemCtrl_C_ICampItemSetItemSelectButtonHelp) == 0x000008, "Wrong size on BP_CampItemCtrl_C_ICampItemSetItemSelectButtonHelp");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemSetItemSelectButtonHelp, InPartyNumber) == 0x000000, "Member 'BP_CampItemCtrl_C_ICampItemSetItemSelectButtonHelp::InPartyNumber' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemSetItemSelectButtonHelp, InInitialize) == 0x000004, "Member 'BP_CampItemCtrl_C_ICampItemSetItemSelectButtonHelp::InInitialize' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemSetItemSelectButtonHelp, OutParam) == 0x000005, "Member 'BP_CampItemCtrl_C_ICampItemSetItemSelectButtonHelp::OutParam' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.ICampItemSetPartyNumber
// 0x0008 (0x0008 - 0x0000)
struct BP_CampItemCtrl_C_ICampItemSetPartyNumber final
{
public:
	int32                                         InNumber;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutParam;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_ICampItemSetPartyNumber) == 0x000004, "Wrong alignment on BP_CampItemCtrl_C_ICampItemSetPartyNumber");
static_assert(sizeof(BP_CampItemCtrl_C_ICampItemSetPartyNumber) == 0x000008, "Wrong size on BP_CampItemCtrl_C_ICampItemSetPartyNumber");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemSetPartyNumber, InNumber) == 0x000000, "Member 'BP_CampItemCtrl_C_ICampItemSetPartyNumber::InNumber' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemSetPartyNumber, OutParam) == 0x000004, "Member 'BP_CampItemCtrl_C_ICampItemSetPartyNumber::OutParam' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.ICampItemSetItemHelp
// 0x0002 (0x0002 - 0x0000)
struct BP_CampItemCtrl_C_ICampItemSetItemHelp final
{
public:
	bool                                          InChangeAnimation;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OutParam;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_ICampItemSetItemHelp) == 0x000001, "Wrong alignment on BP_CampItemCtrl_C_ICampItemSetItemHelp");
static_assert(sizeof(BP_CampItemCtrl_C_ICampItemSetItemHelp) == 0x000002, "Wrong size on BP_CampItemCtrl_C_ICampItemSetItemHelp");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemSetItemHelp, InChangeAnimation) == 0x000000, "Member 'BP_CampItemCtrl_C_ICampItemSetItemHelp::InChangeAnimation' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemSetItemHelp, OutParam) == 0x000001, "Member 'BP_CampItemCtrl_C_ICampItemSetItemHelp::OutParam' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.ICampItemGetListFadeOut
// 0x0001 (0x0001 - 0x0000)
struct BP_CampItemCtrl_C_ICampItemGetListFadeOut final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_ICampItemGetListFadeOut) == 0x000001, "Wrong alignment on BP_CampItemCtrl_C_ICampItemGetListFadeOut");
static_assert(sizeof(BP_CampItemCtrl_C_ICampItemGetListFadeOut) == 0x000001, "Wrong size on BP_CampItemCtrl_C_ICampItemGetListFadeOut");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemGetListFadeOut, OutFlag) == 0x000000, "Member 'BP_CampItemCtrl_C_ICampItemGetListFadeOut::OutFlag' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.ICampItemGetItemNumber
// 0x0008 (0x0008 - 0x0000)
struct BP_CampItemCtrl_C_ICampItemGetItemNumber final
{
public:
	int32                                         OutNumber;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemNumber_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampItemCtrl_C_ICampItemGetItemNumber) == 0x000004, "Wrong alignment on BP_CampItemCtrl_C_ICampItemGetItemNumber");
static_assert(sizeof(BP_CampItemCtrl_C_ICampItemGetItemNumber) == 0x000008, "Wrong size on BP_CampItemCtrl_C_ICampItemGetItemNumber");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemGetItemNumber, OutNumber) == 0x000000, "Member 'BP_CampItemCtrl_C_ICampItemGetItemNumber::OutNumber' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemGetItemNumber, CallFunc_GetItemNumber_ReturnValue) == 0x000004, "Member 'BP_CampItemCtrl_C_ICampItemGetItemNumber::CallFunc_GetItemNumber_ReturnValue' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.ICampItemGetReasonForCansel
// 0x0002 (0x0002 - 0x0000)
struct BP_CampItemCtrl_C_ICampItemGetReasonForCansel final
{
public:
	E_CAMPITEMLIST_CANSELTYPE                     OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CAMPITEMLIST_CANSELTYPE                     CallFunc_GetReasonForCansel_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampItemCtrl_C_ICampItemGetReasonForCansel) == 0x000001, "Wrong alignment on BP_CampItemCtrl_C_ICampItemGetReasonForCansel");
static_assert(sizeof(BP_CampItemCtrl_C_ICampItemGetReasonForCansel) == 0x000002, "Wrong size on BP_CampItemCtrl_C_ICampItemGetReasonForCansel");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemGetReasonForCansel, OutParam) == 0x000000, "Member 'BP_CampItemCtrl_C_ICampItemGetReasonForCansel::OutParam' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemGetReasonForCansel, CallFunc_GetReasonForCansel_ReturnValue) == 0x000001, "Member 'BP_CampItemCtrl_C_ICampItemGetReasonForCansel::CallFunc_GetReasonForCansel_ReturnValue' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.IIsCampItemUseItemProc
// 0x0002 (0x0002 - 0x0000)
struct BP_CampItemCtrl_C_IIsCampItemUseItemProc final
{
public:
	bool                                          OutUsed;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_IIsCampItemUseItemProc) == 0x000001, "Wrong alignment on BP_CampItemCtrl_C_IIsCampItemUseItemProc");
static_assert(sizeof(BP_CampItemCtrl_C_IIsCampItemUseItemProc) == 0x000002, "Wrong size on BP_CampItemCtrl_C_IIsCampItemUseItemProc");
static_assert(offsetof(BP_CampItemCtrl_C_IIsCampItemUseItemProc, OutUsed) == 0x000000, "Member 'BP_CampItemCtrl_C_IIsCampItemUseItemProc::OutUsed' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_IIsCampItemUseItemProc, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BP_CampItemCtrl_C_IIsCampItemUseItemProc::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.ICampItemGetSelectedItemId
// 0x0008 (0x0008 - 0x0000)
struct BP_CampItemCtrl_C_ICampItemGetSelectedItemId final
{
public:
	int32                                         OutItemID;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCursorItemId_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampItemCtrl_C_ICampItemGetSelectedItemId) == 0x000004, "Wrong alignment on BP_CampItemCtrl_C_ICampItemGetSelectedItemId");
static_assert(sizeof(BP_CampItemCtrl_C_ICampItemGetSelectedItemId) == 0x000008, "Wrong size on BP_CampItemCtrl_C_ICampItemGetSelectedItemId");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemGetSelectedItemId, OutItemID) == 0x000000, "Member 'BP_CampItemCtrl_C_ICampItemGetSelectedItemId::OutItemID' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemGetSelectedItemId, CallFunc_GetCursorItemId_ReturnValue) == 0x000004, "Member 'BP_CampItemCtrl_C_ICampItemGetSelectedItemId::CallFunc_GetCursorItemId_ReturnValue' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.ICampItemProc
// 0x0004 (0x0004 - 0x0000)
struct BP_CampItemCtrl_C_ICampItemProc final
{
public:
	bool                                          OutIsCanseled;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Finished;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ResetParameterAvailabelFlag_ReturnValue;  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_ICampItemProc) == 0x000001, "Wrong alignment on BP_CampItemCtrl_C_ICampItemProc");
static_assert(sizeof(BP_CampItemCtrl_C_ICampItemProc) == 0x000004, "Wrong size on BP_CampItemCtrl_C_ICampItemProc");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemProc, OutIsCanseled) == 0x000000, "Member 'BP_CampItemCtrl_C_ICampItemProc::OutIsCanseled' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemProc, Finished) == 0x000001, "Member 'BP_CampItemCtrl_C_ICampItemProc::Finished' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemProc, CallFunc_ResetParameterAvailabelFlag_ReturnValue) == 0x000002, "Member 'BP_CampItemCtrl_C_ICampItemProc::CallFunc_ResetParameterAvailabelFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemProc, K2Node_SwitchEnum_CmpSuccess) == 0x000003, "Member 'BP_CampItemCtrl_C_ICampItemProc::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.ICampItemIsFinished
// 0x0001 (0x0001 - 0x0000)
struct BP_CampItemCtrl_C_ICampItemIsFinished final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_ICampItemIsFinished) == 0x000001, "Wrong alignment on BP_CampItemCtrl_C_ICampItemIsFinished");
static_assert(sizeof(BP_CampItemCtrl_C_ICampItemIsFinished) == 0x000001, "Wrong size on BP_CampItemCtrl_C_ICampItemIsFinished");
static_assert(offsetof(BP_CampItemCtrl_C_ICampItemIsFinished, OutFinished) == 0x000000, "Member 'BP_CampItemCtrl_C_ICampItemIsFinished::OutFinished' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.IsMouseClickedByMsgProc
// 0x0003 (0x0003 - 0x0000)
struct BP_CampItemCtrl_C_IsMouseClickedByMsgProc final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MsgWindowIsNextPageIconClicked_OutClicked; // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_IsMouseClickedByMsgProc) == 0x000001, "Wrong alignment on BP_CampItemCtrl_C_IsMouseClickedByMsgProc");
static_assert(sizeof(BP_CampItemCtrl_C_IsMouseClickedByMsgProc) == 0x000003, "Wrong size on BP_CampItemCtrl_C_IsMouseClickedByMsgProc");
static_assert(offsetof(BP_CampItemCtrl_C_IsMouseClickedByMsgProc, OutFinished) == 0x000000, "Member 'BP_CampItemCtrl_C_IsMouseClickedByMsgProc::OutFinished' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_IsMouseClickedByMsgProc, RetValue) == 0x000001, "Member 'BP_CampItemCtrl_C_IsMouseClickedByMsgProc::RetValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_IsMouseClickedByMsgProc, CallFunc_MsgWindowIsNextPageIconClicked_OutClicked) == 0x000002, "Member 'BP_CampItemCtrl_C_IsMouseClickedByMsgProc::CallFunc_MsgWindowIsNextPageIconClicked_OutClicked' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.ItemCategoryWindowClicked
// 0x0008 (0x0008 - 0x0000)
struct BP_CampItemCtrl_C_ItemCategoryWindowClicked final
{
public:
	E_CATEGORYWINDOW_MOUSE_EVENT_TYPE             MouseEventType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46B0[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectCategoryIcon;                                // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampItemCtrl_C_ItemCategoryWindowClicked) == 0x000004, "Wrong alignment on BP_CampItemCtrl_C_ItemCategoryWindowClicked");
static_assert(sizeof(BP_CampItemCtrl_C_ItemCategoryWindowClicked) == 0x000008, "Wrong size on BP_CampItemCtrl_C_ItemCategoryWindowClicked");
static_assert(offsetof(BP_CampItemCtrl_C_ItemCategoryWindowClicked, MouseEventType) == 0x000000, "Member 'BP_CampItemCtrl_C_ItemCategoryWindowClicked::MouseEventType' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_ItemCategoryWindowClicked, SelectCategoryIcon) == 0x000004, "Member 'BP_CampItemCtrl_C_ItemCategoryWindowClicked::SelectCategoryIcon' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.UnlockSortMouse
// 0x0001 (0x0001 - 0x0000)
struct BP_CampItemCtrl_C_UnlockSortMouse final
{
public:
	bool                                          CallFunc_SortMouseUnlockSortMouse_ReturnValue;     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_UnlockSortMouse) == 0x000001, "Wrong alignment on BP_CampItemCtrl_C_UnlockSortMouse");
static_assert(sizeof(BP_CampItemCtrl_C_UnlockSortMouse) == 0x000001, "Wrong size on BP_CampItemCtrl_C_UnlockSortMouse");
static_assert(offsetof(BP_CampItemCtrl_C_UnlockSortMouse, CallFunc_SortMouseUnlockSortMouse_ReturnValue) == 0x000000, "Member 'BP_CampItemCtrl_C_UnlockSortMouse::CallFunc_SortMouseUnlockSortMouse_ReturnValue' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.LockSortMouse
// 0x0001 (0x0001 - 0x0000)
struct BP_CampItemCtrl_C_LockSortMouse final
{
public:
	bool                                          CallFunc_SortMouseLockSortMouse_ReturnValue;       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_LockSortMouse) == 0x000001, "Wrong alignment on BP_CampItemCtrl_C_LockSortMouse");
static_assert(sizeof(BP_CampItemCtrl_C_LockSortMouse) == 0x000001, "Wrong size on BP_CampItemCtrl_C_LockSortMouse");
static_assert(offsetof(BP_CampItemCtrl_C_LockSortMouse, CallFunc_SortMouseLockSortMouse_ReturnValue) == 0x000000, "Member 'BP_CampItemCtrl_C_LockSortMouse::CallFunc_SortMouseLockSortMouse_ReturnValue' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.GetSortMouseParameter
// 0x0014 (0x0014 - 0x0000)
struct BP_CampItemCtrl_C_GetSortMouseParameter final
{
public:
	E_SORTWINDOW_MOUSE_EVENT_TYPE                 MouseEventType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46B1[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectListIdx;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectSlotIdx;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ListDrawOffset;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SortMouseSetParameter_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_GetSortMouseParameter) == 0x000004, "Wrong alignment on BP_CampItemCtrl_C_GetSortMouseParameter");
static_assert(sizeof(BP_CampItemCtrl_C_GetSortMouseParameter) == 0x000014, "Wrong size on BP_CampItemCtrl_C_GetSortMouseParameter");
static_assert(offsetof(BP_CampItemCtrl_C_GetSortMouseParameter, MouseEventType) == 0x000000, "Member 'BP_CampItemCtrl_C_GetSortMouseParameter::MouseEventType' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_GetSortMouseParameter, SelectListIdx) == 0x000004, "Member 'BP_CampItemCtrl_C_GetSortMouseParameter::SelectListIdx' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_GetSortMouseParameter, SelectSlotIdx) == 0x000008, "Member 'BP_CampItemCtrl_C_GetSortMouseParameter::SelectSlotIdx' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_GetSortMouseParameter, ListDrawOffset) == 0x00000C, "Member 'BP_CampItemCtrl_C_GetSortMouseParameter::ListDrawOffset' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_GetSortMouseParameter, CallFunc_SortMouseSetParameter_ReturnValue) == 0x000010, "Member 'BP_CampItemCtrl_C_GetSortMouseParameter::CallFunc_SortMouseSetParameter_ReturnValue' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.IsItemListRectArea
// 0x0002 (0x0002 - 0x0000)
struct BP_CampItemCtrl_C_IsItemListRectArea final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsItemListArea_OutParam;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_IsItemListRectArea) == 0x000001, "Wrong alignment on BP_CampItemCtrl_C_IsItemListRectArea");
static_assert(sizeof(BP_CampItemCtrl_C_IsItemListRectArea) == 0x000002, "Wrong size on BP_CampItemCtrl_C_IsItemListRectArea");
static_assert(offsetof(BP_CampItemCtrl_C_IsItemListRectArea, OutParam) == 0x000000, "Member 'BP_CampItemCtrl_C_IsItemListRectArea::OutParam' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_IsItemListRectArea, CallFunc_IsItemListArea_OutParam) == 0x000001, "Member 'BP_CampItemCtrl_C_IsItemListRectArea::CallFunc_IsItemListArea_OutParam' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.CalcReselectItem
// 0x0028 (0x0028 - 0x0000)
struct BP_CampItemCtrl_C_CalcReselectItem final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Retparam;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B2[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCanBeUseItemNumber_ReturnValue;        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CalcCanBeUseItem_ReturnValue;             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ResettingCursorListIndex_ReturnValue;     // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B3[0x1];                                     // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemType_ReturnValue;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B4[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSortType_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetSortImportantItem_ReturnValue;         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetSortRelicItem_ReturnValue;             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetSortUseItem_ReturnValue;               // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B5[0x1];                                     // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCursorDispIndex_ReturnValue;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetItemPanel_ReturnValue;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_CalcReselectItem) == 0x000004, "Wrong alignment on BP_CampItemCtrl_C_CalcReselectItem");
static_assert(sizeof(BP_CampItemCtrl_C_CalcReselectItem) == 0x000028, "Wrong size on BP_CampItemCtrl_C_CalcReselectItem");
static_assert(offsetof(BP_CampItemCtrl_C_CalcReselectItem, OutFinished) == 0x000000, "Member 'BP_CampItemCtrl_C_CalcReselectItem::OutFinished' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CalcReselectItem, Retparam) == 0x000001, "Member 'BP_CampItemCtrl_C_CalcReselectItem::Retparam' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CalcReselectItem, CallFunc_GetCanBeUseItemNumber_ReturnValue) == 0x000004, "Member 'BP_CampItemCtrl_C_CalcReselectItem::CallFunc_GetCanBeUseItemNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CalcReselectItem, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_CampItemCtrl_C_CalcReselectItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CalcReselectItem, K2Node_SwitchInteger_CmpSuccess) == 0x00000C, "Member 'BP_CampItemCtrl_C_CalcReselectItem::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CalcReselectItem, CallFunc_CalcCanBeUseItem_ReturnValue) == 0x00000D, "Member 'BP_CampItemCtrl_C_CalcReselectItem::CallFunc_CalcCanBeUseItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CalcReselectItem, CallFunc_ResettingCursorListIndex_ReturnValue) == 0x00000E, "Member 'BP_CampItemCtrl_C_CalcReselectItem::CallFunc_ResettingCursorListIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CalcReselectItem, CallFunc_GetItemType_ReturnValue) == 0x000010, "Member 'BP_CampItemCtrl_C_CalcReselectItem::CallFunc_GetItemType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CalcReselectItem, K2Node_SwitchInteger_CmpSuccess_1) == 0x000014, "Member 'BP_CampItemCtrl_C_CalcReselectItem::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CalcReselectItem, CallFunc_GetSortType_ReturnValue) == 0x000018, "Member 'BP_CampItemCtrl_C_CalcReselectItem::CallFunc_GetSortType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CalcReselectItem, CallFunc_SetSortImportantItem_ReturnValue) == 0x00001C, "Member 'BP_CampItemCtrl_C_CalcReselectItem::CallFunc_SetSortImportantItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CalcReselectItem, CallFunc_SetSortRelicItem_ReturnValue) == 0x00001D, "Member 'BP_CampItemCtrl_C_CalcReselectItem::CallFunc_SetSortRelicItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CalcReselectItem, CallFunc_SetSortUseItem_ReturnValue) == 0x00001E, "Member 'BP_CampItemCtrl_C_CalcReselectItem::CallFunc_SetSortUseItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CalcReselectItem, CallFunc_GetCursorDispIndex_ReturnValue) == 0x000020, "Member 'BP_CampItemCtrl_C_CalcReselectItem::CallFunc_GetCursorDispIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CalcReselectItem, CallFunc_SetItemPanel_ReturnValue) == 0x000024, "Member 'BP_CampItemCtrl_C_CalcReselectItem::CallFunc_SetItemPanel_ReturnValue' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.CreateReselectItem
// 0x000C (0x000C - 0x0000)
struct BP_CampItemCtrl_C_CreateReselectItem final
{
public:
	int32                                         InItemType;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutFinished;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Retparam;                                          // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetSelectedDarkmaskOff_ReturnValue;       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetSelectedDarkmaskOff_ReturnValue_1;     // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetSelectedDarkmaskOff_ReturnValue_2;     // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CreateItemList_ReturnValue;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_CreateReselectItem) == 0x000004, "Wrong alignment on BP_CampItemCtrl_C_CreateReselectItem");
static_assert(sizeof(BP_CampItemCtrl_C_CreateReselectItem) == 0x00000C, "Wrong size on BP_CampItemCtrl_C_CreateReselectItem");
static_assert(offsetof(BP_CampItemCtrl_C_CreateReselectItem, InItemType) == 0x000000, "Member 'BP_CampItemCtrl_C_CreateReselectItem::InItemType' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CreateReselectItem, OutFinished) == 0x000004, "Member 'BP_CampItemCtrl_C_CreateReselectItem::OutFinished' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CreateReselectItem, Retparam) == 0x000005, "Member 'BP_CampItemCtrl_C_CreateReselectItem::Retparam' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CreateReselectItem, CallFunc_SetSelectedDarkmaskOff_ReturnValue) == 0x000006, "Member 'BP_CampItemCtrl_C_CreateReselectItem::CallFunc_SetSelectedDarkmaskOff_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CreateReselectItem, CallFunc_SetSelectedDarkmaskOff_ReturnValue_1) == 0x000007, "Member 'BP_CampItemCtrl_C_CreateReselectItem::CallFunc_SetSelectedDarkmaskOff_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CreateReselectItem, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'BP_CampItemCtrl_C_CreateReselectItem::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CreateReselectItem, CallFunc_SetSelectedDarkmaskOff_ReturnValue_2) == 0x000009, "Member 'BP_CampItemCtrl_C_CreateReselectItem::CallFunc_SetSelectedDarkmaskOff_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CreateReselectItem, CallFunc_CreateItemList_ReturnValue) == 0x00000A, "Member 'BP_CampItemCtrl_C_CreateReselectItem::CallFunc_CreateItemList_ReturnValue' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.CheckItemSelectButtonHelp
// 0x0080 (0x0080 - 0x0000)
struct BP_CampItemCtrl_C_CheckItemSelectButtonHelp final
{
public:
	bool                                          InInitialize;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B6[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtnHelpInfo                           NewLocalVar_0;                                     // 0x0008(0x0020)(Edit, BlueprintVisible)
	class FText                                   CallFunc_BtnHelp_GetTextByEnum_HelpText;           // 0x0028(0x0018)()
	struct FBtnHelpInfo                           K2Node_MakeStruct_BtnHelpInfo;                     // 0x0040(0x0020)()
	TArray<struct FBtnHelpInfo>                   K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B7[0x2];                                     // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemNumber_ReturnValue;                // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_CheckItemSelectButtonHelp) == 0x000008, "Wrong alignment on BP_CampItemCtrl_C_CheckItemSelectButtonHelp");
static_assert(sizeof(BP_CampItemCtrl_C_CheckItemSelectButtonHelp) == 0x000080, "Wrong size on BP_CampItemCtrl_C_CheckItemSelectButtonHelp");
static_assert(offsetof(BP_CampItemCtrl_C_CheckItemSelectButtonHelp, InInitialize) == 0x000000, "Member 'BP_CampItemCtrl_C_CheckItemSelectButtonHelp::InInitialize' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CheckItemSelectButtonHelp, NewLocalVar_0) == 0x000008, "Member 'BP_CampItemCtrl_C_CheckItemSelectButtonHelp::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CheckItemSelectButtonHelp, CallFunc_BtnHelp_GetTextByEnum_HelpText) == 0x000028, "Member 'BP_CampItemCtrl_C_CheckItemSelectButtonHelp::CallFunc_BtnHelp_GetTextByEnum_HelpText' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CheckItemSelectButtonHelp, K2Node_MakeStruct_BtnHelpInfo) == 0x000040, "Member 'BP_CampItemCtrl_C_CheckItemSelectButtonHelp::K2Node_MakeStruct_BtnHelpInfo' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CheckItemSelectButtonHelp, K2Node_MakeArray_Array) == 0x000060, "Member 'BP_CampItemCtrl_C_CheckItemSelectButtonHelp::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CheckItemSelectButtonHelp, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000070, "Member 'BP_CampItemCtrl_C_CheckItemSelectButtonHelp::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CheckItemSelectButtonHelp, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000071, "Member 'BP_CampItemCtrl_C_CheckItemSelectButtonHelp::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CheckItemSelectButtonHelp, CallFunc_GetItemNumber_ReturnValue) == 0x000074, "Member 'BP_CampItemCtrl_C_CheckItemSelectButtonHelp::CallFunc_GetItemNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_CheckItemSelectButtonHelp, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000078, "Member 'BP_CampItemCtrl_C_CheckItemSelectButtonHelp::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.UpdateMW_FastState
// 0x0014 (0x0014 - 0x0000)
struct BP_CampItemCtrl_C_UpdateMW_FastState final
{
public:
	bool                                          OnFast;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B8[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B9[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MSgCtrl_UpdateMW_FastEffect_IsDispEffect; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_UpdateMW_FastState) == 0x000004, "Wrong alignment on BP_CampItemCtrl_C_UpdateMW_FastState");
static_assert(sizeof(BP_CampItemCtrl_C_UpdateMW_FastState) == 0x000014, "Wrong size on BP_CampItemCtrl_C_UpdateMW_FastState");
static_assert(offsetof(BP_CampItemCtrl_C_UpdateMW_FastState, OnFast) == 0x000000, "Member 'BP_CampItemCtrl_C_UpdateMW_FastState::OnFast' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_UpdateMW_FastState, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000004, "Member 'BP_CampItemCtrl_C_UpdateMW_FastState::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_UpdateMW_FastState, CallFunc_Less_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_CampItemCtrl_C_UpdateMW_FastState::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_UpdateMW_FastState, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_CampItemCtrl_C_UpdateMW_FastState::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_UpdateMW_FastState, CallFunc_MSgCtrl_UpdateMW_FastEffect_IsDispEffect) == 0x000010, "Member 'BP_CampItemCtrl_C_UpdateMW_FastState::CallFunc_MSgCtrl_UpdateMW_FastEffect_IsDispEffect' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_UpdateMW_FastState, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000011, "Member 'BP_CampItemCtrl_C_UpdateMW_FastState::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.UpdateMW_AutoWait
// 0x000C (0x000C - 0x0000)
struct BP_CampItemCtrl_C_UpdateMW_AutoWait final
{
public:
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46BA[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampItemCtrl_C_UpdateMW_AutoWait) == 0x000004, "Wrong alignment on BP_CampItemCtrl_C_UpdateMW_AutoWait");
static_assert(sizeof(BP_CampItemCtrl_C_UpdateMW_AutoWait) == 0x00000C, "Wrong size on BP_CampItemCtrl_C_UpdateMW_AutoWait");
static_assert(offsetof(BP_CampItemCtrl_C_UpdateMW_AutoWait, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000000, "Member 'BP_CampItemCtrl_C_UpdateMW_AutoWait::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_UpdateMW_AutoWait, CallFunc_Less_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_CampItemCtrl_C_UpdateMW_AutoWait::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_UpdateMW_AutoWait, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_CampItemCtrl_C_UpdateMW_AutoWait::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.MovingItemTypeCursorCheck
// 0x0004 (0x0004 - 0x0000)
struct BP_CampItemCtrl_C_MovingItemTypeCursorCheck final
{
public:
	bool                                          CallFunc_ResetItemTypeMovingCursor_ReturnValue;    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_MovingItemTypeCursorCheck) == 0x000001, "Wrong alignment on BP_CampItemCtrl_C_MovingItemTypeCursorCheck");
static_assert(sizeof(BP_CampItemCtrl_C_MovingItemTypeCursorCheck) == 0x000004, "Wrong size on BP_CampItemCtrl_C_MovingItemTypeCursorCheck");
static_assert(offsetof(BP_CampItemCtrl_C_MovingItemTypeCursorCheck, CallFunc_ResetItemTypeMovingCursor_ReturnValue) == 0x000000, "Member 'BP_CampItemCtrl_C_MovingItemTypeCursorCheck::CallFunc_ResetItemTypeMovingCursor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_MovingItemTypeCursorCheck, CallFunc_IsActionPadCheck_Success) == 0x000001, "Member 'BP_CampItemCtrl_C_MovingItemTypeCursorCheck::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_MovingItemTypeCursorCheck, CallFunc_IsActionPadCheck_Success_1) == 0x000002, "Member 'BP_CampItemCtrl_C_MovingItemTypeCursorCheck::CallFunc_IsActionPadCheck_Success_1' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_MovingItemTypeCursorCheck, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'BP_CampItemCtrl_C_MovingItemTypeCursorCheck::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.MovingSortCursorCheck
// 0x000C (0x000C - 0x0000)
struct BP_CampItemCtrl_C_MovingSortCursorCheck final
{
public:
	int32                                         InItemType;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ResetSortMovingCursor_ReturnValue;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_2;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_3;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_MovingSortCursorCheck) == 0x000004, "Wrong alignment on BP_CampItemCtrl_C_MovingSortCursorCheck");
static_assert(sizeof(BP_CampItemCtrl_C_MovingSortCursorCheck) == 0x00000C, "Wrong size on BP_CampItemCtrl_C_MovingSortCursorCheck");
static_assert(offsetof(BP_CampItemCtrl_C_MovingSortCursorCheck, InItemType) == 0x000000, "Member 'BP_CampItemCtrl_C_MovingSortCursorCheck::InItemType' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_MovingSortCursorCheck, CallFunc_IsActionPadCheck_Success) == 0x000004, "Member 'BP_CampItemCtrl_C_MovingSortCursorCheck::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_MovingSortCursorCheck, CallFunc_ResetSortMovingCursor_ReturnValue) == 0x000005, "Member 'BP_CampItemCtrl_C_MovingSortCursorCheck::CallFunc_ResetSortMovingCursor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_MovingSortCursorCheck, CallFunc_IsActionPadCheck_Success_1) == 0x000006, "Member 'BP_CampItemCtrl_C_MovingSortCursorCheck::CallFunc_IsActionPadCheck_Success_1' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_MovingSortCursorCheck, CallFunc_IsActionPadCheck_Success_2) == 0x000007, "Member 'BP_CampItemCtrl_C_MovingSortCursorCheck::CallFunc_IsActionPadCheck_Success_2' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_MovingSortCursorCheck, CallFunc_IsActionPadCheck_Success_3) == 0x000008, "Member 'BP_CampItemCtrl_C_MovingSortCursorCheck::CallFunc_IsActionPadCheck_Success_3' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_MovingSortCursorCheck, CallFunc_BooleanOR_ReturnValue) == 0x000009, "Member 'BP_CampItemCtrl_C_MovingSortCursorCheck::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_MovingSortCursorCheck, CallFunc_BooleanOR_ReturnValue_1) == 0x00000A, "Member 'BP_CampItemCtrl_C_MovingSortCursorCheck::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_MovingSortCursorCheck, CallFunc_BooleanOR_ReturnValue_2) == 0x00000B, "Member 'BP_CampItemCtrl_C_MovingSortCursorCheck::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.RestartSelectedItemList
// 0x0030 (0x0030 - 0x0000)
struct BP_CampItemCtrl_C_RestartSelectedItemList final
{
public:
	TDelegate<void(E_CATEGORYWINDOW_MOUSE_EVENT_TYPE MouseEventType, int32 SelectCategoryIcon)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class ABP_CommonUI_EventCtrl_C*               CallFunc_GetCommonUI_EventCtrl_outActor;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemType_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetCategoryPosition_OutVector2D;          // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCursorDispIndex_ReturnValue;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetItemPanel_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampItemCtrl_C_RestartSelectedItemList) == 0x000008, "Wrong alignment on BP_CampItemCtrl_C_RestartSelectedItemList");
static_assert(sizeof(BP_CampItemCtrl_C_RestartSelectedItemList) == 0x000030, "Wrong size on BP_CampItemCtrl_C_RestartSelectedItemList");
static_assert(offsetof(BP_CampItemCtrl_C_RestartSelectedItemList, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_CampItemCtrl_C_RestartSelectedItemList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_RestartSelectedItemList, CallFunc_GetCommonUI_EventCtrl_outActor) == 0x000010, "Member 'BP_CampItemCtrl_C_RestartSelectedItemList::CallFunc_GetCommonUI_EventCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_RestartSelectedItemList, CallFunc_GetItemType_ReturnValue) == 0x000018, "Member 'BP_CampItemCtrl_C_RestartSelectedItemList::CallFunc_GetItemType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_RestartSelectedItemList, CallFunc_GetCategoryPosition_OutVector2D) == 0x00001C, "Member 'BP_CampItemCtrl_C_RestartSelectedItemList::CallFunc_GetCategoryPosition_OutVector2D' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_RestartSelectedItemList, CallFunc_GetCursorDispIndex_ReturnValue) == 0x000024, "Member 'BP_CampItemCtrl_C_RestartSelectedItemList::CallFunc_GetCursorDispIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampItemCtrl_C_RestartSelectedItemList, CallFunc_SetItemPanel_ReturnValue) == 0x000028, "Member 'BP_CampItemCtrl_C_RestartSelectedItemList::CallFunc_SetItemPanel_ReturnValue' has a wrong offset!");

// Function BP_CampItemCtrl.BP_CampItemCtrl_C.SelectPillarDialog
// 0x0160 (0x0160 - 0x0000)
struct BP_CampItemCtrl_C_SelectPillarDialog final
{
public:
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46BB[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_1;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_2;                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46BC[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46BD[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DialogCtrl_C>     CallFunc_BPI_GetDialogWindowCtrl_OutActor;         // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_DialogCtrl_C>     CallFunc_BPI_GetDialogWindowCtrl_OutActor_1;       // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IWasConfirmedByMouse_bConfirmed;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46BE[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IWasConfirmedByMouse_ItemIndex;           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_3;                        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
