#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CampCotrol_2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BP_CampCotrol_2.BP_CampCotrol_2_C.GetIsCampOpen
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCotrol_2_C_GetIsCampOpen final
{
public:
	bool                                          Param_IsCampOpen;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCotrol_2_C_GetIsCampOpen) == 0x000001, "Wrong alignment on BP_CampCotrol_2_C_GetIsCampOpen");
static_assert(sizeof(BP_CampCotrol_2_C_GetIsCampOpen) == 0x000001, "Wrong size on BP_CampCotrol_2_C_GetIsCampOpen");
static_assert(offsetof(BP_CampCotrol_2_C_GetIsCampOpen, Param_IsCampOpen) == 0x000000, "Member 'BP_CampCotrol_2_C_GetIsCampOpen::Param_IsCampOpen' has a wrong offset!");

// Function BP_CampCotrol_2.BP_CampCotrol_2_C.CheckCampOpenFlag
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCotrol_2_C_CheckCampOpenFlag final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCotrol_2_C_CheckCampOpenFlag) == 0x000001, "Wrong alignment on BP_CampCotrol_2_C_CheckCampOpenFlag");
static_assert(sizeof(BP_CampCotrol_2_C_CheckCampOpenFlag) == 0x000001, "Wrong size on BP_CampCotrol_2_C_CheckCampOpenFlag");
static_assert(offsetof(BP_CampCotrol_2_C_CheckCampOpenFlag, ReturnValue) == 0x000000, "Member 'BP_CampCotrol_2_C_CheckCampOpenFlag::ReturnValue' has a wrong offset!");

// Function BP_CampCotrol_2.BP_CampCotrol_2_C.OnLoaded_20B106F442986DC0ACBDAAA873BBBE3A
// 0x0008 (0x0008 - 0x0000)
struct BP_CampCotrol_2_C_OnLoaded_20B106F442986DC0ACBDAAA873BBBE3A final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampCotrol_2_C_OnLoaded_20B106F442986DC0ACBDAAA873BBBE3A) == 0x000008, "Wrong alignment on BP_CampCotrol_2_C_OnLoaded_20B106F442986DC0ACBDAAA873BBBE3A");
static_assert(sizeof(BP_CampCotrol_2_C_OnLoaded_20B106F442986DC0ACBDAAA873BBBE3A) == 0x000008, "Wrong size on BP_CampCotrol_2_C_OnLoaded_20B106F442986DC0ACBDAAA873BBBE3A");
static_assert(offsetof(BP_CampCotrol_2_C_OnLoaded_20B106F442986DC0ACBDAAA873BBBE3A, Loaded) == 0x000000, "Member 'BP_CampCotrol_2_C_OnLoaded_20B106F442986DC0ACBDAAA873BBBE3A::Loaded' has a wrong offset!");

// Function BP_CampCotrol_2.BP_CampCotrol_2_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CampCotrol_2_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampCotrol_2_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CampCotrol_2_C_ReceiveTick");
static_assert(sizeof(BP_CampCotrol_2_C_ReceiveTick) == 0x000004, "Wrong size on BP_CampCotrol_2_C_ReceiveTick");
static_assert(offsetof(BP_CampCotrol_2_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CampCotrol_2_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_CampCotrol_2.BP_CampCotrol_2_C.PlayerLock
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCotrol_2_C_PlayerLock final
{
public:
	bool                                          IsLock;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCotrol_2_C_PlayerLock) == 0x000001, "Wrong alignment on BP_CampCotrol_2_C_PlayerLock");
static_assert(sizeof(BP_CampCotrol_2_C_PlayerLock) == 0x000001, "Wrong size on BP_CampCotrol_2_C_PlayerLock");
static_assert(offsetof(BP_CampCotrol_2_C_PlayerLock, IsLock) == 0x000000, "Member 'BP_CampCotrol_2_C_PlayerLock::IsLock' has a wrong offset!");

// Function BP_CampCotrol_2.BP_CampCotrol_2_C.ExecuteUbergraph_BP_CampCotrol_2
// 0x0270 (0x0270 - 0x0000)
struct BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B5C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B5D[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue_1;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B5E[0x8];                                     // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	class UClass*                                 K2Node_ClassDynamicCast_AsCamera_Actor;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B5F[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ICampTopIsReturnTitle_OutReturnTitle;     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ICampTopIsFinished_OutFinished;           // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B60[0x6];                                     // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_1;                        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          CallFunc_GetCurrentBGM_ReturnValue;                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B61[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameMode_C>       K2Node_DynamicCast_AsBPI_Game_Mode;                // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B62[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameMode_C>       K2Node_DynamicCast_AsBPI_Game_Mode_1;              // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMapSystemOnlyLoadEnd_End;               // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B63[0x6];                                     // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIMovieCtrl_C>    CallFunc_Stop_self_CastInput;                      // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B64[0x6];                                     // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectGCManager*                      CallFunc_Get_ReturnValue_2;                        // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectGCManager*                      CallFunc_Get_ReturnValue_3;                        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIMovieCtrl_C>    CallFunc_Play_self_CastInput;                      // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ICampTopGetUsedPillar_OutParam;           // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B65[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0150(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_bgmv_camp_Ctrl_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIMovieCtrl_C>    CallFunc_Stop_self_CastInput_1;                    // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ScreenTransition_isFadeFinish_outValue;   // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsLock;                         // 0x01A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBgmScene                                     Temp_byte_Variable;                                // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBgmScene                                     Temp_byte_Variable_1;                              // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B66[0x2];                                     // 0x01A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMapID_ReturnValue;                     // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate;              // 0x01AC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_8B67[0x4];                                     // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_4;                        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_UIManager_C*                        K2Node_DynamicCast_AsBP_UIManager;                 // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_UI_FADE_STATE                               CallFunc_ScreenTransition_getFadeState_outType;    // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBgmScene                                     K2Node_Select_Default;                             // 0x01D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B68[0xB];                                     // 0x01D5(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x01E0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ScreenTransition_isFadeFinish_outValue_1; // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B69[0x6];                                     // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          K2Node_Select_Default_1;                           // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor;                   // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B6A[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CampTopCtrl_C>    K2Node_DynamicCast_AsBPI_Camp_Top_Ctrl;            // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2) == 0x000010, "Wrong alignment on BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2");
static_assert(sizeof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2) == 0x000270, "Wrong size on BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, EntryPoint) == 0x000000, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_GetMapCommon_rerutn) == 0x000008, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, K2Node_DynamicCast_AsBPI_Map_Common) == 0x000010, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_SpawnSound2D_ReturnValue) == 0x000028, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_SpawnSound2D_ReturnValue_1) == 0x000030, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_SpawnSound2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_Get_ReturnValue) == 0x000038, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, Temp_class_Variable) == 0x000040, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, K2Node_ClassDynamicCast_AsCamera_Actor) == 0x000080, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::K2Node_ClassDynamicCast_AsCamera_Actor' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, K2Node_ClassDynamicCast_bSuccess) == 0x000088, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, K2Node_Event_DeltaSeconds) == 0x00008C, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_ICampTopIsReturnTitle_OutReturnTitle) == 0x000090, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_ICampTopIsReturnTitle_OutReturnTitle' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_ICampTopIsFinished_OutFinished) == 0x000091, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_ICampTopIsFinished_OutFinished' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_Get_ReturnValue_1) == 0x000098, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_GetCurrentBGM_ReturnValue) == 0x0000A0, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_GetCurrentBGM_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_GetPlayerController_ReturnValue) == 0x0000A8, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000B0, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_GetPlayerController_ReturnValue_2) == 0x0000B8, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_GetViewTarget_ReturnValue) == 0x0000C0, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, K2Node_CustomEvent_Loaded) == 0x0000C8, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_GetGameMode_ReturnValue) == 0x0000D0, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, K2Node_DynamicCast_AsBPI_Game_Mode) == 0x0000E0, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::K2Node_DynamicCast_AsBPI_Game_Mode' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, K2Node_DynamicCast_AsBPI_Game_Mode_1) == 0x0000F8, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::K2Node_DynamicCast_AsBPI_Game_Mode_1' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, K2Node_DynamicCast_bSuccess_2) == 0x000108, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_IsMapSystemOnlyLoadEnd_End) == 0x000109, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_IsMapSystemOnlyLoadEnd_End' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_Stop_self_CastInput) == 0x000110, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_Stop_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, Temp_bool_Variable) == 0x000120, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_IsValid_ReturnValue_1) == 0x000121, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_Get_ReturnValue_2) == 0x000128, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_Get_ReturnValue_3) == 0x000130, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_Get_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_Play_self_CastInput) == 0x000138, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_Play_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_ICampTopGetUsedPillar_OutParam) == 0x000148, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_ICampTopGetUsedPillar_OutParam' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_MakeTransform_ReturnValue_1) == 0x000150, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000180, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_FinishSpawningActor_ReturnValue) == 0x000188, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_Stop_self_CastInput_1) == 0x000190, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_Stop_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_MakeLiteralByte_ReturnValue) == 0x0001A0, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_ScreenTransition_isFadeFinish_outValue) == 0x0001A1, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_ScreenTransition_isFadeFinish_outValue' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, Temp_bool_Variable_1) == 0x0001A2, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, K2Node_CustomEvent_IsLock) == 0x0001A3, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::K2Node_CustomEvent_IsLock' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, Temp_byte_Variable) == 0x0001A4, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, Temp_byte_Variable_1) == 0x0001A5, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_GetMapID_ReturnValue) == 0x0001A8, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_GetMapID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, K2Node_CreateDelegate_OutputDelegate) == 0x0001AC, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_Get_ReturnValue_4) == 0x0001C0, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_Get_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, K2Node_DynamicCast_AsBP_UIManager) == 0x0001C8, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::K2Node_DynamicCast_AsBP_UIManager' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, K2Node_DynamicCast_bSuccess_3) == 0x0001D0, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, Temp_bool_Variable_2) == 0x0001D1, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_ScreenTransition_getFadeState_outType) == 0x0001D2, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_ScreenTransition_getFadeState_outType' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, K2Node_Select_Default) == 0x0001D3, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001D4, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_MakeTransform_ReturnValue_2) == 0x0001E0, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000210, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000218, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_ScreenTransition_isFadeFinish_outValue_1) == 0x000220, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_ScreenTransition_isFadeFinish_outValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_CheckEventFlag_ReturnValue) == 0x000221, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, K2Node_Select_Default_1) == 0x000228, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000230, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, K2Node_ClassDynamicCast_AsActor) == 0x000238, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::K2Node_ClassDynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, K2Node_ClassDynamicCast_bSuccess_1) == 0x000240, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::K2Node_ClassDynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000248, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000250, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, K2Node_DynamicCast_AsBPI_Camp_Top_Ctrl) == 0x000258, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::K2Node_DynamicCast_AsBPI_Camp_Top_Ctrl' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2, K2Node_DynamicCast_bSuccess_4) == 0x000268, "Member 'BP_CampCotrol_2_C_ExecuteUbergraph_BP_CampCotrol_2::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");

// Function BP_CampCotrol_2.BP_CampCotrol_2_C.CloseCamp__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct BP_CampCotrol_2_C_CloseCamp__DelegateSignature final
{
public:
	bool                                          InForceCloseCamp;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InReturnTitle;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCotrol_2_C_CloseCamp__DelegateSignature) == 0x000001, "Wrong alignment on BP_CampCotrol_2_C_CloseCamp__DelegateSignature");
static_assert(sizeof(BP_CampCotrol_2_C_CloseCamp__DelegateSignature) == 0x000002, "Wrong size on BP_CampCotrol_2_C_CloseCamp__DelegateSignature");
static_assert(offsetof(BP_CampCotrol_2_C_CloseCamp__DelegateSignature, InForceCloseCamp) == 0x000000, "Member 'BP_CampCotrol_2_C_CloseCamp__DelegateSignature::InForceCloseCamp' has a wrong offset!");
static_assert(offsetof(BP_CampCotrol_2_C_CloseCamp__DelegateSignature, InReturnTitle) == 0x000001, "Member 'BP_CampCotrol_2_C_CloseCamp__DelegateSignature::InReturnTitle' has a wrong offset!");

}

