#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CommonUI_EventCtrl

#include "Basic.hpp"

#include "E_SORTWINDOW_MOUSE_EVENT_TYPE_structs.hpp"
#include "E_SKILLSEARCH_WINDOW_MOUSE_EVENT_TYPE_structs.hpp"
#include "E_CATEGORYWINDOW_MOUSE_EVENT_TYPE_structs.hpp"


namespace SDK::Params
{

// Function BP_CommonUI_EventCtrl.BP_CommonUI_EventCtrl_C.CategoryWindow_MouseEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_CommonUI_EventCtrl_C_CategoryWindow_MouseEvent__DelegateSignature final
{
public:
	E_CATEGORYWINDOW_MOUSE_EVENT_TYPE             MouseEventType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391D[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectCategoryIcon;                                // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CommonUI_EventCtrl_C_CategoryWindow_MouseEvent__DelegateSignature) == 0x000004, "Wrong alignment on BP_CommonUI_EventCtrl_C_CategoryWindow_MouseEvent__DelegateSignature");
static_assert(sizeof(BP_CommonUI_EventCtrl_C_CategoryWindow_MouseEvent__DelegateSignature) == 0x000008, "Wrong size on BP_CommonUI_EventCtrl_C_CategoryWindow_MouseEvent__DelegateSignature");
static_assert(offsetof(BP_CommonUI_EventCtrl_C_CategoryWindow_MouseEvent__DelegateSignature, MouseEventType) == 0x000000, "Member 'BP_CommonUI_EventCtrl_C_CategoryWindow_MouseEvent__DelegateSignature::MouseEventType' has a wrong offset!");
static_assert(offsetof(BP_CommonUI_EventCtrl_C_CategoryWindow_MouseEvent__DelegateSignature, SelectCategoryIcon) == 0x000004, "Member 'BP_CommonUI_EventCtrl_C_CategoryWindow_MouseEvent__DelegateSignature::SelectCategoryIcon' has a wrong offset!");

// Function BP_CommonUI_EventCtrl.BP_CommonUI_EventCtrl_C.SkillSearchSort_MouseEvent__DelegateSignature
// 0x0014 (0x0014 - 0x0000)
struct BP_CommonUI_EventCtrl_C_SkillSearchSort_MouseEvent__DelegateSignature final
{
public:
	E_SKILLSEARCH_WINDOW_MOUSE_EVENT_TYPE         MouseEventType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391E[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectLstIdx;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectSlotIdx;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ListScrollOffset;                                  // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectElementIdx;                                  // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CommonUI_EventCtrl_C_SkillSearchSort_MouseEvent__DelegateSignature) == 0x000004, "Wrong alignment on BP_CommonUI_EventCtrl_C_SkillSearchSort_MouseEvent__DelegateSignature");
static_assert(sizeof(BP_CommonUI_EventCtrl_C_SkillSearchSort_MouseEvent__DelegateSignature) == 0x000014, "Wrong size on BP_CommonUI_EventCtrl_C_SkillSearchSort_MouseEvent__DelegateSignature");
static_assert(offsetof(BP_CommonUI_EventCtrl_C_SkillSearchSort_MouseEvent__DelegateSignature, MouseEventType) == 0x000000, "Member 'BP_CommonUI_EventCtrl_C_SkillSearchSort_MouseEvent__DelegateSignature::MouseEventType' has a wrong offset!");
static_assert(offsetof(BP_CommonUI_EventCtrl_C_SkillSearchSort_MouseEvent__DelegateSignature, SelectLstIdx) == 0x000004, "Member 'BP_CommonUI_EventCtrl_C_SkillSearchSort_MouseEvent__DelegateSignature::SelectLstIdx' has a wrong offset!");
static_assert(offsetof(BP_CommonUI_EventCtrl_C_SkillSearchSort_MouseEvent__DelegateSignature, SelectSlotIdx) == 0x000008, "Member 'BP_CommonUI_EventCtrl_C_SkillSearchSort_MouseEvent__DelegateSignature::SelectSlotIdx' has a wrong offset!");
static_assert(offsetof(BP_CommonUI_EventCtrl_C_SkillSearchSort_MouseEvent__DelegateSignature, ListScrollOffset) == 0x00000C, "Member 'BP_CommonUI_EventCtrl_C_SkillSearchSort_MouseEvent__DelegateSignature::ListScrollOffset' has a wrong offset!");
static_assert(offsetof(BP_CommonUI_EventCtrl_C_SkillSearchSort_MouseEvent__DelegateSignature, SelectElementIdx) == 0x000010, "Member 'BP_CommonUI_EventCtrl_C_SkillSearchSort_MouseEvent__DelegateSignature::SelectElementIdx' has a wrong offset!");

// Function BP_CommonUI_EventCtrl.BP_CommonUI_EventCtrl_C.SortWindow_MouseEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_CommonUI_EventCtrl_C_SortWindow_MouseEvent__DelegateSignature final
{
public:
	E_SORTWINDOW_MOUSE_EVENT_TYPE                 MouseEventType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391F[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectLstIdx;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectSlotIdx;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ListScrollOffset;                                  // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CommonUI_EventCtrl_C_SortWindow_MouseEvent__DelegateSignature) == 0x000004, "Wrong alignment on BP_CommonUI_EventCtrl_C_SortWindow_MouseEvent__DelegateSignature");
static_assert(sizeof(BP_CommonUI_EventCtrl_C_SortWindow_MouseEvent__DelegateSignature) == 0x000010, "Wrong size on BP_CommonUI_EventCtrl_C_SortWindow_MouseEvent__DelegateSignature");
static_assert(offsetof(BP_CommonUI_EventCtrl_C_SortWindow_MouseEvent__DelegateSignature, MouseEventType) == 0x000000, "Member 'BP_CommonUI_EventCtrl_C_SortWindow_MouseEvent__DelegateSignature::MouseEventType' has a wrong offset!");
static_assert(offsetof(BP_CommonUI_EventCtrl_C_SortWindow_MouseEvent__DelegateSignature, SelectLstIdx) == 0x000004, "Member 'BP_CommonUI_EventCtrl_C_SortWindow_MouseEvent__DelegateSignature::SelectLstIdx' has a wrong offset!");
static_assert(offsetof(BP_CommonUI_EventCtrl_C_SortWindow_MouseEvent__DelegateSignature, SelectSlotIdx) == 0x000008, "Member 'BP_CommonUI_EventCtrl_C_SortWindow_MouseEvent__DelegateSignature::SelectSlotIdx' has a wrong offset!");
static_assert(offsetof(BP_CommonUI_EventCtrl_C_SortWindow_MouseEvent__DelegateSignature, ListScrollOffset) == 0x00000C, "Member 'BP_CommonUI_EventCtrl_C_SortWindow_MouseEvent__DelegateSignature::ListScrollOffset' has a wrong offset!");

}

