#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CampCharaPanelCtrl

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ST_BtnHelp_ColorInfo_byIdx_structs.hpp"
#include "E_SORTWINDOW_MOUSE_EVENT_TYPE_structs.hpp"
#include "E_SKILLSEARCH_WINDOW_MOUSE_EVENT_TYPE_structs.hpp"
#include "Project_structs.hpp"
#include "Engine_structs.hpp"
#include "E_SORTWINDOW_ANIM_STATE_structs.hpp"
#include "E_CATEGORYWINDOW_MOUSE_EVENT_TYPE_structs.hpp"


namespace SDK::Params
{

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelSetItemNumPosition
// 0x0014 (0x0014 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelSetItemNumPosition final
{
public:
	struct FVector2D                              InMainPosition;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              InStockPosition;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutParam;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetItemNumPosition) == 0x000004, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelSetItemNumPosition");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetItemNumPosition) == 0x000014, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelSetItemNumPosition");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetItemNumPosition, InMainPosition) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSetItemNumPosition::InMainPosition' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetItemNumPosition, InStockPosition) == 0x000008, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSetItemNumPosition::InStockPosition' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetItemNumPosition, OutParam) == 0x000010, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSetItemNumPosition::OutParam' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelGetMaxNumberOfItem
// 0x0008 (0x0008 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelGetMaxNumberOfItem final
{
public:
	int32                                         OutLevel;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxNumberOfItem_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelGetMaxNumberOfItem) == 0x000004, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelGetMaxNumberOfItem");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelGetMaxNumberOfItem) == 0x000008, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelGetMaxNumberOfItem");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelGetMaxNumberOfItem, OutLevel) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelGetMaxNumberOfItem::OutLevel' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelGetMaxNumberOfItem, CallFunc_GetMaxNumberOfItem_ReturnValue) == 0x000004, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelGetMaxNumberOfItem::CallFunc_GetMaxNumberOfItem_ReturnValue' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelIsChangeParameter
// 0x0002 (0x0002 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelIsChangeParameter final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsChangeParameter) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsChangeParameter");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsChangeParameter) == 0x000002, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsChangeParameter");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsChangeParameter, OutFlag) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelIsChangeParameter::OutFlag' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsChangeParameter, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelIsChangeParameter::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelLevelUpVisibleOff
// 0x0038 (0x0038 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelLevelUpVisibleOff final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43CA[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43CB[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonHelpWindowCtrl_C> CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor;     // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelLevelUpVisibleOff) == 0x000008, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelLevelUpVisibleOff");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelLevelUpVisibleOff) == 0x000038, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelLevelUpVisibleOff");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelLevelUpVisibleOff, OutFlag) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelLevelUpVisibleOff::OutFlag' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelLevelUpVisibleOff, CallFunc_Get_ReturnValue) == 0x000008, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelLevelUpVisibleOff::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelLevelUpVisibleOff, K2Node_DynamicCast_AsBPI_UIManager) == 0x000010, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelLevelUpVisibleOff::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelLevelUpVisibleOff, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelLevelUpVisibleOff::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelLevelUpVisibleOff, CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor) == 0x000028, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelLevelUpVisibleOff::CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelRestartLevelUpVisible
// 0x0038 (0x0038 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetUseItemTargetListPanel_ReturnValue;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43CC[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43CD[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonHelpWindowCtrl_C> CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor;     // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible) == 0x000008, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible) == 0x000038, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible, OutFlag) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible::OutFlag' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible, CallFunc_SetUseItemTargetListPanel_ReturnValue) == 0x000001, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible::CallFunc_SetUseItemTargetListPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible, CallFunc_Get_ReturnValue) == 0x000008, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible, K2Node_DynamicCast_AsBPI_UIManager) == 0x000010, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible, CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor) == 0x000028, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible::CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelRestartLevelUp
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUp final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUp) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUp");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUp) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUp");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUp, OutFlag) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUp::OutFlag' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelIsLevelUp
// 0x0002 (0x0002 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelIsLevelUp final
{
public:
	bool                                          OutLevelUp;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsLevelUp) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsLevelUp");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsLevelUp) == 0x000002, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsLevelUp");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsLevelUp, OutLevelUp) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelIsLevelUp::OutLevelUp' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsLevelUp, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelIsLevelUp::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelResetPartyMouseFlag
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFlag final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFlag) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFlag");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFlag) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFlag");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFlag, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFlag::OutParam' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelResetPartyMouseFocus
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFocus final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFocus) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFocus");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFocus) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFocus");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFocus, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFocus::OutParam' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelSetPartyMouseFocus
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyMouseFocus final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyMouseFocus) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyMouseFocus");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyMouseFocus) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyMouseFocus");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyMouseFocus, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyMouseFocus::OutParam' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelInitializeProc
// 0x0002 (0x0002 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelInitializeProc final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InitializeProc_OutFinished;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelInitializeProc) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelInitializeProc");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelInitializeProc) == 0x000002, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelInitializeProc");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelInitializeProc, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelInitializeProc::OutParam' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelInitializeProc, CallFunc_InitializeProc_OutFinished) == 0x000001, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelInitializeProc::CallFunc_InitializeProc_OutFinished' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelIsInitialized
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelIsInitialized final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsInitialized) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsInitialized");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsInitialized) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsInitialized");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsInitialized, OutFinished) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelIsInitialized::OutFinished' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelResetUnselectablePanel
// 0x0002 (0x0002 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelResetUnselectablePanel final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ResetUnselectablePanel_ReturnValue;       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetUnselectablePanel) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelResetUnselectablePanel");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetUnselectablePanel) == 0x000002, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelResetUnselectablePanel");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetUnselectablePanel, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelResetUnselectablePanel::OutParam' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetUnselectablePanel, CallFunc_ResetUnselectablePanel_ReturnValue) == 0x000001, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelResetUnselectablePanel::CallFunc_ResetUnselectablePanel_ReturnValue' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelResetAllActorPanel
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelResetAllActorPanel final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetAllActorPanel) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelResetAllActorPanel");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetAllActorPanel) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelResetAllActorPanel");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetAllActorPanel, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelResetAllActorPanel::OutParam' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelGetPanelDispNumber
// 0x0008 (0x0008 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelGetPanelDispNumber final
{
public:
	int32                                         OutNumber;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStockDispNumber_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelGetPanelDispNumber) == 0x000004, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelGetPanelDispNumber");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelGetPanelDispNumber) == 0x000008, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelGetPanelDispNumber");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelGetPanelDispNumber, OutNumber) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelGetPanelDispNumber::OutNumber' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelGetPanelDispNumber, CallFunc_GetStockDispNumber_ReturnValue) == 0x000004, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelGetPanelDispNumber::CallFunc_GetStockDispNumber_ReturnValue' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelCalcCharaPanelMove
// 0x0008 (0x0008 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelCalcCharaPanelMove final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutParam;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelCalcCharaPanelMove) == 0x000004, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelCalcCharaPanelMove");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelCalcCharaPanelMove) == 0x000008, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelCalcCharaPanelMove");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelCalcCharaPanelMove, InType) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelCalcCharaPanelMove::InType' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelCalcCharaPanelMove, OutParam) == 0x000004, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelCalcCharaPanelMove::OutParam' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelCalcCharaPanelMove, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelCalcCharaPanelMove::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelCalcCharaPanelMove, CallFunc_CheckEventFlag_ReturnValue) == 0x000006, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelCalcCharaPanelMove::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelResetStateItemHelp
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelResetStateItemHelp final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetStateItemHelp) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelResetStateItemHelp");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetStateItemHelp) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelResetStateItemHelp");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetStateItemHelp, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelResetStateItemHelp::OutParam' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelIsStateItemHelp
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelIsStateItemHelp final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsStateItemHelp) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsStateItemHelp");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsStateItemHelp) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsStateItemHelp");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsStateItemHelp, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelIsStateItemHelp::OutParam' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelSetAnalyzeButtoneHelp
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelSetAnalyzeButtoneHelp final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetAnalyzeButtoneHelp) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelSetAnalyzeButtoneHelp");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetAnalyzeButtoneHelp) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelSetAnalyzeButtoneHelp");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetAnalyzeButtoneHelp, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSetAnalyzeButtoneHelp::OutParam' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelUpdate
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelUpdate final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelUpdate) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelUpdate");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelUpdate) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelUpdate");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelUpdate, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelUpdate::OutParam' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelSetPartyOffsetByNkmIndex
// 0x001C (0x001C - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex final
{
public:
	int32                                         InNkmIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutParam;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43CE[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPanelIndexByNkmIndex_ReturnValue;      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43CF[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetStockInitializeCursorPositionIndex_ReturnValue; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetPartyInitializeCursorPositionIndex_ReturnValue; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex) == 0x000004, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex) == 0x00001C, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex, InNkmIndex) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex::InNkmIndex' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex, OutParam) == 0x000004, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex::OutParam' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex, CallFunc_GetPanelIndexByNkmIndex_ReturnValue) == 0x000008, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex::CallFunc_GetPanelIndexByNkmIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex, CallFunc_SetStockInitializeCursorPositionIndex_ReturnValue) == 0x000014, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex::CallFunc_SetStockInitializeCursorPositionIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex, CallFunc_SetPartyInitializeCursorPositionIndex_ReturnValue) == 0x000018, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex::CallFunc_SetPartyInitializeCursorPositionIndex_ReturnValue' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelResetAllNewIcon
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelResetAllNewIcon final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetAllNewIcon) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelResetAllNewIcon");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetAllNewIcon) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelResetAllNewIcon");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetAllNewIcon, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelResetAllNewIcon::OutParam' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelIsFinishedCharaPanel
// 0x0002 (0x0002 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelIsFinishedCharaPanel final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFinishedPanelFadeOut_OutFinished;       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsFinishedCharaPanel) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsFinishedCharaPanel");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsFinishedCharaPanel) == 0x000002, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsFinishedCharaPanel");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsFinishedCharaPanel, OutFinished) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelIsFinishedCharaPanel::OutFinished' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsFinishedCharaPanel, CallFunc_IsFinishedPanelFadeOut_OutFinished) == 0x000001, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelIsFinishedCharaPanel::CallFunc_IsFinishedPanelFadeOut_OutFinished' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelSetSkillReserveHPMPParam
// 0x0002 (0x0002 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelSetSkillReserveHPMPParam final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetSkillCalcOnPanelByIndex_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetSkillReserveHPMPParam) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelSetSkillReserveHPMPParam");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetSkillReserveHPMPParam) == 0x000002, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelSetSkillReserveHPMPParam");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetSkillReserveHPMPParam, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSetSkillReserveHPMPParam::OutParam' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSetSkillReserveHPMPParam, CallFunc_SetSkillCalcOnPanelByIndex_ReturnValue) == 0x000001, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSetSkillReserveHPMPParam::CallFunc_SetSkillCalcOnPanelByIndex_ReturnValue' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelResetMenuBGOffFlag
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOffFlag final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOffFlag) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOffFlag");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOffFlag) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOffFlag");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOffFlag, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOffFlag::OutParam' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelResetMenuBGOnFlag
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOnFlag final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOnFlag) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOnFlag");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOnFlag) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOnFlag");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOnFlag, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOnFlag::OutParam' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelIsMenuBGOff
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOff final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOff) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOff");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOff) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOff");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOff, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOff::OutParam' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelIsMenuBGOn
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOn final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOn) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOn");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOn) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOn");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOn, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOn::OutParam' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelIsRestartSkillList
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartSkillList final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartSkillList) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartSkillList");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartSkillList) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartSkillList");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartSkillList, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartSkillList::OutParam' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelIsRestartItemList
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartItemList final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartItemList) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartItemList");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartItemList) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartItemList");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartItemList, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartItemList::OutParam' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelIsDeleteStatusItemList
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteStatusItemList final
{
public:
	bool                                          OutDelete;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteStatusItemList) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteStatusItemList");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteStatusItemList) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteStatusItemList");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteStatusItemList, OutDelete) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteStatusItemList::OutDelete' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelResetTitleOnFlag
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOnFlag final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOnFlag) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOnFlag");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOnFlag) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOnFlag");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOnFlag, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOnFlag::OutParam' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelIsMainTitleOn
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOn final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOn) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOn");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOn) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOn");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOn, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOn::OutParam' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelResetTitleOffFlag
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOffFlag final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOffFlag) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOffFlag");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOffFlag) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOffFlag");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOffFlag, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOffFlag::OutParam' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelIsMainTitleOff
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOff final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOff) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOff");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOff) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOff");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOff, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOff::OutParam' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelSkillUserStatusCtrInit
// 0x0050 (0x0050 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit final
{
public:
	int32                                         NkmIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsParty;                                           // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Dummy;                                             // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43D0[0xA];                                     // 0x0006(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NewInit_Success;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43D1[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDevilID_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit) == 0x000010, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit) == 0x000050, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit, NkmIndex) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit::NkmIndex' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit, IsParty) == 0x000004, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit::IsParty' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit, Dummy) == 0x000005, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit::Dummy' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit, CallFunc_NewInit_Success) == 0x000040, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit::CallFunc_NewInit_Success' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit, CallFunc_GetDevilID_ReturnValue) == 0x000044, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit::CallFunc_GetDevilID_ReturnValue' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelSkillUserStatusCtrlStart
// 0x0002 (0x0002 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrlStart final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_StartCtrl_Success;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrlStart) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrlStart");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrlStart) == 0x000002, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrlStart");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrlStart, Dummy) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrlStart::Dummy' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrlStart, CallFunc_BPI_StartCtrl_Success) == 0x000001, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrlStart::CallFunc_BPI_StartCtrl_Success' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelSkillUserStatusCtrl
// 0x000C (0x000C - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrl final
{
public:
	bool                                          IsEnd;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43D2[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_TickEvent_StatusEnd;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrl) == 0x000004, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrl");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrl) == 0x00000C, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrl");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrl, IsEnd) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrl::IsEnd' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrl, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000004, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrl::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrl, CallFunc_BPI_TickEvent_StatusEnd) == 0x000008, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrl::CallFunc_BPI_TickEvent_StatusEnd' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelIsDeleteSStatusSkillList
// 0x0001 (0x0001 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteSStatusSkillList final
{
public:
	bool                                          OutDelete;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteSStatusSkillList) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteSStatusSkillList");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteSStatusSkillList) == 0x000001, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteSStatusSkillList");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteSStatusSkillList, OutDelete) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteSStatusSkillList::OutDelete' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelGetSStatusStep
// 0x0004 (0x0004 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusStep final
{
public:
	int32                                         OutStep;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusStep) == 0x000004, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusStep");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusStep) == 0x000004, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusStep");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusStep, OutStep) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusStep::OutStep' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelGetSStatusType
// 0x0004 (0x0004 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusType final
{
public:
	int32                                         OutType;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusType) == 0x000004, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusType");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusType) == 0x000004, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusType");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusType, OutType) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusType::OutType' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelGetUtsusemiCount
// 0x0008 (0x0008 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiCount final
{
public:
	int32                                         OutNumber;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUtsusemiCount_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiCount) == 0x000004, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiCount");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiCount) == 0x000008, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiCount");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiCount, OutNumber) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiCount::OutNumber' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiCount, CallFunc_GetUtsusemiCount_ReturnValue) == 0x000004, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiCount::CallFunc_GetUtsusemiCount_ReturnValue' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelGetAnalyzeCount
// 0x0008 (0x0008 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelGetAnalyzeCount final
{
public:
	int32                                         OutNumber;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAnalyzeCount_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelGetAnalyzeCount) == 0x000004, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelGetAnalyzeCount");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelGetAnalyzeCount) == 0x000008, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelGetAnalyzeCount");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelGetAnalyzeCount, OutNumber) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelGetAnalyzeCount::OutNumber' has a wrong offset!");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelGetAnalyzeCount, CallFunc_GetAnalyzeCount_ReturnValue) == 0x000004, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelGetAnalyzeCount::CallFunc_GetAnalyzeCount_ReturnValue' has a wrong offset!");

// Function BP_CampCharaPanelCtrl.BP_CampCharaPanelCtrl_C.ICampCharaPanelIsNewIconOfAllUtsusemiOff
// 0x0002 (0x0002 - 0x0000)
struct BP_CampCharaPanelCtrl_C_ICampCharaPanelIsNewIconOfAllUtsusemiOff final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNewIconOfAllUtsusemiOff_ReturnValue;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsNewIconOfAllUtsusemiOff) == 0x000001, "Wrong alignment on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsNewIconOfAllUtsusemiOff");
static_assert(sizeof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsNewIconOfAllUtsusemiOff) == 0x000002, "Wrong size on BP_CampCharaPanelCtrl_C_ICampCharaPanelIsNewIconOfAllUtsusemiOff");
static_assert(offsetof(BP_CampCharaPanelCtrl_C_ICampCharaPanelIsNewIconOfAllUtsusemiOff, OutParam) == 0x000000, "Member 'BP_CampCharaPanelCtrl_C_ICampCharaPanelIsNewIconOfAllUtsusemiOff::OutParam' has a wrong offset!");
