#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CampSkillCtrl

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "E_SORTWINDOW_MOUSE_EVENT_TYPE_structs.hpp"
#include "E_CAMPSKILLCTRL_GSTATUS_structs.hpp"


namespace SDK::Params
{

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.ICampSkillIsInSortMenu
// 0x0003 (0x0003 - 0x0000)
struct BP_CampSkillCtrl_C_ICampSkillIsInSortMenu final
{
public:
	bool                                          OutSort;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RetFlag;                                           // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampSkillCtrl_C_ICampSkillIsInSortMenu) == 0x000001, "Wrong alignment on BP_CampSkillCtrl_C_ICampSkillIsInSortMenu");
static_assert(sizeof(BP_CampSkillCtrl_C_ICampSkillIsInSortMenu) == 0x000003, "Wrong size on BP_CampSkillCtrl_C_ICampSkillIsInSortMenu");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillIsInSortMenu, OutSort) == 0x000000, "Member 'BP_CampSkillCtrl_C_ICampSkillIsInSortMenu::OutSort' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillIsInSortMenu, RetFlag) == 0x000001, "Member 'BP_CampSkillCtrl_C_ICampSkillIsInSortMenu::RetFlag' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillIsInSortMenu, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'BP_CampSkillCtrl_C_ICampSkillIsInSortMenu::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.ICampSkillSetSkillSelectButtonHelp
// 0x0008 (0x0008 - 0x0000)
struct BP_CampSkillCtrl_C_ICampSkillSetSkillSelectButtonHelp final
{
public:
	int32                                         InNumber;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InInitialize;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OutParam;                                          // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampSkillCtrl_C_ICampSkillSetSkillSelectButtonHelp) == 0x000004, "Wrong alignment on BP_CampSkillCtrl_C_ICampSkillSetSkillSelectButtonHelp");
static_assert(sizeof(BP_CampSkillCtrl_C_ICampSkillSetSkillSelectButtonHelp) == 0x000008, "Wrong size on BP_CampSkillCtrl_C_ICampSkillSetSkillSelectButtonHelp");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillSetSkillSelectButtonHelp, InNumber) == 0x000000, "Member 'BP_CampSkillCtrl_C_ICampSkillSetSkillSelectButtonHelp::InNumber' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillSetSkillSelectButtonHelp, InInitialize) == 0x000004, "Member 'BP_CampSkillCtrl_C_ICampSkillSetSkillSelectButtonHelp::InInitialize' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillSetSkillSelectButtonHelp, OutParam) == 0x000005, "Member 'BP_CampSkillCtrl_C_ICampSkillSetSkillSelectButtonHelp::OutParam' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.ICampSkillSetPartyNumber
// 0x0008 (0x0008 - 0x0000)
struct BP_CampSkillCtrl_C_ICampSkillSetPartyNumber final
{
public:
	int32                                         InPartyNumber;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutParam;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampSkillCtrl_C_ICampSkillSetPartyNumber) == 0x000004, "Wrong alignment on BP_CampSkillCtrl_C_ICampSkillSetPartyNumber");
static_assert(sizeof(BP_CampSkillCtrl_C_ICampSkillSetPartyNumber) == 0x000008, "Wrong size on BP_CampSkillCtrl_C_ICampSkillSetPartyNumber");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillSetPartyNumber, InPartyNumber) == 0x000000, "Member 'BP_CampSkillCtrl_C_ICampSkillSetPartyNumber::InPartyNumber' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillSetPartyNumber, OutParam) == 0x000004, "Member 'BP_CampSkillCtrl_C_ICampSkillSetPartyNumber::OutParam' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.ICampSkillIsClosedSortWindow
// 0x0002 (0x0002 - 0x0000)
struct BP_CampSkillCtrl_C_ICampSkillIsClosedSortWindow final
{
public:
	bool                                          OutClosed;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Retparam;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampSkillCtrl_C_ICampSkillIsClosedSortWindow) == 0x000001, "Wrong alignment on BP_CampSkillCtrl_C_ICampSkillIsClosedSortWindow");
static_assert(sizeof(BP_CampSkillCtrl_C_ICampSkillIsClosedSortWindow) == 0x000002, "Wrong size on BP_CampSkillCtrl_C_ICampSkillIsClosedSortWindow");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillIsClosedSortWindow, OutClosed) == 0x000000, "Member 'BP_CampSkillCtrl_C_ICampSkillIsClosedSortWindow::OutClosed' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillIsClosedSortWindow, Retparam) == 0x000001, "Member 'BP_CampSkillCtrl_C_ICampSkillIsClosedSortWindow::Retparam' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.ICampSkillIsOpenStatus
// 0x0001 (0x0001 - 0x0000)
struct BP_CampSkillCtrl_C_ICampSkillIsOpenStatus final
{
public:
	bool                                          CallStatusOpen;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampSkillCtrl_C_ICampSkillIsOpenStatus) == 0x000001, "Wrong alignment on BP_CampSkillCtrl_C_ICampSkillIsOpenStatus");
static_assert(sizeof(BP_CampSkillCtrl_C_ICampSkillIsOpenStatus) == 0x000001, "Wrong size on BP_CampSkillCtrl_C_ICampSkillIsOpenStatus");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillIsOpenStatus, CallStatusOpen) == 0x000000, "Member 'BP_CampSkillCtrl_C_ICampSkillIsOpenStatus::CallStatusOpen' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.ICampSkillIsListAnimation
// 0x0002 (0x0002 - 0x0000)
struct BP_CampSkillCtrl_C_ICampSkillIsListAnimation final
{
public:
	bool                                          OutIsAnimation;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsListAnimation_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampSkillCtrl_C_ICampSkillIsListAnimation) == 0x000001, "Wrong alignment on BP_CampSkillCtrl_C_ICampSkillIsListAnimation");
static_assert(sizeof(BP_CampSkillCtrl_C_ICampSkillIsListAnimation) == 0x000002, "Wrong size on BP_CampSkillCtrl_C_ICampSkillIsListAnimation");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillIsListAnimation, OutIsAnimation) == 0x000000, "Member 'BP_CampSkillCtrl_C_ICampSkillIsListAnimation::OutIsAnimation' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillIsListAnimation, CallFunc_IsListAnimation_ReturnValue) == 0x000001, "Member 'BP_CampSkillCtrl_C_ICampSkillIsListAnimation::CallFunc_IsListAnimation_ReturnValue' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.ICampSkillIsWaitPartyEnd
// 0x0002 (0x0002 - 0x0000)
struct BP_CampSkillCtrl_C_ICampSkillIsWaitPartyEnd final
{
public:
	bool                                          OutEnd;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSkillListAnimationEnd_OutFinished;      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampSkillCtrl_C_ICampSkillIsWaitPartyEnd) == 0x000001, "Wrong alignment on BP_CampSkillCtrl_C_ICampSkillIsWaitPartyEnd");
static_assert(sizeof(BP_CampSkillCtrl_C_ICampSkillIsWaitPartyEnd) == 0x000002, "Wrong size on BP_CampSkillCtrl_C_ICampSkillIsWaitPartyEnd");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillIsWaitPartyEnd, OutEnd) == 0x000000, "Member 'BP_CampSkillCtrl_C_ICampSkillIsWaitPartyEnd::OutEnd' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillIsWaitPartyEnd, CallFunc_IsSkillListAnimationEnd_OutFinished) == 0x000001, "Member 'BP_CampSkillCtrl_C_ICampSkillIsWaitPartyEnd::CallFunc_IsSkillListAnimationEnd_OutFinished' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.ICampSkillGetListFadeOut
// 0x0001 (0x0001 - 0x0000)
struct BP_CampSkillCtrl_C_ICampSkillGetListFadeOut final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampSkillCtrl_C_ICampSkillGetListFadeOut) == 0x000001, "Wrong alignment on BP_CampSkillCtrl_C_ICampSkillGetListFadeOut");
static_assert(sizeof(BP_CampSkillCtrl_C_ICampSkillGetListFadeOut) == 0x000001, "Wrong size on BP_CampSkillCtrl_C_ICampSkillGetListFadeOut");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillGetListFadeOut, OutFlag) == 0x000000, "Member 'BP_CampSkillCtrl_C_ICampSkillGetListFadeOut::OutFlag' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.ICampSkillUtsusemiProc
// 0x00C0 (0x00C0 - 0x0000)
struct BP_CampSkillCtrl_C_ICampSkillUtsusemiProc final
{
public:
	bool                                          OutIsCanseled;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D06[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Oldcursor;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Canseled;                                          // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetMovingCursor_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D07[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMouseWheelAxis_Axis;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSkillListRectArea_OutParam;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D08[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMouseWheelParameter_ReturnValue;       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MoveUtsusemiCursor_ReturnValue;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D09[0x1];                                     // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetUtsusemiCursorDispIndex_ReturnValue;   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUtsusemiCursorListIndex_ReturnValue;   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D0A[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMouseHovered_OutIndex;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D0B[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MoveUtsusemiCursor_ReturnValue_1;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetMovingCursor_ReturnValue_1;            // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D0C[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUtsusemiCursorListIndex_ReturnValue_1; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUtsusemiCursorListIndex_ReturnValue_2; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D0D[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_1;                        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUtsusemiSkillCount_ReturnValue;        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D0E[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D0F[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CommonHelpWindowCtrl_C> CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor;     // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D10[0x1];                                     // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetUtsusemiSkillCount_ReturnValue_1;      // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D11[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetUtsusemiCursorDispIndex_ReturnValue_1; // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RestartUtsusemiSkillList_ReturnValue;     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D12[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetUtsusemiSkillCount_ReturnValue_2;      // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MoveUtsusemiCursor_ReturnValue_2;         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D13[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MoveUtsusemiCursor_ReturnValue_3;         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MoveUtsusemiCursor_ReturnValue_4;         // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MoveUtsusemiCursor_ReturnValue_5;         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetIconHelpStatus_ReturnValue;            // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc) == 0x000008, "Wrong alignment on BP_CampSkillCtrl_C_ICampSkillUtsusemiProc");
static_assert(sizeof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc) == 0x0000C0, "Wrong size on BP_CampSkillCtrl_C_ICampSkillUtsusemiProc");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, OutIsCanseled) == 0x000000, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::OutIsCanseled' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, Oldcursor) == 0x000004, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::Oldcursor' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, Canseled) == 0x000008, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::Canseled' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_SetMovingCursor_ReturnValue) == 0x000009, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_SetMovingCursor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_GetMouseWheelAxis_Axis) == 0x00000C, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_GetMouseWheelAxis_Axis' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_IsSkillListRectArea_OutParam) == 0x000010, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_IsSkillListRectArea_OutParam' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_GetMouseWheelParameter_ReturnValue) == 0x000014, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_GetMouseWheelParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_MoveUtsusemiCursor_ReturnValue) == 0x000018, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_MoveUtsusemiCursor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00001C, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00001D, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x00001E, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_GetUtsusemiCursorDispIndex_ReturnValue) == 0x000020, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_GetUtsusemiCursorDispIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_GetUtsusemiCursorListIndex_ReturnValue) == 0x000024, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_GetUtsusemiCursorListIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000028, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_GetMouseHovered_OutIndex) == 0x00002C, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_GetMouseHovered_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_BooleanAND_ReturnValue) == 0x000030, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_MoveUtsusemiCursor_ReturnValue_1) == 0x000038, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_MoveUtsusemiCursor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00003C, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_SetMovingCursor_ReturnValue_1) == 0x00003D, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_SetMovingCursor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_Get_ReturnValue) == 0x000040, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_GetUtsusemiCursorListIndex_ReturnValue_1) == 0x000048, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_GetUtsusemiCursorListIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_GetUtsusemiCursorListIndex_ReturnValue_2) == 0x00004C, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_GetUtsusemiCursorListIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000050, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_Get_ReturnValue_1) == 0x000058, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_GetUtsusemiSkillCount_ReturnValue) == 0x000060, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_GetUtsusemiSkillCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, K2Node_DynamicCast_AsBPI_UIManager) == 0x000068, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00007C, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor) == 0x000080, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000090, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_BooleanAND_ReturnValue_1) == 0x000091, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000092, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_GetUtsusemiSkillCount_ReturnValue_1) == 0x000094, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_GetUtsusemiSkillCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000098, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_GetUtsusemiCursorDispIndex_ReturnValue_1) == 0x00009C, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_GetUtsusemiCursorDispIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_RestartUtsusemiSkillList_ReturnValue) == 0x0000A0, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_RestartUtsusemiSkillList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_GetUtsusemiSkillCount_ReturnValue_2) == 0x0000A4, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_GetUtsusemiSkillCount_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_MoveUtsusemiCursor_ReturnValue_2) == 0x0000A8, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_MoveUtsusemiCursor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000AC, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_MoveUtsusemiCursor_ReturnValue_3) == 0x0000B0, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_MoveUtsusemiCursor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_MoveUtsusemiCursor_ReturnValue_4) == 0x0000B4, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_MoveUtsusemiCursor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_MoveUtsusemiCursor_ReturnValue_5) == 0x0000B8, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_MoveUtsusemiCursor_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, CallFunc_SetIconHelpStatus_ReturnValue) == 0x0000BC, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::CallFunc_SetIconHelpStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, K2Node_SwitchInteger_CmpSuccess) == 0x0000BD, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillUtsusemiProc, K2Node_SwitchInteger_CmpSuccess_1) == 0x0000BE, "Member 'BP_CampSkillCtrl_C_ICampSkillUtsusemiProc::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.IIsCampSkillMoveCursor
// 0x0002 (0x0002 - 0x0000)
struct BP_CampSkillCtrl_C_IIsCampSkillMoveCursor final
{
public:
	bool                                          OutMoved;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampSkillCtrl_C_IIsCampSkillMoveCursor) == 0x000001, "Wrong alignment on BP_CampSkillCtrl_C_IIsCampSkillMoveCursor");
static_assert(sizeof(BP_CampSkillCtrl_C_IIsCampSkillMoveCursor) == 0x000002, "Wrong size on BP_CampSkillCtrl_C_IIsCampSkillMoveCursor");
static_assert(offsetof(BP_CampSkillCtrl_C_IIsCampSkillMoveCursor, OutMoved) == 0x000000, "Member 'BP_CampSkillCtrl_C_IIsCampSkillMoveCursor::OutMoved' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_IIsCampSkillMoveCursor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BP_CampSkillCtrl_C_IIsCampSkillMoveCursor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.ICampSkillGetSelectedNkmIndex
// 0x0008 (0x0008 - 0x0000)
struct BP_CampSkillCtrl_C_ICampSkillGetSelectedNkmIndex final
{
public:
	int32                                         OutNkmIndex;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCursorNkmIndex_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampSkillCtrl_C_ICampSkillGetSelectedNkmIndex) == 0x000004, "Wrong alignment on BP_CampSkillCtrl_C_ICampSkillGetSelectedNkmIndex");
static_assert(sizeof(BP_CampSkillCtrl_C_ICampSkillGetSelectedNkmIndex) == 0x000008, "Wrong size on BP_CampSkillCtrl_C_ICampSkillGetSelectedNkmIndex");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillGetSelectedNkmIndex, OutNkmIndex) == 0x000000, "Member 'BP_CampSkillCtrl_C_ICampSkillGetSelectedNkmIndex::OutNkmIndex' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillGetSelectedNkmIndex, CallFunc_GetCursorNkmIndex_ReturnValue) == 0x000004, "Member 'BP_CampSkillCtrl_C_ICampSkillGetSelectedNkmIndex::CallFunc_GetCursorNkmIndex_ReturnValue' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.ICampSkillGetReasonForCansel
// 0x0002 (0x0002 - 0x0000)
struct BP_CampSkillCtrl_C_ICampSkillGetReasonForCansel final
{
public:
	E_CAMPSKILLLIST_CANSELTYPE                    OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CAMPSKILLLIST_CANSELTYPE                    CallFunc_GetReasonForCansel_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampSkillCtrl_C_ICampSkillGetReasonForCansel) == 0x000001, "Wrong alignment on BP_CampSkillCtrl_C_ICampSkillGetReasonForCansel");
static_assert(sizeof(BP_CampSkillCtrl_C_ICampSkillGetReasonForCansel) == 0x000002, "Wrong size on BP_CampSkillCtrl_C_ICampSkillGetReasonForCansel");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillGetReasonForCansel, OutParam) == 0x000000, "Member 'BP_CampSkillCtrl_C_ICampSkillGetReasonForCansel::OutParam' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillGetReasonForCansel, CallFunc_GetReasonForCansel_ReturnValue) == 0x000001, "Member 'BP_CampSkillCtrl_C_ICampSkillGetReasonForCansel::CallFunc_GetReasonForCansel_ReturnValue' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.IIsCampSkillUseSkillProc
// 0x0002 (0x0002 - 0x0000)
struct BP_CampSkillCtrl_C_IIsCampSkillUseSkillProc final
{
public:
	bool                                          OutUsed;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampSkillCtrl_C_IIsCampSkillUseSkillProc) == 0x000001, "Wrong alignment on BP_CampSkillCtrl_C_IIsCampSkillUseSkillProc");
static_assert(sizeof(BP_CampSkillCtrl_C_IIsCampSkillUseSkillProc) == 0x000002, "Wrong size on BP_CampSkillCtrl_C_IIsCampSkillUseSkillProc");
static_assert(offsetof(BP_CampSkillCtrl_C_IIsCampSkillUseSkillProc, OutUsed) == 0x000000, "Member 'BP_CampSkillCtrl_C_IIsCampSkillUseSkillProc::OutUsed' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_IIsCampSkillUseSkillProc, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BP_CampSkillCtrl_C_IIsCampSkillUseSkillProc::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.ICampSkillGetSelectedSkillId
// 0x0008 (0x0008 - 0x0000)
struct BP_CampSkillCtrl_C_ICampSkillGetSelectedSkillId final
{
public:
	int32                                         OutSkillId;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCursorSkillId_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampSkillCtrl_C_ICampSkillGetSelectedSkillId) == 0x000004, "Wrong alignment on BP_CampSkillCtrl_C_ICampSkillGetSelectedSkillId");
static_assert(sizeof(BP_CampSkillCtrl_C_ICampSkillGetSelectedSkillId) == 0x000008, "Wrong size on BP_CampSkillCtrl_C_ICampSkillGetSelectedSkillId");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillGetSelectedSkillId, OutSkillId) == 0x000000, "Member 'BP_CampSkillCtrl_C_ICampSkillGetSelectedSkillId::OutSkillId' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillGetSelectedSkillId, CallFunc_GetCursorSkillId_ReturnValue) == 0x000004, "Member 'BP_CampSkillCtrl_C_ICampSkillGetSelectedSkillId::CallFunc_GetCursorSkillId_ReturnValue' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.ICampSkillProc
// 0x0003 (0x0003 - 0x0000)
struct BP_CampSkillCtrl_C_ICampSkillProc final
{
public:
	bool                                          OutIsCanseled;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ResetParameterAvailabelFlag_ReturnValue;  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampSkillCtrl_C_ICampSkillProc) == 0x000001, "Wrong alignment on BP_CampSkillCtrl_C_ICampSkillProc");
static_assert(sizeof(BP_CampSkillCtrl_C_ICampSkillProc) == 0x000003, "Wrong size on BP_CampSkillCtrl_C_ICampSkillProc");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillProc, OutIsCanseled) == 0x000000, "Member 'BP_CampSkillCtrl_C_ICampSkillProc::OutIsCanseled' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillProc, CallFunc_ResetParameterAvailabelFlag_ReturnValue) == 0x000001, "Member 'BP_CampSkillCtrl_C_ICampSkillProc::CallFunc_ResetParameterAvailabelFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillProc, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'BP_CampSkillCtrl_C_ICampSkillProc::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.ICampSkillIsFinished
// 0x0001 (0x0001 - 0x0000)
struct BP_CampSkillCtrl_C_ICampSkillIsFinished final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampSkillCtrl_C_ICampSkillIsFinished) == 0x000001, "Wrong alignment on BP_CampSkillCtrl_C_ICampSkillIsFinished");
static_assert(sizeof(BP_CampSkillCtrl_C_ICampSkillIsFinished) == 0x000001, "Wrong size on BP_CampSkillCtrl_C_ICampSkillIsFinished");
static_assert(offsetof(BP_CampSkillCtrl_C_ICampSkillIsFinished, OutFinished) == 0x000000, "Member 'BP_CampSkillCtrl_C_ICampSkillIsFinished::OutFinished' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.UnlockSortMouse
// 0x0001 (0x0001 - 0x0000)
struct BP_CampSkillCtrl_C_UnlockSortMouse final
{
public:
	bool                                          CallFunc_SortMouseUnlockSortMouse_ReturnValue;     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampSkillCtrl_C_UnlockSortMouse) == 0x000001, "Wrong alignment on BP_CampSkillCtrl_C_UnlockSortMouse");
static_assert(sizeof(BP_CampSkillCtrl_C_UnlockSortMouse) == 0x000001, "Wrong size on BP_CampSkillCtrl_C_UnlockSortMouse");
static_assert(offsetof(BP_CampSkillCtrl_C_UnlockSortMouse, CallFunc_SortMouseUnlockSortMouse_ReturnValue) == 0x000000, "Member 'BP_CampSkillCtrl_C_UnlockSortMouse::CallFunc_SortMouseUnlockSortMouse_ReturnValue' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.LockSortMouse
// 0x0001 (0x0001 - 0x0000)
struct BP_CampSkillCtrl_C_LockSortMouse final
{
public:
	bool                                          CallFunc_SortMouseLockSortMouse_ReturnValue;       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampSkillCtrl_C_LockSortMouse) == 0x000001, "Wrong alignment on BP_CampSkillCtrl_C_LockSortMouse");
static_assert(sizeof(BP_CampSkillCtrl_C_LockSortMouse) == 0x000001, "Wrong size on BP_CampSkillCtrl_C_LockSortMouse");
static_assert(offsetof(BP_CampSkillCtrl_C_LockSortMouse, CallFunc_SortMouseLockSortMouse_ReturnValue) == 0x000000, "Member 'BP_CampSkillCtrl_C_LockSortMouse::CallFunc_SortMouseLockSortMouse_ReturnValue' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.GetSortMouseParameter
// 0x0014 (0x0014 - 0x0000)
struct BP_CampSkillCtrl_C_GetSortMouseParameter final
{
public:
	E_SORTWINDOW_MOUSE_EVENT_TYPE                 MouseEventType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D14[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectLstIdx;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectSlotIdx;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ListScrollOffset;                                  // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SortMouseSetParameter_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampSkillCtrl_C_GetSortMouseParameter) == 0x000004, "Wrong alignment on BP_CampSkillCtrl_C_GetSortMouseParameter");
static_assert(sizeof(BP_CampSkillCtrl_C_GetSortMouseParameter) == 0x000014, "Wrong size on BP_CampSkillCtrl_C_GetSortMouseParameter");
static_assert(offsetof(BP_CampSkillCtrl_C_GetSortMouseParameter, MouseEventType) == 0x000000, "Member 'BP_CampSkillCtrl_C_GetSortMouseParameter::MouseEventType' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_GetSortMouseParameter, SelectLstIdx) == 0x000004, "Member 'BP_CampSkillCtrl_C_GetSortMouseParameter::SelectLstIdx' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_GetSortMouseParameter, SelectSlotIdx) == 0x000008, "Member 'BP_CampSkillCtrl_C_GetSortMouseParameter::SelectSlotIdx' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_GetSortMouseParameter, ListScrollOffset) == 0x00000C, "Member 'BP_CampSkillCtrl_C_GetSortMouseParameter::ListScrollOffset' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_GetSortMouseParameter, CallFunc_SortMouseSetParameter_ReturnValue) == 0x000010, "Member 'BP_CampSkillCtrl_C_GetSortMouseParameter::CallFunc_SortMouseSetParameter_ReturnValue' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.IsSkillListRectArea
// 0x0002 (0x0002 - 0x0000)
struct BP_CampSkillCtrl_C_IsSkillListRectArea final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSkillListRectArea_OutParam;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampSkillCtrl_C_IsSkillListRectArea) == 0x000001, "Wrong alignment on BP_CampSkillCtrl_C_IsSkillListRectArea");
static_assert(sizeof(BP_CampSkillCtrl_C_IsSkillListRectArea) == 0x000002, "Wrong size on BP_CampSkillCtrl_C_IsSkillListRectArea");
static_assert(offsetof(BP_CampSkillCtrl_C_IsSkillListRectArea, OutParam) == 0x000000, "Member 'BP_CampSkillCtrl_C_IsSkillListRectArea::OutParam' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_IsSkillListRectArea, CallFunc_IsSkillListRectArea_OutParam) == 0x000001, "Member 'BP_CampSkillCtrl_C_IsSkillListRectArea::CallFunc_IsSkillListRectArea_OutParam' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.CheckSkillSelectButtonHelp
// 0x0001 (0x0001 - 0x0000)
struct BP_CampSkillCtrl_C_CheckSkillSelectButtonHelp final
{
public:
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampSkillCtrl_C_CheckSkillSelectButtonHelp) == 0x000001, "Wrong alignment on BP_CampSkillCtrl_C_CheckSkillSelectButtonHelp");
static_assert(sizeof(BP_CampSkillCtrl_C_CheckSkillSelectButtonHelp) == 0x000001, "Wrong size on BP_CampSkillCtrl_C_CheckSkillSelectButtonHelp");
static_assert(offsetof(BP_CampSkillCtrl_C_CheckSkillSelectButtonHelp, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000000, "Member 'BP_CampSkillCtrl_C_CheckSkillSelectButtonHelp::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.UpdateMW_FastState
// 0x0014 (0x0014 - 0x0000)
struct BP_CampSkillCtrl_C_UpdateMW_FastState final
{
public:
	bool                                          OnFast;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D15[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D16[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MSgCtrl_UpdateMW_FastEffect_IsDispEffect; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampSkillCtrl_C_UpdateMW_FastState) == 0x000004, "Wrong alignment on BP_CampSkillCtrl_C_UpdateMW_FastState");
static_assert(sizeof(BP_CampSkillCtrl_C_UpdateMW_FastState) == 0x000014, "Wrong size on BP_CampSkillCtrl_C_UpdateMW_FastState");
static_assert(offsetof(BP_CampSkillCtrl_C_UpdateMW_FastState, OnFast) == 0x000000, "Member 'BP_CampSkillCtrl_C_UpdateMW_FastState::OnFast' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_UpdateMW_FastState, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000004, "Member 'BP_CampSkillCtrl_C_UpdateMW_FastState::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_UpdateMW_FastState, CallFunc_Less_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_CampSkillCtrl_C_UpdateMW_FastState::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_UpdateMW_FastState, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_CampSkillCtrl_C_UpdateMW_FastState::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_UpdateMW_FastState, CallFunc_MSgCtrl_UpdateMW_FastEffect_IsDispEffect) == 0x000010, "Member 'BP_CampSkillCtrl_C_UpdateMW_FastState::CallFunc_MSgCtrl_UpdateMW_FastEffect_IsDispEffect' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_UpdateMW_FastState, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000011, "Member 'BP_CampSkillCtrl_C_UpdateMW_FastState::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.UpdateMW_AutoWait
// 0x000C (0x000C - 0x0000)
struct BP_CampSkillCtrl_C_UpdateMW_AutoWait final
{
public:
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D17[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CampSkillCtrl_C_UpdateMW_AutoWait) == 0x000004, "Wrong alignment on BP_CampSkillCtrl_C_UpdateMW_AutoWait");
static_assert(sizeof(BP_CampSkillCtrl_C_UpdateMW_AutoWait) == 0x00000C, "Wrong size on BP_CampSkillCtrl_C_UpdateMW_AutoWait");
static_assert(offsetof(BP_CampSkillCtrl_C_UpdateMW_AutoWait, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000000, "Member 'BP_CampSkillCtrl_C_UpdateMW_AutoWait::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_UpdateMW_AutoWait, CallFunc_Less_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_CampSkillCtrl_C_UpdateMW_AutoWait::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_UpdateMW_AutoWait, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_CampSkillCtrl_C_UpdateMW_AutoWait::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.MovingSortCursorCheck
// 0x0008 (0x0008 - 0x0000)
struct BP_CampSkillCtrl_C_MovingSortCursorCheck final
{
public:
	bool                                          CallFunc_ResetSortMovingCursor_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_2;               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_3;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampSkillCtrl_C_MovingSortCursorCheck) == 0x000001, "Wrong alignment on BP_CampSkillCtrl_C_MovingSortCursorCheck");
static_assert(sizeof(BP_CampSkillCtrl_C_MovingSortCursorCheck) == 0x000008, "Wrong size on BP_CampSkillCtrl_C_MovingSortCursorCheck");
static_assert(offsetof(BP_CampSkillCtrl_C_MovingSortCursorCheck, CallFunc_ResetSortMovingCursor_ReturnValue) == 0x000000, "Member 'BP_CampSkillCtrl_C_MovingSortCursorCheck::CallFunc_ResetSortMovingCursor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_MovingSortCursorCheck, CallFunc_IsActionPadCheck_Success) == 0x000001, "Member 'BP_CampSkillCtrl_C_MovingSortCursorCheck::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_MovingSortCursorCheck, CallFunc_IsActionPadCheck_Success_1) == 0x000002, "Member 'BP_CampSkillCtrl_C_MovingSortCursorCheck::CallFunc_IsActionPadCheck_Success_1' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_MovingSortCursorCheck, CallFunc_IsActionPadCheck_Success_2) == 0x000003, "Member 'BP_CampSkillCtrl_C_MovingSortCursorCheck::CallFunc_IsActionPadCheck_Success_2' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_MovingSortCursorCheck, CallFunc_IsActionPadCheck_Success_3) == 0x000004, "Member 'BP_CampSkillCtrl_C_MovingSortCursorCheck::CallFunc_IsActionPadCheck_Success_3' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_MovingSortCursorCheck, CallFunc_BooleanOR_ReturnValue) == 0x000005, "Member 'BP_CampSkillCtrl_C_MovingSortCursorCheck::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_MovingSortCursorCheck, CallFunc_BooleanOR_ReturnValue_1) == 0x000006, "Member 'BP_CampSkillCtrl_C_MovingSortCursorCheck::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_MovingSortCursorCheck, CallFunc_BooleanOR_ReturnValue_2) == 0x000007, "Member 'BP_CampSkillCtrl_C_MovingSortCursorCheck::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.RestartSelectedSkillList
// 0x0008 (0x0008 - 0x0000)
struct BP_CampSkillCtrl_C_RestartSelectedSkillList final
{
public:
	int32                                         CallFunc_GetCursorDispIndex_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetSkillPanel_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CreateSkillList_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampSkillCtrl_C_RestartSelectedSkillList) == 0x000004, "Wrong alignment on BP_CampSkillCtrl_C_RestartSelectedSkillList");
static_assert(sizeof(BP_CampSkillCtrl_C_RestartSelectedSkillList) == 0x000008, "Wrong size on BP_CampSkillCtrl_C_RestartSelectedSkillList");
static_assert(offsetof(BP_CampSkillCtrl_C_RestartSelectedSkillList, CallFunc_GetCursorDispIndex_ReturnValue) == 0x000000, "Member 'BP_CampSkillCtrl_C_RestartSelectedSkillList::CallFunc_GetCursorDispIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_RestartSelectedSkillList, CallFunc_SetSkillPanel_ReturnValue) == 0x000004, "Member 'BP_CampSkillCtrl_C_RestartSelectedSkillList::CallFunc_SetSkillPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_RestartSelectedSkillList, CallFunc_CreateSkillList_ReturnValue) == 0x000005, "Member 'BP_CampSkillCtrl_C_RestartSelectedSkillList::CallFunc_CreateSkillList_ReturnValue' has a wrong offset!");

// Function BP_CampSkillCtrl.BP_CampSkillCtrl_C.InitializeSortParameter
// 0x0014 (0x0014 - 0x0000)
struct BP_CampSkillCtrl_C_InitializeSortParameter final
{
public:
	int32                                         CallFunc_BPL_SortWindow2_GetAppliedSetting_AppliedSetting; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SORT_WINDOW_SORT_ORDER                      CallFunc_BPL_SortWindow2_GetAppliedSetting_AppliedOrder; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetSortType_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D18[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BPL_SortWindow2_GetAppliedSetting_AppliedSetting_1; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SORT_WINDOW_SORT_ORDER                      CallFunc_BPL_SortWindow2_GetAppliedSetting_AppliedOrder_1; // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetSortSkillList_ReturnValue;             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetSortAscending_ReturnValue;             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetSortAscending_ReturnValue_1;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CampSkillCtrl_C_InitializeSortParameter) == 0x000004, "Wrong alignment on BP_CampSkillCtrl_C_InitializeSortParameter");
static_assert(sizeof(BP_CampSkillCtrl_C_InitializeSortParameter) == 0x000014, "Wrong size on BP_CampSkillCtrl_C_InitializeSortParameter");
static_assert(offsetof(BP_CampSkillCtrl_C_InitializeSortParameter, CallFunc_BPL_SortWindow2_GetAppliedSetting_AppliedSetting) == 0x000000, "Member 'BP_CampSkillCtrl_C_InitializeSortParameter::CallFunc_BPL_SortWindow2_GetAppliedSetting_AppliedSetting' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_InitializeSortParameter, CallFunc_BPL_SortWindow2_GetAppliedSetting_AppliedOrder) == 0x000004, "Member 'BP_CampSkillCtrl_C_InitializeSortParameter::CallFunc_BPL_SortWindow2_GetAppliedSetting_AppliedOrder' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_InitializeSortParameter, CallFunc_SetSortType_ReturnValue) == 0x000005, "Member 'BP_CampSkillCtrl_C_InitializeSortParameter::CallFunc_SetSortType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CampSkillCtrl_C_InitializeSortParameter, CallFunc_BPL_SortWindow2_GetAppliedSetting_AppliedSetting_1) == 0x000008, "Member 'BP_CampSkillCtrl_C_InitializeSortParameter::CallFunc_BPL_SortWindow2_GetAppliedSetting_AppliedSetting_1' has a wrong offset!");
