#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CameraDitherComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CameraDitherComponent.BP_CameraDitherComponent_C.ExecuteUbergraph_BP_CameraDitherComponent
// 0x0050 (0x0050 - 0x0000)
struct BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     CallFunc_TraceForMaskingObjects_HitResults;        // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_TraceForMaskingObjects_ReturnValue;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_CalculateHitLocation_HitLocation;         // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent) == 0x000008, "Wrong alignment on BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent");
static_assert(sizeof(BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent) == 0x000050, "Wrong size on BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent");
static_assert(offsetof(BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent, EntryPoint) == 0x000000, "Member 'BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000010, "Member 'BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000018, "Member 'BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent, CallFunc_TraceForMaskingObjects_HitResults) == 0x000020, "Member 'BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent::CallFunc_TraceForMaskingObjects_HitResults' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent, CallFunc_TraceForMaskingObjects_ReturnValue) == 0x000030, "Member 'BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent::CallFunc_TraceForMaskingObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent, CallFunc_CalculateHitLocation_HitLocation) == 0x000034, "Member 'BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent::CallFunc_CalculateHitLocation_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000040, "Member 'BP_CameraDitherComponent_C_ExecuteUbergraph_BP_CameraDitherComponent::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");

// Function BP_CameraDitherComponent.BP_CameraDitherComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CameraDitherComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraDitherComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CameraDitherComponent_C_ReceiveTick");
static_assert(sizeof(BP_CameraDitherComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_CameraDitherComponent_C_ReceiveTick");
static_assert(offsetof(BP_CameraDitherComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CameraDitherComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_CameraDitherComponent.BP_CameraDitherComponent_C.BP Trace For Masking Objects
// 0x00E0 (0x00E0 - 0x0000)
struct BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     OutHits;                                           // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00B8(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FHitResult>                     CallFunc_BoxTraceMulti_OutHits;                    // 0x00C8(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_BoxTraceMulti_ReturnValue;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects) == 0x000008, "Wrong alignment on BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects");
static_assert(sizeof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects) == 0x0000E0, "Wrong size on BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects, ReturnValue) == 0x000000, "Member 'BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects, OutHits) == 0x000008, "Member 'BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects::OutHits' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects, CallFunc_GetForwardVector_ReturnValue) == 0x000018, "Member 'BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000028, "Member 'BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects, CallFunc_MakeVector_ReturnValue) == 0x000034, "Member 'BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000040, "Member 'BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects, CallFunc_GetForwardVector_ReturnValue_1) == 0x00004C, "Member 'BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects, CallFunc_GetUpVector_ReturnValue) == 0x000058, "Member 'BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects, CallFunc_BreakVector_X) == 0x000064, "Member 'BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects, CallFunc_BreakVector_Y) == 0x000068, "Member 'BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects, CallFunc_BreakVector_Z) == 0x00006C, "Member 'BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000070, "Member 'BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects, CallFunc_MakeVector_ReturnValue_1) == 0x00007C, "Member 'BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects, CallFunc_Add_VectorVector_ReturnValue) == 0x000088, "Member 'BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000094, "Member 'BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000A0, "Member 'BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000AC, "Member 'BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects, Temp_object_Variable) == 0x0000B8, "Member 'BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects, CallFunc_BoxTraceMulti_OutHits) == 0x0000C8, "Member 'BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects::CallFunc_BoxTraceMulti_OutHits' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects, CallFunc_BoxTraceMulti_ReturnValue) == 0x0000D8, "Member 'BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects::CallFunc_BoxTraceMulti_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000D9, "Member 'BP_CameraDitherComponent_C_BP_Trace_For_Masking_Objects::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function BP_CameraDitherComponent.BP_CameraDitherComponent_C.Initialize Dither Component
// 0x0018 (0x0018 - 0x0000)
struct BP_CameraDitherComponent_C_Initialize_Dither_Component final
{
public:
	class USpringArmComponent*                    CameraBoom;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CapsuleComponent;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       FollowCamera;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraDitherComponent_C_Initialize_Dither_Component) == 0x000008, "Wrong alignment on BP_CameraDitherComponent_C_Initialize_Dither_Component");
static_assert(sizeof(BP_CameraDitherComponent_C_Initialize_Dither_Component) == 0x000018, "Wrong size on BP_CameraDitherComponent_C_Initialize_Dither_Component");
static_assert(offsetof(BP_CameraDitherComponent_C_Initialize_Dither_Component, CameraBoom) == 0x000000, "Member 'BP_CameraDitherComponent_C_Initialize_Dither_Component::CameraBoom' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_Initialize_Dither_Component, CapsuleComponent) == 0x000008, "Member 'BP_CameraDitherComponent_C_Initialize_Dither_Component::CapsuleComponent' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_Initialize_Dither_Component, FollowCamera) == 0x000010, "Member 'BP_CameraDitherComponent_C_Initialize_Dither_Component::FollowCamera' has a wrong offset!");

// Function BP_CameraDitherComponent.BP_CameraDitherComponent_C.DebugTraceForDitherArea
// 0x0040 (0x0040 - 0x0000)
struct BP_CameraDitherComponent_C_DebugTraceForDitherArea final
{
public:
	bool                                          IsDithering;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_CalculateHitLocation_HitLocation;         // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     CallFunc_SphereTraceMulti_OutHits;                 // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMulti_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CameraDitherComponent_C_DebugTraceForDitherArea) == 0x000008, "Wrong alignment on BP_CameraDitherComponent_C_DebugTraceForDitherArea");
static_assert(sizeof(BP_CameraDitherComponent_C_DebugTraceForDitherArea) == 0x000040, "Wrong size on BP_CameraDitherComponent_C_DebugTraceForDitherArea");
static_assert(offsetof(BP_CameraDitherComponent_C_DebugTraceForDitherArea, IsDithering) == 0x000000, "Member 'BP_CameraDitherComponent_C_DebugTraceForDitherArea::IsDithering' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_DebugTraceForDitherArea, CallFunc_CalculateHitLocation_HitLocation) == 0x000004, "Member 'BP_CameraDitherComponent_C_DebugTraceForDitherArea::CallFunc_CalculateHitLocation_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_DebugTraceForDitherArea, Temp_object_Variable) == 0x000010, "Member 'BP_CameraDitherComponent_C_DebugTraceForDitherArea::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_DebugTraceForDitherArea, CallFunc_Add_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_CameraDitherComponent_C_DebugTraceForDitherArea::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_DebugTraceForDitherArea, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000024, "Member 'BP_CameraDitherComponent_C_DebugTraceForDitherArea::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_DebugTraceForDitherArea, CallFunc_SphereTraceMulti_OutHits) == 0x000028, "Member 'BP_CameraDitherComponent_C_DebugTraceForDitherArea::CallFunc_SphereTraceMulti_OutHits' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_DebugTraceForDitherArea, CallFunc_SphereTraceMulti_ReturnValue) == 0x000038, "Member 'BP_CameraDitherComponent_C_DebugTraceForDitherArea::CallFunc_SphereTraceMulti_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_DebugTraceForDitherArea, CallFunc_BooleanAND_ReturnValue) == 0x000039, "Member 'BP_CameraDitherComponent_C_DebugTraceForDitherArea::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_CameraDitherComponent.BP_CameraDitherComponent_C.BP CalcHitlocation
// 0x0050 (0x0050 - 0x0000)
struct BP_CameraDitherComponent_C_BP_CalcHitlocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleRadius_ReturnValue;       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraDitherComponent_C_BP_CalcHitlocation) == 0x000004, "Wrong alignment on BP_CameraDitherComponent_C_BP_CalcHitlocation");
static_assert(sizeof(BP_CameraDitherComponent_C_BP_CalcHitlocation) == 0x000050, "Wrong size on BP_CameraDitherComponent_C_BP_CalcHitlocation");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_CalcHitlocation, ReturnValue) == 0x000000, "Member 'BP_CameraDitherComponent_C_BP_CalcHitlocation::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_CalcHitlocation, CallFunc_Add_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_CameraDitherComponent_C_BP_CalcHitlocation::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_CalcHitlocation, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000010, "Member 'BP_CameraDitherComponent_C_BP_CalcHitlocation::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_CalcHitlocation, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000014, "Member 'BP_CameraDitherComponent_C_BP_CalcHitlocation::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_CalcHitlocation, CallFunc_GetForwardVector_ReturnValue) == 0x000020, "Member 'BP_CameraDitherComponent_C_BP_CalcHitlocation::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_CalcHitlocation, CallFunc_GetScaledCapsuleRadius_ReturnValue) == 0x00002C, "Member 'BP_CameraDitherComponent_C_BP_CalcHitlocation::CallFunc_GetScaledCapsuleRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_CalcHitlocation, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000030, "Member 'BP_CameraDitherComponent_C_BP_CalcHitlocation::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_CalcHitlocation, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000034, "Member 'BP_CameraDitherComponent_C_BP_CalcHitlocation::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_CalcHitlocation, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000038, "Member 'BP_CameraDitherComponent_C_BP_CalcHitlocation::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BP_CalcHitlocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000044, "Member 'BP_CameraDitherComponent_C_BP_CalcHitlocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function BP_CameraDitherComponent.BP_CameraDitherComponent_C.SetVariables
// 0x000C (0x000C - 0x0000)
struct BP_CameraDitherComponent_C_SetVariables final
{
public:
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue_1;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraDitherComponent_C_SetVariables) == 0x000004, "Wrong alignment on BP_CameraDitherComponent_C_SetVariables");
static_assert(sizeof(BP_CameraDitherComponent_C_SetVariables) == 0x00000C, "Wrong size on BP_CameraDitherComponent_C_SetVariables");
static_assert(offsetof(BP_CameraDitherComponent_C_SetVariables, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000000, "Member 'BP_CameraDitherComponent_C_SetVariables::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_SetVariables, CallFunc_GetScalarParameterValue_ReturnValue_1) == 0x000004, "Member 'BP_CameraDitherComponent_C_SetVariables::CallFunc_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_SetVariables, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_CameraDitherComponent_C_SetVariables::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_CameraDitherComponent.BP_CameraDitherComponent_C.Set Trace Collisions
// 0x0024 (0x0024 - 0x0000)
struct BP_CameraDitherComponent_C_Set_Trace_Collisions final
{
public:
	float                                         TraceHeight;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TraceWidth;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TraceHeightOffset;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraDitherComponent_C_Set_Trace_Collisions) == 0x000004, "Wrong alignment on BP_CameraDitherComponent_C_Set_Trace_Collisions");
static_assert(sizeof(BP_CameraDitherComponent_C_Set_Trace_Collisions) == 0x000024, "Wrong size on BP_CameraDitherComponent_C_Set_Trace_Collisions");
static_assert(offsetof(BP_CameraDitherComponent_C_Set_Trace_Collisions, TraceHeight) == 0x000000, "Member 'BP_CameraDitherComponent_C_Set_Trace_Collisions::TraceHeight' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_Set_Trace_Collisions, TraceWidth) == 0x000004, "Member 'BP_CameraDitherComponent_C_Set_Trace_Collisions::TraceWidth' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_Set_Trace_Collisions, TraceHeightOffset) == 0x000008, "Member 'BP_CameraDitherComponent_C_Set_Trace_Collisions::TraceHeightOffset' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_Set_Trace_Collisions, CallFunc_FTrunc_ReturnValue) == 0x00000C, "Member 'BP_CameraDitherComponent_C_Set_Trace_Collisions::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_Set_Trace_Collisions, CallFunc_FTrunc_ReturnValue_1) == 0x000010, "Member 'BP_CameraDitherComponent_C_Set_Trace_Collisions::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_Set_Trace_Collisions, CallFunc_FTrunc_ReturnValue_2) == 0x000014, "Member 'BP_CameraDitherComponent_C_Set_Trace_Collisions::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_Set_Trace_Collisions, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'BP_CameraDitherComponent_C_Set_Trace_Collisions::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BP_CameraDitherComponent.BP_CameraDitherComponent_C.ToggleDitherState
// 0x0030 (0x0030 - 0x0000)
struct BP_CameraDitherComponent_C_ToggleDitherState final
{
public:
	bool                                          NewDitherState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionChannel                             Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionChannel                             Temp_byte_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionChannel                             K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CameraDitherComponent_C_ToggleDitherState) == 0x000008, "Wrong alignment on BP_CameraDitherComponent_C_ToggleDitherState");
static_assert(sizeof(BP_CameraDitherComponent_C_ToggleDitherState) == 0x000030, "Wrong size on BP_CameraDitherComponent_C_ToggleDitherState");
static_assert(offsetof(BP_CameraDitherComponent_C_ToggleDitherState, NewDitherState) == 0x000000, "Member 'BP_CameraDitherComponent_C_ToggleDitherState::NewDitherState' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_ToggleDitherState, Temp_int_Variable) == 0x000004, "Member 'BP_CameraDitherComponent_C_ToggleDitherState::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_ToggleDitherState, Temp_byte_Variable) == 0x000008, "Member 'BP_CameraDitherComponent_C_ToggleDitherState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_ToggleDitherState, Temp_byte_Variable_1) == 0x000009, "Member 'BP_CameraDitherComponent_C_ToggleDitherState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_ToggleDitherState, CallFunc_Conv_BoolToInt_ReturnValue) == 0x00000C, "Member 'BP_CameraDitherComponent_C_ToggleDitherState::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_ToggleDitherState, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_CameraDitherComponent_C_ToggleDitherState::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_ToggleDitherState, K2Node_Select_Default) == 0x000018, "Member 'BP_CameraDitherComponent_C_ToggleDitherState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_ToggleDitherState, CallFunc_GetPlayerPawn_ReturnValue) == 0x000020, "Member 'BP_CameraDitherComponent_C_ToggleDitherState::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_ToggleDitherState, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'BP_CameraDitherComponent_C_ToggleDitherState::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_CameraDitherComponent.BP_CameraDitherComponent_C.TempToggleDitherState
// 0x0020 (0x0020 - 0x0000)
struct BP_CameraDitherComponent_C_TempToggleDitherState final
{
public:
	bool                                          ForceDitherOff;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CameraDitherComponent_C_TempToggleDitherState) == 0x000008, "Wrong alignment on BP_CameraDitherComponent_C_TempToggleDitherState");
static_assert(sizeof(BP_CameraDitherComponent_C_TempToggleDitherState) == 0x000020, "Wrong size on BP_CameraDitherComponent_C_TempToggleDitherState");
static_assert(offsetof(BP_CameraDitherComponent_C_TempToggleDitherState, ForceDitherOff) == 0x000000, "Member 'BP_CameraDitherComponent_C_TempToggleDitherState::ForceDitherOff' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_TempToggleDitherState, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_CameraDitherComponent_C_TempToggleDitherState::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_TempToggleDitherState, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'BP_CameraDitherComponent_C_TempToggleDitherState::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_TempToggleDitherState, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'BP_CameraDitherComponent_C_TempToggleDitherState::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_TempToggleDitherState, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'BP_CameraDitherComponent_C_TempToggleDitherState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_TempToggleDitherState, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x00001A, "Member 'BP_CameraDitherComponent_C_TempToggleDitherState::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function BP_CameraDitherComponent.BP_CameraDitherComponent_C.TempToggleDitherState_Immediate
// 0x0020 (0x0020 - 0x0000)
struct BP_CameraDitherComponent_C_TempToggleDitherState_Immediate final
{
public:
	bool                                          ForceDitherOff;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CameraDitherComponent_C_TempToggleDitherState_Immediate) == 0x000008, "Wrong alignment on BP_CameraDitherComponent_C_TempToggleDitherState_Immediate");
static_assert(sizeof(BP_CameraDitherComponent_C_TempToggleDitherState_Immediate) == 0x000020, "Wrong size on BP_CameraDitherComponent_C_TempToggleDitherState_Immediate");
static_assert(offsetof(BP_CameraDitherComponent_C_TempToggleDitherState_Immediate, ForceDitherOff) == 0x000000, "Member 'BP_CameraDitherComponent_C_TempToggleDitherState_Immediate::ForceDitherOff' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_TempToggleDitherState_Immediate, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_CameraDitherComponent_C_TempToggleDitherState_Immediate::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_TempToggleDitherState_Immediate, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'BP_CameraDitherComponent_C_TempToggleDitherState_Immediate::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_TempToggleDitherState_Immediate, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'BP_CameraDitherComponent_C_TempToggleDitherState_Immediate::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_TempToggleDitherState_Immediate, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'BP_CameraDitherComponent_C_TempToggleDitherState_Immediate::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_TempToggleDitherState_Immediate, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x00001A, "Member 'BP_CameraDitherComponent_C_TempToggleDitherState_Immediate::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function BP_CameraDitherComponent.BP_CameraDitherComponent_C.BPI_TempToggleDitherState_Immediate
// 0x0002 (0x0002 - 0x0000)
struct BP_CameraDitherComponent_C_BPI_TempToggleDitherState_Immediate final
{
public:
	bool                                          ForceDitherOff;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Dummy;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CameraDitherComponent_C_BPI_TempToggleDitherState_Immediate) == 0x000001, "Wrong alignment on BP_CameraDitherComponent_C_BPI_TempToggleDitherState_Immediate");
static_assert(sizeof(BP_CameraDitherComponent_C_BPI_TempToggleDitherState_Immediate) == 0x000002, "Wrong size on BP_CameraDitherComponent_C_BPI_TempToggleDitherState_Immediate");
static_assert(offsetof(BP_CameraDitherComponent_C_BPI_TempToggleDitherState_Immediate, ForceDitherOff) == 0x000000, "Member 'BP_CameraDitherComponent_C_BPI_TempToggleDitherState_Immediate::ForceDitherOff' has a wrong offset!");
static_assert(offsetof(BP_CameraDitherComponent_C_BPI_TempToggleDitherState_Immediate, Dummy) == 0x000001, "Member 'BP_CameraDitherComponent_C_BPI_TempToggleDitherState_Immediate::Dummy' has a wrong offset!");

}

