#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CommonWindowCtrl

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CommonWindowCtrl.BP_CommonWindowCtrl_C.ExecuteUbergraph_BP_CommonWindowCtrl
// 0x0090 (0x0090 - 0x0000)
struct BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_WIDGET_PRIO                                 K2Node_Event_InPriority_1;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EAB[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    K2Node_Event_InScriptMessageAsset_1;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InIndex;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTN_HELP_MAPPING_KEY_TYPE                   K2Node_Event_InAction_1;                           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EAC[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InIconColor_1;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_WIDGET_PRIO                                 K2Node_Event_InPriority;                           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EAD[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    K2Node_Event_InScriptMessageAsset;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_InLabel;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTN_HELP_MAPPING_KEY_TYPE                   K2Node_Event_InAction;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EAE[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InIconColor;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_WIDGET_PRIO                                 K2Node_Event_InPriority_2;                         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EAF[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    K2Node_Event_InScriptMessageAsset_2;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InIndex_1;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InIconType;                           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InIconColor_2;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue_1;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_WIDGET_PRIO                                 K2Node_Event_InPriority_3;                         // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EB0[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    K2Node_Event_InScriptMessageAsset_3;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_InLabel_1;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InIconType_1;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InIconColor_3;                        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue_2;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue_3;            // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BTN_HELP_MAPPING_KEY_TYPE                   CallFunc_GetCurrentMappingType_MappingType;        // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EB1[0x1];                                     // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EB2[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CommonWindow_C*                     CallFunc_Create_ReturnValue;                       // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionWindowActive_OutParam;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl) == 0x000008, "Wrong alignment on BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl");
static_assert(sizeof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl) == 0x000090, "Wrong size on BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, EntryPoint) == 0x000000, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, K2Node_Event_InPriority_1) == 0x000004, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::K2Node_Event_InPriority_1' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, K2Node_Event_InScriptMessageAsset_1) == 0x000008, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::K2Node_Event_InScriptMessageAsset_1' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, K2Node_Event_InIndex) == 0x000010, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::K2Node_Event_InIndex' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, K2Node_Event_InAction_1) == 0x000014, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::K2Node_Event_InAction_1' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, K2Node_Event_InIconColor_1) == 0x000018, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::K2Node_Event_InIconColor_1' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, K2Node_Event_InPriority) == 0x00001C, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::K2Node_Event_InPriority' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, K2Node_Event_InScriptMessageAsset) == 0x000020, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::K2Node_Event_InScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, K2Node_Event_InLabel) == 0x000028, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::K2Node_Event_InLabel' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, K2Node_Event_InAction) == 0x000030, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::K2Node_Event_InAction' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, K2Node_Event_InIconColor) == 0x000034, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::K2Node_Event_InIconColor' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, CallFunc_AddToWidgetPrio_ReturnValue) == 0x000038, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::CallFunc_AddToWidgetPrio_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, K2Node_Event_InPriority_2) == 0x000039, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::K2Node_Event_InPriority_2' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, K2Node_Event_InScriptMessageAsset_2) == 0x000040, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::K2Node_Event_InScriptMessageAsset_2' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, K2Node_Event_InIndex_1) == 0x000048, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::K2Node_Event_InIndex_1' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, K2Node_Event_InIconType) == 0x00004C, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::K2Node_Event_InIconType' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, K2Node_Event_InIconColor_2) == 0x000050, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::K2Node_Event_InIconColor_2' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, CallFunc_AddToWidgetPrio_ReturnValue_1) == 0x000054, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::CallFunc_AddToWidgetPrio_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, K2Node_Event_InPriority_3) == 0x000055, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::K2Node_Event_InPriority_3' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, K2Node_Event_InScriptMessageAsset_3) == 0x000058, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::K2Node_Event_InScriptMessageAsset_3' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, K2Node_Event_InLabel_1) == 0x000060, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::K2Node_Event_InLabel_1' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, K2Node_Event_InIconType_1) == 0x000068, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::K2Node_Event_InIconType_1' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, K2Node_Event_InIconColor_3) == 0x00006C, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::K2Node_Event_InIconColor_3' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, CallFunc_AddToWidgetPrio_ReturnValue_2) == 0x000070, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::CallFunc_AddToWidgetPrio_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, CallFunc_AddToWidgetPrio_ReturnValue_3) == 0x000071, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::CallFunc_AddToWidgetPrio_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, CallFunc_GetCurrentMappingType_MappingType) == 0x000072, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::CallFunc_GetCurrentMappingType_MappingType' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, K2Node_Event_DeltaSeconds) == 0x000074, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, K2Node_Event_EndPlayReason) == 0x000078, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000079, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, CallFunc_IsValid_ReturnValue) == 0x00007A, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x00007B, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, CallFunc_Create_ReturnValue) == 0x000080, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, CallFunc_IsActionWindowActive_OutParam) == 0x000088, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::CallFunc_IsActionWindowActive_OutParam' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000089, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x00008A, "Member 'BP_CommonWindowCtrl_C_ExecuteUbergraph_BP_CommonWindowCtrl::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");

// Function BP_CommonWindowCtrl.BP_CommonWindowCtrl_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_CommonWindowCtrl_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CommonWindowCtrl_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_CommonWindowCtrl_C_ReceiveEndPlay");
static_assert(sizeof(BP_CommonWindowCtrl_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_CommonWindowCtrl_C_ReceiveEndPlay");
static_assert(offsetof(BP_CommonWindowCtrl_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_CommonWindowCtrl_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_CommonWindowCtrl.BP_CommonWindowCtrl_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CommonWindowCtrl_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CommonWindowCtrl_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CommonWindowCtrl_C_ReceiveTick");
static_assert(sizeof(BP_CommonWindowCtrl_C_ReceiveTick) == 0x000004, "Wrong size on BP_CommonWindowCtrl_C_ReceiveTick");
static_assert(offsetof(BP_CommonWindowCtrl_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CommonWindowCtrl_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_CommonWindowCtrl.BP_CommonWindowCtrl_C.IActionWindowOpenWithActionSpecifiedByLabel
// 0x0020 (0x0020 - 0x0000)
struct BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByLabel final
{
public:
	E_WIDGET_PRIO                                 InPriority;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EB3[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    InScriptMessageAsset;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InLabel;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTN_HELP_MAPPING_KEY_TYPE                   InAction;                                          // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EB4[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InIconColor;                                       // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByLabel) == 0x000008, "Wrong alignment on BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByLabel");
static_assert(sizeof(BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByLabel) == 0x000020, "Wrong size on BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByLabel");
static_assert(offsetof(BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByLabel, InPriority) == 0x000000, "Member 'BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByLabel::InPriority' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByLabel, InScriptMessageAsset) == 0x000008, "Member 'BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByLabel::InScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByLabel, InLabel) == 0x000010, "Member 'BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByLabel::InLabel' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByLabel, InAction) == 0x000018, "Member 'BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByLabel::InAction' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByLabel, InIconColor) == 0x00001C, "Member 'BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByLabel::InIconColor' has a wrong offset!");

// Function BP_CommonWindowCtrl.BP_CommonWindowCtrl_C.IActionWindowOpenWithActionSpecifiedByIndex
// 0x0020 (0x0020 - 0x0000)
struct BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByIndex final
{
public:
	E_WIDGET_PRIO                                 InPriority;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EB5[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    InScriptMessageAsset;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InIndex;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTN_HELP_MAPPING_KEY_TYPE                   InAction;                                          // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EB6[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InIconColor;                                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByIndex) == 0x000008, "Wrong alignment on BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByIndex");
static_assert(sizeof(BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByIndex) == 0x000020, "Wrong size on BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByIndex");
static_assert(offsetof(BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByIndex, InPriority) == 0x000000, "Member 'BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByIndex::InPriority' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByIndex, InScriptMessageAsset) == 0x000008, "Member 'BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByIndex::InScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByIndex, InIndex) == 0x000010, "Member 'BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByIndex::InIndex' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByIndex, InAction) == 0x000014, "Member 'BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByIndex::InAction' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByIndex, InIconColor) == 0x000018, "Member 'BP_CommonWindowCtrl_C_IActionWindowOpenWithActionSpecifiedByIndex::InIconColor' has a wrong offset!");

// Function BP_CommonWindowCtrl.BP_CommonWindowCtrl_C.IActionWindowOpenByIndex
// 0x0020 (0x0020 - 0x0000)
struct BP_CommonWindowCtrl_C_IActionWindowOpenByIndex final
{
public:
	E_WIDGET_PRIO                                 InPriority;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EB7[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    InScriptMessageAsset;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InIndex;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InIconType;                                        // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InIconColor;                                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CommonWindowCtrl_C_IActionWindowOpenByIndex) == 0x000008, "Wrong alignment on BP_CommonWindowCtrl_C_IActionWindowOpenByIndex");
static_assert(sizeof(BP_CommonWindowCtrl_C_IActionWindowOpenByIndex) == 0x000020, "Wrong size on BP_CommonWindowCtrl_C_IActionWindowOpenByIndex");
static_assert(offsetof(BP_CommonWindowCtrl_C_IActionWindowOpenByIndex, InPriority) == 0x000000, "Member 'BP_CommonWindowCtrl_C_IActionWindowOpenByIndex::InPriority' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_IActionWindowOpenByIndex, InScriptMessageAsset) == 0x000008, "Member 'BP_CommonWindowCtrl_C_IActionWindowOpenByIndex::InScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_IActionWindowOpenByIndex, InIndex) == 0x000010, "Member 'BP_CommonWindowCtrl_C_IActionWindowOpenByIndex::InIndex' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_IActionWindowOpenByIndex, InIconType) == 0x000014, "Member 'BP_CommonWindowCtrl_C_IActionWindowOpenByIndex::InIconType' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_IActionWindowOpenByIndex, InIconColor) == 0x000018, "Member 'BP_CommonWindowCtrl_C_IActionWindowOpenByIndex::InIconColor' has a wrong offset!");

// Function BP_CommonWindowCtrl.BP_CommonWindowCtrl_C.IActionWindowOpenByLabel
// 0x0020 (0x0020 - 0x0000)
struct BP_CommonWindowCtrl_C_IActionWindowOpenByLabel final
{
public:
	E_WIDGET_PRIO                                 InPriority;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EB8[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    InScriptMessageAsset;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InLabel;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InIconType;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InIconColor;                                       // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CommonWindowCtrl_C_IActionWindowOpenByLabel) == 0x000008, "Wrong alignment on BP_CommonWindowCtrl_C_IActionWindowOpenByLabel");
static_assert(sizeof(BP_CommonWindowCtrl_C_IActionWindowOpenByLabel) == 0x000020, "Wrong size on BP_CommonWindowCtrl_C_IActionWindowOpenByLabel");
static_assert(offsetof(BP_CommonWindowCtrl_C_IActionWindowOpenByLabel, InPriority) == 0x000000, "Member 'BP_CommonWindowCtrl_C_IActionWindowOpenByLabel::InPriority' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_IActionWindowOpenByLabel, InScriptMessageAsset) == 0x000008, "Member 'BP_CommonWindowCtrl_C_IActionWindowOpenByLabel::InScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_IActionWindowOpenByLabel, InLabel) == 0x000010, "Member 'BP_CommonWindowCtrl_C_IActionWindowOpenByLabel::InLabel' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_IActionWindowOpenByLabel, InIconType) == 0x000018, "Member 'BP_CommonWindowCtrl_C_IActionWindowOpenByLabel::InIconType' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_IActionWindowOpenByLabel, InIconColor) == 0x00001C, "Member 'BP_CommonWindowCtrl_C_IActionWindowOpenByLabel::InIconColor' has a wrong offset!");

// Function BP_CommonWindowCtrl.BP_CommonWindowCtrl_C.SetInitializeParameter
// 0x0001 (0x0001 - 0x0000)
struct BP_CommonWindowCtrl_C_SetInitializeParameter final
{
public:
	bool                                          CallFunc_CheckGamePadUI_Gamepad;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CommonWindowCtrl_C_SetInitializeParameter) == 0x000001, "Wrong alignment on BP_CommonWindowCtrl_C_SetInitializeParameter");
static_assert(sizeof(BP_CommonWindowCtrl_C_SetInitializeParameter) == 0x000001, "Wrong size on BP_CommonWindowCtrl_C_SetInitializeParameter");
static_assert(offsetof(BP_CommonWindowCtrl_C_SetInitializeParameter, CallFunc_CheckGamePadUI_Gamepad) == 0x000000, "Member 'BP_CommonWindowCtrl_C_SetInitializeParameter::CallFunc_CheckGamePadUI_Gamepad' has a wrong offset!");

// Function BP_CommonWindowCtrl.BP_CommonWindowCtrl_C.CalcIconDispMode
// 0x0002 (0x0002 - 0x0000)
struct BP_CommonWindowCtrl_C_CalcIconDispMode final
{
public:
	bool                                          CallFunc_CheckGamePadUI_Gamepad;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CommonWindowCtrl_C_CalcIconDispMode) == 0x000001, "Wrong alignment on BP_CommonWindowCtrl_C_CalcIconDispMode");
static_assert(sizeof(BP_CommonWindowCtrl_C_CalcIconDispMode) == 0x000002, "Wrong size on BP_CommonWindowCtrl_C_CalcIconDispMode");
static_assert(offsetof(BP_CommonWindowCtrl_C_CalcIconDispMode, CallFunc_CheckGamePadUI_Gamepad) == 0x000000, "Member 'BP_CommonWindowCtrl_C_CalcIconDispMode::CallFunc_CheckGamePadUI_Gamepad' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_CalcIconDispMode, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'BP_CommonWindowCtrl_C_CalcIconDispMode::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function BP_CommonWindowCtrl.BP_CommonWindowCtrl_C.Calc Key Board Language Type
// 0x0002 (0x0002 - 0x0000)
struct BP_CommonWindowCtrl_C_Calc_Key_Board_Language_Type final
{
public:
	E_KeyboardLanguage                            CallFunc_GetKeyboardLanguage_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CommonWindowCtrl_C_Calc_Key_Board_Language_Type) == 0x000001, "Wrong alignment on BP_CommonWindowCtrl_C_Calc_Key_Board_Language_Type");
static_assert(sizeof(BP_CommonWindowCtrl_C_Calc_Key_Board_Language_Type) == 0x000002, "Wrong size on BP_CommonWindowCtrl_C_Calc_Key_Board_Language_Type");
static_assert(offsetof(BP_CommonWindowCtrl_C_Calc_Key_Board_Language_Type, CallFunc_GetKeyboardLanguage_ReturnValue) == 0x000000, "Member 'BP_CommonWindowCtrl_C_Calc_Key_Board_Language_Type::CallFunc_GetKeyboardLanguage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CommonWindowCtrl_C_Calc_Key_Board_Language_Type, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BP_CommonWindowCtrl_C_Calc_Key_Board_Language_Type::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_CommonWindowCtrl.BP_CommonWindowCtrl_C.IActionWindowIsActive
// 0x0001 (0x0001 - 0x0000)
struct BP_CommonWindowCtrl_C_IActionWindowIsActive final
{
public:
	bool                                          OutActive;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CommonWindowCtrl_C_IActionWindowIsActive) == 0x000001, "Wrong alignment on BP_CommonWindowCtrl_C_IActionWindowIsActive");
static_assert(sizeof(BP_CommonWindowCtrl_C_IActionWindowIsActive) == 0x000001, "Wrong size on BP_CommonWindowCtrl_C_IActionWindowIsActive");
static_assert(offsetof(BP_CommonWindowCtrl_C_IActionWindowIsActive, OutActive) == 0x000000, "Member 'BP_CommonWindowCtrl_C_IActionWindowIsActive::OutActive' has a wrong offset!");

}

