#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharaChanger_Battle2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"
#include "ST_TalkCameraOffset_structs.hpp"
#include "ST_StBattleCameraSetUp_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CharaChanger_Battle2.BP_CharaChanger_Battle2_C.ExecuteUbergraph_BP_CharaChanger_Battle2
// 0x06E0 (0x06E0 - 0x0000)
struct BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NeedToFinalize_IsNeedToFinalize;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5516[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentPartyIndex_PartyIndex;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TalkDebug_GetCamera_IsDebugMode_Out;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5517[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             K2Node_Event_SpawnPos_1;                           // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	E_UI_STATUS_CTRL_TYPE                         K2Node_Event_Type_1;                               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5518[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_StatusCtrlDataBtl;                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_useAnalyzeItem;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5519[0xF];                                     // 0x0061(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Event_SpawnPos;                             // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	E_UI_STATUS_CTRL_TYPE                         K2Node_Event_Type;                                 // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_551A[0x6];                                     // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_551B[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_551C[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDevilID_ReturnValue;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckIsChangedRequest_NoChange;           // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DestroyDevilModel_destroyed;              // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_551D[0x6];                                     // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectGCManager*                      CallFunc_Get_ReturnValue;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_StBattleCameraSetUp                CallFunc_SetBattleStatusData_BattleCameraData;     // 0x00D8(0x002C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckIsChangedRequest_NoChange_1;         // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_UnitSetVisibilitySideAll_retValue;     // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_UnitSetVisibilitySideAll_retValue_1;   // 0x0106(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_UnitSetVisibilitySideAll_retValue_2;   // 0x0107(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_UnitSetVisibilitySideAll_retValue_3;   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_551E[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_DevilID_1;                            // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlCharData                           CallFunc_BI_GetCharaData_retValue;                 // 0x0110(0x0148)()
	TScriptInterface<class IBPI_CharaBaseAccessor_C> CallFunc_BI_GetPartyUnit_retValue;                 // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BI_CalcBattleCameraScale_Scale;           // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_StBattleCameraSetUp                CallFunc_SetBattleStatusData_BattleCameraData_1;   // 0x026C(0x002C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DestroyDevilModel_destroyed_1;            // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_551F[0x2];                                     // 0x02A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x02B0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Event_DevilID;                              // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsUnknown;                            // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckIsChangedRequest_NoChange_2;         // 0x02E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DestroyDevilModel_destroyed_2;            // 0x02E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5520[0x1];                                     // 0x02E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectGCManager*                      CallFunc_Get_ReturnValue_1;                        // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x02F0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0320(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5521[0x7];                                     // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CallFunc_GetDevilAssetClassData_ClassAssetID;      // 0x03B0(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_GetDevilAssetClassData_PlayerBaseAssetID; // 0x03D8(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_DestroyDevilModel_destroyed_3;            // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5522[0x3];                                     // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0404(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0410(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x041C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0428(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0438(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0448(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0458(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTargetFaceLocation_Location;           // 0x0468(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5523[0x4];                                     // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue_1;        // 0x0478(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0488(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0498(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x04A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharaBaseAccessor_C> CallFunc_BI_CalcBattleCameraScale_self_CastInput;  // 0x04B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BI_CalcBattleCameraScale_Scale_1;         // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5524[0x4];                                     // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x04D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x04E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x04F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0500(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NeedToFinalize_IsNeedToFinalize_1;        // 0x0511(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NeedToFinalize_IsNeedToFinalize_2;        // 0x0512(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NeedToFinalize_IsNeedToFinalize_3;        // 0x0513(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DestroyDevilModel_destroyed_4;            // 0x0514(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5525[0x3];                                     // 0x0515(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectGCManager*                      CallFunc_Get_ReturnValue_2;                        // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_BPL_GetBIBattleMain_retValue;             // 0x0520(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPL_GetBIBattleMain_success;              // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_GetCharAction_Success;                 // 0x0531(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5526[0x6];                                     // 0x0532(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleCharAction_C> CallFunc_BI_GetCharAction_RetValue;                // 0x0538(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOpenDebugMenu_ReturnValue;              // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5527[0x3];                                     // 0x0549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BPI_GetActorIndex_Ret;                    // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_UnitSetVisibility_retValue;            // 0x0551(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0552(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5528[0x1];                                     // 0x0553(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate;              // 0x0554(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5529[0x4];                                     // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NeedEnemyCameraData_ReturnValue;          // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NeedEnemyCameraData_ReturnValue_1;        // 0x0571(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_552A[0x2];                                     // 0x0572(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_TalkCameraOffset                   CallFunc_SetTalkCameraOffsetTable_CameraOffset;    // 0x0574(0x0028)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_TalkCameraOffset                   CallFunc_SetTalkCameraOffsetTable_CameraOffset_1;  // 0x059C(0x0028)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckIsChangedRequest_NoChange_3;         // 0x05C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NeedToFinalize_IsNeedToFinalize_4;        // 0x05C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DestroyDevilModel_destroyed_5;            // 0x05C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x05C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_552B[0x7];                                     // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectGCManager*                      CallFunc_Get_ReturnValue_3;                        // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_552C[0x8];                                     // 0x05D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x05E0(0x0030)(IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor;      // 0x0610(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_552D[0x7];                                     // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaAnimation_C> CallFunc_UpdateAnimation_self_CastInput;           // 0x0628(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAnimSequenceBase*                      CallFunc_BI_GetDefaultAnimation_ret;               // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Montage_IsPlaying_ReturnValue;            // 0x0649(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Montage_IsActive_ReturnValue;             // 0x064A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_552E[0x5];                                     // 0x064B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharaMotion                           CallFunc_GetCharaMotion_CharaMotion;               // 0x0650(0x0018)(NoDestructor)
	bool                                          CallFunc_GetCharaMotion_IsValid;                   // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0669(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x066A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x066B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x066C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_552F[0x3];                                     // 0x066D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> CallFunc_BI_GuestBattleInitialize_self_CastInput;  // 0x0670(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5530[0x7];                                     // 0x0681(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsChara_Base;              // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5531[0x7];                                     // 0x06A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevilPerformanceComponent_C*           CallFunc_GetComponentByClass_ReturnValue;          // 0x06B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharaParamComponent*                   CallFunc_GetComponentByClass_ReturnValue_1;        // 0x06C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_DevilPerformanceCore_C> K2Node_DynamicCast_AsBPI_Devil_Performance_Core;   // 0x06C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x06D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_AdjustMeshScale_NoUse;                 // 0x06DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2) == 0x000010, "Wrong alignment on BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2");
static_assert(sizeof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2) == 0x0006E0, "Wrong size on BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, EntryPoint) == 0x000000, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_NeedToFinalize_IsNeedToFinalize) == 0x000004, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_NeedToFinalize_IsNeedToFinalize' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_GetCurrentPartyIndex_PartyIndex) == 0x00000C, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_GetCurrentPartyIndex_PartyIndex' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_TalkDebug_GetCamera_IsDebugMode_Out) == 0x000010, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_TalkDebug_GetCamera_IsDebugMode_Out' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, K2Node_Event_SpawnPos_1) == 0x000020, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::K2Node_Event_SpawnPos_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, K2Node_Event_Type_1) == 0x000050, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::K2Node_Event_Type_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, K2Node_Event_StatusCtrlDataBtl) == 0x000058, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::K2Node_Event_StatusCtrlDataBtl' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, K2Node_Event_useAnalyzeItem) == 0x000060, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::K2Node_Event_useAnalyzeItem' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, K2Node_Event_SpawnPos) == 0x000070, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::K2Node_Event_SpawnPos' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, K2Node_Event_Type) == 0x0000A0, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::K2Node_Event_Type' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000A1, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000A8, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B0, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_GetViewTarget_ReturnValue) == 0x0000B8, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000C0, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_GetDevilID_ReturnValue) == 0x0000C4, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_GetDevilID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_CheckIsChangedRequest_NoChange) == 0x0000C8, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_CheckIsChangedRequest_NoChange' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_DestroyDevilModel_destroyed) == 0x0000C9, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_DestroyDevilModel_destroyed' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_Get_ReturnValue) == 0x0000D0, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_SetBattleStatusData_BattleCameraData) == 0x0000D8, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_SetBattleStatusData_BattleCameraData' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_CheckIsChangedRequest_NoChange_1) == 0x000104, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_CheckIsChangedRequest_NoChange_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BI_UnitSetVisibilitySideAll_retValue) == 0x000105, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BI_UnitSetVisibilitySideAll_retValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BI_UnitSetVisibilitySideAll_retValue_1) == 0x000106, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BI_UnitSetVisibilitySideAll_retValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BI_UnitSetVisibilitySideAll_retValue_2) == 0x000107, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BI_UnitSetVisibilitySideAll_retValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BI_UnitSetVisibilitySideAll_retValue_3) == 0x000108, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BI_UnitSetVisibilitySideAll_retValue_3' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, K2Node_Event_DevilID_1) == 0x00010C, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::K2Node_Event_DevilID_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BI_GetCharaData_retValue) == 0x000110, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BI_GetCharaData_retValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BI_GetPartyUnit_retValue) == 0x000258, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BI_GetPartyUnit_retValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BI_CalcBattleCameraScale_Scale) == 0x000268, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BI_CalcBattleCameraScale_Scale' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_SetBattleStatusData_BattleCameraData_1) == 0x00026C, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_SetBattleStatusData_BattleCameraData_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, K2Node_DynamicCast_AsActor) == 0x000298, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, K2Node_DynamicCast_bSuccess) == 0x0002A0, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_DestroyDevilModel_destroyed_1) == 0x0002A1, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_DestroyDevilModel_destroyed_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_GetActorForwardVector_ReturnValue) == 0x0002A4, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_GetTransform_ReturnValue) == 0x0002B0, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, K2Node_Event_DevilID) == 0x0002E0, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::K2Node_Event_DevilID' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, K2Node_Event_IsUnknown) == 0x0002E4, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::K2Node_Event_IsUnknown' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_CheckIsChangedRequest_NoChange_2) == 0x0002E5, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_CheckIsChangedRequest_NoChange_2' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_DestroyDevilModel_destroyed_2) == 0x0002E6, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_DestroyDevilModel_destroyed_2' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_Get_ReturnValue_1) == 0x0002E8, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_GetTransform_ReturnValue_1) == 0x0002F0, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000320, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0003A8, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_GetDevilAssetClassData_ClassAssetID) == 0x0003B0, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_GetDevilAssetClassData_ClassAssetID' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_GetDevilAssetClassData_PlayerBaseAssetID) == 0x0003D8, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_GetDevilAssetClassData_PlayerBaseAssetID' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_DestroyDevilModel_destroyed_3) == 0x000400, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_DestroyDevilModel_destroyed_3' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BreakTransform_Location) == 0x000404, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BreakTransform_Rotation) == 0x000410, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BreakTransform_Scale) == 0x00041C, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_Conv_VectorToString_ReturnValue) == 0x000428, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_Conv_FloatToString_ReturnValue) == 0x000438, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_Concat_StrStr_ReturnValue) == 0x000448, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000458, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_GetTargetFaceLocation_Location) == 0x000468, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_GetTargetFaceLocation_Location' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_Conv_VectorToString_ReturnValue_1) == 0x000478, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_Conv_VectorToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000488, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000498, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0004A8, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BI_CalcBattleCameraScale_self_CastInput) == 0x0004B8, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BI_CalcBattleCameraScale_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BI_CalcBattleCameraScale_Scale_1) == 0x0004C8, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BI_CalcBattleCameraScale_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_Conv_FloatToString_ReturnValue_1) == 0x0004D0, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_Conv_FloatToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0004E0, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_Conv_IntToString_ReturnValue) == 0x0004F0, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000500, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_IsValid_ReturnValue) == 0x000510, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_NeedToFinalize_IsNeedToFinalize_1) == 0x000511, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_NeedToFinalize_IsNeedToFinalize_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_NeedToFinalize_IsNeedToFinalize_2) == 0x000512, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_NeedToFinalize_IsNeedToFinalize_2' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_NeedToFinalize_IsNeedToFinalize_3) == 0x000513, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_NeedToFinalize_IsNeedToFinalize_3' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_DestroyDevilModel_destroyed_4) == 0x000514, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_DestroyDevilModel_destroyed_4' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_Get_ReturnValue_2) == 0x000518, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BPL_GetBIBattleMain_retValue) == 0x000520, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BPL_GetBIBattleMain_retValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BPL_GetBIBattleMain_success) == 0x000530, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BPL_GetBIBattleMain_success' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BI_GetCharAction_Success) == 0x000531, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BI_GetCharAction_Success' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BI_GetCharAction_RetValue) == 0x000538, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BI_GetCharAction_RetValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_IsOpenDebugMenu_ReturnValue) == 0x000548, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_IsOpenDebugMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BPI_GetActorIndex_Ret) == 0x00054C, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BPI_GetActorIndex_Ret' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BooleanAND_ReturnValue) == 0x000550, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BI_UnitSetVisibility_retValue) == 0x000551, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BI_UnitSetVisibility_retValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_IsValid_ReturnValue_1) == 0x000552, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, K2Node_CreateDelegate_OutputDelegate) == 0x000554, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_GetPlayerController_ReturnValue_2) == 0x000568, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_NeedEnemyCameraData_ReturnValue) == 0x000570, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_NeedEnemyCameraData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_NeedEnemyCameraData_ReturnValue_1) == 0x000571, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_NeedEnemyCameraData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_SetTalkCameraOffsetTable_CameraOffset) == 0x000574, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_SetTalkCameraOffsetTable_CameraOffset' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_SetTalkCameraOffsetTable_CameraOffset_1) == 0x00059C, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_SetTalkCameraOffsetTable_CameraOffset_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_CheckIsChangedRequest_NoChange_3) == 0x0005C4, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_CheckIsChangedRequest_NoChange_3' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_NeedToFinalize_IsNeedToFinalize_4) == 0x0005C5, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_NeedToFinalize_IsNeedToFinalize_4' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_DestroyDevilModel_destroyed_5) == 0x0005C6, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_DestroyDevilModel_destroyed_5' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_Not_PreBool_ReturnValue) == 0x0005C7, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BooleanAND_ReturnValue_1) == 0x0005C8, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_Get_ReturnValue_3) == 0x0005D0, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_Get_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_MakeTransform_ReturnValue) == 0x0005E0, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor) == 0x000610, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, K2Node_DynamicCast_bSuccess_1) == 0x000620, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_UpdateAnimation_self_CastInput) == 0x000628, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_UpdateAnimation_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BI_GetDefaultAnimation_ret) == 0x000638, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BI_GetDefaultAnimation_ret' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_GetAnimInstance_ReturnValue) == 0x000640, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_IsValid_ReturnValue_2) == 0x000648, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_Montage_IsPlaying_ReturnValue) == 0x000649, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_Montage_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_Montage_IsActive_ReturnValue) == 0x00064A, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_Montage_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_GetCharaMotion_CharaMotion) == 0x000650, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_GetCharaMotion_CharaMotion' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_GetCharaMotion_IsValid) == 0x000668, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_GetCharaMotion_IsValid' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BooleanAND_ReturnValue_2) == 0x000669, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BooleanAND_ReturnValue_3) == 0x00066A, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00066B, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x00066C, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BI_GuestBattleInitialize_self_CastInput) == 0x000670, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BI_GuestBattleInitialize_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BooleanOR_ReturnValue) == 0x000680, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, Temp_class_Variable) == 0x000688, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, K2Node_CustomEvent_Loaded) == 0x000690, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, K2Node_ClassDynamicCast_AsChara_Base) == 0x000698, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::K2Node_ClassDynamicCast_AsChara_Base' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, K2Node_ClassDynamicCast_bSuccess) == 0x0006A0, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0006A8, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_FinishSpawningActor_ReturnValue) == 0x0006B0, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_GetComponentByClass_ReturnValue) == 0x0006B8, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_GetComponentByClass_ReturnValue_1) == 0x0006C0, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, K2Node_DynamicCast_AsBPI_Devil_Performance_Core) == 0x0006C8, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::K2Node_DynamicCast_AsBPI_Devil_Performance_Core' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, K2Node_DynamicCast_bSuccess_2) == 0x0006D8, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2, CallFunc_IsValid_ReturnValue_3) == 0x0006D9, "Member 'BP_CharaChanger_Battle2_C_ExecuteUbergraph_BP_CharaChanger_Battle2::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
