#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CategoryWindowCtrl

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CategoryWindowCtrl.BP_CategoryWindowCtrl_C.ExecuteUbergraph_BP_CategoryWindowCtrl
// 0x0018 (0x0018 - 0x0000)
struct BP_CategoryWindowCtrl_C_ExecuteUbergraph_BP_CategoryWindowCtrl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65BD[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CategoryWindow_C*                   CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CategoryWindowCtrl_C_ExecuteUbergraph_BP_CategoryWindowCtrl) == 0x000008, "Wrong alignment on BP_CategoryWindowCtrl_C_ExecuteUbergraph_BP_CategoryWindowCtrl");
static_assert(sizeof(BP_CategoryWindowCtrl_C_ExecuteUbergraph_BP_CategoryWindowCtrl) == 0x000018, "Wrong size on BP_CategoryWindowCtrl_C_ExecuteUbergraph_BP_CategoryWindowCtrl");
static_assert(offsetof(BP_CategoryWindowCtrl_C_ExecuteUbergraph_BP_CategoryWindowCtrl, EntryPoint) == 0x000000, "Member 'BP_CategoryWindowCtrl_C_ExecuteUbergraph_BP_CategoryWindowCtrl::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_ExecuteUbergraph_BP_CategoryWindowCtrl, K2Node_Event_EndPlayReason) == 0x000004, "Member 'BP_CategoryWindowCtrl_C_ExecuteUbergraph_BP_CategoryWindowCtrl::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_ExecuteUbergraph_BP_CategoryWindowCtrl, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BP_CategoryWindowCtrl_C_ExecuteUbergraph_BP_CategoryWindowCtrl::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_ExecuteUbergraph_BP_CategoryWindowCtrl, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_CategoryWindowCtrl_C_ExecuteUbergraph_BP_CategoryWindowCtrl::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_ExecuteUbergraph_BP_CategoryWindowCtrl, CallFunc_IsInViewport_ReturnValue) == 0x000011, "Member 'BP_CategoryWindowCtrl_C_ExecuteUbergraph_BP_CategoryWindowCtrl::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");

// Function BP_CategoryWindowCtrl.BP_CategoryWindowCtrl_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_CategoryWindowCtrl_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CategoryWindowCtrl_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_CategoryWindowCtrl_C_ReceiveEndPlay");
static_assert(sizeof(BP_CategoryWindowCtrl_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_CategoryWindowCtrl_C_ReceiveEndPlay");
static_assert(offsetof(BP_CategoryWindowCtrl_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_CategoryWindowCtrl_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_CategoryWindowCtrl.BP_CategoryWindowCtrl_C.BindMouseEvent
// 0x0030 (0x0030 - 0x0000)
struct BP_CategoryWindowCtrl_C_BindMouseEvent final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 CategoryIdx)>            K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_CategoryWindowCtrl_C_BindMouseEvent) == 0x000004, "Wrong alignment on BP_CategoryWindowCtrl_C_BindMouseEvent");
static_assert(sizeof(BP_CategoryWindowCtrl_C_BindMouseEvent) == 0x000030, "Wrong size on BP_CategoryWindowCtrl_C_BindMouseEvent");
static_assert(offsetof(BP_CategoryWindowCtrl_C_BindMouseEvent, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_CategoryWindowCtrl_C_BindMouseEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_BindMouseEvent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'BP_CategoryWindowCtrl_C_BindMouseEvent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_BindMouseEvent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'BP_CategoryWindowCtrl_C_BindMouseEvent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function BP_CategoryWindowCtrl.BP_CategoryWindowCtrl_C.OnClickedByMouse_CategoryIcon
// 0x0018 (0x0018 - 0x0000)
struct BP_CategoryWindowCtrl_C_OnClickedByMouse_CategoryIcon final
{
public:
	int32                                         InCategoryIdx;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65BE[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CommonUI_EventCtrl_C*               CallFunc_GetCommonUI_EventCtrl_outActor;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CATEGORY_UI_STATE                           CallFunc_GetCategoryWindowState_State;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CategoryWindowCtrl_C_OnClickedByMouse_CategoryIcon) == 0x000008, "Wrong alignment on BP_CategoryWindowCtrl_C_OnClickedByMouse_CategoryIcon");
static_assert(sizeof(BP_CategoryWindowCtrl_C_OnClickedByMouse_CategoryIcon) == 0x000018, "Wrong size on BP_CategoryWindowCtrl_C_OnClickedByMouse_CategoryIcon");
static_assert(offsetof(BP_CategoryWindowCtrl_C_OnClickedByMouse_CategoryIcon, InCategoryIdx) == 0x000000, "Member 'BP_CategoryWindowCtrl_C_OnClickedByMouse_CategoryIcon::InCategoryIdx' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_OnClickedByMouse_CategoryIcon, CallFunc_GetCommonUI_EventCtrl_outActor) == 0x000008, "Member 'BP_CategoryWindowCtrl_C_OnClickedByMouse_CategoryIcon::CallFunc_GetCommonUI_EventCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_OnClickedByMouse_CategoryIcon, CallFunc_GetCategoryWindowState_State) == 0x000010, "Member 'BP_CategoryWindowCtrl_C_OnClickedByMouse_CategoryIcon::CallFunc_GetCategoryWindowState_State' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_OnClickedByMouse_CategoryIcon, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'BP_CategoryWindowCtrl_C_OnClickedByMouse_CategoryIcon::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_CategoryWindowCtrl.BP_CategoryWindowCtrl_C.OnClickedByMouse_SlideL
// 0x0018 (0x0018 - 0x0000)
struct BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideL final
{
public:
	class ABP_CommonUI_EventCtrl_C*               CallFunc_GetCommonUI_EventCtrl_outActor;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CATEGORY_UI_STATE                           CallFunc_GetCategoryWindowState_State;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65BF[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCursorIndex_CursorIndex;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideL) == 0x000008, "Wrong alignment on BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideL");
static_assert(sizeof(BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideL) == 0x000018, "Wrong size on BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideL");
static_assert(offsetof(BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideL, CallFunc_GetCommonUI_EventCtrl_outActor) == 0x000000, "Member 'BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideL::CallFunc_GetCommonUI_EventCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideL, CallFunc_GetCategoryWindowState_State) == 0x000008, "Member 'BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideL::CallFunc_GetCategoryWindowState_State' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideL, CallFunc_GetCursorIndex_CursorIndex) == 0x00000C, "Member 'BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideL::CallFunc_GetCursorIndex_CursorIndex' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideL, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideL::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_CategoryWindowCtrl.BP_CategoryWindowCtrl_C.OnClickedByMouse_SlideR
// 0x0018 (0x0018 - 0x0000)
struct BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideR final
{
public:
	class ABP_CommonUI_EventCtrl_C*               CallFunc_GetCommonUI_EventCtrl_outActor;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CATEGORY_UI_STATE                           CallFunc_GetCategoryWindowState_State;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65C0[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCursorIndex_CursorIndex;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideR) == 0x000008, "Wrong alignment on BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideR");
static_assert(sizeof(BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideR) == 0x000018, "Wrong size on BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideR");
static_assert(offsetof(BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideR, CallFunc_GetCommonUI_EventCtrl_outActor) == 0x000000, "Member 'BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideR::CallFunc_GetCommonUI_EventCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideR, CallFunc_GetCategoryWindowState_State) == 0x000008, "Member 'BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideR::CallFunc_GetCategoryWindowState_State' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideR, CallFunc_GetCursorIndex_CursorIndex) == 0x00000C, "Member 'BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideR::CallFunc_GetCursorIndex_CursorIndex' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideR, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'BP_CategoryWindowCtrl_C_OnClickedByMouse_SlideR::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_CategoryWindowCtrl.BP_CategoryWindowCtrl_C.GetCategoryWindowState
// 0x0002 (0x0002 - 0x0000)
struct BP_CategoryWindowCtrl_C_GetCategoryWindowState final
{
public:
	E_CATEGORY_UI_STATE                           State;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CATEGORY_UI_STATE                           CallFunc_GetState_UIState;                         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CategoryWindowCtrl_C_GetCategoryWindowState) == 0x000001, "Wrong alignment on BP_CategoryWindowCtrl_C_GetCategoryWindowState");
static_assert(sizeof(BP_CategoryWindowCtrl_C_GetCategoryWindowState) == 0x000002, "Wrong size on BP_CategoryWindowCtrl_C_GetCategoryWindowState");
static_assert(offsetof(BP_CategoryWindowCtrl_C_GetCategoryWindowState, State) == 0x000000, "Member 'BP_CategoryWindowCtrl_C_GetCategoryWindowState::State' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_GetCategoryWindowState, CallFunc_GetState_UIState) == 0x000001, "Member 'BP_CategoryWindowCtrl_C_GetCategoryWindowState::CallFunc_GetState_UIState' has a wrong offset!");

// Function BP_CategoryWindowCtrl.BP_CategoryWindowCtrl_C.CloseCategoryWindow
// 0x0002 (0x0002 - 0x0000)
struct BP_CategoryWindowCtrl_C_CloseCategoryWindow final
{
public:
	bool                                          IsSkipAnim;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnVal;                                         // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CategoryWindowCtrl_C_CloseCategoryWindow) == 0x000001, "Wrong alignment on BP_CategoryWindowCtrl_C_CloseCategoryWindow");
static_assert(sizeof(BP_CategoryWindowCtrl_C_CloseCategoryWindow) == 0x000002, "Wrong size on BP_CategoryWindowCtrl_C_CloseCategoryWindow");
static_assert(offsetof(BP_CategoryWindowCtrl_C_CloseCategoryWindow, IsSkipAnim) == 0x000000, "Member 'BP_CategoryWindowCtrl_C_CloseCategoryWindow::IsSkipAnim' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_CloseCategoryWindow, ReturnVal) == 0x000001, "Member 'BP_CategoryWindowCtrl_C_CloseCategoryWindow::ReturnVal' has a wrong offset!");

// Function BP_CategoryWindowCtrl.BP_CategoryWindowCtrl_C.OpenCategoryWindow
// 0x000C (0x000C - 0x0000)
struct BP_CategoryWindowCtrl_C_OpenCategoryWindow final
{
public:
	E_WIDGET_PRIO                                 WidgetPrio;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CATEGORY_PATTERN                            CategoryPattern;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CATEGORY_FRAMEIN_TYPE                       FrameInPattern;                                    // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65C1[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DefaultCursorIdx;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSkipAnim;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnVal;                                         // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue;              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CategoryWindowCtrl_C_OpenCategoryWindow) == 0x000004, "Wrong alignment on BP_CategoryWindowCtrl_C_OpenCategoryWindow");
static_assert(sizeof(BP_CategoryWindowCtrl_C_OpenCategoryWindow) == 0x00000C, "Wrong size on BP_CategoryWindowCtrl_C_OpenCategoryWindow");
static_assert(offsetof(BP_CategoryWindowCtrl_C_OpenCategoryWindow, WidgetPrio) == 0x000000, "Member 'BP_CategoryWindowCtrl_C_OpenCategoryWindow::WidgetPrio' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_OpenCategoryWindow, CategoryPattern) == 0x000001, "Member 'BP_CategoryWindowCtrl_C_OpenCategoryWindow::CategoryPattern' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_OpenCategoryWindow, FrameInPattern) == 0x000002, "Member 'BP_CategoryWindowCtrl_C_OpenCategoryWindow::FrameInPattern' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_OpenCategoryWindow, DefaultCursorIdx) == 0x000004, "Member 'BP_CategoryWindowCtrl_C_OpenCategoryWindow::DefaultCursorIdx' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_OpenCategoryWindow, IsSkipAnim) == 0x000008, "Member 'BP_CategoryWindowCtrl_C_OpenCategoryWindow::IsSkipAnim' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_OpenCategoryWindow, ReturnVal) == 0x000009, "Member 'BP_CategoryWindowCtrl_C_OpenCategoryWindow::ReturnVal' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_OpenCategoryWindow, CallFunc_AddToWidgetPrio_ReturnValue) == 0x00000A, "Member 'BP_CategoryWindowCtrl_C_OpenCategoryWindow::CallFunc_AddToWidgetPrio_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_OpenCategoryWindow, CallFunc_IsInViewport_ReturnValue) == 0x00000B, "Member 'BP_CategoryWindowCtrl_C_OpenCategoryWindow::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");

// Function BP_CategoryWindowCtrl.BP_CategoryWindowCtrl_C.MoveCategoryCursor
// 0x0002 (0x0002 - 0x0000)
struct BP_CategoryWindowCtrl_C_MoveCategoryCursor final
{
public:
	E_CATEGORY_CURSOR_MOVE_DIRECTION              MoveDirection;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnVal;                                         // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CategoryWindowCtrl_C_MoveCategoryCursor) == 0x000001, "Wrong alignment on BP_CategoryWindowCtrl_C_MoveCategoryCursor");
static_assert(sizeof(BP_CategoryWindowCtrl_C_MoveCategoryCursor) == 0x000002, "Wrong size on BP_CategoryWindowCtrl_C_MoveCategoryCursor");
static_assert(offsetof(BP_CategoryWindowCtrl_C_MoveCategoryCursor, MoveDirection) == 0x000000, "Member 'BP_CategoryWindowCtrl_C_MoveCategoryCursor::MoveDirection' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_MoveCategoryCursor, ReturnVal) == 0x000001, "Member 'BP_CategoryWindowCtrl_C_MoveCategoryCursor::ReturnVal' has a wrong offset!");

// Function BP_CategoryWindowCtrl.BP_CategoryWindowCtrl_C.SetPosition
// 0x000C (0x000C - 0x0000)
struct BP_CategoryWindowCtrl_C_SetPosition final
{
public:
	struct FVector2D                              Position;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnVal;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CategoryWindowCtrl_C_SetPosition) == 0x000004, "Wrong alignment on BP_CategoryWindowCtrl_C_SetPosition");
static_assert(sizeof(BP_CategoryWindowCtrl_C_SetPosition) == 0x00000C, "Wrong size on BP_CategoryWindowCtrl_C_SetPosition");
static_assert(offsetof(BP_CategoryWindowCtrl_C_SetPosition, Position) == 0x000000, "Member 'BP_CategoryWindowCtrl_C_SetPosition::Position' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_SetPosition, ReturnVal) == 0x000008, "Member 'BP_CategoryWindowCtrl_C_SetPosition::ReturnVal' has a wrong offset!");

// Function BP_CategoryWindowCtrl.BP_CategoryWindowCtrl_C.GetCursorIndex
// 0x0008 (0x0008 - 0x0000)
struct BP_CategoryWindowCtrl_C_GetCursorIndex final
{
public:
	int32                                         CursorIndex;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCursorIndex_CursorIndex;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CategoryWindowCtrl_C_GetCursorIndex) == 0x000004, "Wrong alignment on BP_CategoryWindowCtrl_C_GetCursorIndex");
static_assert(sizeof(BP_CategoryWindowCtrl_C_GetCursorIndex) == 0x000008, "Wrong size on BP_CategoryWindowCtrl_C_GetCursorIndex");
static_assert(offsetof(BP_CategoryWindowCtrl_C_GetCursorIndex, CursorIndex) == 0x000000, "Member 'BP_CategoryWindowCtrl_C_GetCursorIndex::CursorIndex' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_GetCursorIndex, CallFunc_GetCursorIndex_CursorIndex) == 0x000004, "Member 'BP_CategoryWindowCtrl_C_GetCursorIndex::CallFunc_GetCursorIndex_CursorIndex' has a wrong offset!");

// Function BP_CategoryWindowCtrl.BP_CategoryWindowCtrl_C.SetCursorIndex
// 0x0008 (0x0008 - 0x0000)
struct BP_CategoryWindowCtrl_C_SetCursorIndex final
{
public:
	int32                                         CursorIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnVal;                                         // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CategoryWindowCtrl_C_SetCursorIndex) == 0x000004, "Wrong alignment on BP_CategoryWindowCtrl_C_SetCursorIndex");
static_assert(sizeof(BP_CategoryWindowCtrl_C_SetCursorIndex) == 0x000008, "Wrong size on BP_CategoryWindowCtrl_C_SetCursorIndex");
static_assert(offsetof(BP_CategoryWindowCtrl_C_SetCursorIndex, CursorIndex) == 0x000000, "Member 'BP_CategoryWindowCtrl_C_SetCursorIndex::CursorIndex' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_SetCursorIndex, ReturnVal) == 0x000004, "Member 'BP_CategoryWindowCtrl_C_SetCursorIndex::ReturnVal' has a wrong offset!");

// Function BP_CategoryWindowCtrl.BP_CategoryWindowCtrl_C.SetNewIconVisibility
// 0x0008 (0x0008 - 0x0000)
struct BP_CategoryWindowCtrl_C_SetNewIconVisibility final
{
public:
	int32                                         CursorIdx;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsVisible;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnVal;                                         // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CategoryWindowCtrl_C_SetNewIconVisibility) == 0x000004, "Wrong alignment on BP_CategoryWindowCtrl_C_SetNewIconVisibility");
static_assert(sizeof(BP_CategoryWindowCtrl_C_SetNewIconVisibility) == 0x000008, "Wrong size on BP_CategoryWindowCtrl_C_SetNewIconVisibility");
static_assert(offsetof(BP_CategoryWindowCtrl_C_SetNewIconVisibility, CursorIdx) == 0x000000, "Member 'BP_CategoryWindowCtrl_C_SetNewIconVisibility::CursorIdx' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_SetNewIconVisibility, IsVisible) == 0x000004, "Member 'BP_CategoryWindowCtrl_C_SetNewIconVisibility::IsVisible' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_SetNewIconVisibility, ReturnVal) == 0x000005, "Member 'BP_CategoryWindowCtrl_C_SetNewIconVisibility::ReturnVal' has a wrong offset!");

// Function BP_CategoryWindowCtrl.BP_CategoryWindowCtrl_C.AlignNewIconAnim
// 0x0008 (0x0008 - 0x0000)
struct BP_CategoryWindowCtrl_C_AlignNewIconAnim final
{
public:
	float                                         Frame;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnVal;                                         // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CategoryWindowCtrl_C_AlignNewIconAnim) == 0x000004, "Wrong alignment on BP_CategoryWindowCtrl_C_AlignNewIconAnim");
static_assert(sizeof(BP_CategoryWindowCtrl_C_AlignNewIconAnim) == 0x000008, "Wrong size on BP_CategoryWindowCtrl_C_AlignNewIconAnim");
static_assert(offsetof(BP_CategoryWindowCtrl_C_AlignNewIconAnim, Frame) == 0x000000, "Member 'BP_CategoryWindowCtrl_C_AlignNewIconAnim::Frame' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_AlignNewIconAnim, ReturnVal) == 0x000004, "Member 'BP_CategoryWindowCtrl_C_AlignNewIconAnim::ReturnVal' has a wrong offset!");

// Function BP_CategoryWindowCtrl.BP_CategoryWindowCtrl_C.GetNewIconAnimFrame
// 0x0008 (0x0008 - 0x0000)
struct BP_CategoryWindowCtrl_C_GetNewIconAnimFrame final
{
public:
	float                                         Frame;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNewIconAnimFrame_Frame;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CategoryWindowCtrl_C_GetNewIconAnimFrame) == 0x000004, "Wrong alignment on BP_CategoryWindowCtrl_C_GetNewIconAnimFrame");
static_assert(sizeof(BP_CategoryWindowCtrl_C_GetNewIconAnimFrame) == 0x000008, "Wrong size on BP_CategoryWindowCtrl_C_GetNewIconAnimFrame");
static_assert(offsetof(BP_CategoryWindowCtrl_C_GetNewIconAnimFrame, Frame) == 0x000000, "Member 'BP_CategoryWindowCtrl_C_GetNewIconAnimFrame::Frame' has a wrong offset!");
static_assert(offsetof(BP_CategoryWindowCtrl_C_GetNewIconAnimFrame, CallFunc_GetNewIconAnimFrame_Frame) == 0x000004, "Member 'BP_CategoryWindowCtrl_C_GetNewIconAnimFrame::CallFunc_GetNewIconAnimFrame_Frame' has a wrong offset!");

}

