#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharaPanel

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CharaPanel.BP_CharaPanel_C.ExecuteUbergraph_BP_CharaPanel
// 0x03C0 (0x03C0 - 0x0000)
struct BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E2C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CharaPanel_C*                       CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ResetActorMoveMode_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E2D[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InTYpe_4;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InNumber;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_WIDGET_PRIO                                 K2Node_CustomEvent_InPrio;                         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E2E[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_InStartTime;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_InAnimeRate;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E2F[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharaPanelVNumberCtrl_C*            CallFunc_FinishSpawningActor_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetVNumberValue_ReturnValue;              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E30[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InMode;                         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorMoveMode_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetActorMoveMode_ReturnValue_1;           // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetActorMoveMode_ReturnValue_2;           // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetActorMoveMode_ReturnValue_3;           // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetActorMoveMode_ReturnValue_4;           // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E31[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCharaPanelVNumberPosMode_ReturnValue;  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharaPanelVNumberMoveMode_ReturnValue; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartNumberCountAnimation_ReturnValue;    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetVNumberMode_ReturnValue;               // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E32[0x2];                                     // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCharaPanelVNumberMoveMode_ReturnValue_1; // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetNumberCountAnimationPosition_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetMainPosition_OutVec;                   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActorMovePosition_ReturnValue;         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InFrame_6;                      // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InCostType;                     // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InCost;                         // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActorMovePosition_ReturnValue_1;       // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InHP;                           // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InHPMax;                        // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InFrame_5;                      // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_1;               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugeRatio_ReturnValue;                // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E33[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InText_1;                       // 0x0100(0x0018)()
	int32                                         K2Node_CustomEvent_InParam;                        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InTYpe_3;                       // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0120(0x0018)()
	int32                                         K2Node_CustomEvent_InMP;                           // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InMPMax;                        // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InFrame_4;                      // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugeRatio_ReturnValue_1;              // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InCharaID;                      // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E34[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadCharaPanelIcon_ReturnValue;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BAD_STATUS                                  K2Node_CustomEvent_InBadStatusType_2;              // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E35[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E36[0x3];                                     // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SetBadstatusParameter_ReturnValue;        // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BAD_STATUS                                  K2Node_CustomEvent_InBadStatusType_1;              // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E37[0x3];                                     // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ResetBadstatusParameter_ReturnValue;      // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CHARAPANEL_SUPPORTICON_TYPE                 K2Node_CustomEvent_InSupportIcon_2;                // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E38[0x3];                                     // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetSupportParameter_ReturnValue;          // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CHARAPANEL_SUPPORTICON_TYPE                 K2Node_Event_argSupportType_1;                     // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E39[0x3];                                     // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SetSupportParameter_ReturnValue_1;        // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CHARAPANEL_SUPPORTICON_TYPE                 K2Node_CustomEvent_InSupportIcon_1;                // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E3A[0x3];                                     // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ResetSupportParameter_ReturnValue;        // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CHARAPANEL_SUPPORTICON_TYPE                 K2Node_Event_argSupportType;                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E3B[0x3];                                     // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ResetSupportParameter_ReturnValue_1;      // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InLevel;                        // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InTYpe_2;                       // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InColorType_1;                  // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InColorType;                    // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InCalcHP_2;                     // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InFrame_3;                      // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_2;               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_3;               // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InCalcMP;                       // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InFrame_2;                      // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugeRatio_ReturnValue_2;              // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_4;               // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_5;               // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugeRatio_ReturnValue_3;              // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InReserveMP_1;                  // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_6;               // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_7;               // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugeRatio_ReturnValue_4;              // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugeRatio_ReturnValue_5;              // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E3C[0x3];                                     // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetParameter_ReturnValue_8;               // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_9;               // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugeRatio_ReturnValue_6;              // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_10;              // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E3D[0x3];                                     // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAdjustParam_ReturnValue;               // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugeRatio_ReturnValue_7;              // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_11;              // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_12;              // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAdjustParam_ReturnValue_1;             // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugeRatio_ReturnValue_8;              // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugeRatio_ReturnValue_9;              // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_13;              // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InCalcHP_1;                     // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InFrame_1;                      // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InLimitHP;                      // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BAD_STATUS                                  K2Node_CustomEvent_InBadStatusType;                // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E3E[0x3];                                     // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAdjustParam_ReturnValue_2;             // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugeRatio_ReturnValue_10;             // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetMainPosition_OutVec_1;                 // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharaPanelVNumberMoveMode_ReturnValue_2; // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharaPanelVNumberMoveMode_ReturnValue_3; // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharaPanelVNumberPosMode_ReturnValue_1; // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StopPanelRecoveryAnimation_ReturnValue;   // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartNumberCountAnimation_ReturnValue_1;  // 0x0255(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDisplayPanel_OutDisplay;                // 0x0256(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E3F[0x1];                                     // 0x0257(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InColorType_2;                  // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisplayPanel_OutDisplay_1;              // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDisplayPanel_OutDisplay_2;              // 0x025D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDisplayPanel_OutDisplay_3;              // 0x025E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDisplayPanel_OutDisplay_4;              // 0x025F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDisplayPanel_OutDisplay_5;              // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E40[0x3];                                     // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InDegits;                       // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InTYpe_5;                       // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_14;              // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_15;              // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugeRatio_ReturnValue_11;             // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InReserveHp;                    // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_16;              // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_17;              // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugeRatio_ReturnValue_12;             // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugeRatio_ReturnValue_13;             // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E41[0x3];                                     // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InParam_1;                      // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_InStartTime_1;                  // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartPanelRecoveryAnimation_ReturnValue;  // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E42[0x3];                                     // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InReserveMP;                    // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_18;              // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_19;              // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugeRatio_ReturnValue_14;             // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugeRatio_ReturnValue_15;             // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E43[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue;                 // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InCalcHP;                       // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InFrame;                        // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InSetHP;                        // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_20;              // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_21;              // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAdjustParam_ReturnValue_3;             // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugeRatio_ReturnValue_16;             // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugeRatio_ReturnValue_17;             // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_22;              // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E44[0x4];                                     // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E45[0x8];                                     // 0x02F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0300(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue_1;                // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InTYpe_6;                       // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InNumber_1;                     // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_WIDGET_PRIO                                 K2Node_CustomEvent_InPrio_1;                       // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E46[0x3];                                     // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_InStartTime_2;                  // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharaPanelVNumberCtrl_C*            CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetNumberCountAnimationPosition_ReturnValue_1; // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetVNumberMode_ReturnValue_1;             // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetVNumberValue_ReturnValue_1;            // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_CHARAPANEL_SUPPORTICON_TYPE                 K2Node_CustomEvent_InSupportIcon;                  // 0x036A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E47[0x1];                                     // 0x036B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InTurn;                         // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetSupportParameter_ReturnValue_2;        // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_23;              // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_24;              // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugeRatio_ReturnValue_18;             // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParameter_ReturnValue_25;              // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InAnimation;                    // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_InAnimation_1;                  // 0x0385(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E48[0x2];                                     // 0x0386(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InNkmIndex;                     // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InPlayer;                       // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetGaugeAlphaAnimation_ReturnValue;       // 0x038D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetGaugeAlphaAnimation_ReturnValue_1;     // 0x038E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetGaugeAlphaAnimation_ReturnValue_2;     // 0x038F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetGaugeAlphaAnimation_ReturnValue_3;     // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetGaugeAlphaAnimation_ReturnValue_4;     // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetGaugeAlphaAnimation_ReturnValue_5;     // 0x0392(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E49[0x1];                                     // 0x0393(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InTYpe_1;                       // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetNextPAnimeStack_ReturnValue;           // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E4A[0x7];                                     // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CharaPanel_C*                       K2Node_CustomEvent_InUserWidget;                   // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InTYpe;                         // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFinishedFadeIn_OutFinished;             // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetNextPAnimeStack_ReturnValue_1;         // 0x03B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E4B[0x2];                                     // 0x03B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetParameter_ReturnValue_26;              // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFinishedFadeOut_OutFinished;            // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x03BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DeleteCharaPanel_ReturnValue;             // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel) == 0x000010, "Wrong alignment on BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel");
static_assert(sizeof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel) == 0x0003C0, "Wrong size on BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, EntryPoint) == 0x000000, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_ResetActorMoveMode_ReturnValue) == 0x000010, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_ResetActorMoveMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InTYpe_4) == 0x000014, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InTYpe_4' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InNumber) == 0x000018, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InNumber' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InPrio) == 0x00001C, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InPrio' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InStartTime) == 0x000020, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InStartTime' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InAnimeRate) == 0x000024, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InAnimeRate' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000068, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_FinishSpawningActor_ReturnValue) == 0x000070, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_GetPosition_ReturnValue) == 0x000078, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_SetVNumberValue_ReturnValue) == 0x000080, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_SetVNumberValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InMode) == 0x000084, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InMode' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_SetActorMoveMode_ReturnValue) == 0x000088, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_SetActorMoveMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_SetActorMoveMode_ReturnValue_1) == 0x000089, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_SetActorMoveMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_SetActorMoveMode_ReturnValue_2) == 0x00008A, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_SetActorMoveMode_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_SetActorMoveMode_ReturnValue_3) == 0x00008B, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_SetActorMoveMode_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_SetActorMoveMode_ReturnValue_4) == 0x00008C, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_SetActorMoveMode_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_GetCharaPanelVNumberPosMode_ReturnValue) == 0x000090, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_GetCharaPanelVNumberPosMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_GetCharaPanelVNumberMoveMode_ReturnValue) == 0x000094, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_GetCharaPanelVNumberMoveMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_StartNumberCountAnimation_ReturnValue) == 0x000098, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_StartNumberCountAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_SetVNumberMode_ReturnValue) == 0x000099, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_SetVNumberMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_GetCharaPanelVNumberMoveMode_ReturnValue_1) == 0x00009C, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_GetCharaPanelVNumberMoveMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_GetNumberCountAnimationPosition_ReturnValue) == 0x0000A0, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_GetNumberCountAnimationPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x0000A8, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_GetMainPosition_OutVec) == 0x0000B0, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_GetMainPosition_OutVec' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_GetActorMovePosition_ReturnValue) == 0x0000B8, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_GetActorMovePosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000BC, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_MakeVector2D_ReturnValue) == 0x0000C0, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_GetParameter_ReturnValue) == 0x0000C8, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_GetParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InFrame_6) == 0x0000CC, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InFrame_6' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InCostType) == 0x0000D0, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InCostType' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InCost) == 0x0000D4, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InCost' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_GetActorMovePosition_ReturnValue_1) == 0x0000D8, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_GetActorMovePosition_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0000DC, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000E0, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InHP) == 0x0000E8, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InHP' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InHPMax) == 0x0000EC, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InHPMax' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InFrame_5) == 0x0000F0, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InFrame_5' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_GetParameter_ReturnValue_1) == 0x0000F4, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_GetParameter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_GetGaugeRatio_ReturnValue) == 0x0000F8, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_GetGaugeRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InText_1) == 0x000100, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InText_1' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InParam) == 0x000118, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InParam' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InTYpe_3) == 0x00011C, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InTYpe_3' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InText) == 0x000120, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InMP) == 0x000138, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InMP' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InMPMax) == 0x00013C, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InMPMax' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InFrame_4) == 0x000140, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InFrame_4' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_GetGaugeRatio_ReturnValue_1) == 0x000144, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_GetGaugeRatio_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InCharaID) == 0x000148, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InCharaID' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_LoadCharaPanelIcon_ReturnValue) == 0x000150, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_LoadCharaPanelIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InBadStatusType_2) == 0x000158, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InBadStatusType_2' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_DynamicCast_AsTexture) == 0x000160, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_SetBadstatusParameter_ReturnValue) == 0x00016C, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_SetBadstatusParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InBadStatusType_1) == 0x000170, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InBadStatusType_1' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_ResetBadstatusParameter_ReturnValue) == 0x000174, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_ResetBadstatusParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InSupportIcon_2) == 0x000178, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InSupportIcon_2' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00017C, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_SetSupportParameter_ReturnValue) == 0x000180, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_SetSupportParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_Event_argSupportType_1) == 0x000184, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_Event_argSupportType_1' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_SetSupportParameter_ReturnValue_1) == 0x000188, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_SetSupportParameter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00018C, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InSupportIcon_1) == 0x000190, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InSupportIcon_1' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_ResetSupportParameter_ReturnValue) == 0x000194, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_ResetSupportParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_Event_argSupportType) == 0x000198, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_Event_argSupportType' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_ResetSupportParameter_ReturnValue_1) == 0x00019C, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_ResetSupportParameter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InLevel) == 0x0001A0, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InLevel' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InTYpe_2) == 0x0001A4, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InTYpe_2' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InColorType_1) == 0x0001A8, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InColorType_1' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InColorType) == 0x0001AC, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InColorType' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InCalcHP_2) == 0x0001B0, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InCalcHP_2' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InFrame_3) == 0x0001B4, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InFrame_3' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_GetParameter_ReturnValue_2) == 0x0001B8, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_GetParameter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, CallFunc_GetParameter_ReturnValue_3) == 0x0001BC, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::CallFunc_GetParameter_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InCalcMP) == 0x0001C0, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InCalcMP' has a wrong offset!");
static_assert(offsetof(BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel, K2Node_CustomEvent_InFrame_2) == 0x0001C4, "Member 'BP_CharaPanel_C_ExecuteUbergraph_BP_CharaPanel::K2Node_CustomEvent_InFrame_2' has a wrong offset!");
