#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CommonUI_EventCtrl

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "E_SORTWINDOW_MOUSE_EVENT_TYPE_structs.hpp"
#include "E_SKILLSEARCH_WINDOW_MOUSE_EVENT_TYPE_structs.hpp"
#include "E_CATEGORYWINDOW_MOUSE_EVENT_TYPE_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CommonUI_EventCtrl.BP_CommonUI_EventCtrl_C
// 0x0038 (0x0258 - 0x0220)
class ABP_CommonUI_EventCtrl_C final : public AActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             CategoryWindow_MouseEvent;                         // 0x0228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             SkillSearchSort_MouseEvent;                        // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             SortWindow_MouseEvent;                             // 0x0248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void CategoryWindow_MouseEvent__DelegateSignature(E_CATEGORYWINDOW_MOUSE_EVENT_TYPE MouseEventType, int32 SelectCategoryIcon);
	void SkillSearchSort_MouseEvent__DelegateSignature(E_SKILLSEARCH_WINDOW_MOUSE_EVENT_TYPE MouseEventType, int32 SelectLstIdx, int32 SelectSlotIdx, int32 ListScrollOffset, int32 SelectElementIdx);
	void SortWindow_MouseEvent__DelegateSignature(E_SORTWINDOW_MOUSE_EVENT_TYPE MouseEventType, int32 SelectLstIdx, int32 SelectSlotIdx, int32 ListScrollOffset);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CommonUI_EventCtrl_C">();
	}
	static class ABP_CommonUI_EventCtrl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CommonUI_EventCtrl_C>();
	}
};
static_assert(alignof(ABP_CommonUI_EventCtrl_C) == 0x000008, "Wrong alignment on ABP_CommonUI_EventCtrl_C");
static_assert(sizeof(ABP_CommonUI_EventCtrl_C) == 0x000258, "Wrong size on ABP_CommonUI_EventCtrl_C");
static_assert(offsetof(ABP_CommonUI_EventCtrl_C, DefaultSceneRoot) == 0x000220, "Member 'ABP_CommonUI_EventCtrl_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_CommonUI_EventCtrl_C, CategoryWindow_MouseEvent) == 0x000228, "Member 'ABP_CommonUI_EventCtrl_C::CategoryWindow_MouseEvent' has a wrong offset!");
static_assert(offsetof(ABP_CommonUI_EventCtrl_C, SkillSearchSort_MouseEvent) == 0x000238, "Member 'ABP_CommonUI_EventCtrl_C::SkillSearchSort_MouseEvent' has a wrong offset!");
static_assert(offsetof(ABP_CommonUI_EventCtrl_C, SortWindow_MouseEvent) == 0x000248, "Member 'ABP_CommonUI_EventCtrl_C::SortWindow_MouseEvent' has a wrong offset!");

}

