#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DialogCtrl

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_DIALOGCTRL_GSTATUS_structs.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DialogCtrl.BP_DialogCtrl_C
// 0x0050 (0x0270 - 0x0220)
class ABP_DialogCtrl_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWB_DialogWindow_C*                     WB_DialogWindow;                                   // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_DIALOGCTRL_GSTATUS                          Maingstatus;                                       // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_DIALOGCTRL_GSTATUS                          Changegstatus;                                     // 0x0239(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGstatusChage;                                    // 0x023A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Keylock;                                           // 0x023B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsActive;                                          // 0x023C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsDialogOpenFlag;                                  // 0x023D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsDialogCloseFlag;                                 // 0x023E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSetDialogText;                                   // 0x023F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsAlreadySetCloseWindow;                           // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsAlreadySetOpenWindow;                            // 0x0241(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F09[0x6];                                     // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    DTextLabelSMA;                                     // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    DSelectLabelSMA;                                   // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    DSelectIndexSMA;                                   // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Mouseconfirmedindex;                               // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSetSelectFlag;                                   // 0x0264(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsIconAnimation;                                   // 0x0265(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F0A[0x2];                                     // 0x0266(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IconFrame;                                         // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Mousestatus;                                       // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DialogCtrl(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void IDialogRunningIconOff(bool InExecutionFlag);
	void IDialogRunningIconOn(bool InExecutionFlag);
	void IExecutionCloseDialog();
	void IExecutionOpenDialog(bool InUseRunningIcon);
	void ICloseDialog();
	void IDialogOn(E_WIDGET_PRIO InPrio);
	void IOpenDialog();
	void ISetDialogTextFlag(bool InExecution, bool InBuild);
	void ISetDialogText(class UScriptMessageAsset* InScriptMessageAsset, class FName InLabel, bool InBuildText);
	void OnAnyItemSelected(int32 ItemIndex);
	void OnAnyItemClicked(int32 ItemIndex);
	void BeginPlay_DialogSelect();
	void IDialogSelectTextOff();
	void IMoveDialogSelectCursor(int32 InParam);
	void ISetDialogSelectTextByIndex(int32 InMenuNumber, int32 InInitCursorPosition, class UScriptMessageAsset* InScriptMessageAsset, const TArray<int32>& InSelectItemIndex);
	void ISetDialogSelectText(int32 InMenuNumber, int32 InInitCursorPosition, class UScriptMessageAsset* InScriptMessageAsset, const TArray<class FName>& InSelectItemName);
	void IDialogSetProgramValue(int32 InIndex, const class FString& InString);
	void IDialogSetBuildText();
	void IDialogSetValueParam(int32 InIndex, int32 InValueParam);
	void IClearDialogText();
	void ChangeGstatusParam(E_DIALOGCTRL_GSTATUS InGStatus, bool InMain);
	void Gstatus_Init();
	void Gstatus_WindowOpen();
	void Gstatus_WaitWindowOpen();
	void Gstatus_WaitWindowClose();
	void ClearAllScriptMessageAsset();
	void IsOpenDialog(bool* OutOpened);
	void Gstatus_SetText();
	void Gstatus_WaitText();
	void CalcSelectMenuWheel(bool* OutWheel);
	void CalcClickedMenu();
	void StartIconAnimation();
	void StopIconAnimation();
	void IconAnimationProc(float InDeltaTime);
	void InitializeMouse();
	void IIsOpenedDialogWindow(bool* OutFinished);
	void IIsSetDialogText(bool* OutFinished);
	void IIsClosedDialogWindow(bool* OutFinished);
	void IGetDialogSelectedCursorPosition(int32* OutIndex);
	void IWasConfirmedByMouse(bool bReset, bool* bConfirmed, int32* ItemIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DialogCtrl_C">();
	}
	static class ABP_DialogCtrl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DialogCtrl_C>();
	}
};
static_assert(alignof(ABP_DialogCtrl_C) == 0x000008, "Wrong alignment on ABP_DialogCtrl_C");
static_assert(sizeof(ABP_DialogCtrl_C) == 0x000270, "Wrong size on ABP_DialogCtrl_C");
static_assert(offsetof(ABP_DialogCtrl_C, UberGraphFrame) == 0x000220, "Member 'ABP_DialogCtrl_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DialogCtrl_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_DialogCtrl_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DialogCtrl_C, WB_DialogWindow) == 0x000230, "Member 'ABP_DialogCtrl_C::WB_DialogWindow' has a wrong offset!");
static_assert(offsetof(ABP_DialogCtrl_C, Maingstatus) == 0x000238, "Member 'ABP_DialogCtrl_C::Maingstatus' has a wrong offset!");
static_assert(offsetof(ABP_DialogCtrl_C, Changegstatus) == 0x000239, "Member 'ABP_DialogCtrl_C::Changegstatus' has a wrong offset!");
static_assert(offsetof(ABP_DialogCtrl_C, IsGstatusChage) == 0x00023A, "Member 'ABP_DialogCtrl_C::IsGstatusChage' has a wrong offset!");
static_assert(offsetof(ABP_DialogCtrl_C, Keylock) == 0x00023B, "Member 'ABP_DialogCtrl_C::Keylock' has a wrong offset!");
static_assert(offsetof(ABP_DialogCtrl_C, IsActive) == 0x00023C, "Member 'ABP_DialogCtrl_C::IsActive' has a wrong offset!");
static_assert(offsetof(ABP_DialogCtrl_C, IsDialogOpenFlag) == 0x00023D, "Member 'ABP_DialogCtrl_C::IsDialogOpenFlag' has a wrong offset!");
static_assert(offsetof(ABP_DialogCtrl_C, IsDialogCloseFlag) == 0x00023E, "Member 'ABP_DialogCtrl_C::IsDialogCloseFlag' has a wrong offset!");
static_assert(offsetof(ABP_DialogCtrl_C, IsSetDialogText) == 0x00023F, "Member 'ABP_DialogCtrl_C::IsSetDialogText' has a wrong offset!");
static_assert(offsetof(ABP_DialogCtrl_C, IsAlreadySetCloseWindow) == 0x000240, "Member 'ABP_DialogCtrl_C::IsAlreadySetCloseWindow' has a wrong offset!");
static_assert(offsetof(ABP_DialogCtrl_C, IsAlreadySetOpenWindow) == 0x000241, "Member 'ABP_DialogCtrl_C::IsAlreadySetOpenWindow' has a wrong offset!");
static_assert(offsetof(ABP_DialogCtrl_C, DTextLabelSMA) == 0x000248, "Member 'ABP_DialogCtrl_C::DTextLabelSMA' has a wrong offset!");
static_assert(offsetof(ABP_DialogCtrl_C, DSelectLabelSMA) == 0x000250, "Member 'ABP_DialogCtrl_C::DSelectLabelSMA' has a wrong offset!");
static_assert(offsetof(ABP_DialogCtrl_C, DSelectIndexSMA) == 0x000258, "Member 'ABP_DialogCtrl_C::DSelectIndexSMA' has a wrong offset!");
static_assert(offsetof(ABP_DialogCtrl_C, Mouseconfirmedindex) == 0x000260, "Member 'ABP_DialogCtrl_C::Mouseconfirmedindex' has a wrong offset!");
static_assert(offsetof(ABP_DialogCtrl_C, IsSetSelectFlag) == 0x000264, "Member 'ABP_DialogCtrl_C::IsSetSelectFlag' has a wrong offset!");
static_assert(offsetof(ABP_DialogCtrl_C, IsIconAnimation) == 0x000265, "Member 'ABP_DialogCtrl_C::IsIconAnimation' has a wrong offset!");
static_assert(offsetof(ABP_DialogCtrl_C, IconFrame) == 0x000268, "Member 'ABP_DialogCtrl_C::IconFrame' has a wrong offset!");
static_assert(offsetof(ABP_DialogCtrl_C, Mousestatus) == 0x00026C, "Member 'ABP_DialogCtrl_C::Mousestatus' has a wrong offset!");

}

