#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DLCAnnouncer_DelegateChecker

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DLCAnnouncer_DelegateChecker.BP_DLCAnnouncer_DelegateChecker_C
// 0x0028 (0x0248 - 0x0220)
class ABP_DLCAnnouncer_DelegateChecker_C final : public AActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             DLCAnnouncer_EndTask;                              // 0x0228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             DLCAnnouncer_EndTask_OnlyAnnounce;                 // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void DLCAnnouncer_EndTask__DelegateSignature();
	void DLCAnnouncer_EndTask_OnlyAnnounce__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DLCAnnouncer_DelegateChecker_C">();
	}
	static class ABP_DLCAnnouncer_DelegateChecker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DLCAnnouncer_DelegateChecker_C>();
	}
};
static_assert(alignof(ABP_DLCAnnouncer_DelegateChecker_C) == 0x000008, "Wrong alignment on ABP_DLCAnnouncer_DelegateChecker_C");
static_assert(sizeof(ABP_DLCAnnouncer_DelegateChecker_C) == 0x000248, "Wrong size on ABP_DLCAnnouncer_DelegateChecker_C");
static_assert(offsetof(ABP_DLCAnnouncer_DelegateChecker_C, DefaultSceneRoot) == 0x000220, "Member 'ABP_DLCAnnouncer_DelegateChecker_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DLCAnnouncer_DelegateChecker_C, DLCAnnouncer_EndTask) == 0x000228, "Member 'ABP_DLCAnnouncer_DelegateChecker_C::DLCAnnouncer_EndTask' has a wrong offset!");
static_assert(offsetof(ABP_DLCAnnouncer_DelegateChecker_C, DLCAnnouncer_EndTask_OnlyAnnounce) == 0x000238, "Member 'ABP_DLCAnnouncer_DelegateChecker_C::DLCAnnouncer_EndTask_OnlyAnnounce' has a wrong offset!");

}

