#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DG_ToMove

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "Engine_structs.hpp"
#include "DaathTypeList_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ST_BtnHelp_ColorInfo_byIdx_structs.hpp"


namespace SDK::Params
{

// Function BP_DG_ToMove.BP_DG_ToMove_C.ExecuteUbergraph_BP_DG_ToMove
// 0x01D0 (0x01D0 - 0x0000)
struct BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_BtnHelp_ColorInfo_byIdx            K2Node_MakeStruct_ST_BtnHelp_ColorInfo_byIdx;      // 0x0004(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FST_BtnHelp_ColorInfo_byIdx>    K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6BB[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0068(0x0010)(ReferenceParm)
	TScriptInterface<class IBPI_DG_TimeStopEffect_C> K2Node_DynamicCast_AsBPI_DG_Time_Stop_Effect;      // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6BC[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6BD[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DG_TimeStopTimeSpeed_C> K2Node_DynamicCast_AsBPI_DG_Time_Stop_Time_Speed;  // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6BE[0x6];                                     // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn_1;                    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6BF[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_1;             // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6C0[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors_1;    // 0x00F8(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_DG_TimeStopEffect_C> K2Node_DynamicCast_AsBPI_DG_Time_Stop_Effect_1;    // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6C1[0x3];                                     // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6C2[0x3];                                     // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_DG_MoveGate_C>    K2Node_DynamicCast_AsBPI_DG_Move_Gate;             // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_ActivateEffect_Dummy;                 // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6C3[0x5];                                     // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMapID_ReturnValue;                     // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAreaID_ReturnValue;                    // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6C4[0x3];                                     // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSaveUniqueIdFromDataId_ReturnValue;    // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors_2;    // 0x0168(0x0010)(ReferenceParm)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors_3;    // 0x0178(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_3;                         // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_DG_TimeStopRate_C> K2Node_DynamicCast_AsBPI_DG_Time_Stop_Rate;        // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6C5[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapGimmickAffectedByTimeStop_C> K2Node_DynamicCast_AsBPI_Map_Gimmick_Affected_by_Time_Stop; // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6C6[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove) == 0x000008, "Wrong alignment on BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove");
static_assert(sizeof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove) == 0x0001D0, "Wrong size on BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, EntryPoint) == 0x000000, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, K2Node_MakeStruct_ST_BtnHelp_ColorInfo_byIdx) == 0x000004, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::K2Node_MakeStruct_ST_BtnHelp_ColorInfo_byIdx' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, Temp_int_Array_Index_Variable_1) == 0x00002C, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, Temp_int_Loop_Counter_Variable_1) == 0x000030, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, Temp_int_Loop_Counter_Variable_2) == 0x000038, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, Temp_int_Loop_Counter_Variable_3) == 0x00003C, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_Add_IntInt_ReturnValue_2) == 0x000040, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_Add_IntInt_ReturnValue_3) == 0x000044, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, Temp_int_Array_Index_Variable_2) == 0x000048, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, Temp_int_Array_Index_Variable_3) == 0x00004C, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_CheckEventFlag_ReturnValue) == 0x000050, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_GetStreamingLevel_ReturnValue) == 0x000058, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_GetLevelScriptActor_ReturnValue) == 0x000060, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_GetLevelScriptActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_GetAllActorsWithInterface_OutActors) == 0x000068, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_GetAllActorsWithInterface_OutActors' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, K2Node_DynamicCast_AsBPI_DG_Time_Stop_Effect) == 0x000078, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::K2Node_DynamicCast_AsBPI_DG_Time_Stop_Effect' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_Array_Get_Item) == 0x000090, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, K2Node_DynamicCast_AsBPI_DG_Time_Stop_Time_Speed) == 0x0000A0, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::K2Node_DynamicCast_AsBPI_DG_Time_Stop_Time_Speed' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_Less_IntInt_ReturnValue) == 0x0000B1, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_GetMapCommon_rerutn) == 0x0000B8, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_GetMapCommon_rerutn_1) == 0x0000C0, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_GetMapCommon_rerutn_1' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, K2Node_DynamicCast_AsBPI_Map_Common) == 0x0000C8, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, K2Node_DynamicCast_bSuccess_2) == 0x0000D8, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, K2Node_DynamicCast_AsBPI_Map_Common_1) == 0x0000E0, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::K2Node_DynamicCast_AsBPI_Map_Common_1' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, K2Node_DynamicCast_bSuccess_3) == 0x0000F0, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_GetAllActorsWithInterface_OutActors_1) == 0x0000F8, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_GetAllActorsWithInterface_OutActors_1' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_Array_Get_Item_1) == 0x000108, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, K2Node_DynamicCast_AsBPI_DG_Time_Stop_Effect_1) == 0x000110, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::K2Node_DynamicCast_AsBPI_DG_Time_Stop_Effect_1' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, K2Node_DynamicCast_bSuccess_4) == 0x000120, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_Array_Length_ReturnValue_1) == 0x000124, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_Less_IntInt_ReturnValue_1) == 0x000128, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00012C, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, K2Node_DynamicCast_AsBPI_DG_Move_Gate) == 0x000130, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::K2Node_DynamicCast_AsBPI_DG_Move_Gate' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, K2Node_DynamicCast_bSuccess_5) == 0x000140, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_IsValid_ReturnValue) == 0x000141, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_BPI_ActivateEffect_Dummy) == 0x000142, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_BPI_ActivateEffect_Dummy' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_GetMinimapManager_ReturnValue) == 0x000148, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_GetMinimapManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_GetMapID_ReturnValue) == 0x000150, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_GetMapID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_GetAreaID_ReturnValue) == 0x000154, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_GetAreaID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, K2Node_Event_EndPlayReason) == 0x000158, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_GetSaveUniqueIdFromDataId_ReturnValue) == 0x00015C, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_GetSaveUniqueIdFromDataId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_Get_ReturnValue) == 0x000160, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_GetAllActorsWithInterface_OutActors_2) == 0x000168, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_GetAllActorsWithInterface_OutActors_2' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_GetAllActorsWithInterface_OutActors_3) == 0x000178, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_GetAllActorsWithInterface_OutActors_3' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_Array_Get_Item_2) == 0x000188, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_Array_Get_Item_3) == 0x000190, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, K2Node_DynamicCast_AsBPI_DG_Time_Stop_Rate) == 0x000198, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::K2Node_DynamicCast_AsBPI_DG_Time_Stop_Rate' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, K2Node_DynamicCast_bSuccess_6) == 0x0001A8, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, K2Node_DynamicCast_AsBPI_Map_Gimmick_Affected_by_Time_Stop) == 0x0001B0, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::K2Node_DynamicCast_AsBPI_Map_Gimmick_Affected_by_Time_Stop' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, K2Node_DynamicCast_bSuccess_7) == 0x0001C0, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_Array_Length_ReturnValue_2) == 0x0001C4, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_Array_Length_ReturnValue_3) == 0x0001C8, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001CC, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove, CallFunc_Less_IntInt_ReturnValue_3) == 0x0001CD, "Member 'BP_DG_ToMove_C_ExecuteUbergraph_BP_DG_ToMove::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");

// Function BP_DG_ToMove.BP_DG_ToMove_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_DG_ToMove_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DG_ToMove_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_DG_ToMove_C_ReceiveEndPlay");
static_assert(sizeof(BP_DG_ToMove_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_DG_ToMove_C_ReceiveEndPlay");
static_assert(offsetof(BP_DG_ToMove_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_DG_ToMove_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_DG_ToMove.BP_DG_ToMove_C.LinkModel
// 0x0068 (0x0068 - 0x0000)
struct BP_DG_ToMove_C_LinkModel final
{
public:
	float                                         LMinDistance;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6C7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LModel;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6C8[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0020(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6C9[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6CA[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_DistanceSquared_ReturnValue;       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DG_ToMove_C_LinkModel) == 0x000008, "Wrong alignment on BP_DG_ToMove_C_LinkModel");
static_assert(sizeof(BP_DG_ToMove_C_LinkModel) == 0x000068, "Wrong size on BP_DG_ToMove_C_LinkModel");
static_assert(offsetof(BP_DG_ToMove_C_LinkModel, LMinDistance) == 0x000000, "Member 'BP_DG_ToMove_C_LinkModel::LMinDistance' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_LinkModel, LModel) == 0x000008, "Member 'BP_DG_ToMove_C_LinkModel::LModel' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_LinkModel, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_DG_ToMove_C_LinkModel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_LinkModel, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_DG_ToMove_C_LinkModel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_LinkModel, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_DG_ToMove_C_LinkModel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_LinkModel, CallFunc_GetAllActorsWithInterface_OutActors) == 0x000020, "Member 'BP_DG_ToMove_C_LinkModel::CallFunc_GetAllActorsWithInterface_OutActors' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_LinkModel, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'BP_DG_ToMove_C_LinkModel::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_LinkModel, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_DG_ToMove_C_LinkModel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_LinkModel, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_DG_ToMove_C_LinkModel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_LinkModel, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'BP_DG_ToMove_C_LinkModel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_LinkModel, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000050, "Member 'BP_DG_ToMove_C_LinkModel::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_LinkModel, CallFunc_Vector_DistanceSquared_ReturnValue) == 0x00005C, "Member 'BP_DG_ToMove_C_LinkModel::CallFunc_Vector_DistanceSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_LinkModel, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000060, "Member 'BP_DG_ToMove_C_LinkModel::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_DG_ToMove.BP_DG_ToMove_C.MoveParticles
// 0x0058 (0x0058 - 0x0000)
struct BP_DG_ToMove_C_MoveParticles final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAreaID_ReturnValue;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6CB[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidPrimaryAssetId_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6CC[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetActorsFromLevel_ReturnValue;           // 0x0028(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6CD[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEmitter*                               K2Node_DynamicCast_AsEmitter;                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DG_ToMove_C_MoveParticles) == 0x000008, "Wrong alignment on BP_DG_ToMove_C_MoveParticles");
static_assert(sizeof(BP_DG_ToMove_C_MoveParticles) == 0x000058, "Wrong size on BP_DG_ToMove_C_MoveParticles");
static_assert(offsetof(BP_DG_ToMove_C_MoveParticles, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_DG_ToMove_C_MoveParticles::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_MoveParticles, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_DG_ToMove_C_MoveParticles::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_MoveParticles, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_DG_ToMove_C_MoveParticles::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_MoveParticles, CallFunc_GetAreaID_ReturnValue) == 0x00000C, "Member 'BP_DG_ToMove_C_MoveParticles::CallFunc_GetAreaID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_MoveParticles, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000010, "Member 'BP_DG_ToMove_C_MoveParticles::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_MoveParticles, CallFunc_GetStreamingLevel_ReturnValue) == 0x000018, "Member 'BP_DG_ToMove_C_MoveParticles::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_MoveParticles, CallFunc_IsValidPrimaryAssetId_ReturnValue) == 0x000020, "Member 'BP_DG_ToMove_C_MoveParticles::CallFunc_IsValidPrimaryAssetId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_MoveParticles, CallFunc_GetActorsFromLevel_ReturnValue) == 0x000028, "Member 'BP_DG_ToMove_C_MoveParticles::CallFunc_GetActorsFromLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_MoveParticles, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_DG_ToMove_C_MoveParticles::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_MoveParticles, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_DG_ToMove_C_MoveParticles::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_MoveParticles, K2Node_DynamicCast_AsEmitter) == 0x000048, "Member 'BP_DG_ToMove_C_MoveParticles::K2Node_DynamicCast_AsEmitter' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_MoveParticles, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_DG_ToMove_C_MoveParticles::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_MoveParticles, CallFunc_Less_IntInt_ReturnValue) == 0x000051, "Member 'BP_DG_ToMove_C_MoveParticles::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_MoveParticles, CallFunc_IsValid_ReturnValue) == 0x000052, "Member 'BP_DG_ToMove_C_MoveParticles::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_DG_ToMove.BP_DG_ToMove_C.RestoreEffectParam
// 0x0020 (0x0020 - 0x0000)
struct BP_DG_ToMove_C_RestoreEffectParam final
{
public:
	EDaathTypeList                                LDaathType;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6CE[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectGameInstance_C*                 K2Node_DynamicCast_AsProject_Game_Instance;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DG_ToMove_C_RestoreEffectParam) == 0x000008, "Wrong alignment on BP_DG_ToMove_C_RestoreEffectParam");
static_assert(sizeof(BP_DG_ToMove_C_RestoreEffectParam) == 0x000020, "Wrong size on BP_DG_ToMove_C_RestoreEffectParam");
static_assert(offsetof(BP_DG_ToMove_C_RestoreEffectParam, LDaathType) == 0x000000, "Member 'BP_DG_ToMove_C_RestoreEffectParam::LDaathType' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_RestoreEffectParam, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'BP_DG_ToMove_C_RestoreEffectParam::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_RestoreEffectParam, K2Node_DynamicCast_AsProject_Game_Instance) == 0x000010, "Member 'BP_DG_ToMove_C_RestoreEffectParam::K2Node_DynamicCast_AsProject_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_RestoreEffectParam, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_DG_ToMove_C_RestoreEffectParam::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_DG_ToMove.BP_DG_ToMove_C.SetMinimapIconTableRow
// 0x00C0 (0x00C0 - 0x0000)
struct BP_DG_ToMove_C_SetMinimapIconTableRow final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6CF[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMinimapIconTableRow                   OutRow;                                            // 0x0008(0x0058)(Parm, OutParm)
	bool                                          NeedToAddMore;                                     // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6D0[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMinimapIconTableRow                   CallFunc_SetMinimapIconTableRowFromHelper_OutRow;  // 0x0068(0x0058)()
};
static_assert(alignof(BP_DG_ToMove_C_SetMinimapIconTableRow) == 0x000008, "Wrong alignment on BP_DG_ToMove_C_SetMinimapIconTableRow");
static_assert(sizeof(BP_DG_ToMove_C_SetMinimapIconTableRow) == 0x0000C0, "Wrong size on BP_DG_ToMove_C_SetMinimapIconTableRow");
static_assert(offsetof(BP_DG_ToMove_C_SetMinimapIconTableRow, Param_Index) == 0x000000, "Member 'BP_DG_ToMove_C_SetMinimapIconTableRow::Param_Index' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_SetMinimapIconTableRow, OutRow) == 0x000008, "Member 'BP_DG_ToMove_C_SetMinimapIconTableRow::OutRow' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_SetMinimapIconTableRow, NeedToAddMore) == 0x000060, "Member 'BP_DG_ToMove_C_SetMinimapIconTableRow::NeedToAddMore' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_SetMinimapIconTableRow, CallFunc_SetMinimapIconTableRowFromHelper_OutRow) == 0x000068, "Member 'BP_DG_ToMove_C_SetMinimapIconTableRow::CallFunc_SetMinimapIconTableRowFromHelper_OutRow' has a wrong offset!");

// Function BP_DG_ToMove.BP_DG_ToMove_C.BPI_SetDataId
// 0x0008 (0x0008 - 0x0000)
struct BP_DG_ToMove_C_BPI_SetDataId final
{
public:
	int32                                         DataId;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DG_ToMove_C_BPI_SetDataId) == 0x000004, "Wrong alignment on BP_DG_ToMove_C_BPI_SetDataId");
static_assert(sizeof(BP_DG_ToMove_C_BPI_SetDataId) == 0x000008, "Wrong size on BP_DG_ToMove_C_BPI_SetDataId");
static_assert(offsetof(BP_DG_ToMove_C_BPI_SetDataId, DataId) == 0x000000, "Member 'BP_DG_ToMove_C_BPI_SetDataId::DataId' has a wrong offset!");
static_assert(offsetof(BP_DG_ToMove_C_BPI_SetDataId, Dummy) == 0x000004, "Member 'BP_DG_ToMove_C_BPI_SetDataId::Dummy' has a wrong offset!");

}

