#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DialogCtrl

#include "Basic.hpp"

#include "E_DIALOGCTRL_GSTATUS_structs.hpp"
#include "Project_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DialogCtrl.BP_DialogCtrl_C.ExecuteUbergraph_BP_DialogCtrl
// 0x0148 (0x0148 - 0x0000)
struct BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InMenuNumber_1;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InInitCursorPosition_1;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6460[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    K2Node_Event_InScriptMessageAsset_2;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_Event_InSelectItemName;                     // 0x0018(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_Event_InMenuNumber;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InInitCursorPosition;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    K2Node_Event_InScriptMessageAsset_1;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_Event_InSelectItemIndex;                    // 0x0038(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_Event_InParam;                              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Abs_Int_ReturnValue;                      // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6461[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDialogCursorIndex_OutIndex;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InIndex;                              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6462[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_InString;                             // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ItemIndex_1;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ItemIndex;                      // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectCursorIndex_OutIndex;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6463[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6464[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    K2Node_Event_InScriptMessageAsset;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_InLabel;                              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InBuildText;                          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InExecution;                          // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InBuild;                              // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6465[0x1];                                     // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6466[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InIndex_1;                            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InValueParam;                         // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_WIDGET_PRIO                                 K2Node_Event_InPrio;                               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue;              // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InUseRunningIcon;                     // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InExecutionFlag_1;                    // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InExecutionFlag;                      // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6467[0x2];                                     // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 ItemIndex)>              K2Node_CreateDelegate_OutputDelegate;              // 0x00CC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6468[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6469[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMouseCursorState                      CallFunc_PopShowMouseCursor_ReturnValue;           // 0x00E8(0x0018)()
	struct FMouseCursorState                      CallFunc_PopShowMouseCursor_ReturnValue_1;         // 0x0100(0x0018)()
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x011F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_646A[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_DialogWindow_C*                     CallFunc_Create_ReturnValue;                       // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CalcSelectMenuWheel_OutWheel;             // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_646B[0x2];                                     // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 ItemIndex)>              K2Node_CreateDelegate_OutputDelegate_1;            // 0x0134(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl) == 0x000008, "Wrong alignment on BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl");
static_assert(sizeof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl) == 0x000148, "Wrong size on BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, EntryPoint) == 0x000000, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_InMenuNumber_1) == 0x000004, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_InMenuNumber_1' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_InInitCursorPosition_1) == 0x000008, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_InInitCursorPosition_1' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_InScriptMessageAsset_2) == 0x000010, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_InScriptMessageAsset_2' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_InSelectItemName) == 0x000018, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_InSelectItemName' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_InMenuNumber) == 0x000028, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_InMenuNumber' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_InInitCursorPosition) == 0x00002C, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_InInitCursorPosition' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_InScriptMessageAsset_1) == 0x000030, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_InScriptMessageAsset_1' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_InSelectItemIndex) == 0x000038, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_InSelectItemIndex' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_InParam) == 0x000048, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_InParam' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_Abs_Int_ReturnValue) == 0x00004C, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_Abs_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_Subtract_IntInt_ReturnValue) == 0x000050, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000054, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000058, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_GetDialogCursorIndex_OutIndex) == 0x00005C, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_GetDialogCursorIndex_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_InIndex) == 0x000060, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_InIndex' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_InString) == 0x000068, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_InString' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_CustomEvent_ItemIndex_1) == 0x000078, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_CustomEvent_ItemIndex_1' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_CustomEvent_ItemIndex) == 0x00007C, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_CustomEvent_ItemIndex' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_GetSelectCursorIndex_OutIndex) == 0x000080, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_GetSelectCursorIndex_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_Get_ReturnValue) == 0x000088, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000090, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000094, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_InScriptMessageAsset) == 0x000098, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_InScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_InLabel) == 0x0000A0, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_InLabel' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_InBuildText) == 0x0000A8, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_InBuildText' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_InExecution) == 0x0000A9, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_InExecution' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_InBuild) == 0x0000AA, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_InBuild' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, Temp_int_Variable) == 0x0000AC, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000B0, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_Add_IntInt_ReturnValue) == 0x0000B4, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_InIndex_1) == 0x0000B8, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_InIndex_1' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_InValueParam) == 0x0000BC, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_InValueParam' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_InPrio) == 0x0000C0, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_InPrio' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_AddToWidgetPrio_ReturnValue) == 0x0000C1, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_AddToWidgetPrio_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_InUseRunningIcon) == 0x0000C2, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_InUseRunningIcon' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_IsValid_ReturnValue) == 0x0000C3, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_InExecutionFlag_1) == 0x0000C4, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_InExecutionFlag_1' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_InExecutionFlag) == 0x0000C5, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_InExecutionFlag' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, Temp_int_Variable_1) == 0x0000C8, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_CreateDelegate_OutputDelegate) == 0x0000CC, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000DC, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000E0, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_PopShowMouseCursor_ReturnValue) == 0x0000E8, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_PopShowMouseCursor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_PopShowMouseCursor_ReturnValue_1) == 0x000100, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_PopShowMouseCursor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_DeltaSeconds) == 0x000118, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00011C, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_SwitchEnum_CmpSuccess) == 0x00011D, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_Event_EndPlayReason) == 0x00011E, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x00011F, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_IsValid_ReturnValue_1) == 0x000120, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_Create_ReturnValue) == 0x000128, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000130, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, CallFunc_CalcSelectMenuWheel_OutWheel) == 0x000131, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::CallFunc_CalcSelectMenuWheel_OutWheel' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl, K2Node_CreateDelegate_OutputDelegate_1) == 0x000134, "Member 'BP_DialogCtrl_C_ExecuteUbergraph_BP_DialogCtrl::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_DialogCtrl_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogCtrl_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_DialogCtrl_C_ReceiveEndPlay");
static_assert(sizeof(BP_DialogCtrl_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_DialogCtrl_C_ReceiveEndPlay");
static_assert(offsetof(BP_DialogCtrl_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_DialogCtrl_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_DialogCtrl_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogCtrl_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_DialogCtrl_C_ReceiveTick");
static_assert(sizeof(BP_DialogCtrl_C_ReceiveTick) == 0x000004, "Wrong size on BP_DialogCtrl_C_ReceiveTick");
static_assert(offsetof(BP_DialogCtrl_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_DialogCtrl_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.IDialogRunningIconOff
// 0x0001 (0x0001 - 0x0000)
struct BP_DialogCtrl_C_IDialogRunningIconOff final
{
public:
	bool                                          InExecutionFlag;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DialogCtrl_C_IDialogRunningIconOff) == 0x000001, "Wrong alignment on BP_DialogCtrl_C_IDialogRunningIconOff");
static_assert(sizeof(BP_DialogCtrl_C_IDialogRunningIconOff) == 0x000001, "Wrong size on BP_DialogCtrl_C_IDialogRunningIconOff");
static_assert(offsetof(BP_DialogCtrl_C_IDialogRunningIconOff, InExecutionFlag) == 0x000000, "Member 'BP_DialogCtrl_C_IDialogRunningIconOff::InExecutionFlag' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.IDialogRunningIconOn
// 0x0001 (0x0001 - 0x0000)
struct BP_DialogCtrl_C_IDialogRunningIconOn final
{
public:
	bool                                          InExecutionFlag;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DialogCtrl_C_IDialogRunningIconOn) == 0x000001, "Wrong alignment on BP_DialogCtrl_C_IDialogRunningIconOn");
static_assert(sizeof(BP_DialogCtrl_C_IDialogRunningIconOn) == 0x000001, "Wrong size on BP_DialogCtrl_C_IDialogRunningIconOn");
static_assert(offsetof(BP_DialogCtrl_C_IDialogRunningIconOn, InExecutionFlag) == 0x000000, "Member 'BP_DialogCtrl_C_IDialogRunningIconOn::InExecutionFlag' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.IExecutionOpenDialog
// 0x0001 (0x0001 - 0x0000)
struct BP_DialogCtrl_C_IExecutionOpenDialog final
{
public:
	bool                                          InUseRunningIcon;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DialogCtrl_C_IExecutionOpenDialog) == 0x000001, "Wrong alignment on BP_DialogCtrl_C_IExecutionOpenDialog");
static_assert(sizeof(BP_DialogCtrl_C_IExecutionOpenDialog) == 0x000001, "Wrong size on BP_DialogCtrl_C_IExecutionOpenDialog");
static_assert(offsetof(BP_DialogCtrl_C_IExecutionOpenDialog, InUseRunningIcon) == 0x000000, "Member 'BP_DialogCtrl_C_IExecutionOpenDialog::InUseRunningIcon' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.IDialogOn
// 0x0001 (0x0001 - 0x0000)
struct BP_DialogCtrl_C_IDialogOn final
{
public:
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogCtrl_C_IDialogOn) == 0x000001, "Wrong alignment on BP_DialogCtrl_C_IDialogOn");
static_assert(sizeof(BP_DialogCtrl_C_IDialogOn) == 0x000001, "Wrong size on BP_DialogCtrl_C_IDialogOn");
static_assert(offsetof(BP_DialogCtrl_C_IDialogOn, InPrio) == 0x000000, "Member 'BP_DialogCtrl_C_IDialogOn::InPrio' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.ISetDialogTextFlag
// 0x0002 (0x0002 - 0x0000)
struct BP_DialogCtrl_C_ISetDialogTextFlag final
{
public:
	bool                                          InExecution;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InBuild;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DialogCtrl_C_ISetDialogTextFlag) == 0x000001, "Wrong alignment on BP_DialogCtrl_C_ISetDialogTextFlag");
static_assert(sizeof(BP_DialogCtrl_C_ISetDialogTextFlag) == 0x000002, "Wrong size on BP_DialogCtrl_C_ISetDialogTextFlag");
static_assert(offsetof(BP_DialogCtrl_C_ISetDialogTextFlag, InExecution) == 0x000000, "Member 'BP_DialogCtrl_C_ISetDialogTextFlag::InExecution' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ISetDialogTextFlag, InBuild) == 0x000001, "Member 'BP_DialogCtrl_C_ISetDialogTextFlag::InBuild' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.ISetDialogText
// 0x0018 (0x0018 - 0x0000)
struct BP_DialogCtrl_C_ISetDialogText final
{
public:
	class UScriptMessageAsset*                    InScriptMessageAsset;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InLabel;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InBuildText;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DialogCtrl_C_ISetDialogText) == 0x000008, "Wrong alignment on BP_DialogCtrl_C_ISetDialogText");
static_assert(sizeof(BP_DialogCtrl_C_ISetDialogText) == 0x000018, "Wrong size on BP_DialogCtrl_C_ISetDialogText");
static_assert(offsetof(BP_DialogCtrl_C_ISetDialogText, InScriptMessageAsset) == 0x000000, "Member 'BP_DialogCtrl_C_ISetDialogText::InScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ISetDialogText, InLabel) == 0x000008, "Member 'BP_DialogCtrl_C_ISetDialogText::InLabel' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ISetDialogText, InBuildText) == 0x000010, "Member 'BP_DialogCtrl_C_ISetDialogText::InBuildText' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.OnAnyItemSelected
// 0x0004 (0x0004 - 0x0000)
struct BP_DialogCtrl_C_OnAnyItemSelected final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogCtrl_C_OnAnyItemSelected) == 0x000004, "Wrong alignment on BP_DialogCtrl_C_OnAnyItemSelected");
static_assert(sizeof(BP_DialogCtrl_C_OnAnyItemSelected) == 0x000004, "Wrong size on BP_DialogCtrl_C_OnAnyItemSelected");
static_assert(offsetof(BP_DialogCtrl_C_OnAnyItemSelected, ItemIndex) == 0x000000, "Member 'BP_DialogCtrl_C_OnAnyItemSelected::ItemIndex' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.OnAnyItemClicked
// 0x0004 (0x0004 - 0x0000)
struct BP_DialogCtrl_C_OnAnyItemClicked final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogCtrl_C_OnAnyItemClicked) == 0x000004, "Wrong alignment on BP_DialogCtrl_C_OnAnyItemClicked");
static_assert(sizeof(BP_DialogCtrl_C_OnAnyItemClicked) == 0x000004, "Wrong size on BP_DialogCtrl_C_OnAnyItemClicked");
static_assert(offsetof(BP_DialogCtrl_C_OnAnyItemClicked, ItemIndex) == 0x000000, "Member 'BP_DialogCtrl_C_OnAnyItemClicked::ItemIndex' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.IMoveDialogSelectCursor
// 0x0004 (0x0004 - 0x0000)
struct BP_DialogCtrl_C_IMoveDialogSelectCursor final
{
public:
	int32                                         InParam;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogCtrl_C_IMoveDialogSelectCursor) == 0x000004, "Wrong alignment on BP_DialogCtrl_C_IMoveDialogSelectCursor");
static_assert(sizeof(BP_DialogCtrl_C_IMoveDialogSelectCursor) == 0x000004, "Wrong size on BP_DialogCtrl_C_IMoveDialogSelectCursor");
static_assert(offsetof(BP_DialogCtrl_C_IMoveDialogSelectCursor, InParam) == 0x000000, "Member 'BP_DialogCtrl_C_IMoveDialogSelectCursor::InParam' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.ISetDialogSelectTextByIndex
// 0x0020 (0x0020 - 0x0000)
struct BP_DialogCtrl_C_ISetDialogSelectTextByIndex final
{
public:
	int32                                         InMenuNumber;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InInitCursorPosition;                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    InScriptMessageAsset;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 InSelectItemIndex;                                 // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_DialogCtrl_C_ISetDialogSelectTextByIndex) == 0x000008, "Wrong alignment on BP_DialogCtrl_C_ISetDialogSelectTextByIndex");
static_assert(sizeof(BP_DialogCtrl_C_ISetDialogSelectTextByIndex) == 0x000020, "Wrong size on BP_DialogCtrl_C_ISetDialogSelectTextByIndex");
static_assert(offsetof(BP_DialogCtrl_C_ISetDialogSelectTextByIndex, InMenuNumber) == 0x000000, "Member 'BP_DialogCtrl_C_ISetDialogSelectTextByIndex::InMenuNumber' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ISetDialogSelectTextByIndex, InInitCursorPosition) == 0x000004, "Member 'BP_DialogCtrl_C_ISetDialogSelectTextByIndex::InInitCursorPosition' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ISetDialogSelectTextByIndex, InScriptMessageAsset) == 0x000008, "Member 'BP_DialogCtrl_C_ISetDialogSelectTextByIndex::InScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ISetDialogSelectTextByIndex, InSelectItemIndex) == 0x000010, "Member 'BP_DialogCtrl_C_ISetDialogSelectTextByIndex::InSelectItemIndex' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.ISetDialogSelectText
// 0x0020 (0x0020 - 0x0000)
struct BP_DialogCtrl_C_ISetDialogSelectText final
{
public:
	int32                                         InMenuNumber;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InInitCursorPosition;                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    InScriptMessageAsset;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           InSelectItemName;                                  // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_DialogCtrl_C_ISetDialogSelectText) == 0x000008, "Wrong alignment on BP_DialogCtrl_C_ISetDialogSelectText");
static_assert(sizeof(BP_DialogCtrl_C_ISetDialogSelectText) == 0x000020, "Wrong size on BP_DialogCtrl_C_ISetDialogSelectText");
static_assert(offsetof(BP_DialogCtrl_C_ISetDialogSelectText, InMenuNumber) == 0x000000, "Member 'BP_DialogCtrl_C_ISetDialogSelectText::InMenuNumber' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ISetDialogSelectText, InInitCursorPosition) == 0x000004, "Member 'BP_DialogCtrl_C_ISetDialogSelectText::InInitCursorPosition' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ISetDialogSelectText, InScriptMessageAsset) == 0x000008, "Member 'BP_DialogCtrl_C_ISetDialogSelectText::InScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ISetDialogSelectText, InSelectItemName) == 0x000010, "Member 'BP_DialogCtrl_C_ISetDialogSelectText::InSelectItemName' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.IDialogSetProgramValue
// 0x0018 (0x0018 - 0x0000)
struct BP_DialogCtrl_C_IDialogSetProgramValue final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_646C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InString;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogCtrl_C_IDialogSetProgramValue) == 0x000008, "Wrong alignment on BP_DialogCtrl_C_IDialogSetProgramValue");
static_assert(sizeof(BP_DialogCtrl_C_IDialogSetProgramValue) == 0x000018, "Wrong size on BP_DialogCtrl_C_IDialogSetProgramValue");
static_assert(offsetof(BP_DialogCtrl_C_IDialogSetProgramValue, InIndex) == 0x000000, "Member 'BP_DialogCtrl_C_IDialogSetProgramValue::InIndex' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_IDialogSetProgramValue, InString) == 0x000008, "Member 'BP_DialogCtrl_C_IDialogSetProgramValue::InString' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.IDialogSetValueParam
// 0x0008 (0x0008 - 0x0000)
struct BP_DialogCtrl_C_IDialogSetValueParam final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InValueParam;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogCtrl_C_IDialogSetValueParam) == 0x000004, "Wrong alignment on BP_DialogCtrl_C_IDialogSetValueParam");
static_assert(sizeof(BP_DialogCtrl_C_IDialogSetValueParam) == 0x000008, "Wrong size on BP_DialogCtrl_C_IDialogSetValueParam");
static_assert(offsetof(BP_DialogCtrl_C_IDialogSetValueParam, InIndex) == 0x000000, "Member 'BP_DialogCtrl_C_IDialogSetValueParam::InIndex' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_IDialogSetValueParam, InValueParam) == 0x000004, "Member 'BP_DialogCtrl_C_IDialogSetValueParam::InValueParam' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.ChangeGstatusParam
// 0x0002 (0x0002 - 0x0000)
struct BP_DialogCtrl_C_ChangeGstatusParam final
{
public:
	E_DIALOGCTRL_GSTATUS                          InGStatus;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InMain;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DialogCtrl_C_ChangeGstatusParam) == 0x000001, "Wrong alignment on BP_DialogCtrl_C_ChangeGstatusParam");
static_assert(sizeof(BP_DialogCtrl_C_ChangeGstatusParam) == 0x000002, "Wrong size on BP_DialogCtrl_C_ChangeGstatusParam");
static_assert(offsetof(BP_DialogCtrl_C_ChangeGstatusParam, InGStatus) == 0x000000, "Member 'BP_DialogCtrl_C_ChangeGstatusParam::InGStatus' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ChangeGstatusParam, InMain) == 0x000001, "Member 'BP_DialogCtrl_C_ChangeGstatusParam::InMain' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.Gstatus_WaitWindowOpen
// 0x0001 (0x0001 - 0x0000)
struct BP_DialogCtrl_C_Gstatus_WaitWindowOpen final
{
public:
	bool                                          CallFunc_IsOpenDialog_OutOpened;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DialogCtrl_C_Gstatus_WaitWindowOpen) == 0x000001, "Wrong alignment on BP_DialogCtrl_C_Gstatus_WaitWindowOpen");
static_assert(sizeof(BP_DialogCtrl_C_Gstatus_WaitWindowOpen) == 0x000001, "Wrong size on BP_DialogCtrl_C_Gstatus_WaitWindowOpen");
static_assert(offsetof(BP_DialogCtrl_C_Gstatus_WaitWindowOpen, CallFunc_IsOpenDialog_OutOpened) == 0x000000, "Member 'BP_DialogCtrl_C_Gstatus_WaitWindowOpen::CallFunc_IsOpenDialog_OutOpened' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.Gstatus_WaitWindowClose
// 0x0002 (0x0002 - 0x0000)
struct BP_DialogCtrl_C_Gstatus_WaitWindowClose final
{
public:
	bool                                          CallFunc_IsCloseDialogWindow_OutFinished;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DialogCtrl_C_Gstatus_WaitWindowClose) == 0x000001, "Wrong alignment on BP_DialogCtrl_C_Gstatus_WaitWindowClose");
static_assert(sizeof(BP_DialogCtrl_C_Gstatus_WaitWindowClose) == 0x000002, "Wrong size on BP_DialogCtrl_C_Gstatus_WaitWindowClose");
static_assert(offsetof(BP_DialogCtrl_C_Gstatus_WaitWindowClose, CallFunc_IsCloseDialogWindow_OutFinished) == 0x000000, "Member 'BP_DialogCtrl_C_Gstatus_WaitWindowClose::CallFunc_IsCloseDialogWindow_OutFinished' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_Gstatus_WaitWindowClose, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_DialogCtrl_C_Gstatus_WaitWindowClose::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.ClearAllScriptMessageAsset
// 0x0020 (0x0020 - 0x0000)
struct BP_DialogCtrl_C_ClearAllScriptMessageAsset final
{
public:
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ConstParm, ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_1;                          // 0x0010(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(BP_DialogCtrl_C_ClearAllScriptMessageAsset) == 0x000008, "Wrong alignment on BP_DialogCtrl_C_ClearAllScriptMessageAsset");
static_assert(sizeof(BP_DialogCtrl_C_ClearAllScriptMessageAsset) == 0x000020, "Wrong size on BP_DialogCtrl_C_ClearAllScriptMessageAsset");
static_assert(offsetof(BP_DialogCtrl_C_ClearAllScriptMessageAsset, K2Node_MakeArray_Array) == 0x000000, "Member 'BP_DialogCtrl_C_ClearAllScriptMessageAsset::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_ClearAllScriptMessageAsset, K2Node_MakeArray_Array_1) == 0x000010, "Member 'BP_DialogCtrl_C_ClearAllScriptMessageAsset::K2Node_MakeArray_Array_1' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.IsOpenDialog
// 0x0002 (0x0002 - 0x0000)
struct BP_DialogCtrl_C_IsOpenDialog final
{
public:
	bool                                          OutOpened;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOpenDialogWindow_OutFinished;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DialogCtrl_C_IsOpenDialog) == 0x000001, "Wrong alignment on BP_DialogCtrl_C_IsOpenDialog");
static_assert(sizeof(BP_DialogCtrl_C_IsOpenDialog) == 0x000002, "Wrong size on BP_DialogCtrl_C_IsOpenDialog");
static_assert(offsetof(BP_DialogCtrl_C_IsOpenDialog, OutOpened) == 0x000000, "Member 'BP_DialogCtrl_C_IsOpenDialog::OutOpened' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_IsOpenDialog, CallFunc_IsOpenDialogWindow_OutFinished) == 0x000001, "Member 'BP_DialogCtrl_C_IsOpenDialog::CallFunc_IsOpenDialogWindow_OutFinished' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.Gstatus_SetText
// 0x0001 (0x0001 - 0x0000)
struct BP_DialogCtrl_C_Gstatus_SetText final
{
public:
	bool                                          CallFunc_IsOpenDialog_OutOpened;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DialogCtrl_C_Gstatus_SetText) == 0x000001, "Wrong alignment on BP_DialogCtrl_C_Gstatus_SetText");
static_assert(sizeof(BP_DialogCtrl_C_Gstatus_SetText) == 0x000001, "Wrong size on BP_DialogCtrl_C_Gstatus_SetText");
static_assert(offsetof(BP_DialogCtrl_C_Gstatus_SetText, CallFunc_IsOpenDialog_OutOpened) == 0x000000, "Member 'BP_DialogCtrl_C_Gstatus_SetText::CallFunc_IsOpenDialog_OutOpened' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.Gstatus_WaitText
// 0x0001 (0x0001 - 0x0000)
struct BP_DialogCtrl_C_Gstatus_WaitText final
{
public:
	bool                                          CallFunc_IsOpenDialog_OutOpened;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DialogCtrl_C_Gstatus_WaitText) == 0x000001, "Wrong alignment on BP_DialogCtrl_C_Gstatus_WaitText");
static_assert(sizeof(BP_DialogCtrl_C_Gstatus_WaitText) == 0x000001, "Wrong size on BP_DialogCtrl_C_Gstatus_WaitText");
static_assert(offsetof(BP_DialogCtrl_C_Gstatus_WaitText, CallFunc_IsOpenDialog_OutOpened) == 0x000000, "Member 'BP_DialogCtrl_C_Gstatus_WaitText::CallFunc_IsOpenDialog_OutOpened' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.CalcSelectMenuWheel
// 0x0040 (0x0040 - 0x0000)
struct BP_DialogCtrl_C_CalcSelectMenuWheel final
{
public:
	bool                                          OutWheel;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_646D[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Oldcursor;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Retparam;                                          // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_646E[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_DecidesDialogSelectCursor_outparam;       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDialogSelectNumber_OutNumber;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_646F[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6470[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_DecidesDialogSelectCursor_outparam_1;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6471[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMouseWheelAxis_Axis;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMouseWheelParameter_ReturnValue;       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DialogCtrl_C_CalcSelectMenuWheel) == 0x000008, "Wrong alignment on BP_DialogCtrl_C_CalcSelectMenuWheel");
static_assert(sizeof(BP_DialogCtrl_C_CalcSelectMenuWheel) == 0x000040, "Wrong size on BP_DialogCtrl_C_CalcSelectMenuWheel");
static_assert(offsetof(BP_DialogCtrl_C_CalcSelectMenuWheel, OutWheel) == 0x000000, "Member 'BP_DialogCtrl_C_CalcSelectMenuWheel::OutWheel' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_CalcSelectMenuWheel, Oldcursor) == 0x000004, "Member 'BP_DialogCtrl_C_CalcSelectMenuWheel::Oldcursor' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_CalcSelectMenuWheel, Retparam) == 0x000008, "Member 'BP_DialogCtrl_C_CalcSelectMenuWheel::Retparam' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_CalcSelectMenuWheel, CallFunc_DecidesDialogSelectCursor_outparam) == 0x00000C, "Member 'BP_DialogCtrl_C_CalcSelectMenuWheel::CallFunc_DecidesDialogSelectCursor_outparam' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_CalcSelectMenuWheel, CallFunc_GetDialogSelectNumber_OutNumber) == 0x000010, "Member 'BP_DialogCtrl_C_CalcSelectMenuWheel::CallFunc_GetDialogSelectNumber_OutNumber' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_CalcSelectMenuWheel, CallFunc_Get_ReturnValue) == 0x000018, "Member 'BP_DialogCtrl_C_CalcSelectMenuWheel::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_CalcSelectMenuWheel, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'BP_DialogCtrl_C_CalcSelectMenuWheel::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_CalcSelectMenuWheel, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000024, "Member 'BP_DialogCtrl_C_CalcSelectMenuWheel::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_CalcSelectMenuWheel, CallFunc_DecidesDialogSelectCursor_outparam_1) == 0x000028, "Member 'BP_DialogCtrl_C_CalcSelectMenuWheel::CallFunc_DecidesDialogSelectCursor_outparam_1' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_CalcSelectMenuWheel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002C, "Member 'BP_DialogCtrl_C_CalcSelectMenuWheel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_CalcSelectMenuWheel, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00002D, "Member 'BP_DialogCtrl_C_CalcSelectMenuWheel::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_CalcSelectMenuWheel, CallFunc_GetMouseWheelAxis_Axis) == 0x000030, "Member 'BP_DialogCtrl_C_CalcSelectMenuWheel::CallFunc_GetMouseWheelAxis_Axis' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_CalcSelectMenuWheel, CallFunc_GetMouseWheelParameter_ReturnValue) == 0x000034, "Member 'BP_DialogCtrl_C_CalcSelectMenuWheel::CallFunc_GetMouseWheelParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_CalcSelectMenuWheel, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000038, "Member 'BP_DialogCtrl_C_CalcSelectMenuWheel::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_CalcSelectMenuWheel, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000039, "Member 'BP_DialogCtrl_C_CalcSelectMenuWheel::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_CalcSelectMenuWheel, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x00003A, "Member 'BP_DialogCtrl_C_CalcSelectMenuWheel::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_CalcSelectMenuWheel, CallFunc_BooleanAND_ReturnValue) == 0x00003B, "Member 'BP_DialogCtrl_C_CalcSelectMenuWheel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_CalcSelectMenuWheel, CallFunc_BooleanAND_ReturnValue_1) == 0x00003C, "Member 'BP_DialogCtrl_C_CalcSelectMenuWheel::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.CalcClickedMenu
// 0x0008 (0x0008 - 0x0000)
struct BP_DialogCtrl_C_CalcClickedMenu final
{
public:
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6472[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_DecidesDialogSelectCursor_outparam;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogCtrl_C_CalcClickedMenu) == 0x000004, "Wrong alignment on BP_DialogCtrl_C_CalcClickedMenu");
static_assert(sizeof(BP_DialogCtrl_C_CalcClickedMenu) == 0x000008, "Wrong size on BP_DialogCtrl_C_CalcClickedMenu");
static_assert(offsetof(BP_DialogCtrl_C_CalcClickedMenu, CallFunc_IsActionPadCheck_Success) == 0x000000, "Member 'BP_DialogCtrl_C_CalcClickedMenu::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_CalcClickedMenu, CallFunc_DecidesDialogSelectCursor_outparam) == 0x000004, "Member 'BP_DialogCtrl_C_CalcClickedMenu::CallFunc_DecidesDialogSelectCursor_outparam' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.IconAnimationProc
// 0x000C (0x000C - 0x0000)
struct BP_DialogCtrl_C_IconAnimationProc final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6473[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogCtrl_C_IconAnimationProc) == 0x000004, "Wrong alignment on BP_DialogCtrl_C_IconAnimationProc");
static_assert(sizeof(BP_DialogCtrl_C_IconAnimationProc) == 0x00000C, "Wrong size on BP_DialogCtrl_C_IconAnimationProc");
static_assert(offsetof(BP_DialogCtrl_C_IconAnimationProc, InDeltaTime) == 0x000000, "Member 'BP_DialogCtrl_C_IconAnimationProc::InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_IconAnimationProc, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_DialogCtrl_C_IconAnimationProc::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogCtrl_C_IconAnimationProc, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_DialogCtrl_C_IconAnimationProc::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_DialogCtrl.BP_DialogCtrl_C.IIsOpenedDialogWindow
// 0x0001 (0x0001 - 0x0000)
struct BP_DialogCtrl_C_IIsOpenedDialogWindow final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DialogCtrl_C_IIsOpenedDialogWindow) == 0x000001, "Wrong alignment on BP_DialogCtrl_C_IIsOpenedDialogWindow");
static_assert(sizeof(BP_DialogCtrl_C_IIsOpenedDialogWindow) == 0x000001, "Wrong size on BP_DialogCtrl_C_IIsOpenedDialogWindow");
