#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DevilControlBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DevilControlBase.BP_DevilControlBase_C.SetPlayerLookAt
// 0x0058 (0x0058 - 0x0000)
struct BP_DevilControlBase_C_SetPlayerLookAt final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A304[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_LookAt_NoUse;                          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A305[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A306[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1;    // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_LookAt_NoUse_1;                        // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DevilControlBase_C_SetPlayerLookAt) == 0x000008, "Wrong alignment on BP_DevilControlBase_C_SetPlayerLookAt");
static_assert(sizeof(BP_DevilControlBase_C_SetPlayerLookAt) == 0x000058, "Wrong size on BP_DevilControlBase_C_SetPlayerLookAt");
static_assert(offsetof(BP_DevilControlBase_C_SetPlayerLookAt, Enable) == 0x000000, "Member 'BP_DevilControlBase_C_SetPlayerLookAt::Enable' has a wrong offset!");
static_assert(offsetof(BP_DevilControlBase_C_SetPlayerLookAt, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'BP_DevilControlBase_C_SetPlayerLookAt::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DevilControlBase_C_SetPlayerLookAt, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor) == 0x000010, "Member 'BP_DevilControlBase_C_SetPlayerLookAt::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor' has a wrong offset!");
static_assert(offsetof(BP_DevilControlBase_C_SetPlayerLookAt, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_DevilControlBase_C_SetPlayerLookAt::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DevilControlBase_C_SetPlayerLookAt, CallFunc_BI_LookAt_NoUse) == 0x000021, "Member 'BP_DevilControlBase_C_SetPlayerLookAt::CallFunc_BI_LookAt_NoUse' has a wrong offset!");
static_assert(offsetof(BP_DevilControlBase_C_SetPlayerLookAt, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000028, "Member 'BP_DevilControlBase_C_SetPlayerLookAt::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DevilControlBase_C_SetPlayerLookAt, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_DevilControlBase_C_SetPlayerLookAt::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DevilControlBase_C_SetPlayerLookAt, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000038, "Member 'BP_DevilControlBase_C_SetPlayerLookAt::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DevilControlBase_C_SetPlayerLookAt, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1) == 0x000040, "Member 'BP_DevilControlBase_C_SetPlayerLookAt::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1' has a wrong offset!");
static_assert(offsetof(BP_DevilControlBase_C_SetPlayerLookAt, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_DevilControlBase_C_SetPlayerLookAt::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DevilControlBase_C_SetPlayerLookAt, CallFunc_BI_LookAt_NoUse_1) == 0x000051, "Member 'BP_DevilControlBase_C_SetPlayerLookAt::CallFunc_BI_LookAt_NoUse_1' has a wrong offset!");

}

