#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DebugMenuUI

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Project_structs.hpp"
#include "DebugMenuFuncObjStruct_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_DebugMenuUI.BP_DebugMenuUI_C.ExecuteUbergraph_BP_DebugMenuUI
// 0x0470 (0x0470 - 0x0000)
struct BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28CF[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_1;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsDebug_Func_Base_Obj;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckAddMenu_ReturnValue;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0022(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28D0[0x5];                                     // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28D1[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28D2[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_2;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_CheckBattleDebugUICreate;       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28D3[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDebugMenuItemData>             CallFunc_GetMenuEndDeleteItem_ReturnValue;         // 0x0068(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPL_IsBattleExcuting_retValue;            // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28D4[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_BPL_GetBIBattleMain_retValue;             // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPL_GetBIBattleMain_success;              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_ReadyDebugMenu_Ret;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28D5[0x6];                                     // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_BI_GetPartySystem_ret;                    // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_IsInField_retValue;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDebugMenuActiveItemPage_ReturnValue;    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28D6[0x6];                                     // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable_2;                             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28D7[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget_1;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_2;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28D8[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Create_ReturnValue_1;                     // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue_1;            // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPL_IsBattleExcuting_retValue_1;          // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28D9[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPL_IsBattleExcuting_retValue_2;          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28DA[0x6];                                     // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_3;                       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<class UDataTable*>                     K2Node_CustomEvent_DataTableArray;                 // 0x0120(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate;              // 0x0134(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Init_retValue;                            // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28DB[0x2];                                     // 0x014E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDebugMenuItemData>             CallFunc_GetMenuEndDeleteItem_ReturnValue_1;       // 0x0150(0x0010)(ReferenceParm)
	bool                                          K2Node_Event_IsView;                               // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28DC[0x3];                                     // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0164(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x0176(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_2;               // 0x0177(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_3;               // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_4;               // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_5;               // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_6;               // 0x017B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_7;               // 0x017E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_8;               // 0x017F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MoveY_IsMove;                             // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MoveY_IsMove_1;                           // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MoveY_IsMove_2;                           // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MoveY_IsMove_3;                           // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_9;               // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_10;              // 0x0185(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_11;              // 0x0186(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_12;              // 0x0187(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_13;              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_14;              // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_15;              // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_16;              // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28DD[0x2];                                     // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionPadCheck_Success_17;              // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_18;              // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_19;              // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_20;              // 0x019B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28DE[0x2];                                     // 0x019E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable_3;                             // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsBP_Btl_Debug_AITemp_View_Ctrl_Base; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_3;                // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28DF[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionPadCheck_Success_21;              // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28E0[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlDebugAITempViewCtrlBase_C*       CallFunc_FinishSpawningActor_ReturnValue;          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionPadCheck_Success_22;              // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_23;              // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_24;              // 0x01D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_D_MENU_TYPE                                 CallFunc_GetKeyType_KeyType;                       // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_25;              // 0x01D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_26;              // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_27;              // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28E1[0x2];                                     // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_Array_Get_Item;                           // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x01F8(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28E2[0x4];                                     // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuFuncObjStruct                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0218(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28E3[0x6];                                     // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28E4[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28E5[0x7];                                     // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue;  // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28E6[0x4];                                     // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_DebugMenu_Base_C*                   CallFunc_CastDebugMenuBox_AsWB_Debug_Menu_Base;    // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x02D8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CallCancel_IsEnd;                         // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28E7[0x6];                                     // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_DebugMenu_Base_C*                   CallFunc_CastDebugMenuBox_AsWB_Debug_Menu_Base_1;  // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_DebugMenu_Base_C*                   CallFunc_CastDebugMenuBox_AsWB_Debug_Menu_Base_2;  // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28E8[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_DebugMenu_Base_C*                   CallFunc_CastDebugMenuBox_AsWB_Debug_Menu_Base_3;  // 0x0308(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28E9[0x7];                                     // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DebugMenuUI_C>    CallFunc_Init_BPI_DebugMenu_CastInput;             // 0x0318(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWB_DebugMenu_Box_C*                    K2Node_DynamicCast_AsWB_Debug_Menu_Box;            // 0x0328(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28EA[0x3];                                     // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0334(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_28EB[0x4];                                     // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_DebugMenu_Base_C*                   K2Node_DynamicCast_AsWB_Debug_Menu_Base;           // 0x0348(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_4;    // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TypeFunc_IsKeyLock_IsKeyLock;             // 0x0352(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TypeFunc_IsCall_IsCall;                   // 0x0353(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28EC[0x4];                                     // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_DebugMenu_Base_C*                   CallFunc_CastDebugMenuBox_AsWB_Debug_Menu_Base_4;  // 0x0358(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FDebugMenuItemData>             CallFunc_GetMenuEndDeleteItem_ReturnValue_2;       // 0x0360(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_5;    // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsKeyLock_isKeyLock;                   // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0372(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28ED[0x5];                                     // 0x0373(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromName_ReturnValue;     // 0x0380(0x00D0)()
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0451(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0452(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28EE[0x5];                                     // 0x0453(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectGCManager*                      CallFunc_Get_ReturnValue;                          // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28EF[0x3];                                     // 0x0465(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisableDebugMenu_disable;               // 0x046C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI) == 0x000010, "Wrong alignment on BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI");
static_assert(sizeof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI) == 0x000470, "Wrong size on BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, EntryPoint) == 0x000000, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_CustomEvent_Loaded_1) == 0x000008, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, Temp_class_Variable) == 0x000010, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_ClassDynamicCast_AsDebug_Func_Base_Obj) == 0x000018, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_ClassDynamicCast_AsDebug_Func_Base_Obj' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_ClassDynamicCast_bSuccess) == 0x000020, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_CheckAddMenu_ReturnValue) == 0x000021, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_CheckAddMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, Temp_bool_Variable) == 0x000022, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_CustomEvent_Loaded) == 0x000028, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, Temp_class_Variable_1) == 0x000030, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_ClassDynamicCast_AsUser_Widget) == 0x000038, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_ClassDynamicCast_AsUser_Widget' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_ClassDynamicCast_bSuccess_1) == 0x000040, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_ClassDynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_Create_ReturnValue) == 0x000048, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_AddToWidgetPrio_ReturnValue) == 0x000050, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_AddToWidgetPrio_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_CustomEvent_Loaded_2) == 0x000058, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_CustomEvent_CheckBattleDebugUICreate) == 0x000060, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_CustomEvent_CheckBattleDebugUICreate' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_SwitchInteger_CmpSuccess) == 0x000061, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_GetMenuEndDeleteItem_ReturnValue) == 0x000068, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_GetMenuEndDeleteItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, Temp_int_Array_Index_Variable) == 0x000078, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_BPL_IsBattleExcuting_retValue) == 0x00007C, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_BPL_IsBattleExcuting_retValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_BPL_GetBIBattleMain_retValue) == 0x000080, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_BPL_GetBIBattleMain_retValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_BPL_GetBIBattleMain_success) == 0x000090, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_BPL_GetBIBattleMain_success' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_BI_ReadyDebugMenu_Ret) == 0x000091, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_BI_ReadyDebugMenu_Ret' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_BI_GetPartySystem_ret) == 0x000098, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_BI_GetPartySystem_ret' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_BI_IsInField_retValue) == 0x0000A8, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_BI_IsInField_retValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsDebugMenuActiveItemPage_ReturnValue) == 0x0000A9, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsDebugMenuActiveItemPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, Temp_class_Variable_2) == 0x0000B0, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_ClassDynamicCast_AsUser_Widget_1) == 0x0000C0, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_ClassDynamicCast_AsUser_Widget_1' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_ClassDynamicCast_bSuccess_2) == 0x0000C8, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_ClassDynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_Create_ReturnValue_1) == 0x0000D0, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsValid_ReturnValue_1) == 0x0000D8, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_AddToWidgetPrio_ReturnValue_1) == 0x0000D9, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_AddToWidgetPrio_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_BPL_IsBattleExcuting_retValue_1) == 0x0000DA, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_BPL_IsBattleExcuting_retValue_1' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsValid_ReturnValue_2) == 0x0000DB, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_MakeTransform_ReturnValue) == 0x0000E0, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_BPL_IsBattleExcuting_retValue_2) == 0x000110, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_BPL_IsBattleExcuting_retValue_2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_SwitchInteger_CmpSuccess_1) == 0x000111, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_CustomEvent_Loaded_3) == 0x000118, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_CustomEvent_DataTableArray) == 0x000120, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_CustomEvent_DataTableArray' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_Array_Length_ReturnValue) == 0x000130, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_CreateDelegate_OutputDelegate) == 0x000134, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_Array_Add_ReturnValue) == 0x000144, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_Array_Length_ReturnValue_1) == 0x000148, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00014C, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_Init_retValue) == 0x00014D, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_Init_retValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_GetMenuEndDeleteItem_ReturnValue_1) == 0x000150, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_GetMenuEndDeleteItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_Event_IsView) == 0x000160, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_Event_IsView' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_CreateDelegate_OutputDelegate_1) == 0x000164, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000174, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success) == 0x000175, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_1) == 0x000176, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_1' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_2) == 0x000177, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_3) == 0x000178, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_4) == 0x000179, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_4' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_5) == 0x00017A, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_5' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_6) == 0x00017B, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_6' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_BooleanOR_ReturnValue) == 0x00017C, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_BooleanOR_ReturnValue_1) == 0x00017D, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_7) == 0x00017E, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_7' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_8) == 0x00017F, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_8' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_MoveY_IsMove) == 0x000180, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_MoveY_IsMove' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_MoveY_IsMove_1) == 0x000181, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_MoveY_IsMove_1' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_MoveY_IsMove_2) == 0x000182, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_MoveY_IsMove_2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_MoveY_IsMove_3) == 0x000183, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_MoveY_IsMove_3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_9) == 0x000184, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_9' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_10) == 0x000185, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_10' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_11) == 0x000186, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_11' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_12) == 0x000187, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_12' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_13) == 0x000188, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_13' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_14) == 0x000189, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_14' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_BooleanOR_ReturnValue_2) == 0x00018A, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_BooleanOR_ReturnValue_3) == 0x00018B, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_15) == 0x00018C, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_15' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_16) == 0x00018D, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_16' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, Temp_int_Loop_Counter_Variable) == 0x000190, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_Add_IntInt_ReturnValue) == 0x000194, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_17) == 0x000198, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_17' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_18) == 0x000199, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_18' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_19) == 0x00019A, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_19' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_20) == 0x00019B, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_20' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_BooleanOR_ReturnValue_4) == 0x00019C, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_BooleanOR_ReturnValue_5) == 0x00019D, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, Temp_class_Variable_3) == 0x0001A0, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::Temp_class_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_ClassDynamicCast_AsBP_Btl_Debug_AITemp_View_Ctrl_Base) == 0x0001A8, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_ClassDynamicCast_AsBP_Btl_Debug_AITemp_View_Ctrl_Base' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_ClassDynamicCast_bSuccess_3) == 0x0001B0, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_ClassDynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001B8, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_21) == 0x0001C0, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_21' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001C8, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_22) == 0x0001D0, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_22' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_BooleanAND_ReturnValue) == 0x0001D1, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_23) == 0x0001D2, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_23' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_24) == 0x0001D3, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_24' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_BooleanAND_ReturnValue_1) == 0x0001D4, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_GetKeyType_KeyType) == 0x0001D5, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_GetKeyType_KeyType' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_SwitchEnum_CmpSuccess) == 0x0001D6, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_25) == 0x0001D7, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_25' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_26) == 0x0001D8, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_26' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsActionPadCheck_Success_27) == 0x0001D9, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsActionPadCheck_Success_27' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_SelectInt_ReturnValue) == 0x0001DC, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_SelectInt_ReturnValue_1) == 0x0001E0, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_Multiply_IntInt_ReturnValue) == 0x0001E4, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_Event_DeltaSeconds) == 0x0001E8, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, Temp_int_Array_Index_Variable_1) == 0x0001EC, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_Array_Get_Item) == 0x0001F0, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_GetDataTableRowNames_OutRowNames) == 0x0001F8, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_Array_Get_Item_1) == 0x000208, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_Array_Length_ReturnValue_2) == 0x000210, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_GetDataTableRowFromName_OutRow) == 0x000218, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000260, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_Less_IntInt_ReturnValue) == 0x000261, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_Conv_NameToString_ReturnValue) == 0x000268, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000278, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000280, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_SelectString_ReturnValue) == 0x000290, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x0002A0, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_SelectString_ReturnValue_1) == 0x0002A8, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_SelectString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_DebugMenu_DispName_L10N_Text) == 0x0002B8, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_DebugMenu_DispName_L10N_Text' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue) == 0x0002C8, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue' has a wrong offset!");
