#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventBase

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "Engine_structs.hpp"
#include "EventVoiceFixData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ChangeFadeVolume_structs.hpp"
#include "SlateCore_structs.hpp"
#include "E_EVENT_SELECTION_EX_TYPE_structs.hpp"
#include "EventVisibleLevel_structs.hpp"
#include "DebugEventTextTiming_structs.hpp"
#include "EventChangeMaterialTable_structs.hpp"
#include "E_IK_TYPE_LIST_structs.hpp"
#include "E_PLAYER_MANAGER_TYPE_structs.hpp"
#include "EventTableStrInt_structs.hpp"
#include "EventRateTable_structs.hpp"
#include "EventSelection_structs.hpp"
#include "EventImportantSelectionLR_structs.hpp"
#include "EventMessage_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function BP_EventBase.BP_EventBase_C.BI_EB_PlayStart
// 0x0001 (0x0001 - 0x0000)
struct BP_EventBase_C_BI_EB_PlayStart final
{
public:
	bool                                          NoUse;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventBase_C_BI_EB_PlayStart) == 0x000001, "Wrong alignment on BP_EventBase_C_BI_EB_PlayStart");
static_assert(sizeof(BP_EventBase_C_BI_EB_PlayStart) == 0x000001, "Wrong size on BP_EventBase_C_BI_EB_PlayStart");
static_assert(offsetof(BP_EventBase_C_BI_EB_PlayStart, NoUse) == 0x000000, "Member 'BP_EventBase_C_BI_EB_PlayStart::NoUse' has a wrong offset!");

// Function BP_EventBase.BP_EventBase_C.BI_EB_IsFinish
// 0x0002 (0x0002 - 0x0000)
struct BP_EventBase_C_BI_EB_IsFinish final
{
public:
	bool                                          Param_Finish;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFinish_Finish;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventBase_C_BI_EB_IsFinish) == 0x000001, "Wrong alignment on BP_EventBase_C_BI_EB_IsFinish");
static_assert(sizeof(BP_EventBase_C_BI_EB_IsFinish) == 0x000002, "Wrong size on BP_EventBase_C_BI_EB_IsFinish");
static_assert(offsetof(BP_EventBase_C_BI_EB_IsFinish, Param_Finish) == 0x000000, "Member 'BP_EventBase_C_BI_EB_IsFinish::Param_Finish' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_BI_EB_IsFinish, CallFunc_IsFinish_Finish) == 0x000001, "Member 'BP_EventBase_C_BI_EB_IsFinish::CallFunc_IsFinish_Finish' has a wrong offset!");

// Function BP_EventBase.BP_EventBase_C.PlaySelectionSoundEnter
// 0x0018 (0x0018 - 0x0000)
struct BP_EventBase_C_PlaySelectionSoundEnter final
{
public:
	bool                                          SoundFlag;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C81[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue_1;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventBase_C_PlaySelectionSoundEnter) == 0x000008, "Wrong alignment on BP_EventBase_C_PlaySelectionSoundEnter");
static_assert(sizeof(BP_EventBase_C_PlaySelectionSoundEnter) == 0x000018, "Wrong size on BP_EventBase_C_PlaySelectionSoundEnter");
static_assert(offsetof(BP_EventBase_C_PlaySelectionSoundEnter, SoundFlag) == 0x000000, "Member 'BP_EventBase_C_PlaySelectionSoundEnter::SoundFlag' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_PlaySelectionSoundEnter, CallFunc_SpawnSound2D_ReturnValue) == 0x000008, "Member 'BP_EventBase_C_PlaySelectionSoundEnter::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_PlaySelectionSoundEnter, CallFunc_SpawnSound2D_ReturnValue_1) == 0x000010, "Member 'BP_EventBase_C_PlaySelectionSoundEnter::CallFunc_SpawnSound2D_ReturnValue_1' has a wrong offset!");

// Function BP_EventBase.BP_EventBase_C.PlaySelectionSoundSelect
// 0x0018 (0x0018 - 0x0000)
struct BP_EventBase_C_PlaySelectionSoundSelect final
{
public:
	bool                                          SoundFlag;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C82[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue_1;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventBase_C_PlaySelectionSoundSelect) == 0x000008, "Wrong alignment on BP_EventBase_C_PlaySelectionSoundSelect");
static_assert(sizeof(BP_EventBase_C_PlaySelectionSoundSelect) == 0x000018, "Wrong size on BP_EventBase_C_PlaySelectionSoundSelect");
static_assert(offsetof(BP_EventBase_C_PlaySelectionSoundSelect, SoundFlag) == 0x000000, "Member 'BP_EventBase_C_PlaySelectionSoundSelect::SoundFlag' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_PlaySelectionSoundSelect, CallFunc_SpawnSound2D_ReturnValue) == 0x000008, "Member 'BP_EventBase_C_PlaySelectionSoundSelect::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_PlaySelectionSoundSelect, CallFunc_SpawnSound2D_ReturnValue_1) == 0x000010, "Member 'BP_EventBase_C_PlaySelectionSoundSelect::CallFunc_SpawnSound2D_ReturnValue_1' has a wrong offset!");

// Function BP_EventBase.BP_EventBase_C.GetFinish
// 0x0001 (0x0001 - 0x0000)
struct BP_EventBase_C_GetFinish final
{
public:
	bool                                          IsFinish;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventBase_C_GetFinish) == 0x000001, "Wrong alignment on BP_EventBase_C_GetFinish");
static_assert(sizeof(BP_EventBase_C_GetFinish) == 0x000001, "Wrong size on BP_EventBase_C_GetFinish");
static_assert(offsetof(BP_EventBase_C_GetFinish, IsFinish) == 0x000000, "Member 'BP_EventBase_C_GetFinish::IsFinish' has a wrong offset!");

// Function BP_EventBase.BP_EventBase_C.IsTalkPart
// 0x0001 (0x0001 - 0x0000)
struct BP_EventBase_C_IsTalkPart final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventBase_C_IsTalkPart) == 0x000001, "Wrong alignment on BP_EventBase_C_IsTalkPart");
static_assert(sizeof(BP_EventBase_C_IsTalkPart) == 0x000001, "Wrong size on BP_EventBase_C_IsTalkPart");
static_assert(offsetof(BP_EventBase_C_IsTalkPart, ReturnValue) == 0x000000, "Member 'BP_EventBase_C_IsTalkPart::ReturnValue' has a wrong offset!");

// Function BP_EventBase.BP_EventBase_C.SetStaffSkip
// 0x0010 (0x0010 - 0x0000)
struct BP_EventBase_C_SetStaffSkip final
{
public:
	bool                                          Use;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C83[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_EventStaff;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventBase_C_SetStaffSkip) == 0x000008, "Wrong alignment on BP_EventBase_C_SetStaffSkip");
static_assert(sizeof(BP_EventBase_C_SetStaffSkip) == 0x000010, "Wrong size on BP_EventBase_C_SetStaffSkip");
static_assert(offsetof(BP_EventBase_C_SetStaffSkip, Use) == 0x000000, "Member 'BP_EventBase_C_SetStaffSkip::Use' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_SetStaffSkip, Param_EventStaff) == 0x000008, "Member 'BP_EventBase_C_SetStaffSkip::Param_EventStaff' has a wrong offset!");

// Function BP_EventBase.BP_EventBase_C.SetUniteSkip
// 0x0001 (0x0001 - 0x0000)
struct BP_EventBase_C_SetUniteSkip final
{
public:
	bool                                          Use;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventBase_C_SetUniteSkip) == 0x000001, "Wrong alignment on BP_EventBase_C_SetUniteSkip");
static_assert(sizeof(BP_EventBase_C_SetUniteSkip) == 0x000001, "Wrong size on BP_EventBase_C_SetUniteSkip");
static_assert(offsetof(BP_EventBase_C_SetUniteSkip, Use) == 0x000000, "Member 'BP_EventBase_C_SetUniteSkip::Use' has a wrong offset!");

// Function BP_EventBase.BP_EventBase_C.DebugOutputTextTime
// 0x0110 (0x0110 - 0x0000)
struct BP_EventBase_C_DebugOutputTextTime final
{
public:
	float                                         OutputTime;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTextFixTime_FixTime;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C84[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C85[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C86[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScriptMessage                         CallFunc_Array_Get_Item;                           // 0x0060(0x0040)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C87[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C88[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStrLenEvtDebug_ReturnValue;            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C89[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetVoiceAutoTime_ReturnValue;             // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C8A[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventBase_C_DebugOutputTextTime) == 0x000008, "Wrong alignment on BP_EventBase_C_DebugOutputTextTime");
static_assert(sizeof(BP_EventBase_C_DebugOutputTextTime) == 0x000110, "Wrong size on BP_EventBase_C_DebugOutputTextTime");
static_assert(offsetof(BP_EventBase_C_DebugOutputTextTime, OutputTime) == 0x000000, "Member 'BP_EventBase_C_DebugOutputTextTime::OutputTime' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugOutputTextTime, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_EventBase_C_DebugOutputTextTime::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugOutputTextTime, CallFunc_GetTextFixTime_FixTime) == 0x000008, "Member 'BP_EventBase_C_DebugOutputTextTime::CallFunc_GetTextFixTime_FixTime' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugOutputTextTime, CallFunc_Conv_FloatToString_ReturnValue) == 0x000010, "Member 'BP_EventBase_C_DebugOutputTextTime::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugOutputTextTime, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_EventBase_C_DebugOutputTextTime::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugOutputTextTime, CallFunc_Conv_IntToString_ReturnValue) == 0x000028, "Member 'BP_EventBase_C_DebugOutputTextTime::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugOutputTextTime, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'BP_EventBase_C_DebugOutputTextTime::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugOutputTextTime, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000048, "Member 'BP_EventBase_C_DebugOutputTextTime::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugOutputTextTime, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'BP_EventBase_C_DebugOutputTextTime::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugOutputTextTime, CallFunc_IsValid_ReturnValue) == 0x00005C, "Member 'BP_EventBase_C_DebugOutputTextTime::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugOutputTextTime, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_EventBase_C_DebugOutputTextTime::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugOutputTextTime, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'BP_EventBase_C_DebugOutputTextTime::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugOutputTextTime, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_EventBase_C_DebugOutputTextTime::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugOutputTextTime, CallFunc_Conv_TextToString_ReturnValue) == 0x0000A8, "Member 'BP_EventBase_C_DebugOutputTextTime::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugOutputTextTime, CallFunc_Add_IntInt_ReturnValue) == 0x0000B8, "Member 'BP_EventBase_C_DebugOutputTextTime::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugOutputTextTime, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000C0, "Member 'BP_EventBase_C_DebugOutputTextTime::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugOutputTextTime, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000D0, "Member 'BP_EventBase_C_DebugOutputTextTime::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugOutputTextTime, CallFunc_GetStrLenEvtDebug_ReturnValue) == 0x0000E0, "Member 'BP_EventBase_C_DebugOutputTextTime::CallFunc_GetStrLenEvtDebug_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugOutputTextTime, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000E8, "Member 'BP_EventBase_C_DebugOutputTextTime::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugOutputTextTime, CallFunc_GetVoiceAutoTime_ReturnValue) == 0x0000F8, "Member 'BP_EventBase_C_DebugOutputTextTime::CallFunc_GetVoiceAutoTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugOutputTextTime, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000100, "Member 'BP_EventBase_C_DebugOutputTextTime::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");

// Function BP_EventBase.BP_EventBase_C.IsPauseMovieEvent
// 0x0001 (0x0001 - 0x0000)
struct BP_EventBase_C_IsPauseMovieEvent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventBase_C_IsPauseMovieEvent) == 0x000001, "Wrong alignment on BP_EventBase_C_IsPauseMovieEvent");
static_assert(sizeof(BP_EventBase_C_IsPauseMovieEvent) == 0x000001, "Wrong size on BP_EventBase_C_IsPauseMovieEvent");
static_assert(offsetof(BP_EventBase_C_IsPauseMovieEvent, ReturnValue) == 0x000000, "Member 'BP_EventBase_C_IsPauseMovieEvent::ReturnValue' has a wrong offset!");

// Function BP_EventBase.BP_EventBase_C.IsPlayingMovieEvent
// 0x0001 (0x0001 - 0x0000)
struct BP_EventBase_C_IsPlayingMovieEvent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventBase_C_IsPlayingMovieEvent) == 0x000001, "Wrong alignment on BP_EventBase_C_IsPlayingMovieEvent");
static_assert(sizeof(BP_EventBase_C_IsPlayingMovieEvent) == 0x000001, "Wrong size on BP_EventBase_C_IsPlayingMovieEvent");
static_assert(offsetof(BP_EventBase_C_IsPlayingMovieEvent, ReturnValue) == 0x000000, "Member 'BP_EventBase_C_IsPlayingMovieEvent::ReturnValue' has a wrong offset!");

// Function BP_EventBase.BP_EventBase_C.DebugPrintAperture
// 0x0070 (0x0070 - 0x0000)
struct BP_EventBase_C_DebugPrintAperture final
{
public:
	bool                                          CallFunc_IsDebugPrintAperture_NewParam;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C8B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCineCameraComponent*                   CallFunc_GetCineCameraComponent_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventBase_C_DebugPrintAperture) == 0x000008, "Wrong alignment on BP_EventBase_C_DebugPrintAperture");
static_assert(sizeof(BP_EventBase_C_DebugPrintAperture) == 0x000070, "Wrong size on BP_EventBase_C_DebugPrintAperture");
static_assert(offsetof(BP_EventBase_C_DebugPrintAperture, CallFunc_IsDebugPrintAperture_NewParam) == 0x000000, "Member 'BP_EventBase_C_DebugPrintAperture::CallFunc_IsDebugPrintAperture_NewParam' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugPrintAperture, CallFunc_GetCineCameraComponent_ReturnValue) == 0x000008, "Member 'BP_EventBase_C_DebugPrintAperture::CallFunc_GetCineCameraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugPrintAperture, CallFunc_Conv_FloatToString_ReturnValue) == 0x000010, "Member 'BP_EventBase_C_DebugPrintAperture::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugPrintAperture, CallFunc_Conv_FloatToString_ReturnValue_1) == 0x000020, "Member 'BP_EventBase_C_DebugPrintAperture::CallFunc_Conv_FloatToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugPrintAperture, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'BP_EventBase_C_DebugPrintAperture::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugPrintAperture, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000040, "Member 'BP_EventBase_C_DebugPrintAperture::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugPrintAperture, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000050, "Member 'BP_EventBase_C_DebugPrintAperture::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_DebugPrintAperture, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000060, "Member 'BP_EventBase_C_DebugPrintAperture::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");

// Function BP_EventBase.BP_EventBase_C.InterpolationEvent
// 0x0004 (0x0004 - 0x0000)
struct BP_EventBase_C_InterpolationEvent final
{
public:
	int32                                         Type;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventBase_C_InterpolationEvent) == 0x000004, "Wrong alignment on BP_EventBase_C_InterpolationEvent");
static_assert(sizeof(BP_EventBase_C_InterpolationEvent) == 0x000004, "Wrong size on BP_EventBase_C_InterpolationEvent");
static_assert(offsetof(BP_EventBase_C_InterpolationEvent, Type) == 0x000000, "Member 'BP_EventBase_C_InterpolationEvent::Type' has a wrong offset!");

// Function BP_EventBase.BP_EventBase_C.ChangeMovieLanguage
// 0x0030 (0x0030 - 0x0000)
struct BP_EventBase_C_ChangeMovieLanguage final
{
public:
	class FString                                 Culture;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetVoiceLanguage_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C8C[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetCurrentAssetGroupCulture_ReturnValue;  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsJpEdition_ReturnValue;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventBase_C_ChangeMovieLanguage) == 0x000008, "Wrong alignment on BP_EventBase_C_ChangeMovieLanguage");
static_assert(sizeof(BP_EventBase_C_ChangeMovieLanguage) == 0x000030, "Wrong size on BP_EventBase_C_ChangeMovieLanguage");
static_assert(offsetof(BP_EventBase_C_ChangeMovieLanguage, Culture) == 0x000000, "Member 'BP_EventBase_C_ChangeMovieLanguage::Culture' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMovieLanguage, CallFunc_GetVoiceLanguage_ReturnValue) == 0x000010, "Member 'BP_EventBase_C_ChangeMovieLanguage::CallFunc_GetVoiceLanguage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMovieLanguage, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'BP_EventBase_C_ChangeMovieLanguage::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMovieLanguage, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000028, "Member 'BP_EventBase_C_ChangeMovieLanguage::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMovieLanguage, CallFunc_SetCurrentAssetGroupCulture_ReturnValue) == 0x000029, "Member 'BP_EventBase_C_ChangeMovieLanguage::CallFunc_SetCurrentAssetGroupCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMovieLanguage, CallFunc_IsJpEdition_ReturnValue) == 0x00002A, "Member 'BP_EventBase_C_ChangeMovieLanguage::CallFunc_IsJpEdition_ReturnValue' has a wrong offset!");

// Function BP_EventBase.BP_EventBase_C.ChangeMapPostProcessEx
// 0x00E0 (0x00E0 - 0x0000)
struct BP_EventBase_C_ChangeMapPostProcessEx final
{
public:
	class UMaterialInterface*                     Param_PostProcessMaterial;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           ParameterName;                                     // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<float>                                 Value;                                             // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<float>                                 LValue;                                            // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           LName;                                             // 0x0038(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C8D[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C8E[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C8F[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APostProcessVolume*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0090(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C90[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APostProcessVolume*                     CallFunc_Array_Get_Item_1;                         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C91[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWeightedBlendable                     CallFunc_Array_Get_Item_2;                         // 0x00B8(0x0010)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C92[0x6];                                     // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable;               // 0x00D0(0x0010)(NoDestructor)
};
static_assert(alignof(BP_EventBase_C_ChangeMapPostProcessEx) == 0x000008, "Wrong alignment on BP_EventBase_C_ChangeMapPostProcessEx");
static_assert(sizeof(BP_EventBase_C_ChangeMapPostProcessEx) == 0x0000E0, "Wrong size on BP_EventBase_C_ChangeMapPostProcessEx");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, Param_PostProcessMaterial) == 0x000000, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::Param_PostProcessMaterial' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, ParameterName) == 0x000008, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::ParameterName' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, Value) == 0x000018, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::Value' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, LValue) == 0x000028, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::LValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, LName) == 0x000038, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::LName' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, Temp_int_Array_Index_Variable) == 0x000050, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, Temp_int_Array_Index_Variable_1) == 0x000054, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, Temp_int_Loop_Counter_Variable_1) == 0x000058, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, Temp_int_Array_Index_Variable_2) == 0x000060, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, CallFunc_Array_Get_Item) == 0x000064, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000070, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, Temp_int_Loop_Counter_Variable_2) == 0x00007C, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, CallFunc_Array_Add_ReturnValue) == 0x000080, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, CallFunc_Add_IntInt_ReturnValue_2) == 0x000088, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, CallFunc_GetAllActorsOfClass_OutActors) == 0x000090, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, CallFunc_Array_Get_Item_1) == 0x0000A8, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B0, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, CallFunc_Array_Length_ReturnValue_2) == 0x0000B4, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, CallFunc_Array_Get_Item_2) == 0x0000B8, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000C8, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000C9, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcessEx, K2Node_MakeStruct_WeightedBlendable) == 0x0000D0, "Member 'BP_EventBase_C_ChangeMapPostProcessEx::K2Node_MakeStruct_WeightedBlendable' has a wrong offset!");

// Function BP_EventBase.BP_EventBase_C.RevertMapPostProcess
// 0x0088 (0x0088 - 0x0000)
struct BP_EventBase_C_RevertMapPostProcess final
{
public:
	class UMaterialInterface*                     LMaterial;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C93[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C94[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APostProcessVolume*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0028(0x0010)(ReferenceParm)
	class APostProcessVolume*                     CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C95[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightedBlendable                     CallFunc_Array_Get_Item_1;                         // 0x0048(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C96[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C97[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable;               // 0x0070(0x0010)(NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventBase_C_RevertMapPostProcess) == 0x000008, "Wrong alignment on BP_EventBase_C_RevertMapPostProcess");
static_assert(sizeof(BP_EventBase_C_RevertMapPostProcess) == 0x000088, "Wrong size on BP_EventBase_C_RevertMapPostProcess");
static_assert(offsetof(BP_EventBase_C_RevertMapPostProcess, LMaterial) == 0x000000, "Member 'BP_EventBase_C_RevertMapPostProcess::LMaterial' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_RevertMapPostProcess, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_EventBase_C_RevertMapPostProcess::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_RevertMapPostProcess, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_EventBase_C_RevertMapPostProcess::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_RevertMapPostProcess, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_EventBase_C_RevertMapPostProcess::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_RevertMapPostProcess, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'BP_EventBase_C_RevertMapPostProcess::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_RevertMapPostProcess, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_EventBase_C_RevertMapPostProcess::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_RevertMapPostProcess, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BP_EventBase_C_RevertMapPostProcess::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_RevertMapPostProcess, Temp_int_Array_Index_Variable_1) == 0x000020, "Member 'BP_EventBase_C_RevertMapPostProcess::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_RevertMapPostProcess, CallFunc_GetAllActorsOfClass_OutActors) == 0x000028, "Member 'BP_EventBase_C_RevertMapPostProcess::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_RevertMapPostProcess, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_EventBase_C_RevertMapPostProcess::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_RevertMapPostProcess, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_EventBase_C_RevertMapPostProcess::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_RevertMapPostProcess, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'BP_EventBase_C_RevertMapPostProcess::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_RevertMapPostProcess, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'BP_EventBase_C_RevertMapPostProcess::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_RevertMapPostProcess, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'BP_EventBase_C_RevertMapPostProcess::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_RevertMapPostProcess, CallFunc_Less_IntInt_ReturnValue_1) == 0x00005C, "Member 'BP_EventBase_C_RevertMapPostProcess::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_RevertMapPostProcess, K2Node_DynamicCast_AsMaterial_Instance_Dynamic) == 0x000060, "Member 'BP_EventBase_C_RevertMapPostProcess::K2Node_DynamicCast_AsMaterial_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_RevertMapPostProcess, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_EventBase_C_RevertMapPostProcess::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_RevertMapPostProcess, CallFunc_Array_Find_ReturnValue) == 0x00006C, "Member 'BP_EventBase_C_RevertMapPostProcess::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_RevertMapPostProcess, K2Node_MakeStruct_WeightedBlendable) == 0x000070, "Member 'BP_EventBase_C_RevertMapPostProcess::K2Node_MakeStruct_WeightedBlendable' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_RevertMapPostProcess, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000080, "Member 'BP_EventBase_C_RevertMapPostProcess::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_RevertMapPostProcess, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000081, "Member 'BP_EventBase_C_RevertMapPostProcess::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_RevertMapPostProcess, K2Node_SwitchInteger_CmpSuccess) == 0x000082, "Member 'BP_EventBase_C_RevertMapPostProcess::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function BP_EventBase.BP_EventBase_C.ChangeMapPostProcess
// 0x0098 (0x0098 - 0x0000)
struct BP_EventBase_C_ChangeMapPostProcess final
{
public:
	int32                                         Daath;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DownIntensity;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TopIntensity;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C98[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     LMaterial;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C99[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C9A[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APostProcessVolume*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0040(0x0010)(ReferenceParm)
	class APostProcessVolume*                     CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C9B[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C9C[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C9D[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightedBlendable                     CallFunc_Array_Get_Item_1;                         // 0x0070(0x0010)(NoDestructor)
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable;               // 0x0080(0x0010)(NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventBase_C_ChangeMapPostProcess) == 0x000008, "Wrong alignment on BP_EventBase_C_ChangeMapPostProcess");
static_assert(sizeof(BP_EventBase_C_ChangeMapPostProcess) == 0x000098, "Wrong size on BP_EventBase_C_ChangeMapPostProcess");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, Daath) == 0x000000, "Member 'BP_EventBase_C_ChangeMapPostProcess::Daath' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, DownIntensity) == 0x000004, "Member 'BP_EventBase_C_ChangeMapPostProcess::DownIntensity' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, TopIntensity) == 0x000008, "Member 'BP_EventBase_C_ChangeMapPostProcess::TopIntensity' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, LMaterial) == 0x000010, "Member 'BP_EventBase_C_ChangeMapPostProcess::LMaterial' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'BP_EventBase_C_ChangeMapPostProcess::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_EventBase_C_ChangeMapPostProcess::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_EventBase_C_ChangeMapPostProcess::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BP_EventBase_C_ChangeMapPostProcess::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000028, "Member 'BP_EventBase_C_ChangeMapPostProcess::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, Temp_int_Loop_Counter_Variable_1) == 0x00002C, "Member 'BP_EventBase_C_ChangeMapPostProcess::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000030, "Member 'BP_EventBase_C_ChangeMapPostProcess::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'BP_EventBase_C_ChangeMapPostProcess::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, CallFunc_Array_Add_ReturnValue) == 0x00003C, "Member 'BP_EventBase_C_ChangeMapPostProcess::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, CallFunc_GetAllActorsOfClass_OutActors) == 0x000040, "Member 'BP_EventBase_C_ChangeMapPostProcess::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_EventBase_C_ChangeMapPostProcess::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_EventBase_C_ChangeMapPostProcess::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'BP_EventBase_C_ChangeMapPostProcess::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'BP_EventBase_C_ChangeMapPostProcess::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, CallFunc_Less_IntInt_ReturnValue_1) == 0x000064, "Member 'BP_EventBase_C_ChangeMapPostProcess::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, Temp_int_Array_Index_Variable_1) == 0x000068, "Member 'BP_EventBase_C_ChangeMapPostProcess::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'BP_EventBase_C_ChangeMapPostProcess::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, K2Node_MakeStruct_WeightedBlendable) == 0x000080, "Member 'BP_EventBase_C_ChangeMapPostProcess::K2Node_MakeStruct_WeightedBlendable' has a wrong offset!");
static_assert(offsetof(BP_EventBase_C_ChangeMapPostProcess, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000090, "Member 'BP_EventBase_C_ChangeMapPostProcess::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_EventBase.BP_EventBase_C.SetMotionBlur
// 0x0001 (0x0001 - 0x0000)
struct BP_EventBase_C_SetMotionBlur final
{
public:
	bool                                          Switch;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
