#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EstomaCtrl

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EstomaCtrl.BP_EstomaCtrl_C
// 0x0028 (0x0248 - 0x0220)
class ABP_EstomaCtrl_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	E_MOON_AGE                                    MoonAge;                                           // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MOON_AGE                                    PrevMoonAge;                                       // 0x0231(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_883E[0x2];                                     // 0x0232(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MoonChangeCount;                                   // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_EstomaData_C*                       EstomaData;                                        // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PrevRiberama;                                      // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void LogMagatsuhi();
	void GetMagatsuhi_WhenChangeMoon(int32* Magatsuhi);
	void GetMagatsuhi_WhenUsed(int32* Magatsuhi);
	void CloseAActionWindow();
	void OpenAActionWindow();
	void ReceiveTick(float DeltaSeconds);
	void CallStartButton();
	void RestartEstoma_FromOtherMap();
	void CallEndButton();
	void ReceiveBeginPlay();
	void EndEstoma();
	void ExecuteUbergraph_BP_EstomaCtrl(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EstomaCtrl_C">();
	}
	static class ABP_EstomaCtrl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EstomaCtrl_C>();
	}
};
static_assert(alignof(ABP_EstomaCtrl_C) == 0x000008, "Wrong alignment on ABP_EstomaCtrl_C");
static_assert(sizeof(ABP_EstomaCtrl_C) == 0x000248, "Wrong size on ABP_EstomaCtrl_C");
static_assert(offsetof(ABP_EstomaCtrl_C, UberGraphFrame) == 0x000220, "Member 'ABP_EstomaCtrl_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EstomaCtrl_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_EstomaCtrl_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_EstomaCtrl_C, MoonAge) == 0x000230, "Member 'ABP_EstomaCtrl_C::MoonAge' has a wrong offset!");
static_assert(offsetof(ABP_EstomaCtrl_C, PrevMoonAge) == 0x000231, "Member 'ABP_EstomaCtrl_C::PrevMoonAge' has a wrong offset!");
static_assert(offsetof(ABP_EstomaCtrl_C, MoonChangeCount) == 0x000234, "Member 'ABP_EstomaCtrl_C::MoonChangeCount' has a wrong offset!");
static_assert(offsetof(ABP_EstomaCtrl_C, EstomaData) == 0x000238, "Member 'ABP_EstomaCtrl_C::EstomaData' has a wrong offset!");
static_assert(offsetof(ABP_EstomaCtrl_C, PrevRiberama) == 0x000240, "Member 'ABP_EstomaCtrl_C::PrevRiberama' has a wrong offset!");

}

