#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventScriptArea_Add

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EventScriptArea_Add.BP_EventScriptArea_Add_C
// 0x0058 (0x0278 - 0x0220)
class ABP_EventScriptArea_Add_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          UnloadBox;                                         // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          LoadBox;                                           // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             ScriptBeginOverlap;                                // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             ScriptEndOverlap;                                  // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          ActiveArea;                                        // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FD3[0x3];                                     // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoxSize;                                           // 0x0264(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BoxDiff;                                           // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugPrintBoxDiff;                                 // 0x0274(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ScriptBeginOverlap__DelegateSignature();
	void ScriptEndOverlap__DelegateSignature();
	void ExecuteUbergraph_BP_EventScriptArea_Add(int32 EntryPoint);
	void BndEvt__UnloadBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__LoadBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EventScriptArea_Add_C">();
	}
	static class ABP_EventScriptArea_Add_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EventScriptArea_Add_C>();
	}
};
static_assert(alignof(ABP_EventScriptArea_Add_C) == 0x000008, "Wrong alignment on ABP_EventScriptArea_Add_C");
static_assert(sizeof(ABP_EventScriptArea_Add_C) == 0x000278, "Wrong size on ABP_EventScriptArea_Add_C");
static_assert(offsetof(ABP_EventScriptArea_Add_C, UberGraphFrame) == 0x000220, "Member 'ABP_EventScriptArea_Add_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EventScriptArea_Add_C, UnloadBox) == 0x000228, "Member 'ABP_EventScriptArea_Add_C::UnloadBox' has a wrong offset!");
static_assert(offsetof(ABP_EventScriptArea_Add_C, LoadBox) == 0x000230, "Member 'ABP_EventScriptArea_Add_C::LoadBox' has a wrong offset!");
static_assert(offsetof(ABP_EventScriptArea_Add_C, DefaultSceneRoot) == 0x000238, "Member 'ABP_EventScriptArea_Add_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_EventScriptArea_Add_C, ScriptBeginOverlap) == 0x000240, "Member 'ABP_EventScriptArea_Add_C::ScriptBeginOverlap' has a wrong offset!");
static_assert(offsetof(ABP_EventScriptArea_Add_C, ScriptEndOverlap) == 0x000250, "Member 'ABP_EventScriptArea_Add_C::ScriptEndOverlap' has a wrong offset!");
static_assert(offsetof(ABP_EventScriptArea_Add_C, ActiveArea) == 0x000260, "Member 'ABP_EventScriptArea_Add_C::ActiveArea' has a wrong offset!");
static_assert(offsetof(ABP_EventScriptArea_Add_C, BoxSize) == 0x000264, "Member 'ABP_EventScriptArea_Add_C::BoxSize' has a wrong offset!");
static_assert(offsetof(ABP_EventScriptArea_Add_C, BoxDiff) == 0x000270, "Member 'ABP_EventScriptArea_Add_C::BoxDiff' has a wrong offset!");
static_assert(offsetof(ABP_EventScriptArea_Add_C, DebugPrintBoxDiff) == 0x000274, "Member 'ABP_EventScriptArea_Add_C::DebugPrintBoxDiff' has a wrong offset!");

}

