#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EncountAreaDaath_Box

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_EncountArea_Dungeon_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EncountAreaDaath_Box.BP_EncountAreaDaath_Box_C
// 0x0010 (0x0C50 - 0x0C40)
class ABP_EncountAreaDaath_Box_C final : public ABP_EncountArea_Dungeon_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_EncountAreaDaath_Box_C;          // 0x0C40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          NewVar_0_0;                                        // 0x0C48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsFly;                                             // 0x0C49(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_EncountAreaDaath_Box(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void CalcSpawnPointList(bool LineTrace, TArray<struct FTransform>* Param_SpawnPointList);
	void SetView(bool IsView, bool* NewParam);
	void CheckFly(bool* Param_IsFly);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EncountAreaDaath_Box_C">();
	}
	static class ABP_EncountAreaDaath_Box_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EncountAreaDaath_Box_C>();
	}
};
static_assert(alignof(ABP_EncountAreaDaath_Box_C) == 0x000010, "Wrong alignment on ABP_EncountAreaDaath_Box_C");
static_assert(sizeof(ABP_EncountAreaDaath_Box_C) == 0x000C50, "Wrong size on ABP_EncountAreaDaath_Box_C");
static_assert(offsetof(ABP_EncountAreaDaath_Box_C, UberGraphFrame_BP_EncountAreaDaath_Box_C) == 0x000C40, "Member 'ABP_EncountAreaDaath_Box_C::UberGraphFrame_BP_EncountAreaDaath_Box_C' has a wrong offset!");
static_assert(offsetof(ABP_EncountAreaDaath_Box_C, NewVar_0_0) == 0x000C48, "Member 'ABP_EncountAreaDaath_Box_C::NewVar_0_0' has a wrong offset!");
static_assert(offsetof(ABP_EncountAreaDaath_Box_C, IsFly) == 0x000C49, "Member 'ABP_EncountAreaDaath_Box_C::IsFly' has a wrong offset!");

}

