#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EncountAreaDaath_Box

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_EncountAreaDaath_Box.BP_EncountAreaDaath_Box_C.ExecuteUbergraph_BP_EncountAreaDaath_Box
// 0x0008 (0x0008 - 0x0000)
struct BP_EncountAreaDaath_Box_C_ExecuteUbergraph_BP_EncountAreaDaath_Box final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetView_NewParam;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EncountAreaDaath_Box_C_ExecuteUbergraph_BP_EncountAreaDaath_Box) == 0x000004, "Wrong alignment on BP_EncountAreaDaath_Box_C_ExecuteUbergraph_BP_EncountAreaDaath_Box");
static_assert(sizeof(BP_EncountAreaDaath_Box_C_ExecuteUbergraph_BP_EncountAreaDaath_Box) == 0x000008, "Wrong size on BP_EncountAreaDaath_Box_C_ExecuteUbergraph_BP_EncountAreaDaath_Box");
static_assert(offsetof(BP_EncountAreaDaath_Box_C_ExecuteUbergraph_BP_EncountAreaDaath_Box, EntryPoint) == 0x000000, "Member 'BP_EncountAreaDaath_Box_C_ExecuteUbergraph_BP_EncountAreaDaath_Box::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaDaath_Box_C_ExecuteUbergraph_BP_EncountAreaDaath_Box, CallFunc_SetView_NewParam) == 0x000004, "Member 'BP_EncountAreaDaath_Box_C_ExecuteUbergraph_BP_EncountAreaDaath_Box::CallFunc_SetView_NewParam' has a wrong offset!");

// Function BP_EncountAreaDaath_Box.BP_EncountAreaDaath_Box_C.UserConstructionScript
// 0x001C (0x001C - 0x0000)
struct BP_EncountAreaDaath_Box_C_UserConstructionScript final
{
public:
	struct FVector                                L_Pos;                                             // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_Index2;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_index1;                                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_Num;                                             // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_Width;                                           // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EncountAreaDaath_Box_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_EncountAreaDaath_Box_C_UserConstructionScript");
static_assert(sizeof(BP_EncountAreaDaath_Box_C_UserConstructionScript) == 0x00001C, "Wrong size on BP_EncountAreaDaath_Box_C_UserConstructionScript");
static_assert(offsetof(BP_EncountAreaDaath_Box_C_UserConstructionScript, L_Pos) == 0x000000, "Member 'BP_EncountAreaDaath_Box_C_UserConstructionScript::L_Pos' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaDaath_Box_C_UserConstructionScript, L_Index2) == 0x00000C, "Member 'BP_EncountAreaDaath_Box_C_UserConstructionScript::L_Index2' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaDaath_Box_C_UserConstructionScript, L_index1) == 0x000010, "Member 'BP_EncountAreaDaath_Box_C_UserConstructionScript::L_index1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaDaath_Box_C_UserConstructionScript, L_Num) == 0x000014, "Member 'BP_EncountAreaDaath_Box_C_UserConstructionScript::L_Num' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaDaath_Box_C_UserConstructionScript, L_Width) == 0x000018, "Member 'BP_EncountAreaDaath_Box_C_UserConstructionScript::L_Width' has a wrong offset!");

// Function BP_EncountAreaDaath_Box.BP_EncountAreaDaath_Box_C.CalcSpawnPointList
// 0x0028 (0x0028 - 0x0000)
struct BP_EncountAreaDaath_Box_C_CalcSpawnPointList final
{
public:
	bool                                          LineTrace;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E7A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     Param_SpawnPointList;                              // 0x0008(0x0010)(Parm, OutParm)
	TArray<struct FTransform>                     L_Pos;                                             // 0x0018(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(BP_EncountAreaDaath_Box_C_CalcSpawnPointList) == 0x000008, "Wrong alignment on BP_EncountAreaDaath_Box_C_CalcSpawnPointList");
static_assert(sizeof(BP_EncountAreaDaath_Box_C_CalcSpawnPointList) == 0x000028, "Wrong size on BP_EncountAreaDaath_Box_C_CalcSpawnPointList");
static_assert(offsetof(BP_EncountAreaDaath_Box_C_CalcSpawnPointList, LineTrace) == 0x000000, "Member 'BP_EncountAreaDaath_Box_C_CalcSpawnPointList::LineTrace' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaDaath_Box_C_CalcSpawnPointList, Param_SpawnPointList) == 0x000008, "Member 'BP_EncountAreaDaath_Box_C_CalcSpawnPointList::Param_SpawnPointList' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaDaath_Box_C_CalcSpawnPointList, L_Pos) == 0x000018, "Member 'BP_EncountAreaDaath_Box_C_CalcSpawnPointList::L_Pos' has a wrong offset!");

// Function BP_EncountAreaDaath_Box.BP_EncountAreaDaath_Box_C.SetView
// 0x0007 (0x0007 - 0x0000)
struct BP_EncountAreaDaath_Box_C_SetView final
{
public:
	bool                                          IsView;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NewParam;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDebugVolumeHidden_Hidden;              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetView_NewParam;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDebugVolumeHidden_Hidden_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IS_EDITOR_BUILD_ReturnValue;              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EncountAreaDaath_Box_C_SetView) == 0x000001, "Wrong alignment on BP_EncountAreaDaath_Box_C_SetView");
static_assert(sizeof(BP_EncountAreaDaath_Box_C_SetView) == 0x000007, "Wrong size on BP_EncountAreaDaath_Box_C_SetView");
static_assert(offsetof(BP_EncountAreaDaath_Box_C_SetView, IsView) == 0x000000, "Member 'BP_EncountAreaDaath_Box_C_SetView::IsView' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaDaath_Box_C_SetView, NewParam) == 0x000001, "Member 'BP_EncountAreaDaath_Box_C_SetView::NewParam' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaDaath_Box_C_SetView, CallFunc_GetDebugVolumeHidden_Hidden) == 0x000002, "Member 'BP_EncountAreaDaath_Box_C_SetView::CallFunc_GetDebugVolumeHidden_Hidden' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaDaath_Box_C_SetView, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'BP_EncountAreaDaath_Box_C_SetView::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaDaath_Box_C_SetView, CallFunc_SetView_NewParam) == 0x000004, "Member 'BP_EncountAreaDaath_Box_C_SetView::CallFunc_SetView_NewParam' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaDaath_Box_C_SetView, CallFunc_GetDebugVolumeHidden_Hidden_1) == 0x000005, "Member 'BP_EncountAreaDaath_Box_C_SetView::CallFunc_GetDebugVolumeHidden_Hidden_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaDaath_Box_C_SetView, CallFunc_IS_EDITOR_BUILD_ReturnValue) == 0x000006, "Member 'BP_EncountAreaDaath_Box_C_SetView::CallFunc_IS_EDITOR_BUILD_ReturnValue' has a wrong offset!");

// Function BP_EncountAreaDaath_Box.BP_EncountAreaDaath_Box_C.CheckFly
// 0x0001 (0x0001 - 0x0000)
struct BP_EncountAreaDaath_Box_C_CheckFly final
{
public:
	bool                                          Param_IsFly;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EncountAreaDaath_Box_C_CheckFly) == 0x000001, "Wrong alignment on BP_EncountAreaDaath_Box_C_CheckFly");
static_assert(sizeof(BP_EncountAreaDaath_Box_C_CheckFly) == 0x000001, "Wrong size on BP_EncountAreaDaath_Box_C_CheckFly");
static_assert(offsetof(BP_EncountAreaDaath_Box_C_CheckFly, Param_IsFly) == 0x000000, "Member 'BP_EncountAreaDaath_Box_C_CheckFly::Param_IsFly' has a wrong offset!");

}

