#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_esNPC_m061_29

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_esNPC_m061_29.BP_esNPC_m061_29_C.ExecuteUbergraph_BP_esNPC_m061_29
// 0x0060 (0x0060 - 0x0000)
struct BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_OldNewRoute                                 CallFunc_GetOldNewRoute_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_498B[0xB];                                     // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_498C[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANpc706_C*                              CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActive_IsActive;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_1;             // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29) == 0x000010, "Wrong alignment on BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29");
static_assert(sizeof(BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29) == 0x000060, "Wrong size on BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29");
static_assert(offsetof(BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29, EntryPoint) == 0x000000, "Member 'BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29, CallFunc_GetOldNewRoute_ReturnValue) == 0x000004, "Member 'BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29::CallFunc_GetOldNewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000040, "Member 'BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000048, "Member 'BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29, CallFunc_FinishSpawningActor_ReturnValue) == 0x000050, "Member 'BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29, CallFunc_GetActive_IsActive) == 0x000058, "Member 'BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29::CallFunc_GetActive_IsActive' has a wrong offset!");
static_assert(offsetof(BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29, CallFunc_CheckEventFlag_ReturnValue) == 0x000059, "Member 'BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29, CallFunc_CheckEventFlag_ReturnValue_1) == 0x00005A, "Member 'BP_esNPC_m061_29_C_ExecuteUbergraph_BP_esNPC_m061_29::CallFunc_CheckEventFlag_ReturnValue_1' has a wrong offset!");

}

