#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ENVArea

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ENVArea.BP_ENVArea_C
// 0x0028 (0x0248 - 0x0220)
class ABP_ENVArea_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          ENVCue;                                            // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SphereFadeArea_C*                   FadeAreaActor;                                     // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ENVArea(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ENVArea_C">();
	}
	static class ABP_ENVArea_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ENVArea_C>();
	}
};
static_assert(alignof(ABP_ENVArea_C) == 0x000008, "Wrong alignment on ABP_ENVArea_C");
static_assert(sizeof(ABP_ENVArea_C) == 0x000248, "Wrong size on ABP_ENVArea_C");
static_assert(offsetof(ABP_ENVArea_C, UberGraphFrame) == 0x000220, "Member 'ABP_ENVArea_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ENVArea_C, Box) == 0x000228, "Member 'ABP_ENVArea_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_ENVArea_C, Root) == 0x000230, "Member 'ABP_ENVArea_C::Root' has a wrong offset!");
static_assert(offsetof(ABP_ENVArea_C, ENVCue) == 0x000238, "Member 'ABP_ENVArea_C::ENVCue' has a wrong offset!");
static_assert(offsetof(ABP_ENVArea_C, FadeAreaActor) == 0x000240, "Member 'ABP_ENVArea_C::FadeAreaActor' has a wrong offset!");

}

