#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventStatueLvUp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EventStatueLvUp.BP_EventStatueLvUp_C
// 0x0048 (0x0268 - 0x0220)
class ABP_EventStatueLvUp_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EBgmScene                                     BeforeBGMScene;                                    // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_962D[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 ItemId;                                            // 0x0238(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 ItemCnt;                                           // 0x0248(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_ResultMain_C*                       ResultMain;                                        // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Finish;                                            // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Initialized;                                       // 0x0261(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_EventStatueLvUp(int32 EntryPoint);
	void Initialize();
	void ResultFinish();
	void Start();
	void GetFinish(bool* IsFinish);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EventStatueLvUp_C">();
	}
	static class ABP_EventStatueLvUp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EventStatueLvUp_C>();
	}
};
static_assert(alignof(ABP_EventStatueLvUp_C) == 0x000008, "Wrong alignment on ABP_EventStatueLvUp_C");
static_assert(sizeof(ABP_EventStatueLvUp_C) == 0x000268, "Wrong size on ABP_EventStatueLvUp_C");
static_assert(offsetof(ABP_EventStatueLvUp_C, UberGraphFrame) == 0x000220, "Member 'ABP_EventStatueLvUp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EventStatueLvUp_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_EventStatueLvUp_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_EventStatueLvUp_C, BeforeBGMScene) == 0x000230, "Member 'ABP_EventStatueLvUp_C::BeforeBGMScene' has a wrong offset!");
static_assert(offsetof(ABP_EventStatueLvUp_C, ItemId) == 0x000238, "Member 'ABP_EventStatueLvUp_C::ItemId' has a wrong offset!");
static_assert(offsetof(ABP_EventStatueLvUp_C, ItemCnt) == 0x000248, "Member 'ABP_EventStatueLvUp_C::ItemCnt' has a wrong offset!");
static_assert(offsetof(ABP_EventStatueLvUp_C, ResultMain) == 0x000258, "Member 'ABP_EventStatueLvUp_C::ResultMain' has a wrong offset!");
static_assert(offsetof(ABP_EventStatueLvUp_C, Finish) == 0x000260, "Member 'ABP_EventStatueLvUp_C::Finish' has a wrong offset!");
static_assert(offsetof(ABP_EventStatueLvUp_C, Initialized) == 0x000261, "Member 'ABP_EventStatueLvUp_C::Initialized' has a wrong offset!");

}

