#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventDefaultAO

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EventDefaultAO_Struct_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EventDefaultAO.BP_EventDefaultAO_C
// 0x0028 (0x0248 - 0x0220)
class ABP_EventDefaultAO_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FEventDefaultAO_Struct>         SaveSetting;                                       // 0x0230(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ChangeSetting;                                     // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ExecuteUbergraph_BP_EventDefaultAO(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EventDefaultAO_C">();
	}
	static class ABP_EventDefaultAO_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EventDefaultAO_C>();
	}
};
static_assert(alignof(ABP_EventDefaultAO_C) == 0x000008, "Wrong alignment on ABP_EventDefaultAO_C");
static_assert(sizeof(ABP_EventDefaultAO_C) == 0x000248, "Wrong size on ABP_EventDefaultAO_C");
static_assert(offsetof(ABP_EventDefaultAO_C, UberGraphFrame) == 0x000220, "Member 'ABP_EventDefaultAO_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EventDefaultAO_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_EventDefaultAO_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_EventDefaultAO_C, SaveSetting) == 0x000230, "Member 'ABP_EventDefaultAO_C::SaveSetting' has a wrong offset!");
static_assert(offsetof(ABP_EventDefaultAO_C, ChangeSetting) == 0x000240, "Member 'ABP_EventDefaultAO_C::ChangeSetting' has a wrong offset!");

}

