#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EncountSceneMainCtrl

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EncountSceneMainCtrl.BP_EncountSceneMainCtrl_C.ExecuteUbergraph_BP_EncountSceneMainCtrl
// 0x01C0 (0x01C0 - 0x0000)
struct BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetFOVAngle_ReturnValue;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0xC];                                       // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0070(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FadeOut_Black_ReturnValue;                // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FB[0x5];                                       // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue;                 // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Time;                                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ProjectGameInstance_C> K2Node_DynamicCast_AsBPI_Project_Game_Instance;    // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_SetEncountScene_NewParam;             // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_ProjectGameInstance_C> K2Node_DynamicCast_AsBPI_Project_Game_Instance_1;  // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_SetEncountScene_NewParam_1;           // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_ProjectGameInstance_C> K2Node_DynamicCast_AsBPI_Project_Game_Instance_2;  // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_SetEncountScene_NewParam_2;           // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APostProcessVolume*                     CallFunc_GetPostProcessVolume_Post;                // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APostProcessVolume*                     CallFunc_GetPostProcessVolume_Post_1;              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_EncountScene_C*                     CallFunc_Create_ReturnValue;                       // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue;              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl) == 0x000010, "Wrong alignment on BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl");
static_assert(sizeof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl) == 0x0001C0, "Wrong size on BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, EntryPoint) == 0x000000, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000008, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000010, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_GetCameraRotation_ReturnValue) == 0x000018, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_GetFOVAngle_ReturnValue) == 0x000024, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_GetFOVAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_GetCameraLocation_ReturnValue) == 0x000028, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000070, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0000F8, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_FadeOut_Black_ReturnValue) == 0x0000F9, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_FadeOut_Black_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_IsValid_ReturnValue) == 0x0000FA, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_SpawnSound2D_ReturnValue) == 0x000100, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_Get_ReturnValue) == 0x000108, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_Not_PreBool_ReturnValue) == 0x000110, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, K2Node_Event_Time) == 0x000114, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_GetGameInstance_ReturnValue) == 0x000118, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_FMax_ReturnValue) == 0x000120, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, K2Node_DynamicCast_AsBPI_Project_Game_Instance) == 0x000128, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::K2Node_DynamicCast_AsBPI_Project_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00013C, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_BPI_SetEncountScene_NewParam) == 0x000140, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_BPI_SetEncountScene_NewParam' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_GetGameInstance_ReturnValue_1) == 0x000148, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, K2Node_DynamicCast_AsBPI_Project_Game_Instance_1) == 0x000150, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::K2Node_DynamicCast_AsBPI_Project_Game_Instance_1' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, K2Node_DynamicCast_bSuccess_1) == 0x000160, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_BPI_SetEncountScene_NewParam_1) == 0x000161, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_BPI_SetEncountScene_NewParam_1' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_GetGameInstance_ReturnValue_2) == 0x000168, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, K2Node_DynamicCast_AsBPI_Project_Game_Instance_2) == 0x000170, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::K2Node_DynamicCast_AsBPI_Project_Game_Instance_2' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, K2Node_DynamicCast_bSuccess_2) == 0x000180, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_BPI_SetEncountScene_NewParam_2) == 0x000181, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_BPI_SetEncountScene_NewParam_2' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_GetPostProcessVolume_Post) == 0x000188, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_GetPostProcessVolume_Post' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_IsValid_ReturnValue_1) == 0x000190, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_GetPostProcessVolume_Post_1) == 0x000198, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_GetPostProcessVolume_Post_1' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_IsValid_ReturnValue_2) == 0x0001A0, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_Create_ReturnValue) == 0x0001A8, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl, CallFunc_AddToWidgetPrio_ReturnValue) == 0x0001B0, "Member 'BP_EncountSceneMainCtrl_C_ExecuteUbergraph_BP_EncountSceneMainCtrl::CallFunc_AddToWidgetPrio_ReturnValue' has a wrong offset!");

// Function BP_EncountSceneMainCtrl.BP_EncountSceneMainCtrl_C.BPI_EncountSceneFadeIn
// 0x0004 (0x0004 - 0x0000)
struct BP_EncountSceneMainCtrl_C_BPI_EncountSceneFadeIn final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EncountSceneMainCtrl_C_BPI_EncountSceneFadeIn) == 0x000004, "Wrong alignment on BP_EncountSceneMainCtrl_C_BPI_EncountSceneFadeIn");
static_assert(sizeof(BP_EncountSceneMainCtrl_C_BPI_EncountSceneFadeIn) == 0x000004, "Wrong size on BP_EncountSceneMainCtrl_C_BPI_EncountSceneFadeIn");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_BPI_EncountSceneFadeIn, Time) == 0x000000, "Member 'BP_EncountSceneMainCtrl_C_BPI_EncountSceneFadeIn::Time' has a wrong offset!");

// Function BP_EncountSceneMainCtrl.BP_EncountSceneMainCtrl_C.GetPostProcessVolume
// 0x0040 (0x0040 - 0x0000)
struct BP_EncountSceneMainCtrl_C_GetPostProcessVolume final
{
public:
	class APostProcessVolume*                     Post;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APostProcessVolume*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APostProcessVolume*                     CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EncountSceneMainCtrl_C_GetPostProcessVolume) == 0x000008, "Wrong alignment on BP_EncountSceneMainCtrl_C_GetPostProcessVolume");
static_assert(sizeof(BP_EncountSceneMainCtrl_C_GetPostProcessVolume) == 0x000040, "Wrong size on BP_EncountSceneMainCtrl_C_GetPostProcessVolume");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_GetPostProcessVolume, Post) == 0x000000, "Member 'BP_EncountSceneMainCtrl_C_GetPostProcessVolume::Post' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_GetPostProcessVolume, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_EncountSceneMainCtrl_C_GetPostProcessVolume::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_GetPostProcessVolume, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_EncountSceneMainCtrl_C_GetPostProcessVolume::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_GetPostProcessVolume, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_EncountSceneMainCtrl_C_GetPostProcessVolume::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_GetPostProcessVolume, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'BP_EncountSceneMainCtrl_C_GetPostProcessVolume::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_GetPostProcessVolume, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_EncountSceneMainCtrl_C_GetPostProcessVolume::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_GetPostProcessVolume, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_EncountSceneMainCtrl_C_GetPostProcessVolume::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_GetPostProcessVolume, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_EncountSceneMainCtrl_C_GetPostProcessVolume::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_GetPostProcessVolume, CallFunc_ActorHasTag_ReturnValue) == 0x000039, "Member 'BP_EncountSceneMainCtrl_C_GetPostProcessVolume::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");

// Function BP_EncountSceneMainCtrl.BP_EncountSceneMainCtrl_C.BPI_ReadyEncountSceneFade
// 0x0001 (0x0001 - 0x0000)
struct BP_EncountSceneMainCtrl_C_BPI_ReadyEncountSceneFade final
{
public:
	bool                                          Ready;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EncountSceneMainCtrl_C_BPI_ReadyEncountSceneFade) == 0x000001, "Wrong alignment on BP_EncountSceneMainCtrl_C_BPI_ReadyEncountSceneFade");
static_assert(sizeof(BP_EncountSceneMainCtrl_C_BPI_ReadyEncountSceneFade) == 0x000001, "Wrong size on BP_EncountSceneMainCtrl_C_BPI_ReadyEncountSceneFade");
static_assert(offsetof(BP_EncountSceneMainCtrl_C_BPI_ReadyEncountSceneFade, Ready) == 0x000000, "Member 'BP_EncountSceneMainCtrl_C_BPI_ReadyEncountSceneFade::Ready' has a wrong offset!");

}

