#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventNaviDevil316_Ippondatara

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "BP_EventMissionBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EventNaviDevil316_Ippondatara.BP_EventNaviDevil316_Ippondatara_C
// 0x0048 (0x0368 - 0x0320)
class ABP_EventNaviDevil316_Ippondatara_C final : public ABP_EventMissionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_EventNaviDevil316_Ippondatara_C; // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SelectIndex;                                       // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27F2[0x4];                                     // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    NaviMessageAsset;                                  // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  Spawn;                                             // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_NAVI_DEVIL                                  NaviDevilType;                                     // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27F3[0x3];                                     // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNaviDevilData                         NaviDevilData;                                     // 0x0344(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_27F4[0x4];                                     // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AutoRotateFocus_C*                  AutoRotateCtrl;                                    // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnPawn;                                         // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_EventNaviDevil316_Ippondatara(int32 EntryPoint);
	void QuestExecute();
	void ReceiveBeginPlay();
	void OnLoaded_EBE363AF48A425B496BADFB72AE3B454(class UObject* Loaded);
	void OnLoaded_88B27D2B42597E5BE6BC24A571D0ACCC(TSubclassOf<class UObject> Loaded);
	void OnLoaded_113C03D44DBBB647C7ECA9AE0F700A75(TSubclassOf<class UObject> Loaded);
	void BPI_CheckNaviDevil(bool* NaviDevil);
	void CallDeactivate();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EventNaviDevil316_Ippondatara_C">();
	}
	static class ABP_EventNaviDevil316_Ippondatara_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EventNaviDevil316_Ippondatara_C>();
	}
};
static_assert(alignof(ABP_EventNaviDevil316_Ippondatara_C) == 0x000008, "Wrong alignment on ABP_EventNaviDevil316_Ippondatara_C");
static_assert(sizeof(ABP_EventNaviDevil316_Ippondatara_C) == 0x000368, "Wrong size on ABP_EventNaviDevil316_Ippondatara_C");
static_assert(offsetof(ABP_EventNaviDevil316_Ippondatara_C, UberGraphFrame_BP_EventNaviDevil316_Ippondatara_C) == 0x000320, "Member 'ABP_EventNaviDevil316_Ippondatara_C::UberGraphFrame_BP_EventNaviDevil316_Ippondatara_C' has a wrong offset!");
static_assert(offsetof(ABP_EventNaviDevil316_Ippondatara_C, SelectIndex) == 0x000328, "Member 'ABP_EventNaviDevil316_Ippondatara_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(ABP_EventNaviDevil316_Ippondatara_C, NaviMessageAsset) == 0x000330, "Member 'ABP_EventNaviDevil316_Ippondatara_C::NaviMessageAsset' has a wrong offset!");
static_assert(offsetof(ABP_EventNaviDevil316_Ippondatara_C, Spawn) == 0x000338, "Member 'ABP_EventNaviDevil316_Ippondatara_C::Spawn' has a wrong offset!");
static_assert(offsetof(ABP_EventNaviDevil316_Ippondatara_C, NaviDevilType) == 0x000340, "Member 'ABP_EventNaviDevil316_Ippondatara_C::NaviDevilType' has a wrong offset!");
static_assert(offsetof(ABP_EventNaviDevil316_Ippondatara_C, NaviDevilData) == 0x000344, "Member 'ABP_EventNaviDevil316_Ippondatara_C::NaviDevilData' has a wrong offset!");
static_assert(offsetof(ABP_EventNaviDevil316_Ippondatara_C, AutoRotateCtrl) == 0x000358, "Member 'ABP_EventNaviDevil316_Ippondatara_C::AutoRotateCtrl' has a wrong offset!");
static_assert(offsetof(ABP_EventNaviDevil316_Ippondatara_C, SpawnPawn) == 0x000360, "Member 'ABP_EventNaviDevil316_Ippondatara_C::SpawnPawn' has a wrong offset!");

}

