#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EncountSceneCtrl

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EncountSceneCtrl.BP_EncountSceneCtrl_C
// 0x0020 (0x0240 - 0x0220)
class ABP_EncountSceneCtrl_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          NewEffect;                                         // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Danger;                                            // 0x0239(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_EncountSceneCtrl(int32 EntryPoint);
	void EvtDis_ReadyEncount______0();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EncountSceneCtrl_C">();
	}
	static class ABP_EncountSceneCtrl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EncountSceneCtrl_C>();
	}
};
static_assert(alignof(ABP_EncountSceneCtrl_C) == 0x000008, "Wrong alignment on ABP_EncountSceneCtrl_C");
static_assert(sizeof(ABP_EncountSceneCtrl_C) == 0x000240, "Wrong size on ABP_EncountSceneCtrl_C");
static_assert(offsetof(ABP_EncountSceneCtrl_C, UberGraphFrame) == 0x000220, "Member 'ABP_EncountSceneCtrl_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EncountSceneCtrl_C, SceneCaptureComponent2D) == 0x000228, "Member 'ABP_EncountSceneCtrl_C::SceneCaptureComponent2D' has a wrong offset!");
static_assert(offsetof(ABP_EncountSceneCtrl_C, DefaultSceneRoot) == 0x000230, "Member 'ABP_EncountSceneCtrl_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_EncountSceneCtrl_C, NewEffect) == 0x000238, "Member 'ABP_EncountSceneCtrl_C::NewEffect' has a wrong offset!");
static_assert(offsetof(ABP_EncountSceneCtrl_C, Danger) == 0x000239, "Member 'ABP_EncountSceneCtrl_C::Danger' has a wrong offset!");

}

