#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventScriptBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Project_structs.hpp"
#include "E_EVENT_TOILETMARK_TYPE_structs.hpp"
#include "AActionWindowTable_st_structs.hpp"


namespace SDK::Params
{

// Function BP_EventScriptBase.BP_EventScriptBase_C.ExecuteUbergraph_BP_EventScriptBase
// 0x06F0 (0x06F0 - 0x0000)
struct BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6B58[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B59[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_DynamicCast_AsAnim_Sequence_Base;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B5A[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B5B[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_EventScriptArea_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0088(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B5C[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B5D[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventScriptArea_C*                  CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B5E[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EventScript_C>    K2Node_DynamicCast_AsBPI_Event_Script;             // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SpawnReflesh_NoUse;                       // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B5F[0x2];                                     // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGazeTargetHolder*                      CallFunc_GetGazeTargetHolder_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_CheckMapPause_IsPause;                // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B60[0x5];                                     // 0x013B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_1;                    // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_1;             // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_CheckMapPause_IsPause_1;              // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Active;                               // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B61[0x4];                                     // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_2;                    // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMapEventHit_Type_AAction_C*            K2Node_DynamicCast_AsMap_Event_Hit_Type_AAction;   // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B62[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_2;             // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B63[0x3];                                     // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x018C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CheckActorBegunPlay_ReturnValue;          // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B64[0x3];                                     // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_3;                    // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_3;             // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B65[0x5];                                     // 0x01BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B66[0x4];                                     // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor;      // 0x01D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B67[0x6];                                     // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_BI_GetMeshComponent_MeshComp;             // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B68[0x7];                                     // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGazeTarget>           K2Node_DynamicCast_AsGaze_Target;                  // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B69[0x7];                                     // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0254(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B6A[0x3];                                     // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapEventHit_Type_INOUT_C*              K2Node_DynamicCast_AsMap_Event_Hit_Type_INOUT;     // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B6B[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0288(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0294(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_2;           // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x02AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_3;           // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue_1;                    // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B6C[0x4];                                     // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1;    // 0x02D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B6D[0x6];                                     // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_2;    // 0x02F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B6E[0x3];                                     // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B6F[0x7];                                     // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_3;                         // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_3;    // 0x0318(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B70[0x3];                                     // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BI_LookAt_NoUse;                          // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B71[0x2];                                     // 0x0332(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0334(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6B72[0x4];                                     // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapEventHit_Type_AAction_C*            K2Node_DynamicCast_AsMap_Event_Hit_Type_AAction_1; // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B73[0x7];                                     // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapEventHit_Type_INOUT_C*              K2Node_DynamicCast_AsMap_Event_Hit_Type_INOUT_1;   // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B74[0xF];                                     // 0x0361(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0370(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventScript_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_2;              // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_4;    // 0x03B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B75[0x7];                                     // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_BI_GetMeshComponent_MeshComp_1;           // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BI_LookAt_NoUse_1;                        // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B76[0x7];                                     // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_1;                        // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          CallFunc_GetCurrentBGM_ReturnValue;                // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBgmScene                                     CallFunc_GetBGMScene_ReturnValue;                  // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B77[0x3];                                     // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0400(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_4;                         // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAActionWindowTable_st                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x041C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x042A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B78[0x5];                                     // 0x042B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_2;                        // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0438(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B79[0x7];                                     // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonWindowCtrl_C> CallFunc_BPI_GetCommonWindowCtrl_OutActor;         // 0x0450(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_GetCommonWindowCtrl_Success;          // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B7A[0x7];                                     // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_3;                        // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0470(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B7B[0x7];                                     // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonWindowCtrl_C> CallFunc_BPI_GetCommonWindowCtrl_OutActor_1;       // 0x0488(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_GetCommonWindowCtrl_Success_1;        // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B7C[0x7];                                     // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_4;                        // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x04A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_19;                    // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B7D[0x7];                                     // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_5;                        // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CommonWindowCtrl_C> CallFunc_BPI_GetCommonWindowCtrl_OutActor_2;       // 0x04C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_GetCommonWindowCtrl_Success_2;        // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B7E[0x7];                                     // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_6;                        // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue;            // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMapID_ReturnValue;                     // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B7F[0x4];                                     // 0x04F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapEventHit_Type_AAction_C*            K2Node_DynamicCast_AsMap_Event_Hit_Type_AAction_2; // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_20;                    // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B80[0x3];                                     // 0x0501(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAreaID_ReturnValue;                    // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStaticMinimapEntry_Found;              // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B81[0x3];                                     // 0x0509(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMinimapPOIEntry                       CallFunc_GetStaticMinimapEntry_ReturnValue;        // 0x050C(0x0084)(NoDestructor)
	TScriptInterface<class IBPI_MapEventHit_C>    K2Node_DynamicCast_AsBPI_Map_Event_Hit;            // 0x0590(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_21;                    // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B82[0x7];                                     // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapEventHit_C>    K2Node_DynamicCast_AsBPI_Map_Event_Hit_1;          // 0x05A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_22;                    // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Invalid;                        // 0x05B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B83[0x6];                                     // 0x05BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapEventHit_C>    K2Node_DynamicCast_AsBPI_Map_Event_Hit_2;          // 0x05C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_23;                    // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_EVENT_TOILETMARK_TYPE                       K2Node_CustomEvent_Type;                           // 0x05D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B84[0x2];                                     // 0x05D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_Tag;                            // 0x05D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x05DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B85[0x8];                                     // 0x05E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x05F0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x0628(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B86[0x4];                                     // 0x0634(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASkeletalMeshActor*                     CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0644(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMouseCursorState                      CallFunc_PopShowMouseCursor_ReturnValue;           // 0x0648(0x0018)()
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_7;                        // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_8;                        // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_3;              // 0x0670(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_24;                    // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B87[0x7];                                     // 0x0681(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonWindowCtrl_C> CallFunc_BPI_GetCommonWindowCtrl_OutActor_3;       // 0x0688(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_GetCommonWindowCtrl_Success_3;        // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B88[0x3];                                     // 0x0699(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_7;            // 0x069C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6B89[0x4];                                     // 0x06AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_9;                        // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_4;              // 0x06B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_25;                    // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B8A[0x7];                                     // 0x06C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonWindowCtrl_C> CallFunc_BPI_GetCommonWindowCtrl_OutActor_4;       // 0x06D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_GetCommonWindowCtrl_Success_4;        // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase) == 0x000010, "Wrong alignment on BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase");
static_assert(sizeof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase) == 0x0006F0, "Wrong size on BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, EntryPoint) == 0x000000, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_CustomEvent_Loaded_1) == 0x000018, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, Temp_object_Variable) == 0x000020, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x000028, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_CustomEvent_Loaded) == 0x000038, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, Temp_object_Variable_1) == 0x000040, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_DynamicCast_AsAnim_Sequence_Base) == 0x000048, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_DynamicCast_AsAnim_Sequence_Base' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, Temp_int_Array_Index_Variable) == 0x00005C, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000060, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000064, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, Temp_int_Loop_Counter_Variable_1) == 0x000070, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_Add_IntInt_ReturnValue_1) == 0x000074, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, Temp_int_Array_Index_Variable_1) == 0x000078, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, Temp_int_Loop_Counter_Variable_2) == 0x00007C, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_Add_IntInt_ReturnValue_2) == 0x000080, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, Temp_int_Array_Index_Variable_2) == 0x000084, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_GetAllActorsOfClass_OutActors) == 0x000088, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000A0, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, Temp_int_Loop_Counter_Variable_3) == 0x0000AC, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000B0, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, Temp_int_Array_Index_Variable_3) == 0x0000B4, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, Temp_int_Loop_Counter_Variable_4) == 0x0000B8, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000C8, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_DynamicCast_AsBPI_Event_Script) == 0x0000D0, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_DynamicCast_AsBPI_Event_Script' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_DynamicCast_bSuccess_2) == 0x0000E0, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_SpawnReflesh_NoUse) == 0x0000E1, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_SpawnReflesh_NoUse' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, Temp_int_Array_Index_Variable_4) == 0x0000E4, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_GetGazeTargetHolder_ReturnValue) == 0x0000E8, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_GetGazeTargetHolder_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000F0, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_CreateDelegate_OutputDelegate_2) == 0x000100, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_GetMapCommon_rerutn) == 0x000110, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_CreateDelegate_OutputDelegate_3) == 0x000118, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_DynamicCast_AsBPI_Map_Common) == 0x000128, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_DynamicCast_bSuccess_3) == 0x000138, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_IsValid_ReturnValue) == 0x000139, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_BPI_CheckMapPause_IsPause) == 0x00013A, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_BPI_CheckMapPause_IsPause' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_GetMapCommon_rerutn_1) == 0x000140, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_GetMapCommon_rerutn_1' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_DynamicCast_AsBPI_Map_Common_1) == 0x000148, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_DynamicCast_AsBPI_Map_Common_1' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_DynamicCast_bSuccess_4) == 0x000158, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_IsValid_ReturnValue_1) == 0x000159, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_BPI_CheckMapPause_IsPause_1) == 0x00015A, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_BPI_CheckMapPause_IsPause_1' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_Event_Active) == 0x00015B, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_Event_Active' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_GetMapCommon_rerutn_2) == 0x000160, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_GetMapCommon_rerutn_2' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_DynamicCast_AsMap_Event_Hit_Type_AAction) == 0x000168, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_DynamicCast_AsMap_Event_Hit_Type_AAction' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_DynamicCast_bSuccess_5) == 0x000170, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_DynamicCast_AsBPI_Map_Common_2) == 0x000178, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_DynamicCast_AsBPI_Map_Common_2' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_DynamicCast_bSuccess_6) == 0x000188, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_CreateDelegate_OutputDelegate_4) == 0x00018C, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_CheckActorBegunPlay_ReturnValue) == 0x00019C, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_CheckActorBegunPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_GetMapCommon_rerutn_3) == 0x0001A0, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_GetMapCommon_rerutn_3' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_DynamicCast_AsBPI_Map_Common_3) == 0x0001A8, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_DynamicCast_AsBPI_Map_Common_3' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_DynamicCast_bSuccess_7) == 0x0001B8, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_IsValid_ReturnValue_2) == 0x0001B9, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_IsValid_ReturnValue_3) == 0x0001BA, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_Array_Get_Item_1) == 0x0001C0, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_Array_Length_ReturnValue_1) == 0x0001C8, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor) == 0x0001D0, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_DynamicCast_bSuccess_8) == 0x0001E0, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001E1, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_BI_GetMeshComponent_MeshComp) == 0x0001E8, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_BI_GetMeshComponent_MeshComp' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_IsValid_ReturnValue_4) == 0x0001F0, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_DynamicCast_AsGaze_Target) == 0x0001F8, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_DynamicCast_AsGaze_Target' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, K2Node_DynamicCast_bSuccess_9) == 0x000208, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_GetPlayerPawn_ReturnValue) == 0x000210, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000218, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000224, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_GetForwardVector_ReturnValue) == 0x000230, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase, CallFunc_FindLookAtRotation_ReturnValue) == 0x00023C, "Member 'BP_EventScriptBase_C_ExecuteUbergraph_BP_EventScriptBase::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
