#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventHoveringGrass

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EventHoveringGrass.BP_EventHoveringGrass_C
// 0x0030 (0x0250 - 0x0220)
class ABP_EventHoveringGrass_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UFoliageInstancedStaticMeshComponent*> FoliageMeshComponent;                              // 0x0230(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UMaterialInstanceDynamic*>       DMI;                                               // 0x0240(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_EventHoveringGrass(int32 EntryPoint);
	void Reset();
	void Setup();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EventHoveringGrass_C">();
	}
	static class ABP_EventHoveringGrass_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EventHoveringGrass_C>();
	}
};
static_assert(alignof(ABP_EventHoveringGrass_C) == 0x000008, "Wrong alignment on ABP_EventHoveringGrass_C");
static_assert(sizeof(ABP_EventHoveringGrass_C) == 0x000250, "Wrong size on ABP_EventHoveringGrass_C");
static_assert(offsetof(ABP_EventHoveringGrass_C, UberGraphFrame) == 0x000220, "Member 'ABP_EventHoveringGrass_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EventHoveringGrass_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_EventHoveringGrass_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_EventHoveringGrass_C, FoliageMeshComponent) == 0x000230, "Member 'ABP_EventHoveringGrass_C::FoliageMeshComponent' has a wrong offset!");
static_assert(offsetof(ABP_EventHoveringGrass_C, DMI) == 0x000240, "Member 'ABP_EventHoveringGrass_C::DMI' has a wrong offset!");

}

