#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EncountAreaSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SymbolActPattern_structs.hpp"
#include "Project_structs.hpp"
#include "Engine_structs.hpp"
#include "EncountPointStruct_structs.hpp"
#include "EncountData_st_structs.hpp"
#include "SpawnSymbolInfo_structs.hpp"


namespace SDK::Params
{

// Function BP_EncountAreaSpawner.BP_EncountAreaSpawner_C.EvtDis_SpawnDevil__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_EncountAreaSpawner_C_EvtDis_SpawnDevil__DelegateSignature final
{
public:
	class ACustomPawn*                            Devil;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EncountAreaSpawner_C*               This;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EncountAreaSpawner_C_EvtDis_SpawnDevil__DelegateSignature) == 0x000008, "Wrong alignment on BP_EncountAreaSpawner_C_EvtDis_SpawnDevil__DelegateSignature");
static_assert(sizeof(BP_EncountAreaSpawner_C_EvtDis_SpawnDevil__DelegateSignature) == 0x000010, "Wrong size on BP_EncountAreaSpawner_C_EvtDis_SpawnDevil__DelegateSignature");
static_assert(offsetof(BP_EncountAreaSpawner_C_EvtDis_SpawnDevil__DelegateSignature, Devil) == 0x000000, "Member 'BP_EncountAreaSpawner_C_EvtDis_SpawnDevil__DelegateSignature::Devil' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_EvtDis_SpawnDevil__DelegateSignature, This) == 0x000008, "Member 'BP_EncountAreaSpawner_C_EvtDis_SpawnDevil__DelegateSignature::This' has a wrong offset!");

// Function BP_EncountAreaSpawner.BP_EncountAreaSpawner_C.EvtDis_SpawnEnd__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_EncountAreaSpawner_C_EvtDis_SpawnEnd__DelegateSignature final
{
public:
	class ABP_EncountAreaSpawner_C*               This;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EncountAreaSpawner_C_EvtDis_SpawnEnd__DelegateSignature) == 0x000008, "Wrong alignment on BP_EncountAreaSpawner_C_EvtDis_SpawnEnd__DelegateSignature");
static_assert(sizeof(BP_EncountAreaSpawner_C_EvtDis_SpawnEnd__DelegateSignature) == 0x000008, "Wrong size on BP_EncountAreaSpawner_C_EvtDis_SpawnEnd__DelegateSignature");
static_assert(offsetof(BP_EncountAreaSpawner_C_EvtDis_SpawnEnd__DelegateSignature, This) == 0x000000, "Member 'BP_EncountAreaSpawner_C_EvtDis_SpawnEnd__DelegateSignature::This' has a wrong offset!");

// Function BP_EncountAreaSpawner.BP_EncountAreaSpawner_C.ExecuteUbergraph_BP_EncountAreaSpawner
// 0x05D0 (0x05D0 - 0x0000)
struct BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0050(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	struct FEncountPointStruct                    K2Node_MakeStruct_EncountPointStruct;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_GetDevilAssetClassData_ClassAssetID;      // 0x0070(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_GetDevilAssetClassData_PlayerBaseAssetID; // 0x0098(0x0028)(HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_1;                            // 0x00F0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UBPC_CharaSplineMover_C*                CallFunc_AddComponent_ReturnValue;                 // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EncountArea_C>    K2Node_DynamicCast_AsBPI_Encount_Area;             // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineComponent*                       CallFunc_BPI_GetSymbolSpline_Spline;               // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_CheckMapPause_IsPause;                // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x017B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable_1;                               // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success;                        // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue;            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMapID_ReturnValue;                     // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAreaID_ReturnValue;                    // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MINIMAP_POI_ICON                            Temp_byte_Variable;                                // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MINIMAP_POI_ICON                            Temp_byte_Variable_1;                              // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FE[0x2];                                      // 0x01FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0204(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x028D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28E[0x2];                                      // 0x028E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueSymbolData                      CallFunc_GetUniqueSymbolData_ReturnValue;          // 0x0290(0x002C)(ConstParm, NoDestructor)
	E_MINIMAP_POI_ICON                            K2Node_Select_Default_1;                           // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMinimapPOIParam                       K2Node_MakeStruct_MinimapPOIParam;                 // 0x02CC(0x0040)(NoDestructor)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMapSymbolBaseCompornent_C*             CallFunc_AddComponent_ReturnValue_1;               // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0318(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZX_ReturnValue;                // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> CallFunc_BI_SetAllVisibility_self_CastInput;       // 0x0338(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_SetAllVisibility_NoUse;                // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEncountData_st                        K2Node_MakeStruct_EncountData_st;                  // 0x0350(0x0028)(HasGetValueTypeHash)
	TSubclassOf<class UObject>                    CallFunc_Conv_SoftClassReferenceToClass_ReturnValue; // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsCustom_Pawn;             // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsDevil_Base;              // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_1;                    // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_1;             // 0x03A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_CheckMapPause_IsPause_1;              // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EncountArea_C>    K2Node_DynamicCast_AsBPI_Encount_Area_1;           // 0x03D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x03E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E3[0xD];                                      // 0x03E3(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpawnSymbolInfo                       CallFunc_BPI_GetSymbolInfo_SymbolInfo;             // 0x03F0(0x00A0)(HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0490(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x049C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49D[0x3];                                      // 0x049D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x04A0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADevilBase_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_FADE_STATE                               CallFunc_GetFadeState_ReturnValue;                 // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x04E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EA[0x6];                                      // 0x04EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Delay;                          // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsEffect;                       // 0x04FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_AngleManual;                    // 0x04FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FE[0x2];                                      // 0x04FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Angle;                          // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IgnorePause;                    // 0x0504(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_505[0x3];                                      // 0x0505(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Index;                          // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NotCalcAngle;                   // 0x050C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_SpawnMotion;                    // 0x050D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x050E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x050F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0510(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetMapCommon_rerutn_2;                    // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_2;             // 0x0528(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_CheckMapPause_IsPause_2;              // 0x0539(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x053A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x053B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x053C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOneEncountData                        CallFunc_GetEncountData_ReturnValue;               // 0x0550(0x0040)(ConstParm)
	int32                                         K2Node_CustomEvent_DevilId;                        // 0x0590(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_BlankIndex;                     // 0x0594(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0598(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x05A4(0x0010)(ZeroConstructor, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromZX_ReturnValue_1;              // 0x05B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_1;        // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C1[0x3];                                      // 0x05C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x05C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x05CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x05CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner) == 0x000010, "Wrong alignment on BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner");
static_assert(sizeof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner) == 0x0005D0, "Wrong size on BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, EntryPoint) == 0x000000, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, Temp_struct_Variable) == 0x000010, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_CustomEvent_Loaded) == 0x000040, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, Temp_class_Variable) == 0x000048, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, Temp_int_Variable) == 0x000050, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_MakeArray_Array) == 0x000058, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_MakeStruct_EncountPointStruct) == 0x000068, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_MakeStruct_EncountPointStruct' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_GetDevilAssetClassData_ClassAssetID) == 0x000070, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_GetDevilAssetClassData_ClassAssetID' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_GetDevilAssetClassData_PlayerBaseAssetID) == 0x000098, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_GetDevilAssetClassData_PlayerBaseAssetID' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_GetActorForwardVector_ReturnValue) == 0x0000C0, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_GetActorUpVector_ReturnValue) == 0x0000CC, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_GetOwner_ReturnValue) == 0x0000D8, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_RotateAngleAxis_ReturnValue) == 0x0000E0, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, Temp_struct_Variable_1) == 0x0000F0, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_AddComponent_ReturnValue) == 0x000120, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_GetOwner_ReturnValue_1) == 0x000128, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_DynamicCast_AsBPI_Encount_Area) == 0x000130, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_DynamicCast_AsBPI_Encount_Area' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_IsValid_ReturnValue) == 0x000141, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_BPI_GetSymbolSpline_Spline) == 0x000148, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_BPI_GetSymbolSpline_Spline' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_IsValid_ReturnValue_1) == 0x000150, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_GetMapCommon_rerutn) == 0x000158, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_IsValid_ReturnValue_2) == 0x000160, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_DynamicCast_AsBPI_Map_Common) == 0x000168, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_DynamicCast_bSuccess_1) == 0x000178, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_BPI_CheckMapPause_IsPause) == 0x000179, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_BPI_CheckMapPause_IsPause' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_IsValid_ReturnValue_3) == 0x00017A, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_Not_PreBool_ReturnValue) == 0x00017B, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, Temp_int_Variable_1) == 0x00017C, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, Temp_int_Variable_2) == 0x000180, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_GetPlayerPawn_ReturnValue) == 0x000188, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000190, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00019C, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001A8, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_CustomEvent_Success) == 0x0001B4, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_CustomEvent_Success' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_Normal_ReturnValue) == 0x0001B8, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, Temp_bool_Variable) == 0x0001C4, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_GetMinimapManager_ReturnValue) == 0x0001C8, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_GetMinimapManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_GetMapID_ReturnValue) == 0x0001D0, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_GetMapID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_GetAreaID_ReturnValue) == 0x0001D4, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_GetAreaID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0001D8, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0001E4, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_BreakRotator_Roll) == 0x0001F0, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_BreakRotator_Pitch) == 0x0001F4, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_BreakRotator_Yaw) == 0x0001F8, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, Temp_byte_Variable) == 0x0001FC, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, Temp_byte_Variable_1) == 0x0001FD, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_Select_Default) == 0x000200, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000204, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_K2_SetActorLocation_ReturnValue) == 0x00028C, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, Temp_bool_Variable_1) == 0x00028D, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_GetUniqueSymbolData_ReturnValue) == 0x000290, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_GetUniqueSymbolData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_Select_Default_1) == 0x0002BC, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0002C0, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_MakeStruct_MinimapPOIParam) == 0x0002CC, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_MakeStruct_MinimapPOIParam' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_AddComponent_ReturnValue_1) == 0x000310, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_MakeVector_ReturnValue) == 0x000318, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_MakeRotFromZX_ReturnValue) == 0x000324, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_MakeRotFromZX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000330, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_BI_SetAllVisibility_self_CastInput) == 0x000338, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_BI_SetAllVisibility_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_BI_SetAllVisibility_NoUse) == 0x000348, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_BI_SetAllVisibility_NoUse' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_MakeStruct_EncountData_st) == 0x000350, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_MakeStruct_EncountData_st' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_Conv_SoftClassReferenceToClass_ReturnValue) == 0x000378, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_Conv_SoftClassReferenceToClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_ClassDynamicCast_AsCustom_Pawn) == 0x000380, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_ClassDynamicCast_AsCustom_Pawn' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_ClassDynamicCast_bSuccess) == 0x000388, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_ClassDynamicCast_AsDevil_Base) == 0x000390, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_ClassDynamicCast_AsDevil_Base' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_ClassDynamicCast_bSuccess_1) == 0x000398, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_ClassDynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_GetMapCommon_rerutn_1) == 0x0003A0, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_GetMapCommon_rerutn_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_DynamicCast_AsBPI_Map_Common_1) == 0x0003A8, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_DynamicCast_AsBPI_Map_Common_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_DynamicCast_bSuccess_2) == 0x0003B8, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_GetOwner_ReturnValue_2) == 0x0003C0, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_BPI_CheckMapPause_IsPause_1) == 0x0003C8, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_BPI_CheckMapPause_IsPause_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_DynamicCast_AsBPI_Encount_Area_1) == 0x0003D0, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_DynamicCast_AsBPI_Encount_Area_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_DynamicCast_bSuccess_3) == 0x0003E0, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_Not_PreBool_ReturnValue_1) == 0x0003E1, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_BooleanOR_ReturnValue) == 0x0003E2, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_BPI_GetSymbolInfo_SymbolInfo) == 0x0003F0, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_BPI_GetSymbolInfo_SymbolInfo' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x000490, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_Not_PreBool_ReturnValue_2) == 0x00049C, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_MakeTransform_ReturnValue) == 0x0004A0, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_BooleanAND_ReturnValue) == 0x0004D0, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0004D8, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x0004E0, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_GetFadeState_ReturnValue) == 0x0004E8, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_GetFadeState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_SwitchEnum_CmpSuccess) == 0x0004E9, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x0004F0, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_CustomEvent_Delay) == 0x0004F8, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_CustomEvent_Delay' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_CustomEvent_IsEffect) == 0x0004FC, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_CustomEvent_IsEffect' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_CustomEvent_AngleManual) == 0x0004FD, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_CustomEvent_AngleManual' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_CustomEvent_Angle) == 0x000500, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_CustomEvent_Angle' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_CustomEvent_IgnorePause) == 0x000504, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_CustomEvent_IgnorePause' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_CustomEvent_Index) == 0x000508, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_CustomEvent_NotCalcAngle) == 0x00050C, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_CustomEvent_NotCalcAngle' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_CustomEvent_SpawnMotion) == 0x00050D, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_CustomEvent_SpawnMotion' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x00050E, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_Greater_IntInt_ReturnValue) == 0x00050F, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_CreateDelegate_OutputDelegate) == 0x000510, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_GetMapCommon_rerutn_2) == 0x000520, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_GetMapCommon_rerutn_2' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_DynamicCast_AsBPI_Map_Common_2) == 0x000528, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_DynamicCast_AsBPI_Map_Common_2' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_DynamicCast_bSuccess_4) == 0x000538, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_BPI_CheckMapPause_IsPause_2) == 0x000539, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_BPI_CheckMapPause_IsPause_2' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_Not_PreBool_ReturnValue_3) == 0x00053A, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_IsValid_ReturnValue_4) == 0x00053B, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x00053C, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_BooleanOR_ReturnValue_1) == 0x000548, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_GetEncountData_ReturnValue) == 0x000550, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_GetEncountData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_CustomEvent_DevilId) == 0x000590, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_CustomEvent_DevilId' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_CustomEvent_BlankIndex) == 0x000594, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_CustomEvent_BlankIndex' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_MakeVector_ReturnValue_1) == 0x000598, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_CreateDelegate_OutputDelegate_1) == 0x0005A4, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_MakeRotFromZX_ReturnValue_1) == 0x0005B4, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_MakeRotFromZX_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_K2_SetActorRotation_ReturnValue_1) == 0x0005C0, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_K2_SetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_Array_Find_ReturnValue) == 0x0005C4, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_Array_RemoveItem_ReturnValue) == 0x0005C8, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0005C9, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0005CA, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner, K2Node_Event_EndPlayReason) == 0x0005CB, "Member 'BP_EncountAreaSpawner_C_ExecuteUbergraph_BP_EncountAreaSpawner::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BP_EncountAreaSpawner.BP_EncountAreaSpawner_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_EncountAreaSpawner_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EncountAreaSpawner_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_EncountAreaSpawner_C_ReceiveEndPlay");
static_assert(sizeof(BP_EncountAreaSpawner_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_EncountAreaSpawner_C_ReceiveEndPlay");
static_assert(offsetof(BP_EncountAreaSpawner_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_EncountAreaSpawner_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_EncountAreaSpawner.BP_EncountAreaSpawner_C.Debug_TraceAndSpawnSymbol
// 0x0008 (0x0008 - 0x0000)
struct BP_EncountAreaSpawner_C_Debug_TraceAndSpawnSymbol final
{
public:
