#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventCtrl

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EventCtrl.BP_EventCtrl_C
// 0x0020 (0x0240 - 0x0220)
class ABP_EventCtrl_C final : public AActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Activate;                                          // 0x0228(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Finish;                                            // 0x0229(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Fast;                                              // 0x022A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Auto;                                              // 0x022B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         PlayRate;                                          // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 PositionOffset;                                    // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UsePositionOffset;                                 // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void PlayStart();
	void IsFinish(bool* Param_Finish);
	void SetPosition(class AActor* PositionActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EventCtrl_C">();
	}
	static class ABP_EventCtrl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EventCtrl_C>();
	}
};
static_assert(alignof(ABP_EventCtrl_C) == 0x000008, "Wrong alignment on ABP_EventCtrl_C");
static_assert(sizeof(ABP_EventCtrl_C) == 0x000240, "Wrong size on ABP_EventCtrl_C");
static_assert(offsetof(ABP_EventCtrl_C, DefaultSceneRoot) == 0x000220, "Member 'ABP_EventCtrl_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_EventCtrl_C, Activate) == 0x000228, "Member 'ABP_EventCtrl_C::Activate' has a wrong offset!");
static_assert(offsetof(ABP_EventCtrl_C, Finish) == 0x000229, "Member 'ABP_EventCtrl_C::Finish' has a wrong offset!");
static_assert(offsetof(ABP_EventCtrl_C, Fast) == 0x00022A, "Member 'ABP_EventCtrl_C::Fast' has a wrong offset!");
static_assert(offsetof(ABP_EventCtrl_C, Auto) == 0x00022B, "Member 'ABP_EventCtrl_C::Auto' has a wrong offset!");
static_assert(offsetof(ABP_EventCtrl_C, PlayRate) == 0x00022C, "Member 'ABP_EventCtrl_C::PlayRate' has a wrong offset!");
static_assert(offsetof(ABP_EventCtrl_C, PositionOffset) == 0x000230, "Member 'ABP_EventCtrl_C::PositionOffset' has a wrong offset!");
static_assert(offsetof(ABP_EventCtrl_C, UsePositionOffset) == 0x000238, "Member 'ABP_EventCtrl_C::UsePositionOffset' has a wrong offset!");

}

