#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventMissionBase

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AActionWindowTable_st_structs.hpp"


namespace SDK::Params
{

// Function BP_EventMissionBase.BP_EventMissionBase_C.ExecuteUbergraph_BP_EventMissionBase
// 0x04F8 (0x04F8 - 0x0000)
struct BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A104[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A105[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A106[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A107[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A108[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_CheckMapPause_IsPause;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A109[0x2];                                     // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn_1;                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A10A[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_1;             // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_CheckMapPause_IsPause_1;              // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A10B[0x1];                                     // 0x00BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A10C[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Active;                               // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A10D[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapEventHit_Type_AAction_C*            K2Node_DynamicCast_AsMap_Event_Hit_Type_AAction;   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A10E[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapEventHit_Type_INOUT_C*              K2Node_DynamicCast_AsMap_Event_Hit_Type_INOUT;     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A10F[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	class AMapEventHit_Type_AAction_C*            K2Node_DynamicCast_AsMap_Event_Hit_Type_AAction_1; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A110[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapEventHit_Type_INOUT_C*              K2Node_DynamicCast_AsMap_Event_Hit_Type_INOUT_1;   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A111[0x3];                                     // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_2;              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A112[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor;      // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A113[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_BI_GetMeshComponent_MeshComp;             // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A114[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A115[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1;    // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_LookAt_NoUse;                          // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A116[0x5];                                     // 0x01A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_2;    // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A117[0x6];                                     // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_3;    // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_LookAt_NoUse_1;                        // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A118[0x1];                                     // 0x01DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A119[0x4];                                     // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A11A[0x3];                                     // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0204(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_A11B[0x4];                                     // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonWindowCtrl_C> CallFunc_BPI_GetCommonWindowCtrl_OutActor;         // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_GetCommonWindowCtrl_Success;          // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A11C[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_1;                        // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0238(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A11D[0x3];                                     // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CommonWindowCtrl_C> CallFunc_BPI_GetCommonWindowCtrl_OutActor_1;       // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_GetCommonWindowCtrl_Success_1;        // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A11E[0x3];                                     // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_2;           // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A11F[0x3];                                     // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0290(0x0010)(ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x02A0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAActionWindowTable_st                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x02B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A120[0x3];                                     // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x02CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x02CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x02CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_2;                        // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_3;           // 0x02F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue_1;                    // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A121[0x3];                                     // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_3;                        // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Invalid;                        // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A122[0x7];                                     // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapEventHit_Type_AAction_C*            K2Node_DynamicCast_AsMap_Event_Hit_Type_AAction_2; // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0322(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A123[0x1];                                     // 0x0323(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0324(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A124[0x3];                                     // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapEventHit_C>    K2Node_DynamicCast_AsBPI_Map_Event_Hit;            // 0x0338(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A125[0x7];                                     // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapEventHit_C>    K2Node_DynamicCast_AsBPI_Map_Event_Hit_1;          // 0x0350(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A126[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapEventHit_C>    K2Node_DynamicCast_AsBPI_Map_Event_Hit_2;          // 0x0368(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x037A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A127[0x5];                                     // 0x037B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           K2Node_CustomEvent_CameraActor_1;                  // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       K2Node_CustomEvent_Material;                       // 0x0388(0x0028)(HasGetValueTypeHash)
	class ACameraActor*                           K2Node_CustomEvent_CameraActor;                    // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A128[0x7];                                     // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x03C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TScriptInterface<class IBlendableInterface>   CallFunc_RemoveBlendable_InBlendableObject_CastInput; // 0x03D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	E_AActionWindowType                           K2Node_CustomEvent_WindowType;                     // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A129[0x7];                                     // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_1;       // 0x03E8(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_3;                         // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAActionWindowTable_st                 CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0404(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A12A[0x2];                                     // 0x0412(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0414(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0424(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A12B[0x3];                                     // 0x0425(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x042C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A12C[0x3];                                     // 0x042D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A12D[0x3];                                     // 0x0435(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_4;                        // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_5;                        // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x0448(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A12E[0x7];                                     // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonWindowCtrl_C> CallFunc_BPI_GetCommonWindowCtrl_OutActor_2;       // 0x0460(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_GetCommonWindowCtrl_Success_2;        // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A12F[0x3];                                     // 0x0471(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x0474(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_A130[0x4];                                     // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_6;                        // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_3;              // 0x0490(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A131[0x7];                                     // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonWindowCtrl_C> CallFunc_BPI_GetCommonWindowCtrl_OutActor_3;       // 0x04A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_GetCommonWindowCtrl_Success_3;        // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A132[0x7];                                     // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_7;                        // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_4;              // 0x04C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_19;                    // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A133[0x7];                                     // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonWindowCtrl_C> CallFunc_BPI_GetCommonWindowCtrl_OutActor_4;       // 0x04E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_GetCommonWindowCtrl_Success_4;        // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase) == 0x000008, "Wrong alignment on BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase");
static_assert(sizeof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase) == 0x0004F8, "Wrong size on BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, EntryPoint) == 0x000000, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000014, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_GetForwardVector_ReturnValue) == 0x000020, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00002C, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000048, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_GetMapCommon_rerutn) == 0x000050, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x000058, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_AsBPI_Map_Common) == 0x000068, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_GetForwardVector_ReturnValue_1) == 0x00007C, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_BPI_CheckMapPause_IsPause) == 0x000088, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_BPI_CheckMapPause_IsPause' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_IsValid_ReturnValue) == 0x000089, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00008C, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_GetMapCommon_rerutn_1) == 0x000098, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_GetMapCommon_rerutn_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, Temp_int_Array_Index_Variable_1) == 0x0000A0, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_AsBPI_Map_Common_1) == 0x0000A8, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_AsBPI_Map_Common_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_BPI_CheckMapPause_IsPause_1) == 0x0000B9, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_BPI_CheckMapPause_IsPause_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_IsValid_ReturnValue_1) == 0x0000BA, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, Temp_int_Loop_Counter_Variable_1) == 0x0000BC, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C0, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, Temp_int_Array_Index_Variable_2) == 0x0000C4, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, Temp_object_Variable) == 0x0000C8, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_AsMaterial_Instance) == 0x0000D0, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_AsMaterial_Instance' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_bSuccess_2) == 0x0000D8, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000E0, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_Event_Active) == 0x0000E8, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_Event_Active' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_AsMap_Event_Hit_Type_AAction) == 0x0000F0, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_AsMap_Event_Hit_Type_AAction' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_bSuccess_3) == 0x0000F8, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_AsMap_Event_Hit_Type_INOUT) == 0x000100, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_AsMap_Event_Hit_Type_INOUT' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_bSuccess_4) == 0x000108, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_CustomEvent_Loaded) == 0x000110, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_CreateDelegate_OutputDelegate) == 0x000118, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_AsMap_Event_Hit_Type_AAction_1) == 0x000128, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_AsMap_Event_Hit_Type_AAction_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_bSuccess_5) == 0x000130, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_AsMap_Event_Hit_Type_INOUT_1) == 0x000138, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_AsMap_Event_Hit_Type_INOUT_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_bSuccess_6) == 0x000140, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, Temp_int_Array_Index_Variable_3) == 0x000144, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_GetPlayerPawn_ReturnValue_2) == 0x000148, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_GetPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, Temp_int_Loop_Counter_Variable_2) == 0x000150, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor) == 0x000158, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_bSuccess_7) == 0x000168, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_BI_GetMeshComponent_MeshComp) == 0x000170, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_BI_GetMeshComponent_MeshComp' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_Add_IntInt_ReturnValue_2) == 0x000178, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_Array_Get_Item) == 0x000180, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_Array_Length_ReturnValue) == 0x000188, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1) == 0x000190, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_bSuccess_8) == 0x0001A0, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_Less_IntInt_ReturnValue) == 0x0001A1, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_BI_LookAt_NoUse) == 0x0001A2, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_BI_LookAt_NoUse' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_2) == 0x0001A8, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_bSuccess_9) == 0x0001B8, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_IsValid_ReturnValue_2) == 0x0001B9, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_Array_Get_Item_1) == 0x0001C0, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_3) == 0x0001C8, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_3' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_bSuccess_10) == 0x0001D8, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_IsValid_ReturnValue_3) == 0x0001D9, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_BI_LookAt_NoUse_1) == 0x0001DA, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_BI_LookAt_NoUse_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_Array_Length_ReturnValue_1) == 0x0001DC, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_Event_DeltaSeconds) == 0x0001E0, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_Get_ReturnValue) == 0x0001E8, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_AsBPI_UIManager) == 0x0001F0, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_bSuccess_11) == 0x000200, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x000204, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_BPI_GetCommonWindowCtrl_OutActor) == 0x000218, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_BPI_GetCommonWindowCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_BPI_GetCommonWindowCtrl_Success) == 0x000228, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_BPI_GetCommonWindowCtrl_Success' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_Get_ReturnValue_1) == 0x000230, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000238, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_DynamicCast_bSuccess_12) == 0x000248, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00024C, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_BPI_GetCommonWindowCtrl_OutActor_1) == 0x000258, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_BPI_GetCommonWindowCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_BPI_GetCommonWindowCtrl_Success_1) == 0x000268, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_BPI_GetCommonWindowCtrl_Success_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_FindLookAtRotation_ReturnValue) == 0x00026C, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_GetForwardVector_ReturnValue_2) == 0x000278, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_GetForwardVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_Dot_VectorVector_ReturnValue) == 0x000284, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_DegAcos_ReturnValue) == 0x000288, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00028C, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000290, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002A0, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_Array_Get_Item_2) == 0x0002B0, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_GetDataTableRowFromName_OutRow) == 0x0002B8, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0002C4, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_Array_Length_ReturnValue_2) == 0x0002C8, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002CC, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0002CD, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0002CE, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x0002CF, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0002D0, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_FindLookAtRotation_ReturnValue_1) == 0x0002DC, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_FindLookAtRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_Get_ReturnValue_2) == 0x0002E8, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_GetForwardVector_ReturnValue_3) == 0x0002F0, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_GetForwardVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x0002FC, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase, CallFunc_DegAcos_ReturnValue_1) == 0x000300, "Member 'BP_EventMissionBase_C_ExecuteUbergraph_BP_EventMissionBase::CallFunc_DegAcos_ReturnValue_1' has a wrong offset!");
