#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventPlayerChange

#include "Basic.hpp"

#include "E_PLAYER_MANAGER_TYPE_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_EventPlayerChange.BP_EventPlayerChange_C.ExecuteUbergraph_BP_EventPlayerChange
// 0x0190 (0x0190 - 0x0000)
struct BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71D3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_CustomEvent_Class;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_CustomEvent_PlayerBase;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71D4[0x8];                                     // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProjectGameMode_C*                     K2Node_DynamicCast_AsProject_Game_Mode;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71D5[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerBase_C*                          K2Node_DynamicCast_AsPlayer_Base;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71D6[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerBase_C*                          K2Node_DynamicCast_AsPlayer_Base_1;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71D7[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00B0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71D8[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProjectGameMode_C*                     K2Node_DynamicCast_AsProject_Game_Mode_1;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71D9[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0120(0x0030)(IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_PlayerManager_C>  CallFunc_BPI_SetContlrolActivePawn_self_CastInput; // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerBase_C*                          CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_2;                // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProjectGameMode_C*                     K2Node_DynamicCast_AsProject_Game_Mode_2;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_PLAYER_MANAGER_TYPE                         K2Node_CustomEvent_Select;                         // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange) == 0x000010, "Wrong alignment on BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange");
static_assert(sizeof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange) == 0x000190, "Wrong size on BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, EntryPoint) == 0x000000, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, K2Node_CustomEvent_Class) == 0x000008, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::K2Node_CustomEvent_Class' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, K2Node_CustomEvent_PlayerBase) == 0x000010, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::K2Node_CustomEvent_PlayerBase' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, CallFunc_GetGameMode_ReturnValue) == 0x000050, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000058, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, K2Node_DynamicCast_AsProject_Game_Mode) == 0x000060, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::K2Node_DynamicCast_AsProject_Game_Mode' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, CallFunc_FinishSpawningActor_ReturnValue) == 0x000070, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, K2Node_DynamicCast_AsPlayer_Base) == 0x000078, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::K2Node_DynamicCast_AsPlayer_Base' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, CallFunc_GetPlayerPawn_ReturnValue) == 0x000088, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, CallFunc_GetPlayerController_ReturnValue) == 0x000090, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, K2Node_DynamicCast_AsPlayer_Base_1) == 0x000098, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::K2Node_DynamicCast_AsPlayer_Base_1' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, CallFunc_GetControlRotation_ReturnValue) == 0x0000A4, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, CallFunc_GetTransform_ReturnValue) == 0x0000B0, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, CallFunc_GetGameMode_ReturnValue_1) == 0x0000E0, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, CallFunc_BreakTransform_Location) == 0x0000E8, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, CallFunc_BreakTransform_Rotation) == 0x0000F4, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, CallFunc_BreakTransform_Scale) == 0x000100, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, K2Node_DynamicCast_AsProject_Game_Mode_1) == 0x000110, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::K2Node_DynamicCast_AsProject_Game_Mode_1' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, K2Node_DynamicCast_bSuccess_3) == 0x000118, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, CallFunc_MakeTransform_ReturnValue_1) == 0x000120, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, CallFunc_BPI_SetContlrolActivePawn_self_CastInput) == 0x000150, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::CallFunc_BPI_SetContlrolActivePawn_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000160, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000168, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, CallFunc_GetGameMode_ReturnValue_2) == 0x000170, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::CallFunc_GetGameMode_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, K2Node_DynamicCast_AsProject_Game_Mode_2) == 0x000178, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::K2Node_DynamicCast_AsProject_Game_Mode_2' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, K2Node_DynamicCast_bSuccess_4) == 0x000180, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange, K2Node_CustomEvent_Select) == 0x000181, "Member 'BP_EventPlayerChange_C_ExecuteUbergraph_BP_EventPlayerChange::K2Node_CustomEvent_Select' has a wrong offset!");

// Function BP_EventPlayerChange.BP_EventPlayerChange_C.ChangePlayerEx
// 0x0008 (0x0008 - 0x0000)
struct BP_EventPlayerChange_C_ChangePlayerEx final
{
public:
	class UClass*                                 Param_Class;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPlayerChange_C_ChangePlayerEx) == 0x000008, "Wrong alignment on BP_EventPlayerChange_C_ChangePlayerEx");
static_assert(sizeof(BP_EventPlayerChange_C_ChangePlayerEx) == 0x000008, "Wrong size on BP_EventPlayerChange_C_ChangePlayerEx");
static_assert(offsetof(BP_EventPlayerChange_C_ChangePlayerEx, Param_Class) == 0x000000, "Member 'BP_EventPlayerChange_C_ChangePlayerEx::Param_Class' has a wrong offset!");

// Function BP_EventPlayerChange.BP_EventPlayerChange_C.ReturnPlayer
// 0x0001 (0x0001 - 0x0000)
struct BP_EventPlayerChange_C_ReturnPlayer final
{
public:
	E_PLAYER_MANAGER_TYPE                         Select;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPlayerChange_C_ReturnPlayer) == 0x000001, "Wrong alignment on BP_EventPlayerChange_C_ReturnPlayer");
static_assert(sizeof(BP_EventPlayerChange_C_ReturnPlayer) == 0x000001, "Wrong size on BP_EventPlayerChange_C_ReturnPlayer");
static_assert(offsetof(BP_EventPlayerChange_C_ReturnPlayer, Select) == 0x000000, "Member 'BP_EventPlayerChange_C_ReturnPlayer::Select' has a wrong offset!");

// Function BP_EventPlayerChange.BP_EventPlayerChange_C.ChangePlayer
// 0x0008 (0x0008 - 0x0000)
struct BP_EventPlayerChange_C_ChangePlayer final
{
public:
	class UClass*                                 PlayerBase;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPlayerChange_C_ChangePlayer) == 0x000008, "Wrong alignment on BP_EventPlayerChange_C_ChangePlayer");
static_assert(sizeof(BP_EventPlayerChange_C_ChangePlayer) == 0x000008, "Wrong size on BP_EventPlayerChange_C_ChangePlayer");
static_assert(offsetof(BP_EventPlayerChange_C_ChangePlayer, PlayerBase) == 0x000000, "Member 'BP_EventPlayerChange_C_ChangePlayer::PlayerBase' has a wrong offset!");

}

