#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventMissionBase_HitAction

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AActionWindowTable_st_structs.hpp"


namespace SDK::Params
{

// Function BP_EventMissionBase_HitAction.BP_EventMissionBase_HitAction_C.ExecuteUbergraph_BP_EventMissionBase_HitAction
// 0x03F0 (0x03F0 - 0x0000)
struct BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_C9F8[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9F9[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9FA[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_CheckMapPause_IsPause;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9FB[0x6];                                     // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_1;                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_1;             // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_CheckMapPause_IsPause_1;              // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9FC[0x1];                                     // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Active;                               // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9FD[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapEventHit_Type_AAction_C*            K2Node_DynamicCast_AsMap_Event_Hit_Type_AAction;   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9FE[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapEventHit_Type_INOUT_C*              K2Node_DynamicCast_AsMap_Event_Hit_Type_INOUT;     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9FF[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00F4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_CA00[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapEventHit_Type_AAction_C*            K2Node_DynamicCast_AsMap_Event_Hit_Type_AAction_1; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA01[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapEventHit_Type_INOUT_C*              K2Node_DynamicCast_AsMap_Event_Hit_Type_INOUT_1;   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA02[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_2;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor;      // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA03[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_BI_GetMeshComponent_MeshComp;             // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMapEventHit_Type_SHit_C*               K2Node_DynamicCast_AsMap_Event_Hit_Type_SHit;      // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA04[0x3];                                     // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMapEventHit_Type_SHit_C*               K2Node_DynamicCast_AsMap_Event_Hit_Type_SHit_1;    // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA05[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA06[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1;    // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_LookAt_NoUse;                          // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA07[0x5];                                     // 0x0193(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_2;    // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA08[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA09[0x4];                                     // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_3;    // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_LookAt_NoUse_1;                        // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA0A[0x5];                                     // 0x01D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x01D8(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAActionWindowTable_st                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x01F4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA0B[0x2];                                     // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA0C[0x7];                                     // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA0D[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonWindowCtrl_C> CallFunc_BPI_GetCommonWindowCtrl_OutActor;         // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_GetCommonWindowCtrl_Success;          // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA0E[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_1;                        // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA0F[0x3];                                     // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0264(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_CA10[0x4];                                     // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonWindowCtrl_C> CallFunc_BPI_GetCommonWindowCtrl_OutActor_1;       // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_GetCommonWindowCtrl_Success_1;        // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA11[0x3];                                     // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x02A4(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_2;           // 0x02B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA12[0x1];                                     // 0x02CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_2;                        // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_3;           // 0x02EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue_1;                    // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_3;                        // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA13[0x7];                                     // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapEventHit_Type_AAction_C*            K2Node_DynamicCast_AsMap_Event_Hit_Type_AAction_2; // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA14[0x3];                                     // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x031C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_Invalid;                        // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x032D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x032E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA15[0x1];                                     // 0x032F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0330(0x0010)(ZeroConstructor, NoDestructor)
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_4;                        // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x0348(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA16[0x7];                                     // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonWindowCtrl_C> CallFunc_BPI_GetCommonWindowCtrl_OutActor_2;       // 0x0360(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_GetCommonWindowCtrl_Success_2;        // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA17[0x7];                                     // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_5;                        // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_6;                        // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_3;              // 0x0388(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA18[0x7];                                     // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonWindowCtrl_C> CallFunc_BPI_GetCommonWindowCtrl_OutActor_3;       // 0x03A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_GetCommonWindowCtrl_Success_3;        // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA19[0x7];                                     // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_7;                        // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_4;              // 0x03C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA1A[0x7];                                     // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonWindowCtrl_C> CallFunc_BPI_GetCommonWindowCtrl_OutActor_4;       // 0x03D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_GetCommonWindowCtrl_Success_4;        // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction) == 0x000008, "Wrong alignment on BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction");
static_assert(sizeof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction) == 0x0003F0, "Wrong size on BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, EntryPoint) == 0x000000, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_GetPlayerPawn_ReturnValue) == 0x000028, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000030, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000038, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x000044, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_GetForwardVector_ReturnValue) == 0x000050, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_GetForwardVector_ReturnValue_1) == 0x00005C, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000068, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000074, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_GetMapCommon_rerutn) == 0x000080, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, Temp_int_Loop_Counter_Variable_1) == 0x000088, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_AsBPI_Map_Common) == 0x000090, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A4, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_BPI_CheckMapPause_IsPause) == 0x0000A8, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_BPI_CheckMapPause_IsPause' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_IsValid_ReturnValue) == 0x0000A9, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_GetMapCommon_rerutn_1) == 0x0000B0, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_GetMapCommon_rerutn_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_AsBPI_Map_Common_1) == 0x0000B8, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_AsBPI_Map_Common_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_IsValid_ReturnValue_1) == 0x0000C9, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_BPI_CheckMapPause_IsPause_1) == 0x0000CA, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_BPI_CheckMapPause_IsPause_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, Temp_int_Loop_Counter_Variable_2) == 0x0000CC, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000D0, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_Event_Active) == 0x0000D4, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_Event_Active' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_AsMap_Event_Hit_Type_AAction) == 0x0000D8, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_AsMap_Event_Hit_Type_AAction' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_bSuccess_2) == 0x0000E0, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_AsMap_Event_Hit_Type_INOUT) == 0x0000E8, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_AsMap_Event_Hit_Type_INOUT' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_bSuccess_3) == 0x0000F0, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000F4, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_AsMap_Event_Hit_Type_AAction_1) == 0x000108, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_AsMap_Event_Hit_Type_AAction_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_bSuccess_4) == 0x000110, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_AsMap_Event_Hit_Type_INOUT_1) == 0x000118, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_AsMap_Event_Hit_Type_INOUT_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_bSuccess_5) == 0x000120, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_GetPlayerPawn_ReturnValue_2) == 0x000128, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_GetPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor) == 0x000130, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_bSuccess_6) == 0x000140, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_BI_GetMeshComponent_MeshComp) == 0x000148, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_BI_GetMeshComponent_MeshComp' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_AsMap_Event_Hit_Type_SHit) == 0x000150, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_AsMap_Event_Hit_Type_SHit' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_bSuccess_7) == 0x000158, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, Temp_int_Array_Index_Variable_2) == 0x00015C, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_AsMap_Event_Hit_Type_SHit_1) == 0x000160, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_AsMap_Event_Hit_Type_SHit_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_bSuccess_8) == 0x000168, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_Array_Get_Item) == 0x000170, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_Array_Length_ReturnValue) == 0x000178, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1) == 0x000180, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_bSuccess_9) == 0x000190, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_Less_IntInt_ReturnValue) == 0x000191, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_BI_LookAt_NoUse) == 0x000192, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_BI_LookAt_NoUse' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_2) == 0x000198, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_bSuccess_10) == 0x0001A8, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_Array_Get_Item_1) == 0x0001B0, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_Array_Length_ReturnValue_1) == 0x0001B8, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_3) == 0x0001C0, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_3' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_bSuccess_11) == 0x0001D0, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001D1, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_BI_LookAt_NoUse_1) == 0x0001D2, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_BI_LookAt_NoUse_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_GetDataTableRowNames_OutRowNames) == 0x0001D8, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_Array_Get_Item_2) == 0x0001E8, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_Array_Length_ReturnValue_2) == 0x0001F0, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_GetDataTableRowFromName_OutRow) == 0x0001F4, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000200, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_Less_IntInt_ReturnValue_2) == 0x000201, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_Event_DeltaSeconds) == 0x000204, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000208, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_Get_ReturnValue) == 0x000210, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_AsBPI_UIManager) == 0x000218, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_bSuccess_12) == 0x000228, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_BPI_GetCommonWindowCtrl_OutActor) == 0x000230, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_BPI_GetCommonWindowCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_BPI_GetCommonWindowCtrl_Success) == 0x000240, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_BPI_GetCommonWindowCtrl_Success' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_Get_ReturnValue_1) == 0x000248, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000250, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_bSuccess_13) == 0x000260, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_CreateDelegate_OutputDelegate_2) == 0x000264, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_BPI_GetCommonWindowCtrl_OutActor_1) == 0x000278, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_BPI_GetCommonWindowCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_BPI_GetCommonWindowCtrl_Success_1) == 0x000288, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_BPI_GetCommonWindowCtrl_Success_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00028C, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_FindLookAtRotation_ReturnValue) == 0x000298, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_CreateDelegate_OutputDelegate_3) == 0x0002A4, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_GetForwardVector_ReturnValue_2) == 0x0002B4, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_GetForwardVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_Dot_VectorVector_ReturnValue) == 0x0002C0, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_DegAcos_ReturnValue) == 0x0002C4, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0002C8, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0002C9, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0002CA, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0002CC, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_Get_ReturnValue_2) == 0x0002D8, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_FindLookAtRotation_ReturnValue_1) == 0x0002E0, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_FindLookAtRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_GetForwardVector_ReturnValue_3) == 0x0002EC, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_GetForwardVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x0002F8, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_DegAcos_ReturnValue_1) == 0x0002FC, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_DegAcos_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_Get_ReturnValue_3) == 0x000300, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_Get_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000308, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_AsMap_Event_Hit_Type_AAction_2) == 0x000310, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_AsMap_Event_Hit_Type_AAction_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_bSuccess_14) == 0x000318, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_CreateDelegate_OutputDelegate_4) == 0x00031C, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_CustomEvent_Invalid) == 0x00032C, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_CustomEvent_Invalid' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_CheckEventFlag_ReturnValue) == 0x00032D, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00032E, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_CreateDelegate_OutputDelegate_5) == 0x000330, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_Get_ReturnValue_4) == 0x000340, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_Get_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_AsBPI_UIManager_2) == 0x000348, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_AsBPI_UIManager_2' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, K2Node_DynamicCast_bSuccess_15) == 0x000358, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::K2Node_DynamicCast_bSuccess_15' has a wrong offset!");
static_assert(offsetof(BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction, CallFunc_BPI_GetCommonWindowCtrl_OutActor_2) == 0x000360, "Member 'BP_EventMissionBase_HitAction_C_ExecuteUbergraph_BP_EventMissionBase_HitAction::CallFunc_BPI_GetCommonWindowCtrl_OutActor_2' has a wrong offset!");
