#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventMiman_Answer

#include "Basic.hpp"

#include "BP_EventMissionBase_classes.hpp"
#include "Engine_structs.hpp"
#include "E_MakkaWindowAnimState_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EventMiman_Answer.BP_EventMiman_Answer_C
// 0x0030 (0x0350 - 0x0320)
class ABP_EventMiman_Answer_C final : public ABP_EventMissionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_EventMiman_Answer_C;             // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScriptMessageAsset*                    EventMessageAsset;                                 // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 SpawnActor;                                        // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AutoRotateFocus_C*                  AutRotCtrl;                                        // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MapInt;                                            // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MakkaAmount;                                       // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CameraFocusEnd;                                    // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_EventMiman_Answer(int32 EntryPoint);
	void OpenDaath5();
	void CancelTalk();
	void NoMakka();
	void OpenMiman();
	void EndTalk();
	void OpenDaath4();
	void OpenDaath3();
	void OpenDaath2();
	void OpenDaath1();
	void TalkStart();
	void QuestExecute();
	void ReceiveBeginPlay();
	void CallDeactivate();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EventMiman_Answer_C">();
	}
	static class ABP_EventMiman_Answer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EventMiman_Answer_C>();
	}
};
static_assert(alignof(ABP_EventMiman_Answer_C) == 0x000008, "Wrong alignment on ABP_EventMiman_Answer_C");
static_assert(sizeof(ABP_EventMiman_Answer_C) == 0x000350, "Wrong size on ABP_EventMiman_Answer_C");
static_assert(offsetof(ABP_EventMiman_Answer_C, UberGraphFrame_BP_EventMiman_Answer_C) == 0x000320, "Member 'ABP_EventMiman_Answer_C::UberGraphFrame_BP_EventMiman_Answer_C' has a wrong offset!");
static_assert(offsetof(ABP_EventMiman_Answer_C, EventMessageAsset) == 0x000328, "Member 'ABP_EventMiman_Answer_C::EventMessageAsset' has a wrong offset!");
static_assert(offsetof(ABP_EventMiman_Answer_C, SpawnActor) == 0x000330, "Member 'ABP_EventMiman_Answer_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(ABP_EventMiman_Answer_C, AutRotCtrl) == 0x000338, "Member 'ABP_EventMiman_Answer_C::AutRotCtrl' has a wrong offset!");
static_assert(offsetof(ABP_EventMiman_Answer_C, MapInt) == 0x000340, "Member 'ABP_EventMiman_Answer_C::MapInt' has a wrong offset!");
static_assert(offsetof(ABP_EventMiman_Answer_C, MakkaAmount) == 0x000344, "Member 'ABP_EventMiman_Answer_C::MakkaAmount' has a wrong offset!");
static_assert(offsetof(ABP_EventMiman_Answer_C, CameraFocusEnd) == 0x000348, "Member 'ABP_EventMiman_Answer_C::CameraFocusEnd' has a wrong offset!");

}

