#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EncountArea_Magatsuka

#include "Basic.hpp"

#include "MagatsukaParam_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SymbolMoverData_structs.hpp"
#include "MagatsukaSymbolPoint_structs.hpp"
#include "Engine_structs.hpp"
#include "SymbolActPattern_structs.hpp"
#include "Project_structs.hpp"
#include "SpawnSymbolInfo_structs.hpp"


namespace SDK::Params
{

// Function BP_EncountArea_Magatsuka.BP_EncountArea_Magatsuka_C.ExecuteUbergraph_BP_EncountArea_Magatsuka
// 0x0250 (0x0250 - 0x0000)
struct BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26FF[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2700[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0034(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Discovery;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2701[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2702[0x2];                                     // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2703[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMagatsukaSymbolPoint>          K2Node_CustomEvent_EncountPackIndex;               // 0x0050(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_CustomEvent_NoEncount;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2704[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_RouteNodeSpace;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_RouteNode_LimitHeight;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_RouteNode_LimitSlope;           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_MagatsukaCenter;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2705[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      K2Node_CustomEvent_DevilLocationList;              // 0x0078(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_CustomEvent_SafeZoneID;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ManualSafeZone;                 // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_AttackAlongWall;                // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2706[0x2];                                     // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSymbolActPattern>              K2Node_CustomEvent_SecondActPatterns;              // 0x0090(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2707[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2708[0x2];                                     // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2709[0x1];                                     // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_270A[0x2];                                     // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBlankSpawnIndex_Index;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_270B[0x2];                                     // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMagatsukaSymbolPoint                  CallFunc_Array_Get_Item;                           // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_270C[0x2];                                     // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0100(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_270D[0xC];                                     // 0x0134(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpawnSymbolInfo                       K2Node_MakeStruct_SpawnSymbolInfo;                 // 0x0140(0x00A0)(HasGetValueTypeHash)
	bool                                          CallFunc_BPI_SpawnSymbol_NewParam;                 // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_270E[0x7];                                     // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     CallFunc_CalcSpawnPointList_Magatsuka_SpawnPoint;  // 0x01E8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_8;               // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_270F[0x2];                                     // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_SpawnSymbol_NewParam_1;               // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_MITAMA_ENCOUNT                              CallFunc_CalcMitama_MitamaType;                    // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x020B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2710[0x2];                                     // 0x0212(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_SpawnSymbol_NewParam_2;               // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2711[0x3];                                     // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2712[0x4];                                     // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     CallFunc_CalcSpawnPointList_Magatsuka_SpawnPoint_1; // 0x0228(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_SpawnSymbol_NewParam_3;               // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2713[0x3];                                     // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_9;               // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_10;              // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x024D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka) == 0x000010, "Wrong alignment on BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka");
static_assert(sizeof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka) == 0x000250, "Wrong size on BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, EntryPoint) == 0x000000, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, Temp_bool_Variable) == 0x000008, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, Temp_bool_Variable_1) == 0x000010, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, Temp_int_Array_Index_Variable_2) == 0x000024, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, Temp_int_Loop_Counter_Variable_2) == 0x000028, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, Temp_int_Variable) == 0x00002C, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Add_IntInt_ReturnValue_2) == 0x000030, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, Temp_name_Variable) == 0x000034, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, K2Node_CustomEvent_Discovery) == 0x00003C, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::K2Node_CustomEvent_Discovery' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, Temp_int_Variable_1) == 0x000040, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, Temp_bool_True_if_break_was_hit_Variable) == 0x000044, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Not_PreBool_ReturnValue) == 0x000045, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, K2Node_CustomEvent_EncountPackIndex) == 0x000050, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::K2Node_CustomEvent_EncountPackIndex' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, K2Node_CustomEvent_NoEncount) == 0x000060, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::K2Node_CustomEvent_NoEncount' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, K2Node_CustomEvent_RouteNodeSpace) == 0x000064, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::K2Node_CustomEvent_RouteNodeSpace' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, K2Node_CustomEvent_RouteNode_LimitHeight) == 0x000068, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::K2Node_CustomEvent_RouteNode_LimitHeight' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, K2Node_CustomEvent_RouteNode_LimitSlope) == 0x00006C, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::K2Node_CustomEvent_RouteNode_LimitSlope' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, K2Node_CustomEvent_MagatsukaCenter) == 0x000070, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::K2Node_CustomEvent_MagatsukaCenter' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, K2Node_CustomEvent_DevilLocationList) == 0x000078, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::K2Node_CustomEvent_DevilLocationList' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, K2Node_CustomEvent_SafeZoneID) == 0x000088, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::K2Node_CustomEvent_SafeZoneID' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, K2Node_CustomEvent_ManualSafeZone) == 0x00008C, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::K2Node_CustomEvent_ManualSafeZone' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, K2Node_CustomEvent_AttackAlongWall) == 0x00008D, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::K2Node_CustomEvent_AttackAlongWall' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, K2Node_CustomEvent_SecondActPatterns) == 0x000090, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::K2Node_CustomEvent_SecondActPatterns' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Array_Add_ReturnValue) == 0x0000A4, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Array_Length_ReturnValue_2) == 0x0000A8, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, Temp_int_Loop_Counter_Variable_3) == 0x0000AC, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000B4, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_BooleanAND_ReturnValue) == 0x0000B8, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, Temp_bool_True_if_break_was_hit_Variable_1) == 0x0000B9, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Array_Length_ReturnValue_3) == 0x0000BC, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C0, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000C1, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_BooleanAND_ReturnValue_1) == 0x0000C2, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000C4, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Array_Length_ReturnValue_4) == 0x0000C8, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Percent_IntInt_ReturnValue) == 0x0000CC, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000D0, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Not_PreBool_ReturnValue_3) == 0x0000D1, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_GetBlankSpawnIndex_Index) == 0x0000D4, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_GetBlankSpawnIndex_Index' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_BooleanAND_ReturnValue_2) == 0x0000D8, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000D9, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Array_Length_ReturnValue_5) == 0x0000DC, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Array_Length_ReturnValue_6) == 0x0000F8, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000FC, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_IsValid_ReturnValue) == 0x0000FD, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_GetTransform_ReturnValue) == 0x000100, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, Temp_int_Array_Index_Variable_3) == 0x000130, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, K2Node_MakeStruct_SpawnSymbolInfo) == 0x000140, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::K2Node_MakeStruct_SpawnSymbolInfo' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_BPI_SpawnSymbol_NewParam) == 0x0001E0, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_BPI_SpawnSymbol_NewParam' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_CalcSpawnPointList_Magatsuka_SpawnPoint) == 0x0001E8, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_CalcSpawnPointList_Magatsuka_SpawnPoint' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Array_Length_ReturnValue_7) == 0x0001F8, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Array_Length_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Array_Length_ReturnValue_8) == 0x0001FC, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Array_Length_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Greater_IntInt_ReturnValue) == 0x000200, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Less_IntInt_ReturnValue_3) == 0x000201, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, Temp_int_Variable_2) == 0x000204, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_BPI_SpawnSymbol_NewParam_1) == 0x000208, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_BPI_SpawnSymbol_NewParam_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_CalcMitama_MitamaType) == 0x000209, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_CalcMitama_MitamaType' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Not_PreBool_ReturnValue_4) == 0x00020A, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Not_PreBool_ReturnValue_5) == 0x00020B, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, Temp_int_Loop_Counter_Variable_4) == 0x00020C, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_BooleanAND_ReturnValue_3) == 0x000210, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Less_IntInt_ReturnValue_4) == 0x000211, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Add_IntInt_ReturnValue_5) == 0x000214, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_BPI_SpawnSymbol_NewParam_2) == 0x000218, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_BPI_SpawnSymbol_NewParam_2' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Add_IntInt_ReturnValue_6) == 0x00021C, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Add_IntInt_ReturnValue_7) == 0x000220, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_CalcSpawnPointList_Magatsuka_SpawnPoint_1) == 0x000228, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_CalcSpawnPointList_Magatsuka_SpawnPoint_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, Temp_int_Array_Index_Variable_4) == 0x000238, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Add_IntInt_ReturnValue_8) == 0x00023C, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Add_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_BPI_SpawnSymbol_NewParam_3) == 0x000240, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_BPI_SpawnSymbol_NewParam_3' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Array_Length_ReturnValue_9) == 0x000244, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Array_Length_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Array_Length_ReturnValue_10) == 0x000248, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Array_Length_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Less_IntInt_ReturnValue_5) == 0x00024C, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka, CallFunc_Less_IntInt_ReturnValue_6) == 0x00024D, "Member 'BP_EncountArea_Magatsuka_C_ExecuteUbergraph_BP_EncountArea_Magatsuka::CallFunc_Less_IntInt_ReturnValue_6' has a wrong offset!");

// Function BP_EncountArea_Magatsuka.BP_EncountArea_Magatsuka_C.InitMagatsukaArea
// 0x0050 (0x0050 - 0x0000)
struct BP_EncountArea_Magatsuka_C_InitMagatsukaArea final
{
public:
	TArray<struct FMagatsukaSymbolPoint>          EncountPackIndex;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Param_NoEncount;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2714[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Param_RouteNodeSpace;                              // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_RouteNode_LimitHeight;                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_RouteNode_LimitSlope;                        // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_MagatsukaCenter;                             // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2715[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      Param_DevilLocationList;                           // 0x0028(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Param_SafeZoneID;                                  // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_ManualSafeZone;                              // 0x003C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Param_AttackAlongWall;                             // 0x003D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2716[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSymbolActPattern>              Param_SecondActPatterns;                           // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_EncountArea_Magatsuka_C_InitMagatsukaArea) == 0x000008, "Wrong alignment on BP_EncountArea_Magatsuka_C_InitMagatsukaArea");
static_assert(sizeof(BP_EncountArea_Magatsuka_C_InitMagatsukaArea) == 0x000050, "Wrong size on BP_EncountArea_Magatsuka_C_InitMagatsukaArea");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_InitMagatsukaArea, EncountPackIndex) == 0x000000, "Member 'BP_EncountArea_Magatsuka_C_InitMagatsukaArea::EncountPackIndex' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_InitMagatsukaArea, Param_NoEncount) == 0x000010, "Member 'BP_EncountArea_Magatsuka_C_InitMagatsukaArea::Param_NoEncount' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_InitMagatsukaArea, Param_RouteNodeSpace) == 0x000014, "Member 'BP_EncountArea_Magatsuka_C_InitMagatsukaArea::Param_RouteNodeSpace' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_InitMagatsukaArea, Param_RouteNode_LimitHeight) == 0x000018, "Member 'BP_EncountArea_Magatsuka_C_InitMagatsukaArea::Param_RouteNode_LimitHeight' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_InitMagatsukaArea, Param_RouteNode_LimitSlope) == 0x00001C, "Member 'BP_EncountArea_Magatsuka_C_InitMagatsukaArea::Param_RouteNode_LimitSlope' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_InitMagatsukaArea, Param_MagatsukaCenter) == 0x000020, "Member 'BP_EncountArea_Magatsuka_C_InitMagatsukaArea::Param_MagatsukaCenter' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_InitMagatsukaArea, Param_DevilLocationList) == 0x000028, "Member 'BP_EncountArea_Magatsuka_C_InitMagatsukaArea::Param_DevilLocationList' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_InitMagatsukaArea, Param_SafeZoneID) == 0x000038, "Member 'BP_EncountArea_Magatsuka_C_InitMagatsukaArea::Param_SafeZoneID' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_InitMagatsukaArea, Param_ManualSafeZone) == 0x00003C, "Member 'BP_EncountArea_Magatsuka_C_InitMagatsukaArea::Param_ManualSafeZone' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_InitMagatsukaArea, Param_AttackAlongWall) == 0x00003D, "Member 'BP_EncountArea_Magatsuka_C_InitMagatsukaArea::Param_AttackAlongWall' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_InitMagatsukaArea, Param_SecondActPatterns) == 0x000040, "Member 'BP_EncountArea_Magatsuka_C_InitMagatsukaArea::Param_SecondActPatterns' has a wrong offset!");

// Function BP_EncountArea_Magatsuka.BP_EncountArea_Magatsuka_C.MagatsukaDiscovery
// 0x0001 (0x0001 - 0x0000)
struct BP_EncountArea_Magatsuka_C_MagatsukaDiscovery final
{
public:
	bool                                          Param_Discovery;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EncountArea_Magatsuka_C_MagatsukaDiscovery) == 0x000001, "Wrong alignment on BP_EncountArea_Magatsuka_C_MagatsukaDiscovery");
static_assert(sizeof(BP_EncountArea_Magatsuka_C_MagatsukaDiscovery) == 0x000001, "Wrong size on BP_EncountArea_Magatsuka_C_MagatsukaDiscovery");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_MagatsukaDiscovery, Param_Discovery) == 0x000000, "Member 'BP_EncountArea_Magatsuka_C_MagatsukaDiscovery::Param_Discovery' has a wrong offset!");

// Function BP_EncountArea_Magatsuka.BP_EncountArea_Magatsuka_C.InitMagatsukaParamTable
// 0x0040 (0x0040 - 0x0000)
struct BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2717[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0010(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMagatsukaParam                        CallFunc_GetDataTableRowFromName_OutRow;           // 0x002C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable) == 0x000008, "Wrong alignment on BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable");
static_assert(sizeof(BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable) == 0x000040, "Wrong size on BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000010, "Member 'BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable, CallFunc_GetDataTableRowFromName_OutRow) == 0x00002C, "Member 'BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000038, "Member 'BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable, CallFunc_Less_IntInt_ReturnValue) == 0x000039, "Member 'BP_EncountArea_Magatsuka_C_InitMagatsukaParamTable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_EncountArea_Magatsuka.BP_EncountArea_Magatsuka_C.CalcSpawnPointList_Magatsuka
// 0x0680 (0x0680 - 0x0000)
struct BP_EncountArea_Magatsuka_C_CalcSpawnPointList_Magatsuka final
{
public:
	int32                                         Param_SpawnNum;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2718[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     SpawnPoint;                                        // 0x0008(0x0010)(Parm, OutParm)
	int32                                         L_SymbolID;                                        // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2719[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPackEncount                           L_Pack;                                            // 0x0020(0x0058)(Edit, BlueprintVisible)
	bool                                          L_Check;                                           // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271A[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                L_Target;                                          // 0x007C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                L_Center;                                          // 0x0088(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_index;                                           // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              L_Offset;                                          // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                L_Right;                                           // 0x00A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                L_Forward;                                         // 0x00AC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_Height;                                          // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_Length;                                          // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     L_SpawnPoint;                                      // 0x00C0(0x0010)(Edit, BlueprintVisible)
	struct FVector                                L_Pos;                                             // 0x00D0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_Cnt;                                             // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00E0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271B[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x00F8(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271C[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPackEncount                           CallFunc_GetEncountPack_Pack;                      // 0x0110(0x0058)()
	int32                                         CallFunc_GetEncountPack_PackId;                    // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCanSpawnSymbol_Can;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271D[0x3];                                     // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CheckCanSpawnSymbol_SpawnerRadius;        // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271E[0x8];                                     // 0x0178(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0180(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_InComeArea_In;                        // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271F[0x3];                                     // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckFly_IsFly;                           // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2720[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
