#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventCameraBlend

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EventCameraBlend.BP_EventCameraBlend_C
// 0x0018 (0x0238 - 0x0220)
class ABP_EventCameraBlend_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         PrevBlendTime;                                     // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PrevGameTime;                                      // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_EventCameraBlend(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void SetCameraBlend(class AActor* NewViewTarget, float BlendTime, EViewTargetBlendFunction BlendFunc, float BlendExp, bool CheckPrevBlend);
	void SetCameraChange(class AActor* NewViewTarget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EventCameraBlend_C">();
	}
	static class ABP_EventCameraBlend_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EventCameraBlend_C>();
	}
};
static_assert(alignof(ABP_EventCameraBlend_C) == 0x000008, "Wrong alignment on ABP_EventCameraBlend_C");
static_assert(sizeof(ABP_EventCameraBlend_C) == 0x000238, "Wrong size on ABP_EventCameraBlend_C");
static_assert(offsetof(ABP_EventCameraBlend_C, UberGraphFrame) == 0x000220, "Member 'ABP_EventCameraBlend_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EventCameraBlend_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_EventCameraBlend_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_EventCameraBlend_C, PrevBlendTime) == 0x000230, "Member 'ABP_EventCameraBlend_C::PrevBlendTime' has a wrong offset!");
static_assert(offsetof(ABP_EventCameraBlend_C, PrevGameTime) == 0x000234, "Member 'ABP_EventCameraBlend_C::PrevGameTime' has a wrong offset!");

}

