#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EncountArea_GiveUp

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EncountArea_GiveUp.BP_EncountArea_GiveUp_C.ExecuteUbergraph_BP_EncountArea_GiveUp
// 0x00F8 (0x00F8 - 0x0000)
struct BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C93C[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C93D[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0038(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_GiveUp_Success;                           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C93E[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x00C8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C93F[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GiveUp_Success_1;                         // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C940[0x2];                                     // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp) == 0x000008, "Wrong alignment on BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp");
static_assert(sizeof(BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp) == 0x0000F8, "Wrong size on BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp");
static_assert(offsetof(BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp, EntryPoint) == 0x000000, "Member 'BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000018, "Member 'BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp, K2Node_ComponentBoundEvent_OtherActor) == 0x000020, "Member 'BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp, K2Node_ComponentBoundEvent_OtherComp) == 0x000028, "Member 'BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000030, "Member 'BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp, K2Node_ComponentBoundEvent_bFromSweep) == 0x000034, "Member 'BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp, K2Node_ComponentBoundEvent_SweepResult) == 0x000038, "Member 'BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp, CallFunc_GiveUp_Success) == 0x0000C0, "Member 'BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp::CallFunc_GiveUp_Success' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp, CallFunc_Not_PreBool_ReturnValue) == 0x0000C1, "Member 'BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp, CallFunc_GetOverlappingActors_OverlappingActors) == 0x0000C8, "Member 'BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp, CallFunc_Greater_IntInt_ReturnValue) == 0x0000E8, "Member 'BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp, CallFunc_GiveUp_Success_1) == 0x0000E9, "Member 'BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp::CallFunc_GiveUp_Success_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp, CallFunc_Array_Length_ReturnValue_1) == 0x0000EC, "Member 'BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp, CallFunc_Less_IntInt_ReturnValue) == 0x0000F0, "Member 'BP_EncountArea_GiveUp_C_ExecuteUbergraph_BP_EncountArea_GiveUp::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_EncountArea_GiveUp.BP_EncountArea_GiveUp_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_EncountArea_GiveUp_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EncountArea_GiveUp_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_EncountArea_GiveUp_C_ReceiveTick");
static_assert(sizeof(BP_EncountArea_GiveUp_C_ReceiveTick) == 0x000004, "Wrong size on BP_EncountArea_GiveUp_C_ReceiveTick");
static_assert(offsetof(BP_EncountArea_GiveUp_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_EncountArea_GiveUp_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_EncountArea_GiveUp.BP_EncountArea_GiveUp_C.Giveup
// 0x0038 (0x0038 - 0x0000)
struct BP_EncountArea_GiveUp_C_Giveup final
{
public:
	class AActor*                                 Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C941[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMapSymbolBaseCompornent_C*             L_Comp;                                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACustomPawn*                            K2Node_DynamicCast_AsCustom_Pawn;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C942[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMapSymbolBaseCompornent_C*             K2Node_DynamicCast_AsMap_Symbol_Base_Compornent;   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GiveUp_Success;                           // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EncountArea_GiveUp_C_Giveup) == 0x000008, "Wrong alignment on BP_EncountArea_GiveUp_C_Giveup");
static_assert(sizeof(BP_EncountArea_GiveUp_C_Giveup) == 0x000038, "Wrong size on BP_EncountArea_GiveUp_C_Giveup");
static_assert(offsetof(BP_EncountArea_GiveUp_C_Giveup, Pawn) == 0x000000, "Member 'BP_EncountArea_GiveUp_C_Giveup::Pawn' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_Giveup, Success) == 0x000008, "Member 'BP_EncountArea_GiveUp_C_Giveup::Success' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_Giveup, L_Comp) == 0x000010, "Member 'BP_EncountArea_GiveUp_C_Giveup::L_Comp' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_Giveup, K2Node_DynamicCast_AsCustom_Pawn) == 0x000018, "Member 'BP_EncountArea_GiveUp_C_Giveup::K2Node_DynamicCast_AsCustom_Pawn' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_Giveup, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_EncountArea_GiveUp_C_Giveup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_Giveup, K2Node_DynamicCast_AsMap_Symbol_Base_Compornent) == 0x000028, "Member 'BP_EncountArea_GiveUp_C_Giveup::K2Node_DynamicCast_AsMap_Symbol_Base_Compornent' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_Giveup, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_EncountArea_GiveUp_C_Giveup::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_Giveup, CallFunc_GiveUp_Success) == 0x000031, "Member 'BP_EncountArea_GiveUp_C_Giveup::CallFunc_GiveUp_Success' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_Giveup, K2Node_SwitchEnum_CmpSuccess) == 0x000032, "Member 'BP_EncountArea_GiveUp_C_Giveup::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_EncountArea_GiveUp.BP_EncountArea_GiveUp_C.BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_EncountArea_GiveUp_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C943[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_EncountArea_GiveUp_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_EncountArea_GiveUp_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_EncountArea_GiveUp_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_EncountArea_GiveUp_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_EncountArea_GiveUp_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_EncountArea_GiveUp_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_EncountArea_GiveUp_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_EncountArea_GiveUp_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_EncountArea_GiveUp_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_EncountArea_GiveUp_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_GiveUp_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_EncountArea_GiveUp_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

}

