#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ENVArea

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ENVArea.BP_ENVArea_C.ExecuteUbergraph_BP_ENVArea
// 0x0038 (0x0038 - 0x0000)
struct BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_561D[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_561E[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_1;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFadeRate_FadeRate;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea) == 0x000008, "Wrong alignment on BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea");
static_assert(sizeof(BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea) == 0x000038, "Wrong size on BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea");
static_assert(offsetof(BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea, EntryPoint) == 0x000000, "Member 'BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea, K2Node_Event_OtherActor_1) == 0x000008, "Member 'BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea, K2Node_Event_OtherActor) == 0x000010, "Member 'BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea, CallFunc_Get_ReturnValue) == 0x000018, "Member 'BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000020, "Member 'BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea, CallFunc_Get_ReturnValue_1) == 0x000028, "Member 'BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea, CallFunc_GetFadeRate_FadeRate) == 0x000030, "Member 'BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea::CallFunc_GetFadeRate_FadeRate' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea, CallFunc_IsValid_ReturnValue_1) == 0x000035, "Member 'BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea, Temp_bool_IsClosed_Variable) == 0x000036, "Member 'BP_ENVArea_C_ExecuteUbergraph_BP_ENVArea::Temp_bool_IsClosed_Variable' has a wrong offset!");

// Function BP_ENVArea.BP_ENVArea_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ENVArea_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ENVArea_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ENVArea_C_ReceiveTick");
static_assert(sizeof(BP_ENVArea_C_ReceiveTick) == 0x000004, "Wrong size on BP_ENVArea_C_ReceiveTick");
static_assert(offsetof(BP_ENVArea_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ENVArea_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ENVArea.BP_ENVArea_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_ENVArea_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ENVArea_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on BP_ENVArea_C_ReceiveActorEndOverlap");
static_assert(sizeof(BP_ENVArea_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on BP_ENVArea_C_ReceiveActorEndOverlap");
static_assert(offsetof(BP_ENVArea_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'BP_ENVArea_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function BP_ENVArea.BP_ENVArea_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_ENVArea_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ENVArea_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_ENVArea_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_ENVArea_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_ENVArea_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_ENVArea_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_ENVArea_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_ENVArea.BP_ENVArea_C.UserConstructionScript
// 0x0090 (0x0090 - 0x0000)
struct BP_ENVArea_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561F[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCapsuleComponent*>              CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class USphereComponent*>               CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UCapsuleComponent*                      CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5620[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBoxComponent*>                  CallFunc_K2_GetComponentsByClass_ReturnValue_2;    // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5621[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          CallFunc_Array_Get_Item_2;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ENVArea_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_ENVArea_C_UserConstructionScript");
static_assert(sizeof(BP_ENVArea_C_UserConstructionScript) == 0x000090, "Wrong size on BP_ENVArea_C_UserConstructionScript");
static_assert(offsetof(BP_ENVArea_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_ENVArea_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_ENVArea_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_ENVArea_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_UserConstructionScript, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'BP_ENVArea_C_UserConstructionScript::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_UserConstructionScript, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'BP_ENVArea_C_UserConstructionScript::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'BP_ENVArea_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_UserConstructionScript, Temp_int_Array_Index_Variable_2) == 0x000018, "Member 'BP_ENVArea_C_UserConstructionScript::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_UserConstructionScript, Temp_int_Loop_Counter_Variable_2) == 0x00001C, "Member 'BP_ENVArea_C_UserConstructionScript::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_2) == 0x000020, "Member 'BP_ENVArea_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_UserConstructionScript, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000028, "Member 'BP_ENVArea_C_UserConstructionScript::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_UserConstructionScript, CallFunc_K2_GetComponentsByClass_ReturnValue_1) == 0x000038, "Member 'BP_ENVArea_C_UserConstructionScript::CallFunc_K2_GetComponentsByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_ENVArea_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_UserConstructionScript, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'BP_ENVArea_C_UserConstructionScript::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_ENVArea_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_1) == 0x00005C, "Member 'BP_ENVArea_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_ENVArea_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue_1) == 0x000061, "Member 'BP_ENVArea_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_UserConstructionScript, CallFunc_K2_GetComponentsByClass_ReturnValue_2) == 0x000068, "Member 'BP_ENVArea_C_UserConstructionScript::CallFunc_K2_GetComponentsByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_2) == 0x000078, "Member 'BP_ENVArea_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_UserConstructionScript, CallFunc_Array_Get_Item_2) == 0x000080, "Member 'BP_ENVArea_C_UserConstructionScript::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_ENVArea_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue_2) == 0x000088, "Member 'BP_ENVArea_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

}

