#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventHoveringGrass

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EventHoveringGrass.BP_EventHoveringGrass_C.ExecuteUbergraph_BP_EventHoveringGrass
// 0x00F8 (0x00F8 - 0x0000)
struct BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AInstancedFoliageActor*>         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0040(0x0010)(ReferenceParm)
	class AInstancedFoliageActor*                 CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8197[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFoliageInstancedStaticMeshComponent*> CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8198[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFoliageInstancedStaticMeshComponent*   CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0080(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8199[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_2;                         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_819A[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterial*                              CallFunc_GetBaseMaterial_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_819B[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_819C[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFoliageInstancedStaticMeshComponent*   CallFunc_Array_Get_Item_3;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue_1;               // 0x00D8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass) == 0x000008, "Wrong alignment on BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass");
static_assert(sizeof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass) == 0x0000F8, "Wrong size on BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, EntryPoint) == 0x000000, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, Temp_int_Loop_Counter_Variable_2) == 0x00001C, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_Add_IntInt_ReturnValue_2) == 0x000020, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, Temp_int_Array_Index_Variable_2) == 0x000024, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, Temp_int_Loop_Counter_Variable_3) == 0x000028, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_Add_IntInt_ReturnValue_3) == 0x00002C, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, Temp_int_Array_Index_Variable_3) == 0x000030, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, Temp_int_Loop_Counter_Variable_4) == 0x000034, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_Add_IntInt_ReturnValue_4) == 0x000038, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, Temp_int_Array_Index_Variable_4) == 0x00003C, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_GetAllActorsOfClass_OutActors) == 0x000040, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000060, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_GetMaterials_ReturnValue) == 0x000080, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_Array_Length_ReturnValue_1) == 0x000090, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_Array_Get_Item_2) == 0x000098, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A0, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000A8, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_GetBaseMaterial_ReturnValue) == 0x0000B0, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_GetBaseMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_Array_Length_ReturnValue_2) == 0x0000B8, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000BC, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000BD, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0000BE, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_BooleanOR_ReturnValue) == 0x0000BF, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_Array_AddUnique_ReturnValue) == 0x0000C0, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, K2Node_Event_EndPlayReason) == 0x0000C4, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_Array_Add_ReturnValue) == 0x0000C8, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_Array_Get_Item_3) == 0x0000D0, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_GetMaterials_ReturnValue_1) == 0x0000D8, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_GetMaterials_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_Array_Length_ReturnValue_3) == 0x0000E8, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_Array_Length_ReturnValue_4) == 0x0000EC, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_Less_IntInt_ReturnValue_3) == 0x0000F0, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass, CallFunc_Less_IntInt_ReturnValue_4) == 0x0000F1, "Member 'BP_EventHoveringGrass_C_ExecuteUbergraph_BP_EventHoveringGrass::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");

// Function BP_EventHoveringGrass.BP_EventHoveringGrass_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_EventHoveringGrass_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventHoveringGrass_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_EventHoveringGrass_C_ReceiveEndPlay");
static_assert(sizeof(BP_EventHoveringGrass_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_EventHoveringGrass_C_ReceiveEndPlay");
static_assert(offsetof(BP_EventHoveringGrass_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_EventHoveringGrass_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

