#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventScriptArea

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EventScriptArea.BP_EventScriptArea_C
// 0x0060 (0x0280 - 0x0220)
class ABP_EventScriptArea_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          UnloadBox;                                         // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          LoadBox;                                           // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoxSize;                                           // 0x0240(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BoxDiff;                                           // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseMakeActorList;                                  // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ActiveArea;                                        // 0x0251(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSpawn;                                           // 0x0252(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6522[0x5];                                     // 0x0253(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_EventAreaActor_C*>           ActorList;                                         // 0x0258(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ABP_EventScriptArea_Add_C*>      AddArea;                                           // 0x0268(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         SplitIndex;                                        // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSpawnScriptSplit;                                // 0x027C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DebugPrintBoxDiff;                                 // 0x027D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_EventScriptArea(int32 EntryPoint);
	void SpawnScriptSplit();
	void BndEvt__UnloadBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__LoadBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void SpawnRefresh();
	void EndOverlap();
	void BeginOverlap();
	void ReceiveBeginPlay();
	void BI_RecalcOverlap();
	void BI_ChangeMaterialAlice();
	void PlayDeadMotion(bool Active);
	void CallDeactivate();
	void DestroyKeyFree();
	void CheckActive();
	void UserConstructionScript();
	void MakeActorList();
	void SpawnScript();
	void DeleteScript();
	void CheckActiveArea(bool* IsActive);
	void SpawnReflesh(bool* NoUse);
	void BI_FadeInBlack(float Time, bool* Ret);
	void BI_FadeOutBlack(float Time, bool* Ret);
	void BI_FadeInWhite(float Time, bool* Ret);
	void BI_FadeOutWhite(float Time, bool* Ret);
	void BI_DeleteScript(bool* NoUse);
	void BI_SpawnScript(bool* NoUse);
	void BI_CheckActiveArea(bool* IsActive);
	void ForceSpawnScript(bool* NoUse);
	void BI_SetInvalidWindow(bool Invalid, bool* NoUse);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EventScriptArea_C">();
	}
	static class ABP_EventScriptArea_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EventScriptArea_C>();
	}
};
static_assert(alignof(ABP_EventScriptArea_C) == 0x000008, "Wrong alignment on ABP_EventScriptArea_C");
static_assert(sizeof(ABP_EventScriptArea_C) == 0x000280, "Wrong size on ABP_EventScriptArea_C");
static_assert(offsetof(ABP_EventScriptArea_C, UberGraphFrame) == 0x000220, "Member 'ABP_EventScriptArea_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EventScriptArea_C, UnloadBox) == 0x000228, "Member 'ABP_EventScriptArea_C::UnloadBox' has a wrong offset!");
static_assert(offsetof(ABP_EventScriptArea_C, LoadBox) == 0x000230, "Member 'ABP_EventScriptArea_C::LoadBox' has a wrong offset!");
static_assert(offsetof(ABP_EventScriptArea_C, DefaultSceneRoot) == 0x000238, "Member 'ABP_EventScriptArea_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_EventScriptArea_C, BoxSize) == 0x000240, "Member 'ABP_EventScriptArea_C::BoxSize' has a wrong offset!");
static_assert(offsetof(ABP_EventScriptArea_C, BoxDiff) == 0x00024C, "Member 'ABP_EventScriptArea_C::BoxDiff' has a wrong offset!");
static_assert(offsetof(ABP_EventScriptArea_C, UseMakeActorList) == 0x000250, "Member 'ABP_EventScriptArea_C::UseMakeActorList' has a wrong offset!");
static_assert(offsetof(ABP_EventScriptArea_C, ActiveArea) == 0x000251, "Member 'ABP_EventScriptArea_C::ActiveArea' has a wrong offset!");
static_assert(offsetof(ABP_EventScriptArea_C, IsSpawn) == 0x000252, "Member 'ABP_EventScriptArea_C::IsSpawn' has a wrong offset!");
static_assert(offsetof(ABP_EventScriptArea_C, ActorList) == 0x000258, "Member 'ABP_EventScriptArea_C::ActorList' has a wrong offset!");
static_assert(offsetof(ABP_EventScriptArea_C, AddArea) == 0x000268, "Member 'ABP_EventScriptArea_C::AddArea' has a wrong offset!");
static_assert(offsetof(ABP_EventScriptArea_C, SplitIndex) == 0x000278, "Member 'ABP_EventScriptArea_C::SplitIndex' has a wrong offset!");
static_assert(offsetof(ABP_EventScriptArea_C, IsSpawnScriptSplit) == 0x00027C, "Member 'ABP_EventScriptArea_C::IsSpawnScriptSplit' has a wrong offset!");
static_assert(offsetof(ABP_EventScriptArea_C, DebugPrintBoxDiff) == 0x00027D, "Member 'ABP_EventScriptArea_C::DebugPrintBoxDiff' has a wrong offset!");

}

