#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EncountArea_OptionHit

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EncountArea_OptionHit.BP_EncountArea_OptionHit_C.ExecuteUbergraph_BP_EncountArea_OptionHit
// 0x02A8 (0x02A8 - 0x0000)
struct BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_8DF1[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8DF2[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0058(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8DF3[0x2];                                     // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent_3;          // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor_3;                   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp_3;                    // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex_3;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFromSweep_1;                   // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8DF4[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult_1;                  // 0x0120(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent_2;          // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor_2;                   // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp_2;                    // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex_2;               // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8DF5[0x2];                                     // 0x01C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x01C8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8DF6[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent_1;          // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor_1;                   // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp_1;                    // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex_1;               // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFromSweep;                     // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8DF7[0x3];                                     // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult;                    // 0x0200(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent;            // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex;                 // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CalcCapsuleOverlap_Overlap;               // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CalcCapsuleOverlap_Overlap_1;             // 0x02A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x02A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit) == 0x000008, "Wrong alignment on BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit");
static_assert(sizeof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit) == 0x0002A8, "Wrong size on BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, EntryPoint) == 0x000000, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000038, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000040, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000048, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000050, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_ComponentBoundEvent_bFromSweep) == 0x000054, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_ComponentBoundEvent_SweepResult) == 0x000058, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000E0, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_ComponentBoundEvent_OtherActor) == 0x0000E8, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_ComponentBoundEvent_OtherComp) == 0x0000F0, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0000F8, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, CallFunc_Not_PreBool_ReturnValue) == 0x0000FC, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, CallFunc_IsValid_ReturnValue) == 0x0000FD, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CustomEvent_OverlappedComponent_3) == 0x000100, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CustomEvent_OverlappedComponent_3' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CustomEvent_OtherActor_3) == 0x000108, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CustomEvent_OtherActor_3' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CustomEvent_OtherComp_3) == 0x000110, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CustomEvent_OtherComp_3' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CustomEvent_OtherBodyIndex_3) == 0x000118, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CustomEvent_OtherBodyIndex_3' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CustomEvent_bFromSweep_1) == 0x00011C, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CustomEvent_bFromSweep_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CustomEvent_SweepResult_1) == 0x000120, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CustomEvent_SweepResult_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CustomEvent_OverlappedComponent_2) == 0x0001A8, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CustomEvent_OverlappedComponent_2' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CustomEvent_OtherActor_2) == 0x0001B0, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CustomEvent_OtherActor_2' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CustomEvent_OtherComp_2) == 0x0001B8, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CustomEvent_OtherComp_2' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CustomEvent_OtherBodyIndex_2) == 0x0001C0, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CustomEvent_OtherBodyIndex_2' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001C4, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001C5, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001C8, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, CallFunc_IsValid_ReturnValue_1) == 0x0001D8, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CustomEvent_OverlappedComponent_1) == 0x0001E0, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CustomEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CustomEvent_OtherActor_1) == 0x0001E8, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CustomEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CustomEvent_OtherComp_1) == 0x0001F0, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CustomEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CustomEvent_OtherBodyIndex_1) == 0x0001F8, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CustomEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CustomEvent_bFromSweep) == 0x0001FC, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CustomEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CustomEvent_SweepResult) == 0x000200, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CustomEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CustomEvent_OverlappedComponent) == 0x000288, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CustomEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CustomEvent_OtherActor) == 0x000290, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CustomEvent_OtherComp) == 0x000298, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, K2Node_CustomEvent_OtherBodyIndex) == 0x0002A0, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::K2Node_CustomEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, CallFunc_CalcCapsuleOverlap_Overlap) == 0x0002A4, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::CallFunc_CalcCapsuleOverlap_Overlap' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, CallFunc_CalcCapsuleOverlap_Overlap_1) == 0x0002A5, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::CallFunc_CalcCapsuleOverlap_Overlap_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit, CallFunc_Not_PreBool_ReturnValue_3) == 0x0002A6, "Member 'BP_EncountArea_OptionHit_C_ExecuteUbergraph_BP_EncountArea_OptionHit::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");

// Function BP_EncountArea_OptionHit.BP_EncountArea_OptionHit_C.OnCapsuleComponentEndOverlap
// 0x0020 (0x0020 - 0x0000)
struct BP_EncountArea_OptionHit_C_OnCapsuleComponentEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EncountArea_OptionHit_C_OnCapsuleComponentEndOverlap) == 0x000008, "Wrong alignment on BP_EncountArea_OptionHit_C_OnCapsuleComponentEndOverlap");
static_assert(sizeof(BP_EncountArea_OptionHit_C_OnCapsuleComponentEndOverlap) == 0x000020, "Wrong size on BP_EncountArea_OptionHit_C_OnCapsuleComponentEndOverlap");
static_assert(offsetof(BP_EncountArea_OptionHit_C_OnCapsuleComponentEndOverlap, OverlappedComponent) == 0x000000, "Member 'BP_EncountArea_OptionHit_C_OnCapsuleComponentEndOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_OnCapsuleComponentEndOverlap, OtherActor) == 0x000008, "Member 'BP_EncountArea_OptionHit_C_OnCapsuleComponentEndOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_OnCapsuleComponentEndOverlap, OtherComp) == 0x000010, "Member 'BP_EncountArea_OptionHit_C_OnCapsuleComponentEndOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_OnCapsuleComponentEndOverlap, OtherBodyIndex) == 0x000018, "Member 'BP_EncountArea_OptionHit_C_OnCapsuleComponentEndOverlap::OtherBodyIndex' has a wrong offset!");

// Function BP_EncountArea_OptionHit.BP_EncountArea_OptionHit_C.OnCapsuleComponentBeginOverlap
// 0x00A8 (0x00A8 - 0x0000)
struct BP_EncountArea_OptionHit_C_OnCapsuleComponentBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8DF8[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_EncountArea_OptionHit_C_OnCapsuleComponentBeginOverlap) == 0x000008, "Wrong alignment on BP_EncountArea_OptionHit_C_OnCapsuleComponentBeginOverlap");
static_assert(sizeof(BP_EncountArea_OptionHit_C_OnCapsuleComponentBeginOverlap) == 0x0000A8, "Wrong size on BP_EncountArea_OptionHit_C_OnCapsuleComponentBeginOverlap");
static_assert(offsetof(BP_EncountArea_OptionHit_C_OnCapsuleComponentBeginOverlap, OverlappedComponent) == 0x000000, "Member 'BP_EncountArea_OptionHit_C_OnCapsuleComponentBeginOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_OnCapsuleComponentBeginOverlap, OtherActor) == 0x000008, "Member 'BP_EncountArea_OptionHit_C_OnCapsuleComponentBeginOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_OnCapsuleComponentBeginOverlap, OtherComp) == 0x000010, "Member 'BP_EncountArea_OptionHit_C_OnCapsuleComponentBeginOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_OnCapsuleComponentBeginOverlap, OtherBodyIndex) == 0x000018, "Member 'BP_EncountArea_OptionHit_C_OnCapsuleComponentBeginOverlap::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_OnCapsuleComponentBeginOverlap, bFromSweep) == 0x00001C, "Member 'BP_EncountArea_OptionHit_C_OnCapsuleComponentBeginOverlap::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_OnCapsuleComponentBeginOverlap, SweepResult) == 0x000020, "Member 'BP_EncountArea_OptionHit_C_OnCapsuleComponentBeginOverlap::SweepResult' has a wrong offset!");

// Function BP_EncountArea_OptionHit.BP_EncountArea_OptionHit_C.OnSphereComponentEndOverlap
// 0x0020 (0x0020 - 0x0000)
struct BP_EncountArea_OptionHit_C_OnSphereComponentEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EncountArea_OptionHit_C_OnSphereComponentEndOverlap) == 0x000008, "Wrong alignment on BP_EncountArea_OptionHit_C_OnSphereComponentEndOverlap");
static_assert(sizeof(BP_EncountArea_OptionHit_C_OnSphereComponentEndOverlap) == 0x000020, "Wrong size on BP_EncountArea_OptionHit_C_OnSphereComponentEndOverlap");
static_assert(offsetof(BP_EncountArea_OptionHit_C_OnSphereComponentEndOverlap, OverlappedComponent) == 0x000000, "Member 'BP_EncountArea_OptionHit_C_OnSphereComponentEndOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_OnSphereComponentEndOverlap, OtherActor) == 0x000008, "Member 'BP_EncountArea_OptionHit_C_OnSphereComponentEndOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_OnSphereComponentEndOverlap, OtherComp) == 0x000010, "Member 'BP_EncountArea_OptionHit_C_OnSphereComponentEndOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_OnSphereComponentEndOverlap, OtherBodyIndex) == 0x000018, "Member 'BP_EncountArea_OptionHit_C_OnSphereComponentEndOverlap::OtherBodyIndex' has a wrong offset!");

// Function BP_EncountArea_OptionHit.BP_EncountArea_OptionHit_C.OnSphereComponentBeginOverlap
// 0x00A8 (0x00A8 - 0x0000)
struct BP_EncountArea_OptionHit_C_OnSphereComponentBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8DF9[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_EncountArea_OptionHit_C_OnSphereComponentBeginOverlap) == 0x000008, "Wrong alignment on BP_EncountArea_OptionHit_C_OnSphereComponentBeginOverlap");
static_assert(sizeof(BP_EncountArea_OptionHit_C_OnSphereComponentBeginOverlap) == 0x0000A8, "Wrong size on BP_EncountArea_OptionHit_C_OnSphereComponentBeginOverlap");
static_assert(offsetof(BP_EncountArea_OptionHit_C_OnSphereComponentBeginOverlap, OverlappedComponent) == 0x000000, "Member 'BP_EncountArea_OptionHit_C_OnSphereComponentBeginOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_OnSphereComponentBeginOverlap, OtherActor) == 0x000008, "Member 'BP_EncountArea_OptionHit_C_OnSphereComponentBeginOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_OnSphereComponentBeginOverlap, OtherComp) == 0x000010, "Member 'BP_EncountArea_OptionHit_C_OnSphereComponentBeginOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_OnSphereComponentBeginOverlap, OtherBodyIndex) == 0x000018, "Member 'BP_EncountArea_OptionHit_C_OnSphereComponentBeginOverlap::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_OnSphereComponentBeginOverlap, bFromSweep) == 0x00001C, "Member 'BP_EncountArea_OptionHit_C_OnSphereComponentBeginOverlap::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_OnSphereComponentBeginOverlap, SweepResult) == 0x000020, "Member 'BP_EncountArea_OptionHit_C_OnSphereComponentBeginOverlap::SweepResult' has a wrong offset!");

// Function BP_EncountArea_OptionHit.BP_EncountArea_OptionHit_C.BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_EncountArea_OptionHit.BP_EncountArea_OptionHit_C.BndEvt__Hit_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8DFA[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_EncountArea_OptionHit_C_BndEvt__Hit_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_EncountArea_OptionHit.BP_EncountArea_OptionHit_C.UserConstructionScript
// 0x01E0 (0x01E0 - 0x0000)
struct BP_EncountArea_OptionHit_C_UserConstructionScript final
{
public:
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8DFB[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_2;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DFC[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DFD[0xC];                                     // 0x0074(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8DFE[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8DFF[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue_1;       // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	class UCapsuleComponent*                      CallFunc_AddComponent_ReturnValue_1;               // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E00[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_1;                // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_3;                       // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_4;                       // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E01[0x8];                                     // 0x0128(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue_2;       // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E02[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_2;               // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E03[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E04[0x3];                                     // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_4;                          // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_4;                          // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_4;                          // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_5;                       // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E05[0x4];                                     // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue_3;       // 0x01A0(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_FMax_ReturnValue_6;                       // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E06[0x4];                                     // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       CallFunc_AddComponent_ReturnValue_3;               // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EncountArea_OptionHit_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_EncountArea_OptionHit_C_UserConstructionScript");
static_assert(sizeof(BP_EncountArea_OptionHit_C_UserConstructionScript) == 0x0001E0, "Wrong size on BP_EncountArea_OptionHit_C_UserConstructionScript");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000000, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, K2Node_DynamicCast_AsStatic_Mesh) == 0x000008, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000014, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000018, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x00001C, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_FMax_ReturnValue) == 0x000020, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue) == 0x000024, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_BreakVector_X_1) == 0x000028, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_BreakVector_Y_1) == 0x00002C, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_BreakVector_Z_1) == 0x000030, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_FMax_ReturnValue_1) == 0x000034, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_BreakVector_X_2) == 0x000038, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_BreakVector_Y_2) == 0x00003C, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_BreakVector_Z_2) == 0x000040, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000044, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000050, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_FMax_ReturnValue_2) == 0x000054, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_FMax_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000058, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_GetMaterial_ReturnValue) == 0x000060, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x000068, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_GetRelativeTransform_ReturnValue) == 0x000080, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x0000B8, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000C0, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x0000C8, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_GetRelativeTransform_ReturnValue_1) == 0x0000D0, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_GetRelativeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue_1) == 0x000100, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_BreakVector_X_3) == 0x000108, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_BreakVector_Y_3) == 0x00010C, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_BreakVector_Z_3) == 0x000110, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_EncountArea_OptionHit_C_UserConstructionScript, CallFunc_GetMaterial_ReturnValue_1) == 0x000118, "Member 'BP_EncountArea_OptionHit_C_UserConstructionScript::CallFunc_GetMaterial_ReturnValue_1' has a wrong offset!");
