#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventStatueLvUp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BP_EventStatueLvUp.BP_EventStatueLvUp_C.ExecuteUbergraph_BP_EventStatueLvUp
// 0x0100 (0x0100 - 0x0000)
struct BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_962E[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class ABP_ResultMain_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<ERESULT_JOINDATA>                      CallFunc_CreateInitializedJoinData_ReturnValue;    // 0x0068(0x0010)(ReferenceParm)
	EBgmScene                                     CallFunc_GetBGMScene_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_962F[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FResultData                            K2Node_MakeStruct_ResultData;                      // 0x0080(0x0068)()
	bool                                          CallFunc_StackResultData_success;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Initialize_Success;                       // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9630[0x6];                                     // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_1;                        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectGCManager*                      CallFunc_Get_ReturnValue_2;                        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp) == 0x000010, "Wrong alignment on BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp");
static_assert(sizeof(BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp) == 0x000100, "Wrong size on BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp");
static_assert(offsetof(BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp, EntryPoint) == 0x000000, "Member 'BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp, CallFunc_FinishSpawningActor_ReturnValue) == 0x000058, "Member 'BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp, CallFunc_Get_ReturnValue) == 0x000060, "Member 'BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp, CallFunc_CreateInitializedJoinData_ReturnValue) == 0x000068, "Member 'BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp::CallFunc_CreateInitializedJoinData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp, CallFunc_GetBGMScene_ReturnValue) == 0x000078, "Member 'BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp::CallFunc_GetBGMScene_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp, K2Node_MakeStruct_ResultData) == 0x000080, "Member 'BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp::K2Node_MakeStruct_ResultData' has a wrong offset!");
static_assert(offsetof(BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp, CallFunc_StackResultData_success) == 0x0000E8, "Member 'BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp::CallFunc_StackResultData_success' has a wrong offset!");
static_assert(offsetof(BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp, CallFunc_Initialize_Success) == 0x0000E9, "Member 'BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp::CallFunc_Initialize_Success' has a wrong offset!");
static_assert(offsetof(BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp, CallFunc_Get_ReturnValue_1) == 0x0000F0, "Member 'BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp, CallFunc_Get_ReturnValue_2) == 0x0000F8, "Member 'BP_EventStatueLvUp_C_ExecuteUbergraph_BP_EventStatueLvUp::CallFunc_Get_ReturnValue_2' has a wrong offset!");

// Function BP_EventStatueLvUp.BP_EventStatueLvUp_C.GetFinish
// 0x0001 (0x0001 - 0x0000)
struct BP_EventStatueLvUp_C_GetFinish final
{
public:
	bool                                          IsFinish;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventStatueLvUp_C_GetFinish) == 0x000001, "Wrong alignment on BP_EventStatueLvUp_C_GetFinish");
static_assert(sizeof(BP_EventStatueLvUp_C_GetFinish) == 0x000001, "Wrong size on BP_EventStatueLvUp_C_GetFinish");
static_assert(offsetof(BP_EventStatueLvUp_C_GetFinish, IsFinish) == 0x000000, "Member 'BP_EventStatueLvUp_C_GetFinish::IsFinish' has a wrong offset!");

}

