#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FindItemObject

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FindItemObject.BP_FindItemObject_C
// 0x00C0 (0x02E0 - 0x0220)
class ABP_FindItemObject_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        LineRotScene;                                      // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               LineParticle;                                      // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        LineScene;                                         // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                _______2___Track_2_665E729A47896533746668979F431976; // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______2_Alpha_665E729A47896533746668979F431976;   // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______2__Direction_665E729A47896533746668979F431976; // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B0A[0x7];                                     // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______2;                                          // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______1_Alpha_6E481490423F57C0D54E66ACA9B7C8EF;   // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______1__Direction_6E481490423F57C0D54E66ACA9B7C8EF; // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B0B[0x3];                                     // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______1;                                          // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                _______0___Track_2_90AB24064BC58D10E5197B84AFDDFE64; // 0x0288(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______0_Alpha_90AB24064BC58D10E5197B84AFDDFE64;   // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______0__Direction_90AB24064BC58D10E5197B84AFDDFE64; // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B0C[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______0;                                          // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             EvtDis_EndAction;                                  // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UParticleSystem*                        ParticleTemplate;                                  // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        LineParticleTemplate;                              // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DecalDMI;                                          // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DecalCollor;                                       // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EvtDis_EndAction__DelegateSignature();
	void ExecuteUbergraph_BP_FindItemObject(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Action();
	void DecalFadeOut();
	void _______1__UpdateFunc();
	void _______1__FinishedFunc();
	void _______2__UpdateFunc();
	void _______2__FinishedFunc();
	void UserConstructionScript();
	void SetMainParticleVisible(bool Visible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FindItemObject_C">();
	}
	static class ABP_FindItemObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FindItemObject_C>();
	}
};
static_assert(alignof(ABP_FindItemObject_C) == 0x000008, "Wrong alignment on ABP_FindItemObject_C");
static_assert(sizeof(ABP_FindItemObject_C) == 0x0002E0, "Wrong size on ABP_FindItemObject_C");
static_assert(offsetof(ABP_FindItemObject_C, UberGraphFrame) == 0x000220, "Member 'ABP_FindItemObject_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FindItemObject_C, LineRotScene) == 0x000228, "Member 'ABP_FindItemObject_C::LineRotScene' has a wrong offset!");
static_assert(offsetof(ABP_FindItemObject_C, ParticleSystem) == 0x000230, "Member 'ABP_FindItemObject_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_FindItemObject_C, LineParticle) == 0x000238, "Member 'ABP_FindItemObject_C::LineParticle' has a wrong offset!");
static_assert(offsetof(ABP_FindItemObject_C, LineScene) == 0x000240, "Member 'ABP_FindItemObject_C::LineScene' has a wrong offset!");
static_assert(offsetof(ABP_FindItemObject_C, Decal) == 0x000248, "Member 'ABP_FindItemObject_C::Decal' has a wrong offset!");
static_assert(offsetof(ABP_FindItemObject_C, DefaultSceneRoot) == 0x000250, "Member 'ABP_FindItemObject_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_FindItemObject_C, _______2___Track_2_665E729A47896533746668979F431976) == 0x000258, "Member 'ABP_FindItemObject_C::_______2___Track_2_665E729A47896533746668979F431976' has a wrong offset!");
static_assert(offsetof(ABP_FindItemObject_C, _______2_Alpha_665E729A47896533746668979F431976) == 0x000264, "Member 'ABP_FindItemObject_C::_______2_Alpha_665E729A47896533746668979F431976' has a wrong offset!");
static_assert(offsetof(ABP_FindItemObject_C, _______2__Direction_665E729A47896533746668979F431976) == 0x000268, "Member 'ABP_FindItemObject_C::_______2__Direction_665E729A47896533746668979F431976' has a wrong offset!");
static_assert(offsetof(ABP_FindItemObject_C, _______2) == 0x000270, "Member 'ABP_FindItemObject_C::_______2' has a wrong offset!");
static_assert(offsetof(ABP_FindItemObject_C, _______1_Alpha_6E481490423F57C0D54E66ACA9B7C8EF) == 0x000278, "Member 'ABP_FindItemObject_C::_______1_Alpha_6E481490423F57C0D54E66ACA9B7C8EF' has a wrong offset!");
static_assert(offsetof(ABP_FindItemObject_C, _______1__Direction_6E481490423F57C0D54E66ACA9B7C8EF) == 0x00027C, "Member 'ABP_FindItemObject_C::_______1__Direction_6E481490423F57C0D54E66ACA9B7C8EF' has a wrong offset!");
static_assert(offsetof(ABP_FindItemObject_C, _______1) == 0x000280, "Member 'ABP_FindItemObject_C::_______1' has a wrong offset!");
static_assert(offsetof(ABP_FindItemObject_C, _______0___Track_2_90AB24064BC58D10E5197B84AFDDFE64) == 0x000288, "Member 'ABP_FindItemObject_C::_______0___Track_2_90AB24064BC58D10E5197B84AFDDFE64' has a wrong offset!");
static_assert(offsetof(ABP_FindItemObject_C, _______0_Alpha_90AB24064BC58D10E5197B84AFDDFE64) == 0x000294, "Member 'ABP_FindItemObject_C::_______0_Alpha_90AB24064BC58D10E5197B84AFDDFE64' has a wrong offset!");
static_assert(offsetof(ABP_FindItemObject_C, _______0__Direction_90AB24064BC58D10E5197B84AFDDFE64) == 0x000298, "Member 'ABP_FindItemObject_C::_______0__Direction_90AB24064BC58D10E5197B84AFDDFE64' has a wrong offset!");
static_assert(offsetof(ABP_FindItemObject_C, _______0) == 0x0002A0, "Member 'ABP_FindItemObject_C::_______0' has a wrong offset!");
static_assert(offsetof(ABP_FindItemObject_C, EvtDis_EndAction) == 0x0002A8, "Member 'ABP_FindItemObject_C::EvtDis_EndAction' has a wrong offset!");
static_assert(offsetof(ABP_FindItemObject_C, ParticleTemplate) == 0x0002B8, "Member 'ABP_FindItemObject_C::ParticleTemplate' has a wrong offset!");
static_assert(offsetof(ABP_FindItemObject_C, LineParticleTemplate) == 0x0002C0, "Member 'ABP_FindItemObject_C::LineParticleTemplate' has a wrong offset!");
static_assert(offsetof(ABP_FindItemObject_C, DecalDMI) == 0x0002C8, "Member 'ABP_FindItemObject_C::DecalDMI' has a wrong offset!");
static_assert(offsetof(ABP_FindItemObject_C, DecalCollor) == 0x0002D0, "Member 'ABP_FindItemObject_C::DecalCollor' has a wrong offset!");

}

