#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FindItem

#include "Basic.hpp"

#include "E_MapGimmickHideReason_structs.hpp"
#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BP_FindItem.BP_FindItem_C.ExecuteUbergraph_BP_FindItem
// 0x0120 (0x0120 - 0x0000)
struct BP_FindItem_C_ExecuteUbergraph_BP_FindItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMapID_ReturnValue;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckExist_Exist;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8FDB[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTakaraData_SaveID;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTakaraData                            CallFunc_GetTakaraData_ReturnValue;                // 0x0010(0x0024)(ConstParm, NoDestructor)
	bool                                          CallFunc_ItemIsGotten_ReturnValue;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FlagCh_OK;                                // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8FDC[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPartyMakka_ReturnValue;                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8FDD[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_ItemGetNum_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ItemGetMaxNum_ReturnValue;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_MapGimmickHideReason                        K2Node_Event_HideReason_1;                         // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BIT_ADD_ReturnValue;                      // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MapGimmickHideReason                        K2Node_Event_HideReason;                           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8FDE[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_BIT_DEL_ReturnValue;                      // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_CheckMapPause_IsPause;                // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_2;            // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FlagCh_OK_1;                              // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8FDF[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_1;                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8FE0[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_1;             // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8FE1[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPartyMakka_ReturnValue_1;              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_CheckMapPause_IsPause_1;              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8FE2[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8FE3[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_And_IntInt_ReturnValue;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8FE4[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FindItemObject_C*                   K2Node_DynamicCast_AsBP_Find_Item_Object;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8FE5[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FindItemObject_C*                   K2Node_DynamicCast_AsBP_Find_Item_Object_1;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8FE6[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FindItemObject_C*                   K2Node_DynamicCast_AsBP_Find_Item_Object_2;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem) == 0x000008, "Wrong alignment on BP_FindItem_C_ExecuteUbergraph_BP_FindItem");
static_assert(sizeof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem) == 0x000120, "Wrong size on BP_FindItem_C_ExecuteUbergraph_BP_FindItem");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, EntryPoint) == 0x000000, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_GetMapID_ReturnValue) == 0x000004, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_GetMapID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_CheckExist_Exist) == 0x000008, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_CheckExist_Exist' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_GetTakaraData_SaveID) == 0x00000C, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_GetTakaraData_SaveID' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_GetTakaraData_ReturnValue) == 0x000010, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_GetTakaraData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_ItemIsGotten_ReturnValue) == 0x000034, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_ItemIsGotten_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_Not_PreBool_ReturnValue) == 0x000035, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_FlagCh_OK) == 0x000036, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_FlagCh_OK' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000037, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000038, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_GetPartyMakka_ReturnValue) == 0x00003C, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_GetPartyMakka_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000040, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_Greater_IntInt_ReturnValue) == 0x000041, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, K2Node_CreateDelegate_OutputDelegate_1) == 0x000054, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_ItemGetNum_ReturnValue) == 0x000064, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_ItemGetNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_ItemGetMaxNum_ReturnValue) == 0x000068, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_ItemGetMaxNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000070, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000071, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, K2Node_Event_HideReason_1) == 0x000072, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::K2Node_Event_HideReason_1' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000073, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_BIT_ADD_ReturnValue) == 0x000074, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_BIT_ADD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, K2Node_Event_HideReason) == 0x000078, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::K2Node_Event_HideReason' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, K2Node_CreateDelegate_OutputDelegate_2) == 0x00007C, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_BIT_DEL_ReturnValue) == 0x00008C, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_BIT_DEL_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_GetMapCommon_rerutn) == 0x000090, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, K2Node_DynamicCast_AsBPI_Map_Common) == 0x000098, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_BPI_CheckMapPause_IsPause) == 0x0000A9, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_BPI_CheckMapPause_IsPause' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000AA, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_NotEqual_IntInt_ReturnValue_2) == 0x0000AB, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_NotEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_FlagCh_OK_1) == 0x0000AC, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_FlagCh_OK_1' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_GetMapCommon_rerutn_1) == 0x0000B0, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_GetMapCommon_rerutn_1' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_MakeLiteralInt_ReturnValue) == 0x0000B8, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, K2Node_DynamicCast_AsBPI_Map_Common_1) == 0x0000C0, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::K2Node_DynamicCast_AsBPI_Map_Common_1' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_GetPartyMakka_ReturnValue_1) == 0x0000D4, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_GetPartyMakka_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_BPI_CheckMapPause_IsPause_1) == 0x0000D8, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_BPI_CheckMapPause_IsPause_1' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000DC, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000E0, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_And_IntInt_ReturnValue) == 0x0000E4, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_And_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0000E8, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, K2Node_DynamicCast_AsBP_Find_Item_Object) == 0x0000F0, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::K2Node_DynamicCast_AsBP_Find_Item_Object' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, K2Node_DynamicCast_bSuccess_2) == 0x0000F8, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, K2Node_DynamicCast_AsBP_Find_Item_Object_1) == 0x000100, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::K2Node_DynamicCast_AsBP_Find_Item_Object_1' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, K2Node_DynamicCast_bSuccess_3) == 0x000108, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, K2Node_DynamicCast_AsBP_Find_Item_Object_2) == 0x000110, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::K2Node_DynamicCast_AsBP_Find_Item_Object_2' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_ExecuteUbergraph_BP_FindItem, K2Node_DynamicCast_bSuccess_4) == 0x000118, "Member 'BP_FindItem_C_ExecuteUbergraph_BP_FindItem::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");

// Function BP_FindItem.BP_FindItem_C.BPI_ShowGimmick
// 0x0001 (0x0001 - 0x0000)
struct BP_FindItem_C_BPI_ShowGimmick final
{
public:
	E_MapGimmickHideReason                        Param_HideReason;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FindItem_C_BPI_ShowGimmick) == 0x000001, "Wrong alignment on BP_FindItem_C_BPI_ShowGimmick");
static_assert(sizeof(BP_FindItem_C_BPI_ShowGimmick) == 0x000001, "Wrong size on BP_FindItem_C_BPI_ShowGimmick");
static_assert(offsetof(BP_FindItem_C_BPI_ShowGimmick, Param_HideReason) == 0x000000, "Member 'BP_FindItem_C_BPI_ShowGimmick::Param_HideReason' has a wrong offset!");

// Function BP_FindItem.BP_FindItem_C.BPI_HideGimmick
// 0x0001 (0x0001 - 0x0000)
struct BP_FindItem_C_BPI_HideGimmick final
{
public:
	E_MapGimmickHideReason                        Param_HideReason;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FindItem_C_BPI_HideGimmick) == 0x000001, "Wrong alignment on BP_FindItem_C_BPI_HideGimmick");
static_assert(sizeof(BP_FindItem_C_BPI_HideGimmick) == 0x000001, "Wrong size on BP_FindItem_C_BPI_HideGimmick");
static_assert(offsetof(BP_FindItem_C_BPI_HideGimmick, Param_HideReason) == 0x000000, "Member 'BP_FindItem_C_BPI_HideGimmick::Param_HideReason' has a wrong offset!");

// Function BP_FindItem.BP_FindItem_C.FlagCh
// 0x0040 (0x0040 - 0x0000)
struct BP_FindItem_C_FlagCh final
{
public:
	bool                                          OK;                                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8FE7[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         L_Ed;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_St;                                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEventFlagValue_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlagValue_ReturnValue_1;        // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FlagCh_OK;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8FE8[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMapID_ReturnValue;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTakaraData_SaveID;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTakaraData                            CallFunc_GetTakaraData_ReturnValue;                // 0x001C(0x0024)(ConstParm, NoDestructor)
};
static_assert(alignof(BP_FindItem_C_FlagCh) == 0x000004, "Wrong alignment on BP_FindItem_C_FlagCh");
static_assert(sizeof(BP_FindItem_C_FlagCh) == 0x000040, "Wrong size on BP_FindItem_C_FlagCh");
static_assert(offsetof(BP_FindItem_C_FlagCh, OK) == 0x000000, "Member 'BP_FindItem_C_FlagCh::OK' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_FlagCh, L_Ed) == 0x000004, "Member 'BP_FindItem_C_FlagCh::L_Ed' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_FlagCh, L_St) == 0x000008, "Member 'BP_FindItem_C_FlagCh::L_St' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_FlagCh, CallFunc_CheckEventFlagValue_ReturnValue) == 0x00000C, "Member 'BP_FindItem_C_FlagCh::CallFunc_CheckEventFlagValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_FlagCh, CallFunc_CheckEventFlagValue_ReturnValue_1) == 0x00000D, "Member 'BP_FindItem_C_FlagCh::CallFunc_CheckEventFlagValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_FlagCh, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00000E, "Member 'BP_FindItem_C_FlagCh::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_FlagCh, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x00000F, "Member 'BP_FindItem_C_FlagCh::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_FlagCh, CallFunc_FlagCh_OK) == 0x000010, "Member 'BP_FindItem_C_FlagCh::CallFunc_FlagCh_OK' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_FlagCh, CallFunc_GetMapID_ReturnValue) == 0x000014, "Member 'BP_FindItem_C_FlagCh::CallFunc_GetMapID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_FlagCh, CallFunc_GetTakaraData_SaveID) == 0x000018, "Member 'BP_FindItem_C_FlagCh::CallFunc_GetTakaraData_SaveID' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_FlagCh, CallFunc_GetTakaraData_ReturnValue) == 0x00001C, "Member 'BP_FindItem_C_FlagCh::CallFunc_GetTakaraData_ReturnValue' has a wrong offset!");

// Function BP_FindItem.BP_FindItem_C.CheckExist
// 0x0010 (0x0010 - 0x0000)
struct BP_FindItem_C_CheckExist final
{
public:
	bool                                          Exist;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8FE9[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMapID_ReturnValue;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTakaraDataId_SaveID;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTakaraFlag_ReturnValue;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FindItem_C_CheckExist) == 0x000004, "Wrong alignment on BP_FindItem_C_CheckExist");
static_assert(sizeof(BP_FindItem_C_CheckExist) == 0x000010, "Wrong size on BP_FindItem_C_CheckExist");
static_assert(offsetof(BP_FindItem_C_CheckExist, Exist) == 0x000000, "Member 'BP_FindItem_C_CheckExist::Exist' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_CheckExist, CallFunc_GetMapID_ReturnValue) == 0x000004, "Member 'BP_FindItem_C_CheckExist::CallFunc_GetMapID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_CheckExist, CallFunc_GetTakaraDataId_SaveID) == 0x000008, "Member 'BP_FindItem_C_CheckExist::CallFunc_GetTakaraDataId_SaveID' has a wrong offset!");
static_assert(offsetof(BP_FindItem_C_CheckExist, CallFunc_GetTakaraFlag_ReturnValue) == 0x00000C, "Member 'BP_FindItem_C_CheckExist::CallFunc_GetTakaraFlag_ReturnValue' has a wrong offset!");
