#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FogCtrlHolder

#include "Basic.hpp"

#include "ST_HeightFogParameter_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ST_DirectionalLightParameter_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FogCtrlHolder.BP_FogCtrlHolder_C
// 0x00A0 (0x02C0 - 0x0220)
class ABP_FogCtrlHolder_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_HeightFogCtrlBox_C*                 CurrentCtrlBox;                                    // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_HeightFogCtrlBox_C*>         CtrlBoxes;                                         // 0x0238(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient)
	TArray<class ABP_HeightFogCtrlSphere_C*>      CtrlSpheres;                                       // 0x0248(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient)
	TArray<class ABP_HeightFogCtrlBox_ForBattle_C*> CtrlsBoxes_ForBattle;                              // 0x0258(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient)
	struct FST_HeightFogParameter                 InitialFogParam;                                   // 0x0268(0x0040)(Edit, BlueprintVisible, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_DirectionalLightParameter          InitialLightParam;                                 // 0x02A8(0x0014)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FogCtrlHolder(int32 EntryPoint);
	void ResetToDefault();
	void Initialize();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FogCtrlHolder_C">();
	}
	static class ABP_FogCtrlHolder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FogCtrlHolder_C>();
	}
};
static_assert(alignof(ABP_FogCtrlHolder_C) == 0x000008, "Wrong alignment on ABP_FogCtrlHolder_C");
static_assert(sizeof(ABP_FogCtrlHolder_C) == 0x0002C0, "Wrong size on ABP_FogCtrlHolder_C");
static_assert(offsetof(ABP_FogCtrlHolder_C, UberGraphFrame) == 0x000220, "Member 'ABP_FogCtrlHolder_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FogCtrlHolder_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_FogCtrlHolder_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_FogCtrlHolder_C, CurrentCtrlBox) == 0x000230, "Member 'ABP_FogCtrlHolder_C::CurrentCtrlBox' has a wrong offset!");
static_assert(offsetof(ABP_FogCtrlHolder_C, CtrlBoxes) == 0x000238, "Member 'ABP_FogCtrlHolder_C::CtrlBoxes' has a wrong offset!");
static_assert(offsetof(ABP_FogCtrlHolder_C, CtrlSpheres) == 0x000248, "Member 'ABP_FogCtrlHolder_C::CtrlSpheres' has a wrong offset!");
static_assert(offsetof(ABP_FogCtrlHolder_C, CtrlsBoxes_ForBattle) == 0x000258, "Member 'ABP_FogCtrlHolder_C::CtrlsBoxes_ForBattle' has a wrong offset!");
static_assert(offsetof(ABP_FogCtrlHolder_C, InitialFogParam) == 0x000268, "Member 'ABP_FogCtrlHolder_C::InitialFogParam' has a wrong offset!");
static_assert(offsetof(ABP_FogCtrlHolder_C, InitialLightParam) == 0x0002A8, "Member 'ABP_FogCtrlHolder_C::InitialLightParam' has a wrong offset!");

}

