#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FindItemObject

#include "Basic.hpp"

#include "PieceColor_st_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FindItemObject.BP_FindItemObject_C.ExecuteUbergraph_BP_FindItemObject
// 0x0250 (0x0250 - 0x0000)
struct BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPieceColor_st                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0004(0x0004)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E14[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E15[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0058(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E16[0x2];                                     // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0110(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACustomPawn*                            K2Node_DynamicCast_AsCustom_Pawn;                  // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E17[0x3];                                     // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x01C4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject) == 0x000008, "Wrong alignment on BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject");
static_assert(sizeof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject) == 0x000250, "Wrong size on BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, EntryPoint) == 0x000000, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, CallFunc_GetDataTableRowFromName_OutRow) == 0x000004, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000008, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x00000C, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, CallFunc_GetActorUpVector_ReturnValue) == 0x000028, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000034, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, CallFunc_RandomFloatInRange_ReturnValue) == 0x000044, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000048, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, CallFunc_MakeRotator_ReturnValue) == 0x00004C, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000058, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000E0, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000E4, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, K2Node_MakeStruct_LinearColor) == 0x0000F0, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000100, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, CallFunc_IsValid_ReturnValue) == 0x00010C, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, CallFunc_Not_PreBool_ReturnValue) == 0x00010D, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000110, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, CallFunc_GetPlayerPawn_ReturnValue) == 0x000198, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, K2Node_DynamicCast_AsCustom_Pawn) == 0x0001A0, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::K2Node_DynamicCast_AsCustom_Pawn' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, K2Node_DynamicCast_bSuccess) == 0x0001A8, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, CallFunc_GetSocketLocation_ReturnValue) == 0x0001AC, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, CallFunc_VLerp_ReturnValue) == 0x0001B8, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0001C4, "Member 'BP_FindItemObject_C_ExecuteUbergraph_BP_FindItemObject::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function BP_FindItemObject.BP_FindItemObject_C.SetMainParticleVisible
// 0x0003 (0x0003 - 0x0000)
struct BP_FindItemObject_C_SetMainParticleVisible final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FindItemObject_C_SetMainParticleVisible) == 0x000001, "Wrong alignment on BP_FindItemObject_C_SetMainParticleVisible");
static_assert(sizeof(BP_FindItemObject_C_SetMainParticleVisible) == 0x000003, "Wrong size on BP_FindItemObject_C_SetMainParticleVisible");
static_assert(offsetof(BP_FindItemObject_C_SetMainParticleVisible, Visible) == 0x000000, "Member 'BP_FindItemObject_C_SetMainParticleVisible::Visible' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_SetMainParticleVisible, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_FindItemObject_C_SetMainParticleVisible::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FindItemObject_C_SetMainParticleVisible, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'BP_FindItemObject_C_SetMainParticleVisible::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

