#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HeightFogCtrlSphere

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ST_HeightFogParameter_structs.hpp"
#include "ST_DirectionalLightParameter_structs.hpp"


namespace SDK::Params
{

// Function BP_HeightFogCtrlSphere.BP_HeightFogCtrlSphere_C.ExecuteUbergraph_BP_HeightFogCtrlSphere
// 0x02D8 (0x02D8 - 0x0000)
struct BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_7;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_8;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FA9[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FAA[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0030(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FAB[0x3];                                     // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FAC[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue_1;       // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FAD[0x3];                                     // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FAE[0x3];                                     // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FogCtrlHolder_C*                    CallFunc_GetOrSpawnCtrlHolder_OutCtrlHolder;       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FAF[0x3];                                     // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_10;                             // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FB0[0x3];                                     // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_11;                             // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FB1[0x3];                                     // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_3;                           // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FB2[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_4;                           // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_5;                           // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FB3[0x4];                                     // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADirectionalLight*                      CallFunc_GetActorOfClass_ReturnValue;              // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_6;                           // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FB4[0x3];                                     // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_HeightFogParameter                 K2Node_MakeStruct_ST_HeightFogParameter;           // 0x0208(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             K2Node_DynamicCast_AsDirectional_Light_Component;  // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FB5[0x2];                                     // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_7;                           // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_8;                           // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_9;                           // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_10;                          // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_Select_Default_11;                          // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_DirectionalLightParameter          K2Node_MakeStruct_ST_DirectionalLightParameter;    // 0x0268(0x0014)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FB6[0x3];                                     // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_HeightFogParameter                 CallFunc_InterpHeightFogParameter_Result;          // 0x0284(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_DirectionalLightParameter          CallFunc_InterpDirectionalLightParameter_Result;   // 0x02C4(0x0014)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere) == 0x000008, "Wrong alignment on BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere");
static_assert(sizeof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere) == 0x0002D8, "Wrong size on BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, EntryPoint) == 0x000000, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, Temp_bool_Variable) == 0x000004, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, Temp_bool_Variable_1) == 0x000005, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, Temp_bool_Variable_2) == 0x000006, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, Temp_bool_Variable_3) == 0x000007, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, Temp_bool_Variable_4) == 0x000008, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, Temp_bool_Variable_5) == 0x000009, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, Temp_bool_Variable_6) == 0x00000A, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, Temp_bool_Variable_7) == 0x00000B, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, Temp_bool_Variable_8) == 0x00000C, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000010, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000018, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000020, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000028, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_ComponentBoundEvent_bFromSweep) == 0x00002C, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_ComponentBoundEvent_SweepResult) == 0x000030, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000B8, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_ComponentBoundEvent_OtherActor) == 0x0000C0, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_ComponentBoundEvent_OtherComp) == 0x0000C8, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0000D0, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_Event_DeltaSeconds) == 0x0000D4, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000D8, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000E0, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_IsValid_ReturnValue) == 0x0000EC, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000F0, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_Vector_Distance_ReturnValue) == 0x0000FC, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_IsValid_ReturnValue_1) == 0x000100, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000104, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_BreakVector_X) == 0x000110, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_BreakVector_Y) == 0x000114, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_BreakVector_Z) == 0x000118, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00011C, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_K2_GetComponentScale_ReturnValue_1) == 0x000120, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_K2_GetComponentScale_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_BreakVector_X_1) == 0x00012C, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_BreakVector_Y_1) == 0x000130, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_BreakVector_Z_1) == 0x000134, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000138, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00013C, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000140, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000144, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_IsValid_ReturnValue_2) == 0x000148, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_FClamp_ReturnValue) == 0x00014C, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000150, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, Temp_bool_Variable_9) == 0x000154, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_GetOrSpawnCtrlHolder_OutCtrlHolder) == 0x000158, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_GetOrSpawnCtrlHolder_OutCtrlHolder' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_Array_AddUnique_ReturnValue) == 0x000160, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_Not_PreBool_ReturnValue) == 0x000164, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_Select_Default) == 0x000168, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, Temp_bool_Variable_10) == 0x000178, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::Temp_bool_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_Select_Default_1) == 0x00017C, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_Select_Default_2) == 0x000180, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, Temp_bool_Variable_11) == 0x000184, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::Temp_bool_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_GetDisplayName_ReturnValue) == 0x000188, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_Concat_StrStr_ReturnValue) == 0x000198, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_Select_Default_3) == 0x0001A8, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0001B0, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0001C0, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0001D0, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_Select_Default_4) == 0x0001E0, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_Select_Default_5) == 0x0001F0, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_GetActorOfClass_ReturnValue) == 0x0001F8, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_Select_Default_6) == 0x000200, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_IsValid_ReturnValue_3) == 0x000204, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_MakeStruct_ST_HeightFogParameter) == 0x000208, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_MakeStruct_ST_HeightFogParameter' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_DynamicCast_AsDirectional_Light_Component) == 0x000248, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_DynamicCast_AsDirectional_Light_Component' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_DynamicCast_bSuccess) == 0x000250, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_IsValid_ReturnValue_4) == 0x000251, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_Select_Default_7) == 0x000254, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_Select_Default_8) == 0x000258, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_Select_Default_9) == 0x00025C, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_Select_Default_10) == 0x000260, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_Select_Default_10' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_Select_Default_11) == 0x000264, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_Select_Default_11' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, K2Node_MakeStruct_ST_DirectionalLightParameter) == 0x000268, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::K2Node_MakeStruct_ST_DirectionalLightParameter' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_IsValid_ReturnValue_5) == 0x00027C, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_SelectFloat_ReturnValue) == 0x000280, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_InterpHeightFogParameter_Result) == 0x000284, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_InterpHeightFogParameter_Result' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere, CallFunc_InterpDirectionalLightParameter_Result) == 0x0002C4, "Member 'BP_HeightFogCtrlSphere_C_ExecuteUbergraph_BP_HeightFogCtrlSphere::CallFunc_InterpDirectionalLightParameter_Result' has a wrong offset!");

// Function BP_HeightFogCtrlSphere.BP_HeightFogCtrlSphere_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_HeightFogCtrlSphere_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeightFogCtrlSphere_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_HeightFogCtrlSphere_C_ReceiveTick");
static_assert(sizeof(BP_HeightFogCtrlSphere_C_ReceiveTick) == 0x000004, "Wrong size on BP_HeightFogCtrlSphere_C_ReceiveTick");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_HeightFogCtrlSphere_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_HeightFogCtrlSphere.BP_HeightFogCtrlSphere_C.BndEvt__OuterSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_HeightFogCtrlSphere.BP_HeightFogCtrlSphere_C.BndEvt__OuterSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FB7[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_HeightFogCtrlSphere_C_BndEvt__OuterSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_HeightFogCtrlSphere.BP_HeightFogCtrlSphere_C.GetOrSpawnCtrlHolder
// 0x0090 (0x0090 - 0x0000)
struct BP_HeightFogCtrlSphere_C_GetOrSpawnCtrlHolder final
{
public:
	class ABP_FogCtrlHolder_C*                    OutCtrlHolder;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FB8[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0010(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FB9[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FogCtrlHolder_C*                    K2Node_DynamicCast_AsBP_Fog_Ctrl_Holder;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FBA[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FBB[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FogCtrlHolder_C*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FBC[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeightFogCtrlSphere_C_GetOrSpawnCtrlHolder) == 0x000010, "Wrong alignment on BP_HeightFogCtrlSphere_C_GetOrSpawnCtrlHolder");
static_assert(sizeof(BP_HeightFogCtrlSphere_C_GetOrSpawnCtrlHolder) == 0x000090, "Wrong size on BP_HeightFogCtrlSphere_C_GetOrSpawnCtrlHolder");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_GetOrSpawnCtrlHolder, OutCtrlHolder) == 0x000000, "Member 'BP_HeightFogCtrlSphere_C_GetOrSpawnCtrlHolder::OutCtrlHolder' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlSphere_C_GetOrSpawnCtrlHolder, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_HeightFogCtrlSphere_C_GetOrSpawnCtrlHolder::Temp_int_Array_Index_Variable' has a wrong offset!");
