#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HeightFogCtrlBox

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ST_HeightFogParameter_structs.hpp"
#include "ST_DirectionalLightParameter_structs.hpp"


namespace SDK::Params
{

// Function BP_HeightFogCtrlBox.BP_HeightFogCtrlBox_C.ExecuteUbergraph_BP_HeightFogCtrlBox
// 0x0530 (0x0530 - 0x0000)
struct BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_7;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_8;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_9;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_10;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_11;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_12;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_13;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_14;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DD8[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DD9[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_15;                             // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DDA[0x1];                                     // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_HeightFogParameter                 CallFunc_InterpHeightFogParameter_Result;          // 0x003C(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_16;                             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DDB[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_HeightFogParamStr_OutStr;                 // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_17;                             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DDC[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_18;                             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DDD[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FogCtrlHolder_C*                    CallFunc_GetOrSpawnCtrlHolder_OutCtrlHolder;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_19;                             // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DDE[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HeightFogCtrlBox_C*                 CallFunc_FindHighestPriorityHittingCtrlBox_Result; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DDF[0x2];                                     // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FogCtrlHolder_C*                    CallFunc_GetOrSpawnCtrlHolder_OutCtrlHolder_1;     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DE0[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FogCtrlHolder_C*                    CallFunc_GetOrSpawnCtrlHolder_OutCtrlHolder_2;     // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DE1[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_3;                           // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_4;                           // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_5;                           // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DE2[0x2];                                     // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HeightFogCtrlBox_C*                 CallFunc_FindHighestPriorityHittingCtrlBox_Result_1; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DE3[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HeightFogCtrlBox_C*                 CallFunc_FindHighestPriorityHittingCtrlBox_Result_2; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EnvCtrl_C>        CallFunc_BPI_EnvReset_self_CastInput;              // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_4;    // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DE4[0x6];                                     // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DirectionalLightParamStr_OutStr;          // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_HeightFogParamStr_OutStr_1;               // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_3;             // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_4;             // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_11;             // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_12;             // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_5;             // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_13;             // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_14;             // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_6;             // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_15;             // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_16;             // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_7;             // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_17;             // 0x0300(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_18;             // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_8;             // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_19;             // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_20;             // 0x0340(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_21;             // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_22;             // 0x0360(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_23;             // 0x0370(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_24;             // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_25;             // 0x0390(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_9;             // 0x03A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_26;             // 0x03B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_10;            // 0x03C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_27;             // 0x03D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_28;             // 0x03E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_29;             // 0x03F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DE5[0x3];                                     // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_6;                           // 0x0404(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_7;                           // 0x0414(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_8;                           // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADirectionalLight*                      CallFunc_GetActorOfClass_ReturnValue;              // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_9;                           // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DE6[0x3];                                     // 0x0435(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDirectionalLightComponent*             K2Node_DynamicCast_AsDirectional_Light_Component;  // 0x0438(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x0442(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0443(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select_Default_10;                          // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_11;                          // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_12;                          // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_13;                          // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_Select_Default_14;                          // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_DirectionalLightParameter          K2Node_MakeStruct_ST_DirectionalLightParameter;    // 0x0458(0x0014)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_DirectionalLightParameter          CallFunc_InterpDirectionalLightParameter_Result;   // 0x046C(0x0014)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DirectionalLightParamStr_OutStr_1;        // 0x0480(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_30;             // 0x0490(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_31;             // 0x04A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x04B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_20;                             // 0x04B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_21;                             // 0x04B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select_Default_15;                          // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_16;                          // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_HeightFogParameter                 K2Node_MakeStruct_ST_HeightFogParameter;           // 0x04BC(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_17;                          // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_18;                          // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_19;                          // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_20;                          // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_Select_Default_21;                          // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DE7[0x7];                                     // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_GetOverlappingComponents_OverlappingComponents; // 0x0518(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x052C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox) == 0x000008, "Wrong alignment on BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox");
static_assert(sizeof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox) == 0x000530, "Wrong size on BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, EntryPoint) == 0x000000, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Variable) == 0x000004, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Variable_1) == 0x000005, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Variable_2) == 0x000006, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Variable_3) == 0x000007, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Variable_4) == 0x000008, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Variable_5) == 0x000009, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Variable_6) == 0x00000A, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Variable_7) == 0x00000B, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Variable_8) == 0x00000C, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Variable_9) == 0x00000D, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Variable_10) == 0x00000E, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Variable_11) == 0x00000F, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Variable_12) == 0x000010, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Variable_13) == 0x000011, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Variable_13' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Variable_14) == 0x000012, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Variable_14' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000013, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Conv_FloatToString_ReturnValue) == 0x000018, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1) == 0x000028, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00002C, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, K2Node_Event_OtherActor_1) == 0x000030, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_IsValid_ReturnValue_1) == 0x000039, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Variable_15) == 0x00003A, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Variable_15' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_InterpHeightFogParameter_Result) == 0x00003C, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_InterpHeightFogParameter_Result' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Variable_16) == 0x00007C, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Variable_16' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_HeightFogParamStr_OutStr) == 0x000080, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_HeightFogParamStr_OutStr' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Variable_17) == 0x000090, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Variable_17' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, K2Node_Event_OtherActor) == 0x000098, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Variable_18) == 0x0000A0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Variable_18' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_GetOrSpawnCtrlHolder_OutCtrlHolder) == 0x0000A8, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_GetOrSpawnCtrlHolder_OutCtrlHolder' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Array_AddUnique_ReturnValue) == 0x0000B0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Has_Been_Initd_Variable) == 0x0000B4, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_IsValid_ReturnValue_2) == 0x0000B5, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_IsValid_ReturnValue_3) == 0x0000B6, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_IsValid_ReturnValue_4) == 0x0000B7, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Variable_19) == 0x0000B9, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Variable_19' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_IsValid_ReturnValue_5) == 0x0000BA, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000BB, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_FindHighestPriorityHittingCtrlBox_Result) == 0x0000C0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_FindHighestPriorityHittingCtrlBox_Result' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_IsValid_ReturnValue_6) == 0x0000C8, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0000C9, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x0000CA, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_IsValid_ReturnValue_7) == 0x0000CB, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_IsClosed_Variable) == 0x0000CC, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x0000CD, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_GetOrSpawnCtrlHolder_OutCtrlHolder_1) == 0x0000D0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_GetOrSpawnCtrlHolder_OutCtrlHolder_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_IsValid_ReturnValue_8) == 0x0000D8, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_GetOrSpawnCtrlHolder_OutCtrlHolder_2) == 0x0000E0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_GetOrSpawnCtrlHolder_OutCtrlHolder_2' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_IsValid_ReturnValue_9) == 0x0000E8, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, K2Node_Select_Default) == 0x0000EC, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, K2Node_Select_Default_1) == 0x0000F0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, K2Node_Select_Default_2) == 0x0000F4, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, K2Node_Select_Default_3) == 0x0000F8, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, K2Node_Select_Default_4) == 0x000108, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, K2Node_Select_Default_5) == 0x000118, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, K2Node_Event_EndPlayReason) == 0x00011C, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_IsValid_ReturnValue_10) == 0x00011D, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_FindHighestPriorityHittingCtrlBox_Result_1) == 0x000120, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_FindHighestPriorityHittingCtrlBox_Result_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_IsValid_ReturnValue_11) == 0x000128, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_FindHighestPriorityHittingCtrlBox_Result_2) == 0x000130, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_FindHighestPriorityHittingCtrlBox_Result_2' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_BPI_EnvReset_self_CastInput) == 0x000138, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_BPI_EnvReset_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_IsValid_ReturnValue_12) == 0x000148, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_EqualEqual_ObjectObject_ReturnValue_4) == 0x000149, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_EqualEqual_ObjectObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_DirectionalLightParamStr_OutStr) == 0x000150, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_DirectionalLightParamStr_OutStr' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_HeightFogParamStr_OutStr_1) == 0x000160, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_HeightFogParamStr_OutStr_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_GetDisplayName_ReturnValue) == 0x000170, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_GetDisplayName_ReturnValue_1) == 0x000180, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue) == 0x000190, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0001A0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0001B0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0001C0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0001D0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0001E0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0001F0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_GetDisplayName_ReturnValue_2) == 0x000200, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_GetDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000210, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000220, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_GetDisplayName_ReturnValue_3) == 0x000230, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_GetDisplayName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000240, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_10) == 0x000250, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_GetDisplayName_ReturnValue_4) == 0x000260, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_GetDisplayName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_11) == 0x000270, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_12) == 0x000280, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_GetDisplayName_ReturnValue_5) == 0x000290, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_GetDisplayName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_13) == 0x0002A0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_14) == 0x0002B0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_GetDisplayName_ReturnValue_6) == 0x0002C0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_GetDisplayName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_15) == 0x0002D0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_16) == 0x0002E0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_GetDisplayName_ReturnValue_7) == 0x0002F0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_GetDisplayName_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_17) == 0x000300, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_18) == 0x000310, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_GetDisplayName_ReturnValue_8) == 0x000320, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_GetDisplayName_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_19) == 0x000330, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_20) == 0x000340, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_21) == 0x000350, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_22) == 0x000360, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_23) == 0x000370, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_24) == 0x000380, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_25) == 0x000390, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_GetDisplayName_ReturnValue_9) == 0x0003A0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_GetDisplayName_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_26) == 0x0003B0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_GetDisplayName_ReturnValue_10) == 0x0003C0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_GetDisplayName_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_27) == 0x0003D0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_28) == 0x0003E0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Concat_StrStr_ReturnValue_29) == 0x0003F0, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Concat_StrStr_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_Not_PreBool_ReturnValue) == 0x000400, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, K2Node_Select_Default_6) == 0x000404, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, K2Node_Select_Default_7) == 0x000414, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, K2Node_Select_Default_8) == 0x000424, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_GetActorOfClass_ReturnValue) == 0x000428, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, K2Node_Select_Default_9) == 0x000430, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_IsValid_ReturnValue_13) == 0x000434, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, K2Node_DynamicCast_AsDirectional_Light_Component) == 0x000438, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::K2Node_DynamicCast_AsDirectional_Light_Component' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, K2Node_DynamicCast_bSuccess) == 0x000440, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_IsValid_ReturnValue_14) == 0x000441, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_IsValid_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, CallFunc_IsValid_ReturnValue_15) == 0x000442, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::CallFunc_IsValid_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, Temp_bool_Has_Been_Initd_Variable_1) == 0x000443, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, K2Node_Select_Default_10) == 0x000444, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::K2Node_Select_Default_10' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, K2Node_Select_Default_11) == 0x000448, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::K2Node_Select_Default_11' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, K2Node_Select_Default_12) == 0x00044C, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::K2Node_Select_Default_12' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, K2Node_Select_Default_13) == 0x000450, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::K2Node_Select_Default_13' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox, K2Node_Select_Default_14) == 0x000454, "Member 'BP_HeightFogCtrlBox_C_ExecuteUbergraph_BP_HeightFogCtrlBox::K2Node_Select_Default_14' has a wrong offset!");
