#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HeightFogCtrlBox_ForBattle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_HeightFogCtrlBox_ForBattle.BP_HeightFogCtrlBox_ForBattle_C.ExecuteUbergraph_BP_HeightFogCtrlBox_ForBattle
// 0x0028 (0x0028 - 0x0000)
struct BP_HeightFogCtrlBox_ForBattle_C_ExecuteUbergraph_BP_HeightFogCtrlBox_ForBattle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E76[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FogCtrlHolder_C*                    CallFunc_GetOrSpawnCtrlHolder_OutCtrlHolder;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HeightFogCtrlBox_ForBattle_C_ExecuteUbergraph_BP_HeightFogCtrlBox_ForBattle) == 0x000008, "Wrong alignment on BP_HeightFogCtrlBox_ForBattle_C_ExecuteUbergraph_BP_HeightFogCtrlBox_ForBattle");
static_assert(sizeof(BP_HeightFogCtrlBox_ForBattle_C_ExecuteUbergraph_BP_HeightFogCtrlBox_ForBattle) == 0x000028, "Wrong size on BP_HeightFogCtrlBox_ForBattle_C_ExecuteUbergraph_BP_HeightFogCtrlBox_ForBattle");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_ExecuteUbergraph_BP_HeightFogCtrlBox_ForBattle, EntryPoint) == 0x000000, "Member 'BP_HeightFogCtrlBox_ForBattle_C_ExecuteUbergraph_BP_HeightFogCtrlBox_ForBattle::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_ExecuteUbergraph_BP_HeightFogCtrlBox_ForBattle, K2Node_Event_OtherActor_1) == 0x000008, "Member 'BP_HeightFogCtrlBox_ForBattle_C_ExecuteUbergraph_BP_HeightFogCtrlBox_ForBattle::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_ExecuteUbergraph_BP_HeightFogCtrlBox_ForBattle, K2Node_Event_OtherActor) == 0x000010, "Member 'BP_HeightFogCtrlBox_ForBattle_C_ExecuteUbergraph_BP_HeightFogCtrlBox_ForBattle::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_ExecuteUbergraph_BP_HeightFogCtrlBox_ForBattle, CallFunc_GetOrSpawnCtrlHolder_OutCtrlHolder) == 0x000018, "Member 'BP_HeightFogCtrlBox_ForBattle_C_ExecuteUbergraph_BP_HeightFogCtrlBox_ForBattle::CallFunc_GetOrSpawnCtrlHolder_OutCtrlHolder' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_ExecuteUbergraph_BP_HeightFogCtrlBox_ForBattle, CallFunc_Array_AddUnique_ReturnValue) == 0x000020, "Member 'BP_HeightFogCtrlBox_ForBattle_C_ExecuteUbergraph_BP_HeightFogCtrlBox_ForBattle::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_ExecuteUbergraph_BP_HeightFogCtrlBox_ForBattle, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'BP_HeightFogCtrlBox_ForBattle_C_ExecuteUbergraph_BP_HeightFogCtrlBox_ForBattle::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_HeightFogCtrlBox_ForBattle.BP_HeightFogCtrlBox_ForBattle_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_HeightFogCtrlBox_ForBattle_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeightFogCtrlBox_ForBattle_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on BP_HeightFogCtrlBox_ForBattle_C_ReceiveActorEndOverlap");
static_assert(sizeof(BP_HeightFogCtrlBox_ForBattle_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on BP_HeightFogCtrlBox_ForBattle_C_ReceiveActorEndOverlap");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'BP_HeightFogCtrlBox_ForBattle_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function BP_HeightFogCtrlBox_ForBattle.BP_HeightFogCtrlBox_ForBattle_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_HeightFogCtrlBox_ForBattle_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeightFogCtrlBox_ForBattle_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_HeightFogCtrlBox_ForBattle_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_HeightFogCtrlBox_ForBattle_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_HeightFogCtrlBox_ForBattle_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_HeightFogCtrlBox_ForBattle_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_HeightFogCtrlBox_ForBattle.BP_HeightFogCtrlBox_ForBattle_C.UserConstructionScript
// 0x0040 (0x0040 - 0x0000)
struct BP_HeightFogCtrlBox_ForBattle_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCollisionProfileName_ReturnValue;      // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E77[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UShapeComponent*>                CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E78[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UShapeComponent*                        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HeightFogCtrlBox_ForBattle_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_HeightFogCtrlBox_ForBattle_C_UserConstructionScript");
static_assert(sizeof(BP_HeightFogCtrlBox_ForBattle_C_UserConstructionScript) == 0x000040, "Wrong size on BP_HeightFogCtrlBox_ForBattle_C_UserConstructionScript");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_HeightFogCtrlBox_ForBattle_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_HeightFogCtrlBox_ForBattle_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_HeightFogCtrlBox_ForBattle_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_UserConstructionScript, CallFunc_GetCollisionProfileName_ReturnValue) == 0x00000C, "Member 'BP_HeightFogCtrlBox_ForBattle_C_UserConstructionScript::CallFunc_GetCollisionProfileName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_UserConstructionScript, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000018, "Member 'BP_HeightFogCtrlBox_ForBattle_C_UserConstructionScript::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_HeightFogCtrlBox_ForBattle_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_HeightFogCtrlBox_ForBattle_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_HeightFogCtrlBox_ForBattle_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_HeightFogCtrlBox_ForBattle.BP_HeightFogCtrlBox_ForBattle_C.GetOrSpawnCtrlHolder
// 0x00A0 (0x00A0 - 0x0000)
struct BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder final
{
public:
	class ABP_FogCtrlHolder_C*                    OutCtrlHolder;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E79[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E7A[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FogCtrlHolder_C*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E7B[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0060(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E7C[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FogCtrlHolder_C*                    K2Node_DynamicCast_AsBP_Fog_Ctrl_Holder;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E7D[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder) == 0x000010, "Wrong alignment on BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder");
static_assert(sizeof(BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder) == 0x0000A0, "Wrong size on BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder, OutCtrlHolder) == 0x000000, "Member 'BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder::OutCtrlHolder' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder, CallFunc_FinishSpawningActor_ReturnValue) == 0x000050, "Member 'BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder, CallFunc_GetAttachedActors_OutActors) == 0x000060, "Member 'BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder, CallFunc_Array_Get_Item) == 0x000078, "Member 'BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder, K2Node_DynamicCast_AsBP_Fog_Ctrl_Holder) == 0x000080, "Member 'BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder::K2Node_DynamicCast_AsBP_Fog_Ctrl_Holder' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder, CallFunc_Array_Length_ReturnValue) == 0x00008C, "Member 'BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'BP_HeightFogCtrlBox_ForBattle_C_GetOrSpawnCtrlHolder::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

