#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LightVector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LightVector.BP_LightVector_C
// 0x0018 (0x0238 - 0x0220)
class ABP_LightVector_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 LightSourceActor;                                  // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LightVector(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LightVector_C">();
	}
	static class ABP_LightVector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LightVector_C>();
	}
};
static_assert(alignof(ABP_LightVector_C) == 0x000008, "Wrong alignment on ABP_LightVector_C");
static_assert(sizeof(ABP_LightVector_C) == 0x000238, "Wrong size on ABP_LightVector_C");
static_assert(offsetof(ABP_LightVector_C, UberGraphFrame) == 0x000220, "Member 'ABP_LightVector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LightVector_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_LightVector_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_LightVector_C, LightSourceActor) == 0x000230, "Member 'ABP_LightVector_C::LightSourceActor' has a wrong offset!");

}

