#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LogoGameMode

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BP_LogoGameMode.BP_LogoGameMode_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_LogoGameMode_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LogoGameMode_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_LogoGameMode_C_ReceiveTick");
static_assert(sizeof(BP_LogoGameMode_C_ReceiveTick) == 0x000004, "Wrong size on BP_LogoGameMode_C_ReceiveTick");
static_assert(offsetof(BP_LogoGameMode_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_LogoGameMode_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_LogoGameMode.BP_LogoGameMode_C.ExecuteUbergraph_BP_LogoGameMode
// 0x0048 (0x0048 - 0x0000)
struct BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_290E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_LogoScreen_C*                      CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToPlayerScreen_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_290F[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectGCManager*                      CallFunc_Get_ReturnValue;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_1;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCompletedLoadResidentAssets_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2910[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMouseCursorState                      CallFunc_PopShowMouseCursor_ReturnValue;           // 0x0030(0x0018)()
};
static_assert(alignof(BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode) == 0x000008, "Wrong alignment on BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode");
static_assert(sizeof(BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode) == 0x000048, "Wrong size on BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode");
static_assert(offsetof(BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode, EntryPoint) == 0x000000, "Member 'BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode, CallFunc_AddToPlayerScreen_ReturnValue) == 0x000010, "Member 'BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode::CallFunc_AddToPlayerScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode, CallFunc_Get_ReturnValue) == 0x000018, "Member 'BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode, CallFunc_Get_ReturnValue_1) == 0x000020, "Member 'BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode, CallFunc_IsCompletedLoadResidentAssets_ReturnValue) == 0x000028, "Member 'BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode::CallFunc_IsCompletedLoadResidentAssets_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode, CallFunc_PopShowMouseCursor_ReturnValue) == 0x000030, "Member 'BP_LogoGameMode_C_ExecuteUbergraph_BP_LogoGameMode::CallFunc_PopShowMouseCursor_ReturnValue' has a wrong offset!");

}

