#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapShinsei

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_MapGimmickHideReason_structs.hpp"
#include "Project_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_MapShinsei.BP_MapShinsei_C.ExecuteUbergraph_BP_MapShinsei
// 0x05F0 (0x05F0 - 0x0000)
struct BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGetShinseiIgnore_ignore;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9583[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool WalkedIn)>                K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_9584[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               K2Node_CustomEvent_PSystem;                        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9585[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9586[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9587[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl;                 // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9588[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_1;               // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9589[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_2;               // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckExist_Exist;                         // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_958A[0x2];                                     // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MapGimmickHideReason                        K2Node_Event_HideReason_1;                         // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_958B[0x3];                                     // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0100(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_958C[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MapGimmickHideReason                        K2Node_Event_HideReason;                           // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_958D[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ShinseiGetEffect_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_958E[0x3];                                     // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BIT_DEL_ReturnValue;                      // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BIT_ADD_ReturnValue;                      // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_958F[0x3];                                     // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9590[0x3];                                     // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAreaID_ReturnValue;                    // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMapID_ReturnValue;                     // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShinseiSaveBufferStart_ReturnValue;    // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9591[0x3];                                     // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGazeTargetHolder*                      CallFunc_GetGazeTargetHolder_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGazeTarget>           CallFunc_RegisterGazeTarget_InTarget_CastInput;    // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	class UGazeTargetHolder*                      CallFunc_GetGazeTargetHolder_ReturnValue_1;        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9592[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGazeTarget>           CallFunc_UnregisterGazeTarget_InTarget_CastInput;  // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	struct FShinseiData                           CallFunc_GetShinseiData_ReturnValue;               // 0x01B0(0x0004)(ConstParm, NoDestructor)
	uint8                                         Pad_9593[0x4];                                     // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGazeTargetHolder*                      CallFunc_GetGazeTargetHolder_ReturnValue_2;        // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGazeTarget>           CallFunc_UnregisterGazeTarget_InTarget_CastInput_1; // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	class UGazeTargetHolder*                      CallFunc_GetGazeTargetHolder_ReturnValue_3;        // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGazeTarget>           CallFunc_UnregisterGazeTarget_InTarget_CastInput_2; // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	int32                                         CallFunc_GetGodParameterPoint_ReturnValue;         // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9594[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapUICtrl_MapUICtrl;                   // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapUICtrl_C>      K2Node_DynamicCast_AsBPI_Map_UICtrl;               // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9595[0x7];                                     // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMapMakkaWinCtrl_Ctrl;              // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapMakkaWinCtrl_C> K2Node_DynamicCast_AsBPI_Map_Makka_Win_Ctrl;       // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x022B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9596[0x4];                                     // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9597[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0240(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9598[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9599[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_1;             // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapUICtrl_MapUICtrl_1;                 // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapUICtrl_C>      K2Node_DynamicCast_AsBPI_Map_UICtrl_1;             // 0x0288(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_959A[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_3;              // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_959B[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMapMakkaWinCtrl_Ctrl_1;            // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_1;                // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapMakkaWinCtrl_C> K2Node_DynamicCast_AsBPI_Map_Makka_Win_Ctrl_1;     // 0x02C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_CheckNext_MapMiitsuWin_Next;          // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_959C[0x6];                                     // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_1;                    // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_1;             // 0x02E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_959D[0x3];                                     // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x02FC(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_And_IntInt_ReturnValue;                   // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_959E[0x3];                                     // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0314(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_959F[0x4];                                     // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_4;              // 0x0330(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95A0[0x7];                                     // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_3;               // 0x0348(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95A1[0x7];                                     // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_2;             // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_5;              // 0x0368(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95A2[0x7];                                     // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_2;                // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_4;               // 0x0390(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95A3[0x7];                                     // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APla603_C*                              K2Node_DynamicCast_AsPla_603;                      // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95A4[0x7];                                     // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_5;               // 0x03B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95A5[0x7];                                     // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_6;               // 0x03D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_19;                    // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IIsFinishedWindowOut_OutFinished;         // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95A6[0x6];                                     // 0x03E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_7;               // 0x03E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_20;                    // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95A7[0x7];                                     // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerBase_C*                          K2Node_DynamicCast_AsPlayer_Base;                  // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_21;                    // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95A8[0x7];                                     // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_2;              // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0420(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95A9[0x4];                                     // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_3;              // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0438(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0444(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0450(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x045C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0478(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0484(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0490(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x049C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95AA[0x8];                                     // 0x04A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x04B0(0x0030)(IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_4;              // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x04F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95AB[0x4];                                     // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATargetPoint*                           CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_WalkedIn;                       // 0x0511(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0512(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95AC[0x1];                                     // 0x0513(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UParticleSystemComponent* PSystem)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x051C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x052C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95AD[0x3];                                     // 0x052D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95AE[0x7];                                     // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_6;              // 0x0540(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_22;                    // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95AF[0x7];                                     // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_3;             // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_7;              // 0x0560(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_23;                    // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95B0[0x7];                                     // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_3;                // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_8;               // 0x0580(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_24;                    // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95B1[0x7];                                     // 0x0591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_9;               // 0x0598(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_25;                    // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd;             // 0x05A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95B2[0x6];                                     // 0x05AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_5;              // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APla603_C*                              K2Node_DynamicCast_AsPla_603_1;                    // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_26;                    // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMapActionPlaying_bPlaying;              // 0x05C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x05C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95B3[0x5];                                     // 0x05C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMouseCursorState                      CallFunc_PopShowMouseCursor_ReturnValue;           // 0x05C8(0x0018)()
	int32                                         CallFunc_GetShinseiGetNum_ReturnValue;             // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x05E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x05E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei) == 0x000010, "Wrong alignment on BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei");
static_assert(sizeof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei) == 0x0005F0, "Wrong size on BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, EntryPoint) == 0x000000, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_IsGetShinseiIgnore_ignore) == 0x000004, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_IsGetShinseiIgnore_ignore' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_MakeLiteralInt_ReturnValue) == 0x000008, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_CustomEvent_PSystem) == 0x000030, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_CustomEvent_PSystem' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_GetMaterial_ReturnValue) == 0x000038, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000040, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_GetGameInstance_ReturnValue) == 0x000048, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_AsBPI_UIManager) == 0x000058, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_BPI_GetUIManager_UIManager) == 0x000070, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000078, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_BPI_GetMsgCtrl_OutActor) == 0x000090, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_BPI_GetMsgCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_AsBPI_Msg_Ctrl) == 0x000098, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_AsBPI_Msg_Ctrl' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_AsBPI_Msg_Ctrl_1) == 0x0000B0, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_AsBPI_Msg_Ctrl_1' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_bSuccess_3) == 0x0000C0, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_AsBPI_Msg_Ctrl_2) == 0x0000C8, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_AsBPI_Msg_Ctrl_2' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_bSuccess_4) == 0x0000D8, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_CheckExist_Exist) == 0x0000D9, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_CheckExist_Exist' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000DC, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_CustomEvent_DestroyedActor) == 0x0000E8, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000F0, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_Event_HideReason_1) == 0x0000FC, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_Event_HideReason_1' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_MakeTransform_ReturnValue) == 0x000100, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000130, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000138, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_Event_HideReason) == 0x000140, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_Event_HideReason' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_FinishSpawningActor_ReturnValue) == 0x000148, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000150, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_BIT_DEL_ReturnValue) == 0x000154, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_BIT_DEL_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_BIT_ADD_ReturnValue) == 0x000158, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_BIT_ADD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00015C, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_Add_IntInt_ReturnValue) == 0x000160, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000164, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_GetAreaID_ReturnValue) == 0x000168, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_GetAreaID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_GetMapID_ReturnValue) == 0x00016C, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_GetMapID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_GetShinseiSaveBufferStart_ReturnValue) == 0x000170, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_GetShinseiSaveBufferStart_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_Not_PreBool_ReturnValue) == 0x000174, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_GetGazeTargetHolder_ReturnValue) == 0x000178, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_GetGazeTargetHolder_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_RegisterGazeTarget_InTarget_CastInput) == 0x000180, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_RegisterGazeTarget_InTarget_CastInput' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_GetGazeTargetHolder_ReturnValue_1) == 0x000190, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_GetGazeTargetHolder_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_Event_EndPlayReason) == 0x000198, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_UnregisterGazeTarget_InTarget_CastInput) == 0x0001A0, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_UnregisterGazeTarget_InTarget_CastInput' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_GetShinseiData_ReturnValue) == 0x0001B0, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_GetShinseiData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_GetGazeTargetHolder_ReturnValue_2) == 0x0001B8, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_GetGazeTargetHolder_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_UnregisterGazeTarget_InTarget_CastInput_1) == 0x0001C0, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_UnregisterGazeTarget_InTarget_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_GetGazeTargetHolder_ReturnValue_3) == 0x0001D0, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_GetGazeTargetHolder_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_UnregisterGazeTarget_InTarget_CastInput_2) == 0x0001D8, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_UnregisterGazeTarget_InTarget_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_GetGodParameterPoint_ReturnValue) == 0x0001E8, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_GetGodParameterPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_GetMapUICtrl_MapUICtrl) == 0x0001F0, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_GetMapUICtrl_MapUICtrl' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_AsBPI_Map_UICtrl) == 0x0001F8, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_AsBPI_Map_UICtrl' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_bSuccess_5) == 0x000208, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_BPI_GetMapMakkaWinCtrl_Ctrl) == 0x000210, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_BPI_GetMapMakkaWinCtrl_Ctrl' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_AsBPI_Map_Makka_Win_Ctrl) == 0x000218, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_AsBPI_Map_Makka_Win_Ctrl' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_bSuccess_6) == 0x000228, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_BooleanAND_ReturnValue) == 0x000229, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_BooleanAND_ReturnValue_1) == 0x00022A, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_BooleanAND_ReturnValue_2) == 0x00022B, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_GetMapCommon_rerutn) == 0x000230, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_BooleanAND_ReturnValue_3) == 0x000238, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_AsBPI_Map_Common) == 0x000240, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_bSuccess_7) == 0x000250, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_GetGameInstance_ReturnValue_1) == 0x000258, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_AsBPI_UIManager_2) == 0x000260, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_AsBPI_UIManager_2' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_bSuccess_8) == 0x000270, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_BPI_GetUIManager_UIManager_1) == 0x000278, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_BPI_GetUIManager_UIManager_1' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_GetMapUICtrl_MapUICtrl_1) == 0x000280, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_GetMapUICtrl_MapUICtrl_1' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_AsBPI_Map_UICtrl_1) == 0x000288, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_AsBPI_Map_UICtrl_1' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_bSuccess_9) == 0x000298, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_AsBPI_UIManager_3) == 0x0002A0, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_AsBPI_UIManager_3' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_bSuccess_10) == 0x0002B0, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_BPI_GetMapMakkaWinCtrl_Ctrl_1) == 0x0002B8, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_BPI_GetMapMakkaWinCtrl_Ctrl_1' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_BPI_GetMsgCtrl_OutActor_1) == 0x0002C0, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_BPI_GetMsgCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_AsBPI_Map_Makka_Win_Ctrl_1) == 0x0002C8, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_AsBPI_Map_Makka_Win_Ctrl_1' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_bSuccess_11) == 0x0002D8, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_BPI_CheckNext_MapMiitsuWin_Next) == 0x0002D9, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_BPI_CheckNext_MapMiitsuWin_Next' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_GetMapCommon_rerutn_1) == 0x0002E0, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_GetMapCommon_rerutn_1' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_AsBPI_Map_Common_1) == 0x0002E8, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_AsBPI_Map_Common_1' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_bSuccess_12) == 0x0002F8, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002FC, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_And_IntInt_ReturnValue) == 0x00030C, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_And_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000310, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_CreateDelegate_OutputDelegate_3) == 0x000314, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_GetGameInstance_ReturnValue_2) == 0x000328, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_AsBPI_UIManager_4) == 0x000330, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_AsBPI_UIManager_4' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_bSuccess_13) == 0x000340, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_AsBPI_Msg_Ctrl_3) == 0x000348, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_AsBPI_Msg_Ctrl_3' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_bSuccess_14) == 0x000358, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_BPI_GetUIManager_UIManager_2) == 0x000360, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_BPI_GetUIManager_UIManager_2' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_AsBPI_UIManager_5) == 0x000368, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_AsBPI_UIManager_5' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_bSuccess_15) == 0x000378, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_bSuccess_15' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_BPI_GetMsgCtrl_OutActor_2) == 0x000380, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_BPI_GetMsgCtrl_OutActor_2' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, CallFunc_GetPlayerPawn_ReturnValue) == 0x000388, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_AsBPI_Msg_Ctrl_4) == 0x000390, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_AsBPI_Msg_Ctrl_4' has a wrong offset!");
static_assert(offsetof(BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei, K2Node_DynamicCast_bSuccess_16) == 0x0003A0, "Member 'BP_MapShinsei_C_ExecuteUbergraph_BP_MapShinsei::K2Node_DynamicCast_bSuccess_16' has a wrong offset!");
