#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapCharaPanelCtrl

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_MapCharaPanelCtrl.BP_MapCharaPanelCtrl_C.ExecuteUbergraph_BP_MapCharaPanelCtrl
// 0x0430 (0x0430 - 0x0000)
struct BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_246D[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<uint8>                                 CallFunc_GetNkmBattleUnitList_ReturnValue;         // 0x0018(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_246E[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCharData                              CallFunc_GetPlayerData_ReturnValue;                // 0x0030(0x0130)(ConstParm)
	class ABP_CharaPanel_C*                       CallFunc_Array_Get_Item;                           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0168(0x0018)()
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue;              // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_246F[0x2];                                     // 0x0182(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerPanelPositionInBattle_ReturnValue; // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2470[0x3];                                     // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGuest_ReturnValue;                      // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2471[0x3];                                     // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNkmData                               CallFunc_GetNkmData_ReturnValue;                   // 0x0198(0x0120)(ConstParm)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2472[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDevilRaceName_ReturnValue;             // 0x02C0(0x0018)(ConstParm)
	class FText                                   CallFunc_GetDevilName_ReturnValue;                 // 0x02D8(0x0018)(ConstParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeDisplayedCharaPanel_OutDisplayed;    // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanBeDisplayedCharaPanel_OutDisplayed_1;  // 0x02F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanBeDisplayedCharaPanel_OutDisplayed_2;  // 0x02F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Immediate;                            // 0x02F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartMapCharaPanelFadeOutAnimation_ReturnValue; // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2473[0x3];                                     // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InIndex;                              // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharaPanel_C*                       CallFunc_Array_Get_Item_1;                         // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InIndex_1;                            // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StopMapCharaPanelAnimation_ReturnValue;   // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2474[0x3];                                     // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharaPanel_C*                       CallFunc_Array_Get_Item_2;                         // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartMapCharaPanelAnimation_ReturnValue;  // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2475[0x3];                                     // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InNkmIndex;                           // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharaPanel_C*                       CallFunc_Array_Get_Item_3;                         // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InNkmIndex_1;                         // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InStartTime;                          // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InHealHp;                             // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InHealMp;                             // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_WIDGET_PRIO                                 K2Node_Event_InPrio;                               // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2476[0x3];                                     // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPanelIndexFromNkmIndex_OutIndex;       // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2477[0x7];                                     // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharaPanel_C*                       CallFunc_Array_Get_Item_4;                         // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartVNumberAnimation_IsAnime;            // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_2;            // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2478[0x6];                                     // 0x0352(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_MapCharaPanel_C*                    CallFunc_Create_ReturnValue;                       // 0x0358(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2479[0x4];                                     // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDevilRaceNameByRaceID_ReturnValue;     // 0x0370(0x0018)(ConstParm)
	int32                                         Temp_int_Variable_1;                               // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_247A[0x3];                                     // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_247B[0x8];                                     // 0x0398(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x03A0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharaPanel_C*                       CallFunc_Array_Get_Item_5;                         // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharaPanel_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_247C[0x7];                                     // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CharaPanel_C*                       CallFunc_GetWBCharaPanel_OutWidget;                // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMapCharaPanelAnimation_ReturnValue;     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_247D[0x7];                                     // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharaPanel_C*                       CallFunc_Array_Get_Item_6;                         // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x040C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x040D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_247E[0x2];                                     // 0x040E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_247F[0x4];                                     // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharaPanel_C*                       CallFunc_Array_Get_Item_7;                         // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl) == 0x000010, "Wrong alignment on BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl");
static_assert(sizeof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl) == 0x000430, "Wrong size on BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, EntryPoint) == 0x000000, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, Temp_int_Variable) == 0x000014, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_GetNkmBattleUnitList_ReturnValue) == 0x000018, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_GetNkmBattleUnitList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_GetPlayerData_ReturnValue) == 0x000030, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_GetPlayerData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_Array_Get_Item) == 0x000160, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_Conv_StringToText_ReturnValue) == 0x000168, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_AddToWidgetPrio_ReturnValue) == 0x000180, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_AddToWidgetPrio_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_IsInViewport_ReturnValue) == 0x000181, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_GetPlayerPanelPositionInBattle_ReturnValue) == 0x000184, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_GetPlayerPanelPositionInBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000188, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00018C, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_Add_IntInt_ReturnValue_2) == 0x000190, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_IsGuest_ReturnValue) == 0x000194, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_IsGuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_GetNkmData_ReturnValue) == 0x000198, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_GetNkmData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0002B8, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_GetDevilRaceName_ReturnValue) == 0x0002C0, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_GetDevilRaceName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_GetDevilName_ReturnValue) == 0x0002D8, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_GetDevilName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_Add_IntInt_ReturnValue_3) == 0x0002F0, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_CanBeDisplayedCharaPanel_OutDisplayed) == 0x0002F4, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_CanBeDisplayedCharaPanel_OutDisplayed' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_CanBeDisplayedCharaPanel_OutDisplayed_1) == 0x0002F5, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_CanBeDisplayedCharaPanel_OutDisplayed_1' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_CanBeDisplayedCharaPanel_OutDisplayed_2) == 0x0002F6, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_CanBeDisplayedCharaPanel_OutDisplayed_2' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, K2Node_Event_Immediate) == 0x0002F7, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::K2Node_Event_Immediate' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_StartMapCharaPanelFadeOutAnimation_ReturnValue) == 0x0002F8, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_StartMapCharaPanelFadeOutAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, K2Node_Event_InIndex) == 0x0002FC, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::K2Node_Event_InIndex' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_Array_Get_Item_1) == 0x000300, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, K2Node_Event_InIndex_1) == 0x000308, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::K2Node_Event_InIndex_1' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_StopMapCharaPanelAnimation_ReturnValue) == 0x00030C, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_StopMapCharaPanelAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_Array_Get_Item_2) == 0x000310, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_StartMapCharaPanelAnimation_ReturnValue) == 0x000318, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_StartMapCharaPanelAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, K2Node_Event_InNkmIndex) == 0x00031C, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::K2Node_Event_InNkmIndex' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_Array_Get_Item_3) == 0x000320, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, K2Node_Event_InNkmIndex_1) == 0x000328, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::K2Node_Event_InNkmIndex_1' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, K2Node_Event_InStartTime) == 0x00032C, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::K2Node_Event_InStartTime' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, K2Node_Event_InHealHp) == 0x000330, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::K2Node_Event_InHealHp' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, K2Node_Event_InHealMp) == 0x000334, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::K2Node_Event_InHealMp' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, K2Node_Event_InPrio) == 0x000338, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::K2Node_Event_InPrio' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_GetPanelIndexFromNkmIndex_OutIndex) == 0x00033C, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_GetPanelIndexFromNkmIndex_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000340, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_Array_Get_Item_4) == 0x000348, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_StartVNumberAnimation_IsAnime) == 0x000350, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_StartVNumberAnimation_IsAnime' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_NotEqual_IntInt_ReturnValue_2) == 0x000351, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_NotEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_Create_ReturnValue) == 0x000358, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, Temp_int_Array_Index_Variable) == 0x000360, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, Temp_int_Loop_Counter_Variable_1) == 0x000364, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_Add_IntInt_ReturnValue_4) == 0x000368, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_GetDevilRaceNameByRaceID_ReturnValue) == 0x000370, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_GetDevilRaceNameByRaceID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, Temp_int_Variable_1) == 0x000388, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00038C, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_Add_IntInt_ReturnValue_5) == 0x000390, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, K2Node_Event_DeltaSeconds) == 0x000394, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_MakeTransform_ReturnValue) == 0x0003A0, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0003D0, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_Array_Get_Item_5) == 0x0003D8, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_FinishSpawningActor_ReturnValue) == 0x0003E0, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, K2Node_Event_EndPlayReason) == 0x0003E8, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_GetWBCharaPanel_OutWidget) == 0x0003F0, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_GetWBCharaPanel_OutWidget' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_IsMapCharaPanelAnimation_ReturnValue) == 0x0003F8, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_IsMapCharaPanelAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_Array_Get_Item_6) == 0x000400, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_Array_Length_ReturnValue_1) == 0x000408, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_Less_IntInt_ReturnValue_1) == 0x00040C, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_IsValid_ReturnValue) == 0x00040D, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, Temp_int_Array_Index_Variable_1) == 0x000410, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_Array_Get_Item_7) == 0x000418, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_IsValid_ReturnValue_1) == 0x000420, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl, CallFunc_IsValid_ReturnValue_2) == 0x000421, "Member 'BP_MapCharaPanelCtrl_C_ExecuteUbergraph_BP_MapCharaPanelCtrl::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function BP_MapCharaPanelCtrl.BP_MapCharaPanelCtrl_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_MapCharaPanelCtrl_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapCharaPanelCtrl_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_MapCharaPanelCtrl_C_ReceiveEndPlay");
static_assert(sizeof(BP_MapCharaPanelCtrl_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_MapCharaPanelCtrl_C_ReceiveEndPlay");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_MapCharaPanelCtrl_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_MapCharaPanelCtrl.BP_MapCharaPanelCtrl_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_MapCharaPanelCtrl_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapCharaPanelCtrl_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_MapCharaPanelCtrl_C_ReceiveTick");
static_assert(sizeof(BP_MapCharaPanelCtrl_C_ReceiveTick) == 0x000004, "Wrong size on BP_MapCharaPanelCtrl_C_ReceiveTick");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_MapCharaPanelCtrl_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_MapCharaPanelCtrl.BP_MapCharaPanelCtrl_C.IMapCharaPanelOn
// 0x0001 (0x0001 - 0x0000)
struct BP_MapCharaPanelCtrl_C_IMapCharaPanelOn final
{
public:
	bool                                          Immediate;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MapCharaPanelCtrl_C_IMapCharaPanelOn) == 0x000001, "Wrong alignment on BP_MapCharaPanelCtrl_C_IMapCharaPanelOn");
static_assert(sizeof(BP_MapCharaPanelCtrl_C_IMapCharaPanelOn) == 0x000001, "Wrong size on BP_MapCharaPanelCtrl_C_IMapCharaPanelOn");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_IMapCharaPanelOn, Immediate) == 0x000000, "Member 'BP_MapCharaPanelCtrl_C_IMapCharaPanelOn::Immediate' has a wrong offset!");

// Function BP_MapCharaPanelCtrl.BP_MapCharaPanelCtrl_C.BIESetMapCharaPanelFadeOutPanelAnimation
// 0x0004 (0x0004 - 0x0000)
struct BP_MapCharaPanelCtrl_C_BIESetMapCharaPanelFadeOutPanelAnimation final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapCharaPanelCtrl_C_BIESetMapCharaPanelFadeOutPanelAnimation) == 0x000004, "Wrong alignment on BP_MapCharaPanelCtrl_C_BIESetMapCharaPanelFadeOutPanelAnimation");
static_assert(sizeof(BP_MapCharaPanelCtrl_C_BIESetMapCharaPanelFadeOutPanelAnimation) == 0x000004, "Wrong size on BP_MapCharaPanelCtrl_C_BIESetMapCharaPanelFadeOutPanelAnimation");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_BIESetMapCharaPanelFadeOutPanelAnimation, InIndex) == 0x000000, "Member 'BP_MapCharaPanelCtrl_C_BIESetMapCharaPanelFadeOutPanelAnimation::InIndex' has a wrong offset!");

// Function BP_MapCharaPanelCtrl.BP_MapCharaPanelCtrl_C.BIESetInitializeMapCharaPanelAnimation
// 0x0004 (0x0004 - 0x0000)
struct BP_MapCharaPanelCtrl_C_BIESetInitializeMapCharaPanelAnimation final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapCharaPanelCtrl_C_BIESetInitializeMapCharaPanelAnimation) == 0x000004, "Wrong alignment on BP_MapCharaPanelCtrl_C_BIESetInitializeMapCharaPanelAnimation");
static_assert(sizeof(BP_MapCharaPanelCtrl_C_BIESetInitializeMapCharaPanelAnimation) == 0x000004, "Wrong size on BP_MapCharaPanelCtrl_C_BIESetInitializeMapCharaPanelAnimation");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_BIESetInitializeMapCharaPanelAnimation, InIndex) == 0x000000, "Member 'BP_MapCharaPanelCtrl_C_BIESetInitializeMapCharaPanelAnimation::InIndex' has a wrong offset!");

// Function BP_MapCharaPanelCtrl.BP_MapCharaPanelCtrl_C.IMapCharaPanelResetRecoveryAnimation
// 0x0004 (0x0004 - 0x0000)
struct BP_MapCharaPanelCtrl_C_IMapCharaPanelResetRecoveryAnimation final
{
public:
	int32                                         InNkmIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapCharaPanelCtrl_C_IMapCharaPanelResetRecoveryAnimation) == 0x000004, "Wrong alignment on BP_MapCharaPanelCtrl_C_IMapCharaPanelResetRecoveryAnimation");
static_assert(sizeof(BP_MapCharaPanelCtrl_C_IMapCharaPanelResetRecoveryAnimation) == 0x000004, "Wrong size on BP_MapCharaPanelCtrl_C_IMapCharaPanelResetRecoveryAnimation");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_IMapCharaPanelResetRecoveryAnimation, InNkmIndex) == 0x000000, "Member 'BP_MapCharaPanelCtrl_C_IMapCharaPanelResetRecoveryAnimation::InNkmIndex' has a wrong offset!");

// Function BP_MapCharaPanelCtrl.BP_MapCharaPanelCtrl_C.IMapCharaPanelSetHealHpMp
// 0x0014 (0x0014 - 0x0000)
struct BP_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp final
{
public:
	int32                                         InNkmIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InStartTime;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InHealHp;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InHealMp;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp) == 0x000004, "Wrong alignment on BP_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp");
static_assert(sizeof(BP_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp) == 0x000014, "Wrong size on BP_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp, InNkmIndex) == 0x000000, "Member 'BP_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp::InNkmIndex' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp, InStartTime) == 0x000004, "Member 'BP_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp::InStartTime' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp, InHealHp) == 0x000008, "Member 'BP_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp::InHealHp' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp, InHealMp) == 0x00000C, "Member 'BP_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp::InHealMp' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp, InPrio) == 0x000010, "Member 'BP_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp::InPrio' has a wrong offset!");

// Function BP_MapCharaPanelCtrl.BP_MapCharaPanelCtrl_C.CanBeDisplayedCharaPanel
// 0x0003 (0x0003 - 0x0000)
struct BP_MapCharaPanelCtrl_C_CanBeDisplayedCharaPanel final
{
public:
	bool                                          OutDisplayed;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MapCharaPanelCtrl_C_CanBeDisplayedCharaPanel) == 0x000001, "Wrong alignment on BP_MapCharaPanelCtrl_C_CanBeDisplayedCharaPanel");
static_assert(sizeof(BP_MapCharaPanelCtrl_C_CanBeDisplayedCharaPanel) == 0x000003, "Wrong size on BP_MapCharaPanelCtrl_C_CanBeDisplayedCharaPanel");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_CanBeDisplayedCharaPanel, OutDisplayed) == 0x000000, "Member 'BP_MapCharaPanelCtrl_C_CanBeDisplayedCharaPanel::OutDisplayed' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_CanBeDisplayedCharaPanel, CallFunc_CheckEventFlag_ReturnValue) == 0x000001, "Member 'BP_MapCharaPanelCtrl_C_CanBeDisplayedCharaPanel::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_CanBeDisplayedCharaPanel, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'BP_MapCharaPanelCtrl_C_CanBeDisplayedCharaPanel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_MapCharaPanelCtrl.BP_MapCharaPanelCtrl_C.StartVNumberAnimation
// 0x0050 (0x0050 - 0x0000)
struct BP_MapCharaPanelCtrl_C_StartVNumberAnimation final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InStartTime;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InHp;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMp;                                              // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAnime;                                           // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2480[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartTime;                                         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAnimation;                                       // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2481[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetVNumberMode_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2482[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue_1;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCharaPanelVNumberPosMode_ReturnValue;  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetCharaPanelVNumberPosMode_ReturnValue_1; // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetCharaPanelVNumberPosMode_ReturnValue_2; // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2483[0x5];                                     // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharaPanel_C*                       CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCharaPanelVNumberMoveMode_ReturnValue; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetCharaPanelVNumberMoveMode_ReturnValue_1; // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetCharaPanelVNumberMoveMode_ReturnValue_2; // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation) == 0x000008, "Wrong alignment on BP_MapCharaPanelCtrl_C_StartVNumberAnimation");
static_assert(sizeof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation) == 0x000050, "Wrong size on BP_MapCharaPanelCtrl_C_StartVNumberAnimation");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation, InIndex) == 0x000000, "Member 'BP_MapCharaPanelCtrl_C_StartVNumberAnimation::InIndex' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation, InStartTime) == 0x000004, "Member 'BP_MapCharaPanelCtrl_C_StartVNumberAnimation::InStartTime' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation, InHp) == 0x000008, "Member 'BP_MapCharaPanelCtrl_C_StartVNumberAnimation::InHp' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation, InMp) == 0x00000C, "Member 'BP_MapCharaPanelCtrl_C_StartVNumberAnimation::InMp' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation, InPrio) == 0x000010, "Member 'BP_MapCharaPanelCtrl_C_StartVNumberAnimation::InPrio' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation, IsAnime) == 0x000011, "Member 'BP_MapCharaPanelCtrl_C_StartVNumberAnimation::IsAnime' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation, StartTime) == 0x000014, "Member 'BP_MapCharaPanelCtrl_C_StartVNumberAnimation::StartTime' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation, IsAnimation) == 0x000018, "Member 'BP_MapCharaPanelCtrl_C_StartVNumberAnimation::IsAnimation' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000019, "Member 'BP_MapCharaPanelCtrl_C_StartVNumberAnimation::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation, CallFunc_GetVNumberMode_ReturnValue) == 0x00001C, "Member 'BP_MapCharaPanelCtrl_C_StartVNumberAnimation::CallFunc_GetVNumberMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation, K2Node_SwitchInteger_CmpSuccess) == 0x000020, "Member 'BP_MapCharaPanelCtrl_C_StartVNumberAnimation::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000021, "Member 'BP_MapCharaPanelCtrl_C_StartVNumberAnimation::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation, CallFunc_Add_FloatFloat_ReturnValue) == 0x000024, "Member 'BP_MapCharaPanelCtrl_C_StartVNumberAnimation::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation, CallFunc_SpawnSound2D_ReturnValue) == 0x000028, "Member 'BP_MapCharaPanelCtrl_C_StartVNumberAnimation::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation, CallFunc_SpawnSound2D_ReturnValue_1) == 0x000030, "Member 'BP_MapCharaPanelCtrl_C_StartVNumberAnimation::CallFunc_SpawnSound2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation, CallFunc_SetCharaPanelVNumberPosMode_ReturnValue) == 0x000038, "Member 'BP_MapCharaPanelCtrl_C_StartVNumberAnimation::CallFunc_SetCharaPanelVNumberPosMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation, CallFunc_SetCharaPanelVNumberPosMode_ReturnValue_1) == 0x000039, "Member 'BP_MapCharaPanelCtrl_C_StartVNumberAnimation::CallFunc_SetCharaPanelVNumberPosMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation, CallFunc_SetCharaPanelVNumberPosMode_ReturnValue_2) == 0x00003A, "Member 'BP_MapCharaPanelCtrl_C_StartVNumberAnimation::CallFunc_SetCharaPanelVNumberPosMode_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_MapCharaPanelCtrl_C_StartVNumberAnimation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation, CallFunc_SetCharaPanelVNumberMoveMode_ReturnValue) == 0x000048, "Member 'BP_MapCharaPanelCtrl_C_StartVNumberAnimation::CallFunc_SetCharaPanelVNumberMoveMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation, CallFunc_SetCharaPanelVNumberMoveMode_ReturnValue_1) == 0x000049, "Member 'BP_MapCharaPanelCtrl_C_StartVNumberAnimation::CallFunc_SetCharaPanelVNumberMoveMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_StartVNumberAnimation, CallFunc_SetCharaPanelVNumberMoveMode_ReturnValue_2) == 0x00004A, "Member 'BP_MapCharaPanelCtrl_C_StartVNumberAnimation::CallFunc_SetCharaPanelVNumberMoveMode_ReturnValue_2' has a wrong offset!");

// Function BP_MapCharaPanelCtrl.BP_MapCharaPanelCtrl_C.GetPanelIndexFromNkmIndex
// 0x0040 (0x0040 - 0x0000)
struct BP_MapCharaPanelCtrl_C_GetPanelIndexFromNkmIndex final
{
public:
	int32                                         InNkmIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OutIndex;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Retindex;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2484[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerPanelPositionInBattle_ReturnValue; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2485[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2486[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 CallFunc_GetNkmBattleUnitList_ReturnValue;         // 0x0028(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MapCharaPanelCtrl_C_GetPanelIndexFromNkmIndex) == 0x000008, "Wrong alignment on BP_MapCharaPanelCtrl_C_GetPanelIndexFromNkmIndex");
static_assert(sizeof(BP_MapCharaPanelCtrl_C_GetPanelIndexFromNkmIndex) == 0x000040, "Wrong size on BP_MapCharaPanelCtrl_C_GetPanelIndexFromNkmIndex");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_GetPanelIndexFromNkmIndex, InNkmIndex) == 0x000000, "Member 'BP_MapCharaPanelCtrl_C_GetPanelIndexFromNkmIndex::InNkmIndex' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_GetPanelIndexFromNkmIndex, OutIndex) == 0x000004, "Member 'BP_MapCharaPanelCtrl_C_GetPanelIndexFromNkmIndex::OutIndex' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_GetPanelIndexFromNkmIndex, Retindex) == 0x000008, "Member 'BP_MapCharaPanelCtrl_C_GetPanelIndexFromNkmIndex::Retindex' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_GetPanelIndexFromNkmIndex, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'BP_MapCharaPanelCtrl_C_GetPanelIndexFromNkmIndex::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_GetPanelIndexFromNkmIndex, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_MapCharaPanelCtrl_C_GetPanelIndexFromNkmIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_GetPanelIndexFromNkmIndex, CallFunc_GetPlayerPanelPositionInBattle_ReturnValue) == 0x000014, "Member 'BP_MapCharaPanelCtrl_C_GetPanelIndexFromNkmIndex::CallFunc_GetPlayerPanelPositionInBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_GetPanelIndexFromNkmIndex, Temp_int_Variable) == 0x000018, "Member 'BP_MapCharaPanelCtrl_C_GetPanelIndexFromNkmIndex::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_MapCharaPanelCtrl_C_GetPanelIndexFromNkmIndex, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00001C, "Member 'BP_MapCharaPanelCtrl_C_GetPanelIndexFromNkmIndex::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
