#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapGimmickTrigger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MapGimmickTrigger.BP_MapGimmickTrigger_C
// 0x00F0 (0x0310 - 0x0220)
class ABP_MapGimmickTrigger_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             EvtDis_SilentMoon;                                 // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EvtDis_EndBattle;                                  // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EvtDis_StartBattle;                                // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EvtDis_ChangeMagatsukaUndiscovery;                 // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         MagatsukaNotDiscoveryCount;                        // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MagatsukaChangeUndiscoveryCount;                   // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MOON_AGE                                    MoonAge;                                           // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MOON_AGE                                    PrevMoonAge;                                       // 0x0279(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125A[0x6];                                     // 0x027A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             EvtDis_EncountReset;                               // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EvtDis_CheckBattleEscape;                          // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EvtDis_HideObjects_WhenExitMap;                    // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EvtDis_ShowObjects_WhenReturnMap;                  // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EvtDis_MapStart;                                   // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          MapPause;                                          // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125B[0x3];                                     // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PrevCameraDir;                                     // 0x02D4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             EvtDis_highSpeedCamera;                            // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EvtDis_MapPause;                                   // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EvtDis_MapUnpause;                                 // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void EvtDis_SilentMoon__DelegateSignature();
	void EvtDis_EndBattle__DelegateSignature(E_BTL_END BtlEndType, int32 ChainEncountNum);
	void EvtDis_StartBattle__DelegateSignature();
	void EvtDis_ChangeMagatsukaUndiscovery__DelegateSignature();
	void EvtDis_EncountReset__DelegateSignature();
	void EvtDis_CheckBattleEscape__DelegateSignature(bool Escape);
	void EvtDis_HideObjects_WhenExitMap__DelegateSignature();
	void EvtDis_ShowObjects_WhenReturnMap__DelegateSignature();
	void EvtDis_MapStart__DelegateSignature();
	void EvtDis_highSpeedCamera__DelegateSignature();
	void EvtDis_MapPause__DelegateSignature();
	void EvtDis_MapUnpause__DelegateSignature();
	void ExecuteUbergraph_BP_MapGimmickTrigger(int32 EntryPoint);
	void EvtDis_EncountReset_Event();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Enter_MagatsukaNotDiscovery(bool Enter);
	void Enter_MagatsukaChangeUndiscovery(bool Enter);
	void Check_MagatsukaCanDiscovery(bool* CanDiscovery);
	void CalcSpSymbolDead();
	void Pause();
	void Unpause();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MapGimmickTrigger_C">();
	}
	static class ABP_MapGimmickTrigger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MapGimmickTrigger_C>();
	}
};
static_assert(alignof(ABP_MapGimmickTrigger_C) == 0x000008, "Wrong alignment on ABP_MapGimmickTrigger_C");
static_assert(sizeof(ABP_MapGimmickTrigger_C) == 0x000310, "Wrong size on ABP_MapGimmickTrigger_C");
static_assert(offsetof(ABP_MapGimmickTrigger_C, UberGraphFrame) == 0x000220, "Member 'ABP_MapGimmickTrigger_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MapGimmickTrigger_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_MapGimmickTrigger_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MapGimmickTrigger_C, EvtDis_SilentMoon) == 0x000230, "Member 'ABP_MapGimmickTrigger_C::EvtDis_SilentMoon' has a wrong offset!");
static_assert(offsetof(ABP_MapGimmickTrigger_C, EvtDis_EndBattle) == 0x000240, "Member 'ABP_MapGimmickTrigger_C::EvtDis_EndBattle' has a wrong offset!");
static_assert(offsetof(ABP_MapGimmickTrigger_C, EvtDis_StartBattle) == 0x000250, "Member 'ABP_MapGimmickTrigger_C::EvtDis_StartBattle' has a wrong offset!");
static_assert(offsetof(ABP_MapGimmickTrigger_C, EvtDis_ChangeMagatsukaUndiscovery) == 0x000260, "Member 'ABP_MapGimmickTrigger_C::EvtDis_ChangeMagatsukaUndiscovery' has a wrong offset!");
static_assert(offsetof(ABP_MapGimmickTrigger_C, MagatsukaNotDiscoveryCount) == 0x000270, "Member 'ABP_MapGimmickTrigger_C::MagatsukaNotDiscoveryCount' has a wrong offset!");
static_assert(offsetof(ABP_MapGimmickTrigger_C, MagatsukaChangeUndiscoveryCount) == 0x000274, "Member 'ABP_MapGimmickTrigger_C::MagatsukaChangeUndiscoveryCount' has a wrong offset!");
static_assert(offsetof(ABP_MapGimmickTrigger_C, MoonAge) == 0x000278, "Member 'ABP_MapGimmickTrigger_C::MoonAge' has a wrong offset!");
static_assert(offsetof(ABP_MapGimmickTrigger_C, PrevMoonAge) == 0x000279, "Member 'ABP_MapGimmickTrigger_C::PrevMoonAge' has a wrong offset!");
static_assert(offsetof(ABP_MapGimmickTrigger_C, EvtDis_EncountReset) == 0x000280, "Member 'ABP_MapGimmickTrigger_C::EvtDis_EncountReset' has a wrong offset!");
static_assert(offsetof(ABP_MapGimmickTrigger_C, EvtDis_CheckBattleEscape) == 0x000290, "Member 'ABP_MapGimmickTrigger_C::EvtDis_CheckBattleEscape' has a wrong offset!");
static_assert(offsetof(ABP_MapGimmickTrigger_C, EvtDis_HideObjects_WhenExitMap) == 0x0002A0, "Member 'ABP_MapGimmickTrigger_C::EvtDis_HideObjects_WhenExitMap' has a wrong offset!");
static_assert(offsetof(ABP_MapGimmickTrigger_C, EvtDis_ShowObjects_WhenReturnMap) == 0x0002B0, "Member 'ABP_MapGimmickTrigger_C::EvtDis_ShowObjects_WhenReturnMap' has a wrong offset!");
static_assert(offsetof(ABP_MapGimmickTrigger_C, EvtDis_MapStart) == 0x0002C0, "Member 'ABP_MapGimmickTrigger_C::EvtDis_MapStart' has a wrong offset!");
static_assert(offsetof(ABP_MapGimmickTrigger_C, MapPause) == 0x0002D0, "Member 'ABP_MapGimmickTrigger_C::MapPause' has a wrong offset!");
static_assert(offsetof(ABP_MapGimmickTrigger_C, PrevCameraDir) == 0x0002D4, "Member 'ABP_MapGimmickTrigger_C::PrevCameraDir' has a wrong offset!");
static_assert(offsetof(ABP_MapGimmickTrigger_C, EvtDis_highSpeedCamera) == 0x0002E0, "Member 'ABP_MapGimmickTrigger_C::EvtDis_highSpeedCamera' has a wrong offset!");
static_assert(offsetof(ABP_MapGimmickTrigger_C, EvtDis_MapPause) == 0x0002F0, "Member 'ABP_MapGimmickTrigger_C::EvtDis_MapPause' has a wrong offset!");
static_assert(offsetof(ABP_MapGimmickTrigger_C, EvtDis_MapUnpause) == 0x000300, "Member 'ABP_MapGimmickTrigger_C::EvtDis_MapUnpause' has a wrong offset!");

}

