#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapSymbolBlock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MapActorCore_classes.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MapSymbolBlock.BP_MapSymbolBlock_C
// 0x0038 (0x02B0 - 0x0278)
class ABP_MapSymbolBlock_C final : public AMapActorCore_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_MapSymbolBlock_C;                // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitSize;                                           // 0x0290(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsView;                                            // 0x029C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ProfileName;                                       // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SaveProfileName;                                   // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_MapSymbolBlock(int32 EntryPoint);
	void OnEndBattle(E_BTL_END BtlEndType, int32 ChainEncountNum);
	void OnStartBattle();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MapSymbolBlock_C">();
	}
	static class ABP_MapSymbolBlock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MapSymbolBlock_C>();
	}
};
static_assert(alignof(ABP_MapSymbolBlock_C) == 0x000008, "Wrong alignment on ABP_MapSymbolBlock_C");
static_assert(sizeof(ABP_MapSymbolBlock_C) == 0x0002B0, "Wrong size on ABP_MapSymbolBlock_C");
static_assert(offsetof(ABP_MapSymbolBlock_C, UberGraphFrame_BP_MapSymbolBlock_C) == 0x000278, "Member 'ABP_MapSymbolBlock_C::UberGraphFrame_BP_MapSymbolBlock_C' has a wrong offset!");
static_assert(offsetof(ABP_MapSymbolBlock_C, StaticMesh) == 0x000280, "Member 'ABP_MapSymbolBlock_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_MapSymbolBlock_C, Box) == 0x000288, "Member 'ABP_MapSymbolBlock_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_MapSymbolBlock_C, HitSize) == 0x000290, "Member 'ABP_MapSymbolBlock_C::HitSize' has a wrong offset!");
static_assert(offsetof(ABP_MapSymbolBlock_C, IsView) == 0x00029C, "Member 'ABP_MapSymbolBlock_C::IsView' has a wrong offset!");
static_assert(offsetof(ABP_MapSymbolBlock_C, ProfileName) == 0x0002A0, "Member 'ABP_MapSymbolBlock_C::ProfileName' has a wrong offset!");
static_assert(offsetof(ABP_MapSymbolBlock_C, SaveProfileName) == 0x0002A8, "Member 'ABP_MapSymbolBlock_C::SaveProfileName' has a wrong offset!");

}

