#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MagatsukaNotDiscovery

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_MagatsukaNotDiscovery.BP_MagatsukaNotDiscovery_C.ExecuteUbergraph_BP_MagatsukaNotDiscovery
// 0x0140 (0x0140 - 0x0000)
struct BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30E8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E9[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn_1;                    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30EA[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_1;             // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30EB[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMapGimmickTrigger_Actor;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BPI_GetMapGimmickTrigger_Actor_1;         // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MapGimmickTrigger_C*                K2Node_DynamicCast_AsBP_Map_Gimmick_Trigger;       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30EC[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MapGimmickTrigger_C*                K2Node_DynamicCast_AsBP_Map_Gimmick_Trigger_1;     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30ED[0x5];                                     // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery) == 0x000008, "Wrong alignment on BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery");
static_assert(sizeof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery) == 0x000140, "Wrong size on BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, EntryPoint) == 0x000000, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000008, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000010, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000018, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000020, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, CallFunc_GetMapCommon_rerutn) == 0x0000B0, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, CallFunc_GetMapCommon_rerutn_1) == 0x0000B8, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::CallFunc_GetMapCommon_rerutn_1' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, K2Node_DynamicCast_AsBPI_Map_Common) == 0x0000C0, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, K2Node_DynamicCast_AsBPI_Map_Common_1) == 0x0000D8, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::K2Node_DynamicCast_AsBPI_Map_Common_1' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, K2Node_DynamicCast_bSuccess_1) == 0x0000E8, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, CallFunc_BPI_GetMapGimmickTrigger_Actor) == 0x0000F0, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::CallFunc_BPI_GetMapGimmickTrigger_Actor' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, CallFunc_BPI_GetMapGimmickTrigger_Actor_1) == 0x0000F8, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::CallFunc_BPI_GetMapGimmickTrigger_Actor_1' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, K2Node_DynamicCast_AsBP_Map_Gimmick_Trigger) == 0x000100, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::K2Node_DynamicCast_AsBP_Map_Gimmick_Trigger' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, K2Node_DynamicCast_bSuccess_2) == 0x000108, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, K2Node_DynamicCast_AsBP_Map_Gimmick_Trigger_1) == 0x000110, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::K2Node_DynamicCast_AsBP_Map_Gimmick_Trigger_1' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, K2Node_DynamicCast_bSuccess_3) == 0x000118, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, CallFunc_IsValid_ReturnValue) == 0x000119, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, CallFunc_IsValid_ReturnValue_1) == 0x00011A, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000120, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, K2Node_ComponentBoundEvent_OtherActor) == 0x000128, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, K2Node_ComponentBoundEvent_OtherComp) == 0x000130, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000138, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery, CallFunc_Not_PreBool_ReturnValue) == 0x00013C, "Member 'BP_MagatsukaNotDiscovery_C_ExecuteUbergraph_BP_MagatsukaNotDiscovery::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_MagatsukaNotDiscovery.BP_MagatsukaNotDiscovery_C.BndEvt__Box_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_MagatsukaNotDiscovery.BP_MagatsukaNotDiscovery_C.BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30EE[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_MagatsukaNotDiscovery_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_MagatsukaNotDiscovery.BP_MagatsukaNotDiscovery_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct BP_MagatsukaNotDiscovery_C_UserConstructionScript final
{
public:
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30EF[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MagatsukaNotDiscovery_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_MagatsukaNotDiscovery_C_UserConstructionScript");
static_assert(sizeof(BP_MagatsukaNotDiscovery_C_UserConstructionScript) == 0x000020, "Wrong size on BP_MagatsukaNotDiscovery_C_UserConstructionScript");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_UserConstructionScript, CallFunc_GetMaterial_ReturnValue) == 0x000000, "Member 'BP_MagatsukaNotDiscovery_C_UserConstructionScript::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_MagatsukaNotDiscovery_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_MagatsukaNotDiscovery_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'BP_MagatsukaNotDiscovery_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaNotDiscovery_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000014, "Member 'BP_MagatsukaNotDiscovery_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

}

