#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapAutoHeal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MapAutoHeal.BP_MapAutoHeal_C
// 0x0058 (0x0278 - 0x0220)
class ABP_MapAutoHeal_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    ScriptMsg;                                         // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UScriptMessageAsset>     ScriptMsg_Soft;                                    // 0x0238(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FMapAutoHealResult>             Result;                                            // 0x0260(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          UseHeal;                                           // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HaveRebornSkill;                                   // 0x0271(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HaveHPSkill;                                       // 0x0272(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CheckSE;                                           // 0x0273(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_MapAutoHeal(int32 EntryPoint);
	void End();
	void ReceiveBeginPlay();
	void OnLoaded_05CE4B6841AB4841B2084BAECF5A50DA(class UObject* Loaded);
	void PlayOpenDialogSE();
	void CheckVictim(bool* Dead, bool* DecreaseHP);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MapAutoHeal_C">();
	}
	static class ABP_MapAutoHeal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MapAutoHeal_C>();
	}
};
static_assert(alignof(ABP_MapAutoHeal_C) == 0x000008, "Wrong alignment on ABP_MapAutoHeal_C");
static_assert(sizeof(ABP_MapAutoHeal_C) == 0x000278, "Wrong size on ABP_MapAutoHeal_C");
static_assert(offsetof(ABP_MapAutoHeal_C, UberGraphFrame) == 0x000220, "Member 'ABP_MapAutoHeal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MapAutoHeal_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_MapAutoHeal_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MapAutoHeal_C, ScriptMsg) == 0x000230, "Member 'ABP_MapAutoHeal_C::ScriptMsg' has a wrong offset!");
static_assert(offsetof(ABP_MapAutoHeal_C, ScriptMsg_Soft) == 0x000238, "Member 'ABP_MapAutoHeal_C::ScriptMsg_Soft' has a wrong offset!");
static_assert(offsetof(ABP_MapAutoHeal_C, Result) == 0x000260, "Member 'ABP_MapAutoHeal_C::Result' has a wrong offset!");
static_assert(offsetof(ABP_MapAutoHeal_C, UseHeal) == 0x000270, "Member 'ABP_MapAutoHeal_C::UseHeal' has a wrong offset!");
static_assert(offsetof(ABP_MapAutoHeal_C, HaveRebornSkill) == 0x000271, "Member 'ABP_MapAutoHeal_C::HaveRebornSkill' has a wrong offset!");
static_assert(offsetof(ABP_MapAutoHeal_C, HaveHPSkill) == 0x000272, "Member 'ABP_MapAutoHeal_C::HaveHPSkill' has a wrong offset!");
static_assert(offsetof(ABP_MapAutoHeal_C, CheckSE) == 0x000273, "Member 'ABP_MapAutoHeal_C::CheckSE' has a wrong offset!");

}

