#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapWarpEffect

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_MapWarpEffect.BP_MapWarpEffect_C.ExecuteUbergraph_BP_MapWarpEffect
// 0x0038 (0x0038 - 0x0000)
struct BP_MapWarpEffect_C_ExecuteUbergraph_BP_MapWarpEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC22[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         CallFunc_PlaySound2DRooted_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FadeOut_Black_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BC23[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACustomPawn*                            K2Node_DynamicCast_AsCustom_Pawn;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BC24[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapWarpEffect_C_ExecuteUbergraph_BP_MapWarpEffect) == 0x000008, "Wrong alignment on BP_MapWarpEffect_C_ExecuteUbergraph_BP_MapWarpEffect");
static_assert(sizeof(BP_MapWarpEffect_C_ExecuteUbergraph_BP_MapWarpEffect) == 0x000038, "Wrong size on BP_MapWarpEffect_C_ExecuteUbergraph_BP_MapWarpEffect");
static_assert(offsetof(BP_MapWarpEffect_C_ExecuteUbergraph_BP_MapWarpEffect, EntryPoint) == 0x000000, "Member 'BP_MapWarpEffect_C_ExecuteUbergraph_BP_MapWarpEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MapWarpEffect_C_ExecuteUbergraph_BP_MapWarpEffect, CallFunc_PlaySound2DRooted_ReturnValue) == 0x000008, "Member 'BP_MapWarpEffect_C_ExecuteUbergraph_BP_MapWarpEffect::CallFunc_PlaySound2DRooted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapWarpEffect_C_ExecuteUbergraph_BP_MapWarpEffect, CallFunc_FadeOut_Black_ReturnValue) == 0x000010, "Member 'BP_MapWarpEffect_C_ExecuteUbergraph_BP_MapWarpEffect::CallFunc_FadeOut_Black_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapWarpEffect_C_ExecuteUbergraph_BP_MapWarpEffect, CallFunc_GetPlayerPawn_ReturnValue) == 0x000018, "Member 'BP_MapWarpEffect_C_ExecuteUbergraph_BP_MapWarpEffect::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapWarpEffect_C_ExecuteUbergraph_BP_MapWarpEffect, K2Node_DynamicCast_AsCustom_Pawn) == 0x000020, "Member 'BP_MapWarpEffect_C_ExecuteUbergraph_BP_MapWarpEffect::K2Node_DynamicCast_AsCustom_Pawn' has a wrong offset!");
static_assert(offsetof(BP_MapWarpEffect_C_ExecuteUbergraph_BP_MapWarpEffect, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_MapWarpEffect_C_ExecuteUbergraph_BP_MapWarpEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MapWarpEffect_C_ExecuteUbergraph_BP_MapWarpEffect, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000030, "Member 'BP_MapWarpEffect_C_ExecuteUbergraph_BP_MapWarpEffect::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");

}

