#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MagatsukaNotDiscovery

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MagatsukaNotDiscovery.BP_MagatsukaNotDiscovery_C
// 0x0030 (0x0250 - 0x0220)
class ABP_MagatsukaNotDiscovery_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_DebugBox;                                       // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitSize;                                           // 0x0240(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsView;                                            // 0x024C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          In;                                                // 0x024D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_MagatsukaNotDiscovery(int32 EntryPoint);
	void BndEvt__Box_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MagatsukaNotDiscovery_C">();
	}
	static class ABP_MagatsukaNotDiscovery_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MagatsukaNotDiscovery_C>();
	}
};
static_assert(alignof(ABP_MagatsukaNotDiscovery_C) == 0x000008, "Wrong alignment on ABP_MagatsukaNotDiscovery_C");
static_assert(sizeof(ABP_MagatsukaNotDiscovery_C) == 0x000250, "Wrong size on ABP_MagatsukaNotDiscovery_C");
static_assert(offsetof(ABP_MagatsukaNotDiscovery_C, UberGraphFrame) == 0x000220, "Member 'ABP_MagatsukaNotDiscovery_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MagatsukaNotDiscovery_C, SM_DebugBox) == 0x000228, "Member 'ABP_MagatsukaNotDiscovery_C::SM_DebugBox' has a wrong offset!");
static_assert(offsetof(ABP_MagatsukaNotDiscovery_C, Box) == 0x000230, "Member 'ABP_MagatsukaNotDiscovery_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_MagatsukaNotDiscovery_C, DefaultSceneRoot) == 0x000238, "Member 'ABP_MagatsukaNotDiscovery_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MagatsukaNotDiscovery_C, HitSize) == 0x000240, "Member 'ABP_MagatsukaNotDiscovery_C::HitSize' has a wrong offset!");
static_assert(offsetof(ABP_MagatsukaNotDiscovery_C, IsView) == 0x00024C, "Member 'ABP_MagatsukaNotDiscovery_C::IsView' has a wrong offset!");
static_assert(offsetof(ABP_MagatsukaNotDiscovery_C, In) == 0x00024D, "Member 'ABP_MagatsukaNotDiscovery_C::In' has a wrong offset!");

}

