#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapSymbolDebug_Eye

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MapSymbolDebug_Eye.BP_MapSymbolDebug_Eye_C
// 0x0018 (0x0238 - 0x0220)
class ABP_MapSymbolDebug_Eye_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Angle;                                             // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Length;                                            // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MapSymbolDebug_Eye(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Init();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MapSymbolDebug_Eye_C">();
	}
	static class ABP_MapSymbolDebug_Eye_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MapSymbolDebug_Eye_C>();
	}
};
static_assert(alignof(ABP_MapSymbolDebug_Eye_C) == 0x000008, "Wrong alignment on ABP_MapSymbolDebug_Eye_C");
static_assert(sizeof(ABP_MapSymbolDebug_Eye_C) == 0x000238, "Wrong size on ABP_MapSymbolDebug_Eye_C");
static_assert(offsetof(ABP_MapSymbolDebug_Eye_C, UberGraphFrame) == 0x000220, "Member 'ABP_MapSymbolDebug_Eye_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MapSymbolDebug_Eye_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_MapSymbolDebug_Eye_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MapSymbolDebug_Eye_C, Angle) == 0x000230, "Member 'ABP_MapSymbolDebug_Eye_C::Angle' has a wrong offset!");
static_assert(offsetof(ABP_MapSymbolDebug_Eye_C, Length) == 0x000234, "Member 'ABP_MapSymbolDebug_Eye_C::Length' has a wrong offset!");

}

