#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MouseMediator_InheritStatus

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_MouseMediator_InheritStatus.BP_MouseMediator_InheritStatus_C.Disp_OnMovedParentScrollBarByMouse__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_MouseMediator_InheritStatus_C_Disp_OnMovedParentScrollBarByMouse__DelegateSignature final
{
public:
	int32                                         NewOffset;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MouseMediator_InheritStatus_C_Disp_OnMovedParentScrollBarByMouse__DelegateSignature) == 0x000004, "Wrong alignment on BP_MouseMediator_InheritStatus_C_Disp_OnMovedParentScrollBarByMouse__DelegateSignature");
static_assert(sizeof(BP_MouseMediator_InheritStatus_C_Disp_OnMovedParentScrollBarByMouse__DelegateSignature) == 0x000004, "Wrong size on BP_MouseMediator_InheritStatus_C_Disp_OnMovedParentScrollBarByMouse__DelegateSignature");
static_assert(offsetof(BP_MouseMediator_InheritStatus_C_Disp_OnMovedParentScrollBarByMouse__DelegateSignature, NewOffset) == 0x000000, "Member 'BP_MouseMediator_InheritStatus_C_Disp_OnMovedParentScrollBarByMouse__DelegateSignature::NewOffset' has a wrong offset!");

// Function BP_MouseMediator_InheritStatus.BP_MouseMediator_InheritStatus_C.Disp_OnMovedRightScrollBarByMouse__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_MouseMediator_InheritStatus_C_Disp_OnMovedRightScrollBarByMouse__DelegateSignature final
{
public:
	int32                                         NewOffset;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MouseMediator_InheritStatus_C_Disp_OnMovedRightScrollBarByMouse__DelegateSignature) == 0x000004, "Wrong alignment on BP_MouseMediator_InheritStatus_C_Disp_OnMovedRightScrollBarByMouse__DelegateSignature");
static_assert(sizeof(BP_MouseMediator_InheritStatus_C_Disp_OnMovedRightScrollBarByMouse__DelegateSignature) == 0x000004, "Wrong size on BP_MouseMediator_InheritStatus_C_Disp_OnMovedRightScrollBarByMouse__DelegateSignature");
static_assert(offsetof(BP_MouseMediator_InheritStatus_C_Disp_OnMovedRightScrollBarByMouse__DelegateSignature, NewOffset) == 0x000000, "Member 'BP_MouseMediator_InheritStatus_C_Disp_OnMovedRightScrollBarByMouse__DelegateSignature::NewOffset' has a wrong offset!");

// Function BP_MouseMediator_InheritStatus.BP_MouseMediator_InheritStatus_C.Disp_OnClickedParentSlot__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_MouseMediator_InheritStatus_C_Disp_OnClickedParentSlot__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MouseMediator_InheritStatus_C_Disp_OnClickedParentSlot__DelegateSignature) == 0x000004, "Wrong alignment on BP_MouseMediator_InheritStatus_C_Disp_OnClickedParentSlot__DelegateSignature");
static_assert(sizeof(BP_MouseMediator_InheritStatus_C_Disp_OnClickedParentSlot__DelegateSignature) == 0x000004, "Wrong size on BP_MouseMediator_InheritStatus_C_Disp_OnClickedParentSlot__DelegateSignature");
static_assert(offsetof(BP_MouseMediator_InheritStatus_C_Disp_OnClickedParentSlot__DelegateSignature, Param_Index) == 0x000000, "Member 'BP_MouseMediator_InheritStatus_C_Disp_OnClickedParentSlot__DelegateSignature::Param_Index' has a wrong offset!");

// Function BP_MouseMediator_InheritStatus.BP_MouseMediator_InheritStatus_C.Disp_OnClickedRightSlot__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_MouseMediator_InheritStatus_C_Disp_OnClickedRightSlot__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MouseMediator_InheritStatus_C_Disp_OnClickedRightSlot__DelegateSignature) == 0x000004, "Wrong alignment on BP_MouseMediator_InheritStatus_C_Disp_OnClickedRightSlot__DelegateSignature");
static_assert(sizeof(BP_MouseMediator_InheritStatus_C_Disp_OnClickedRightSlot__DelegateSignature) == 0x000004, "Wrong size on BP_MouseMediator_InheritStatus_C_Disp_OnClickedRightSlot__DelegateSignature");
static_assert(offsetof(BP_MouseMediator_InheritStatus_C_Disp_OnClickedRightSlot__DelegateSignature, Param_Index) == 0x000000, "Member 'BP_MouseMediator_InheritStatus_C_Disp_OnClickedRightSlot__DelegateSignature::Param_Index' has a wrong offset!");

// Function BP_MouseMediator_InheritStatus.BP_MouseMediator_InheritStatus_C.Disp_OnHoveredParentSlot__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_MouseMediator_InheritStatus_C_Disp_OnHoveredParentSlot__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MouseMediator_InheritStatus_C_Disp_OnHoveredParentSlot__DelegateSignature) == 0x000004, "Wrong alignment on BP_MouseMediator_InheritStatus_C_Disp_OnHoveredParentSlot__DelegateSignature");
static_assert(sizeof(BP_MouseMediator_InheritStatus_C_Disp_OnHoveredParentSlot__DelegateSignature) == 0x000004, "Wrong size on BP_MouseMediator_InheritStatus_C_Disp_OnHoveredParentSlot__DelegateSignature");
static_assert(offsetof(BP_MouseMediator_InheritStatus_C_Disp_OnHoveredParentSlot__DelegateSignature, Param_Index) == 0x000000, "Member 'BP_MouseMediator_InheritStatus_C_Disp_OnHoveredParentSlot__DelegateSignature::Param_Index' has a wrong offset!");

// Function BP_MouseMediator_InheritStatus.BP_MouseMediator_InheritStatus_C.Disp_OnHoveredRightSlot__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_MouseMediator_InheritStatus_C_Disp_OnHoveredRightSlot__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MouseMediator_InheritStatus_C_Disp_OnHoveredRightSlot__DelegateSignature) == 0x000004, "Wrong alignment on BP_MouseMediator_InheritStatus_C_Disp_OnHoveredRightSlot__DelegateSignature");
static_assert(sizeof(BP_MouseMediator_InheritStatus_C_Disp_OnHoveredRightSlot__DelegateSignature) == 0x000004, "Wrong size on BP_MouseMediator_InheritStatus_C_Disp_OnHoveredRightSlot__DelegateSignature");
static_assert(offsetof(BP_MouseMediator_InheritStatus_C_Disp_OnHoveredRightSlot__DelegateSignature, Param_Index) == 0x000000, "Member 'BP_MouseMediator_InheritStatus_C_Disp_OnHoveredRightSlot__DelegateSignature::Param_Index' has a wrong offset!");

}

