#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapTopCamera

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_MapTopCamera.BP_MapTopCamera_C.ExecuteUbergraph_BP_MapTopCamera
// 0x02E8 (0x02E8 - 0x0000)
struct BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapUICtrl_MapUICtrl;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapUICtrl_C>      K2Node_DynamicCast_AsBPI_Map_UICtrl;               // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C82[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapUICtrl_MapUICtrl_1;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapUICtrl_C>      K2Node_DynamicCast_AsBPI_Map_UICtrl_1;             // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_ShowTopCameraIcon_dummy;              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C83[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_UpdateTopCameraIcon_dummy;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C84[0x2];                                     // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0074(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C85[0x2];                                     // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult_1; // 0x0100(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue_1; // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C86[0x2];                                     // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C87[0x4];                                     // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor;      // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C88[0x3];                                     // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn_1;                    // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C89[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_1;             // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_MapTopCameraOnStartTop_dummy;         // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_MapTopCameraOnFinishTop_dummy;        // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C8A[0x5];                                     // 0x0203(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x0208(0x00D0)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C8B[0x2];                                     // 0x02DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera) == 0x000008, "Wrong alignment on BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera");
static_assert(sizeof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera) == 0x0002E8, "Wrong size on BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, EntryPoint) == 0x000000, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_GetMapUICtrl_MapUICtrl) == 0x000008, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_GetMapUICtrl_MapUICtrl' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, K2Node_DynamicCast_AsBPI_Map_UICtrl) == 0x000018, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::K2Node_DynamicCast_AsBPI_Map_UICtrl' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00002C, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000044, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_GetMapUICtrl_MapUICtrl_1) == 0x000050, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_GetMapUICtrl_MapUICtrl_1' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, K2Node_DynamicCast_AsBPI_Map_UICtrl_1) == 0x000058, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::K2Node_DynamicCast_AsBPI_Map_UICtrl_1' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_BPI_ShowTopCameraIcon_dummy) == 0x000069, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_BPI_ShowTopCameraIcon_dummy' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_BPI_UpdateTopCameraIcon_dummy) == 0x000070, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_BPI_UpdateTopCameraIcon_dummy' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, K2Node_SwitchEnum_CmpSuccess) == 0x000071, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x000074, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x0000FC, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000FD, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult_1) == 0x000100, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_K2_SetActorLocationAndRotation_ReturnValue_1) == 0x000188, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_K2_SetActorLocationAndRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000189, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_BreakVector_X) == 0x00018C, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_BreakVector_Y) == 0x000190, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_BreakVector_Z) == 0x000194, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000198, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001A0, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor) == 0x0001A8, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, K2Node_DynamicCast_bSuccess_2) == 0x0001B8, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_MakeVector_ReturnValue) == 0x0001BC, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_GetMapCommon_rerutn) == 0x0001C8, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_GetMapCommon_rerutn_1) == 0x0001D0, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_GetMapCommon_rerutn_1' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, K2Node_DynamicCast_AsBPI_Map_Common) == 0x0001D8, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, K2Node_DynamicCast_bSuccess_3) == 0x0001E8, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, K2Node_DynamicCast_AsBPI_Map_Common_1) == 0x0001F0, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::K2Node_DynamicCast_AsBPI_Map_Common_1' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, K2Node_DynamicCast_bSuccess_4) == 0x000200, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_BPI_MapTopCameraOnStartTop_dummy) == 0x000201, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_BPI_MapTopCameraOnStartTop_dummy' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_BPI_MapTopCameraOnFinishTop_dummy) == 0x000202, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_BPI_MapTopCameraOnFinishTop_dummy' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue) == 0x000208, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0002D8, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0002D9, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, Temp_int_Variable) == 0x0002DC, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, K2Node_SwitchInteger_CmpSuccess) == 0x0002E0, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_BooleanOR_ReturnValue) == 0x0002E1, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera, CallFunc_Not_PreBool_ReturnValue) == 0x0002E2, "Member 'BP_MapTopCamera_C_ExecuteUbergraph_BP_MapTopCamera::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_MapTopCamera.BP_MapTopCamera_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_MapTopCamera_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapTopCamera_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_MapTopCamera_C_ReceiveTick");
static_assert(sizeof(BP_MapTopCamera_C_ReceiveTick) == 0x000004, "Wrong size on BP_MapTopCamera_C_ReceiveTick");
static_assert(offsetof(BP_MapTopCamera_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_MapTopCamera_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_MapTopCamera.BP_MapTopCamera_C.Start
// 0x0168 (0x0168 - 0x0000)
struct BP_MapTopCamera_C_Start final
{
public:
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x0000(0x00D0)()
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C8C[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor;      // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C8D[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue;                 // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_ProjectPlayerCameraManager_C> K2Node_DynamicCast_AsBPI_Project_Player_Camera_Manager; // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C8E[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInputReceiver_C> K2Node_DynamicCast_AsBPI_Player_Input_Receiver;    // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C8F[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MapTopCamera_C_Start) == 0x000008, "Wrong alignment on BP_MapTopCamera_C_Start");
static_assert(sizeof(BP_MapTopCamera_C_Start) == 0x000168, "Wrong size on BP_MapTopCamera_C_Start");
static_assert(offsetof(BP_MapTopCamera_C_Start, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue) == 0x000000, "Member 'BP_MapTopCamera_C_Start::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Start, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_MapTopCamera_C_Start::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Start, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000D8, "Member 'BP_MapTopCamera_C_Start::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Start, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor) == 0x0000E0, "Member 'BP_MapTopCamera_C_Start::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Start, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'BP_MapTopCamera_C_Start::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Start, CallFunc_Get_ReturnValue) == 0x0000F8, "Member 'BP_MapTopCamera_C_Start::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Start, CallFunc_SpawnSound2D_ReturnValue) == 0x000100, "Member 'BP_MapTopCamera_C_Start::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Start, CallFunc_GetPlayerController_ReturnValue) == 0x000108, "Member 'BP_MapTopCamera_C_Start::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Start, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000110, "Member 'BP_MapTopCamera_C_Start::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Start, K2Node_DynamicCast_AsBPI_Project_Player_Camera_Manager) == 0x000118, "Member 'BP_MapTopCamera_C_Start::K2Node_DynamicCast_AsBPI_Project_Player_Camera_Manager' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Start, K2Node_DynamicCast_bSuccess_1) == 0x000128, "Member 'BP_MapTopCamera_C_Start::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Start, K2Node_DynamicCast_AsBPI_Player_Input_Receiver) == 0x000130, "Member 'BP_MapTopCamera_C_Start::K2Node_DynamicCast_AsBPI_Player_Input_Receiver' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Start, K2Node_DynamicCast_bSuccess_2) == 0x000140, "Member 'BP_MapTopCamera_C_Start::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Start, CallFunc_GetMapCommon_rerutn) == 0x000148, "Member 'BP_MapTopCamera_C_Start::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Start, K2Node_DynamicCast_AsBPI_Map_Common) == 0x000150, "Member 'BP_MapTopCamera_C_Start::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Start, K2Node_DynamicCast_bSuccess_3) == 0x000160, "Member 'BP_MapTopCamera_C_Start::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function BP_MapTopCamera.BP_MapTopCamera_C.ProcessInput
// 0x01D0 (0x01D0 - 0x0000)
struct BP_MapTopCamera_C_ProcessInput final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C90[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0048(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C91[0x5];                                     // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       CallFunc_GetPlayerCamera_PlayerCamera;             // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C92[0x8];                                     // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x00F0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C93[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue;                 // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C94[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ProjectPlayerCameraManager_C> K2Node_DynamicCast_AsBPI_Project_Player_Camera_Manager; // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C95[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRequestFinishCameraUpdateDone_Done;     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C96[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInputReceiver_C> K2Node_DynamicCast_AsBPI_Player_Input_Receiver;    // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C97[0x6];                                     // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapUICtrl_MapUICtrl;                   // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapUICtrl_C>      K2Node_DynamicCast_AsBPI_Map_UICtrl;               // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_HideTopCameraIcon_dummy;              // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_2;               // 0x01C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_3;               // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x01C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MapTopCamera_C_ProcessInput) == 0x000010, "Wrong alignment on BP_MapTopCamera_C_ProcessInput");
static_assert(sizeof(BP_MapTopCamera_C_ProcessInput) == 0x0001D0, "Wrong size on BP_MapTopCamera_C_ProcessInput");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, DeltaSeconds) == 0x000000, "Member 'BP_MapTopCamera_C_ProcessInput::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_BreakVector_X) == 0x000004, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_BreakVector_Y) == 0x000008, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_BreakVector_Z) == 0x00000C, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_BreakVector_X_1) == 0x00001C, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_BreakVector_Y_1) == 0x000020, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_BreakVector_Z_1) == 0x000024, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000028, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_BreakVector_X_2) == 0x00002C, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_BreakVector_Y_2) == 0x000030, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_BreakVector_Z_2) == 0x000034, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_MakeVector_ReturnValue) == 0x000038, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_Greater_IntInt_ReturnValue) == 0x000044, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000048, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0000D0, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_IsActionPadCheck_Success) == 0x0000D1, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_IsActionPadCheck_Success_1) == 0x0000D2, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_IsActionPadCheck_Success_1' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_GetPlayerCamera_PlayerCamera) == 0x0000D8, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_GetPlayerCamera_PlayerCamera' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_Get_ReturnValue) == 0x0000E0, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0000F0, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_BreakTransform_Location) == 0x000120, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_BreakTransform_Rotation) == 0x00012C, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_BreakTransform_Scale) == 0x000138, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_SpawnSound2D_ReturnValue) == 0x000148, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_GetPlayerController_ReturnValue) == 0x000150, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000158, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, K2Node_DynamicCast_AsBPI_Project_Player_Camera_Manager) == 0x000168, "Member 'BP_MapTopCamera_C_ProcessInput::K2Node_DynamicCast_AsBPI_Project_Player_Camera_Manager' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, K2Node_DynamicCast_bSuccess) == 0x000178, "Member 'BP_MapTopCamera_C_ProcessInput::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_GetPlayerPawn_ReturnValue) == 0x000180, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_IsRequestFinishCameraUpdateDone_Done) == 0x000188, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_IsRequestFinishCameraUpdateDone_Done' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, K2Node_DynamicCast_AsBPI_Player_Input_Receiver) == 0x000190, "Member 'BP_MapTopCamera_C_ProcessInput::K2Node_DynamicCast_AsBPI_Player_Input_Receiver' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, K2Node_DynamicCast_bSuccess_1) == 0x0001A0, "Member 'BP_MapTopCamera_C_ProcessInput::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_BooleanOR_ReturnValue) == 0x0001A1, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_GetMapUICtrl_MapUICtrl) == 0x0001A8, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_GetMapUICtrl_MapUICtrl' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, K2Node_DynamicCast_AsBPI_Map_UICtrl) == 0x0001B0, "Member 'BP_MapTopCamera_C_ProcessInput::K2Node_DynamicCast_AsBPI_Map_UICtrl' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, K2Node_DynamicCast_bSuccess_2) == 0x0001C0, "Member 'BP_MapTopCamera_C_ProcessInput::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0001C1, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_BPI_HideTopCameraIcon_dummy) == 0x0001C2, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_BPI_HideTopCameraIcon_dummy' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_IsActionPadCheck_Success_2) == 0x0001C3, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_IsActionPadCheck_Success_2' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_IsActionPadCheck_Success_3) == 0x0001C4, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_IsActionPadCheck_Success_3' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_BooleanOR_ReturnValue_1) == 0x0001C5, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_BooleanOR_ReturnValue_2) == 0x0001C6, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_BooleanAND_ReturnValue) == 0x0001C7, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput, CallFunc_BooleanAND_ReturnValue_1) == 0x0001C8, "Member 'BP_MapTopCamera_C_ProcessInput::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_MapTopCamera.BP_MapTopCamera_C.Deactivate
// 0x0058 (0x0058 - 0x0000)
struct BP_MapTopCamera_C_Deactivate final
{
public:
	class AActor*                                 CallFunc_GetMapUICtrl_MapUICtrl;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapUICtrl_C>      K2Node_DynamicCast_AsBPI_Map_UICtrl;               // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_FromTopCamera_dummy;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C98[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBlendTime_Seconds;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBlendExp_BlendExp;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C99[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9A[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapTopCamera_C_Deactivate) == 0x000008, "Wrong alignment on BP_MapTopCamera_C_Deactivate");
static_assert(sizeof(BP_MapTopCamera_C_Deactivate) == 0x000058, "Wrong size on BP_MapTopCamera_C_Deactivate");
static_assert(offsetof(BP_MapTopCamera_C_Deactivate, CallFunc_GetMapUICtrl_MapUICtrl) == 0x000000, "Member 'BP_MapTopCamera_C_Deactivate::CallFunc_GetMapUICtrl_MapUICtrl' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Deactivate, K2Node_DynamicCast_AsBPI_Map_UICtrl) == 0x000008, "Member 'BP_MapTopCamera_C_Deactivate::K2Node_DynamicCast_AsBPI_Map_UICtrl' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Deactivate, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_MapTopCamera_C_Deactivate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Deactivate, CallFunc_BPI_FromTopCamera_dummy) == 0x000019, "Member 'BP_MapTopCamera_C_Deactivate::CallFunc_BPI_FromTopCamera_dummy' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Deactivate, CallFunc_GetBlendTime_Seconds) == 0x00001C, "Member 'BP_MapTopCamera_C_Deactivate::CallFunc_GetBlendTime_Seconds' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Deactivate, CallFunc_GetMapCommon_rerutn) == 0x000020, "Member 'BP_MapTopCamera_C_Deactivate::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Deactivate, CallFunc_GetBlendExp_BlendExp) == 0x000028, "Member 'BP_MapTopCamera_C_Deactivate::CallFunc_GetBlendExp_BlendExp' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Deactivate, K2Node_DynamicCast_AsBPI_Map_Common) == 0x000030, "Member 'BP_MapTopCamera_C_Deactivate::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Deactivate, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_MapTopCamera_C_Deactivate::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Deactivate, CallFunc_GetPlayerPawn_ReturnValue) == 0x000048, "Member 'BP_MapTopCamera_C_Deactivate::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_Deactivate, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'BP_MapTopCamera_C_Deactivate::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function BP_MapTopCamera.BP_MapTopCamera_C.ProcessInput_Height
// 0x0120 (0x0120 - 0x0000)
struct BP_MapTopCamera_C_ProcessInput_Height final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PrevToNext;                                        // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LHeight_next;                                      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LHeight_prev;                                      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHeightDistanceMin_Height;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAxisPad_Value;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TryTrace_OutNext;                         // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryTrace_CanMove;                         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9B[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x005C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9C[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_1;                          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAxisPad_Value_1;                       // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9D[0x3];                                     // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapTopCamera_C_ProcessInput_Height) == 0x000004, "Wrong alignment on BP_MapTopCamera_C_ProcessInput_Height");
static_assert(sizeof(BP_MapTopCamera_C_ProcessInput_Height) == 0x000120, "Wrong size on BP_MapTopCamera_C_ProcessInput_Height");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput_Height, DeltaSeconds) == 0x000000, "Member 'BP_MapTopCamera_C_ProcessInput_Height::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput_Height, PrevToNext) == 0x000004, "Member 'BP_MapTopCamera_C_ProcessInput_Height::PrevToNext' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput_Height, LHeight_next) == 0x000010, "Member 'BP_MapTopCamera_C_ProcessInput_Height::LHeight_next' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput_Height, LHeight_prev) == 0x000014, "Member 'BP_MapTopCamera_C_ProcessInput_Height::LHeight_prev' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput_Height, CallFunc_BreakVector_X) == 0x000018, "Member 'BP_MapTopCamera_C_ProcessInput_Height::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput_Height, CallFunc_BreakVector_Y) == 0x00001C, "Member 'BP_MapTopCamera_C_ProcessInput_Height::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_MapTopCamera_C_ProcessInput_Height, CallFunc_BreakVector_Z) == 0x000020, "Member 'BP_MapTopCamera_C_ProcessInput_Height::CallFunc_BreakVector_Z' has a wrong offset!");
