#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapUICtrl

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MapSubLevelMinimap_ST_structs.hpp"
#include "Project_structs.hpp"
#include "AreaNameData_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_MapUICtrl.BP_MapUICtrl_C.ExecuteUbergraph_BP_MapUICtrl
// 0x05F0 (0x05F0 - 0x0000)
struct BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D10[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_1;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FText                                   CallFunc_GetAreaName_Text;                         // 0x0010(0x0018)()
	class FText                                   CallFunc_GetAreaName_Text_1;                       // 0x0028(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_LOCATION_WINDOW_TYPE                        Temp_byte_Variable;                                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_LOCATION_WINDOW_TYPE                        Temp_byte_Variable_1;                              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Immediate_2;                          // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D11[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_AreaID_2;                             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Immediate_1;                          // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D12[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue_1;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D13[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetShowingId_OutMapId;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShowingId_OutAreaId;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D14[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMinimapBGTextureEntry*                 CallFunc_LoadMinimapTextureBlocking_BGTexture;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShowingId_OutMapId_1;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShowingId_OutAreaId_1;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMapSubLevelMinimap_ST                 CallFunc_GetMinimap_Minimap;                       // 0x0088(0x0050)(HasGetValueTypeHash)
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue_2;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMinimapFootprintManager*               CallFunc_GetFootprintManager_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D15[0x2];                                     // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MapID_1;                              // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_AreaID_1;                             // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MINIMAP_CHANGE_TYPE                         K2Node_Event_ChangeType_1;                         // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D16[0x3];                                     // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue_3;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShowingId_OutMapId_2;                  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShowingId_OutAreaId_2;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_MapID;                                // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_AreaID;                               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MINIMAP_CHANGE_TYPE                         K2Node_Event_ChangeType;                           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D17[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMinimapBGTextureEntry*                 CallFunc_LoadMinimapTextureBlocking_BGTexture_1;   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue_4;          // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMinimapBGTextureManager*               CallFunc_GetBGTextureManager_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue;              // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D18[0x5];                                     // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue_5;          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D19[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMinimapBGTextureManager*               CallFunc_GetBGTextureManager_ReturnValue_1;        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMapID_ReturnValue;                     // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0156(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Immediate;                            // 0x0157(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_MapCharaPanelCtrl_C> K2Node_DynamicCast_AsBPI_Map_Chara_Panel_Ctrl;     // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D1A[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0170(0x0030)(IsPlainOldData, NoDestructor)
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_1;                        // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D1B[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D1C[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonWindowCtrl_C> CallFunc_BPI_GetCommonWindowCtrl_OutActor;         // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_GetCommonWindowCtrl_Success;          // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D1D[0x7];                                     // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonWindowCtrl_C> CallFunc_BPI_GetCommonWindowCtrl_OutActor_1;       // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_GetCommonWindowCtrl_Success_1;        // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IActionWindowIsActive_OutActive;          // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IActionWindowIsActive_OutActive_1;        // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x020B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D1E[0x4];                                     // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_2;                        // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D1F[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D20[0x1];                                     // 0x0233(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMapID_ReturnValue_1;                   // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAreaID_ReturnValue;                    // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D21[0x4];                                     // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue_6;          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    CallFunc_Conv_SoftClassReferenceToClass_ReturnValue; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    CallFunc_Conv_SoftClassReferenceToClass_ReturnValue_1; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor;                   // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D22[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsActor_1;                 // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D23[0x6];                                     // 0x0272(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapMakkaWinCtrl_C> K2Node_DynamicCast_AsBPI_Map_Makka_Win_Ctrl;       // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_CheckActive_Active;                   // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x028A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_OPTION_COMMON_SELECT_TYPE                   CallFunc_GetMoveDisplayMinimap_ReturnValue;        // 0x028B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D24[0x3];                                     // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_OPTION_COMMON_SELECT_TYPE                   CallFunc_GetMoveDisplayPanel_ReturnValue;          // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D25[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_3;              // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D26[0x6];                                     // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_4;              // 0x02C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D27[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMagatsuhiGaugeCtrl_outActor;       // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_SetMinimapHidden_dummy;               // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D28[0x7];                                     // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MagatsuhiGaugeCtrl_C> K2Node_DynamicCast_AsBPI_Magatsuhi_Gauge_Ctrl;     // 0x02E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D29[0x2];                                     // 0x02FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMapID_ReturnValue_2;                   // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D2A[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProjectGameMode_C*                     K2Node_DynamicCast_AsProject_Game_Mode;            // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D2B[0x7];                                     // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0320(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEventTriggerAttached_IsAttached;        // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D2C[0x7];                                     // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUpliftingGauge_ReturnValue;            // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D2D[0x4];                                     // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_OPTION_COMMON_SELECT_TYPE                   CallFunc_GetMoveDisplayOther_ReturnValue;          // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D2E[0x7];                                     // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsActor_2;                 // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_2;                // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D2F[0x6];                                     // 0x038A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_5;              // 0x03A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D30[0x7];                                     // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_1;             // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_6;              // 0x03C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D31[0x7];                                     // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMagatsuhiGaugeCtrl_outActor_1;     // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MagatsuhiGaugeCtrl_C> K2Node_DynamicCast_AsBPI_Magatsuhi_Gauge_Ctrl_1;   // 0x03F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D32[0x7];                                     // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MagatsuhiGaugeCtrl_C> K2Node_DynamicCast_AsBPI_Magatsuhi_Gauge_Ctrl_2;   // 0x0408(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_OPTION_COMMON_SELECT_TYPE                   CallFunc_GetMoveMagatsuhiGauge_ReturnValue;        // 0x041A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x041B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPL_CheckRemoteDevil_isPlaying;           // 0x041C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D33[0x3];                                     // 0x041D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_2;                       // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPL_CheckRemoteDevil_isPlaying_1;         // 0x042A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x042B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x042C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Immediately;                          // 0x042D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsManualGauge;                        // 0x042E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D34[0x1];                                     // 0x042F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_ManualGauge;                          // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_MinimapMaskId;                        // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D35[0x3];                                     // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMinimapBGTextureEntry*                 CallFunc_LoadMinimapTextureBlocking_BGTexture_2;   // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_MapUI_C*                            CallFunc_Create_ReturnValue;                       // 0x0448(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D36[0x7];                                     // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Text;                                 // 0x0458(0x0018)()
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FAreaNameData                          CallFunc_FindAreaName_TopPrio_AreaNameData;        // 0x0478(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D37[0xC];                                     // 0x0484(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0490(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D38[0x4];                                     // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D39[0x3];                                     // 0x04D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAreaNameData                          CallFunc_FindAreaName_TopPrio_AreaNameData_1;      // 0x04E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAreaNameData                          K2Node_Event_AreaNameData_1;                       // 0x04F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAreaNameData                          K2Node_Event_AreaNameData;                         // 0x0500(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x050C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D3A[0x3];                                     // 0x050D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0514(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0515(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D3B[0x2];                                     // 0x0516(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate;              // 0x0518(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0530(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_LOCATION_WINDOW_TYPE                        K2Node_Event_LocationType;                         // 0x0541(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_IsTokyoLargeMap_IsTokyoLargeMap;      // 0x0542(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_LOCATION_WINDOW_TYPE                        K2Node_Select_Default_1;                           // 0x0543(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D3C[0x3];                                     // 0x0549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x054C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7D3D[0x4];                                     // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable_2;                             // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_18;                   // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D3E[0x7];                                     // 0x0569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_3;                        // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_7;              // 0x0578(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D3F[0x3];                                     // 0x0589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x058C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7D40[0x4];                                     // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_1;                    // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_1;             // 0x05A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_CheckMapPause_IsPause;                // 0x05B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_19;                   // 0x05BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D41[0x5];                                     // 0x05BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_2;                    // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMinimapFocusAction_FocusAction;         // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D42[0x7];                                     // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_2;             // 0x05D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_IsTokyoLargeMap_IsTokyoLargeMap_1;    // 0x05E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_20;                   // 0x05E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x05E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x05E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl) == 0x000010, "Wrong alignment on BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl");
static_assert(sizeof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl) == 0x0005F0, "Wrong size on BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, EntryPoint) == 0x000000, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, K2Node_CustomEvent_Loaded_1) == 0x000008, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_GetAreaName_Text) == 0x000010, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_GetAreaName_Text' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_GetAreaName_Text_1) == 0x000028, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_GetAreaName_Text_1' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, Temp_bool_Variable) == 0x000040, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, Temp_byte_Variable) == 0x000041, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, Temp_byte_Variable_1) == 0x000042, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, K2Node_Event_Immediate_2) == 0x000043, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::K2Node_Event_Immediate_2' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, K2Node_Event_AreaID_2) == 0x000048, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::K2Node_Event_AreaID_2' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_IsValid_ReturnValue_1) == 0x00004C, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, K2Node_Event_Immediate_1) == 0x00004D, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::K2Node_Event_Immediate_1' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_IsValid_ReturnValue_2) == 0x00004E, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_IsValid_ReturnValue_3) == 0x00004F, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_IsValid_ReturnValue_4) == 0x000050, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_GetMinimapManager_ReturnValue) == 0x000058, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_GetMinimapManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_GetMinimapManager_ReturnValue_1) == 0x000060, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_GetMinimapManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_IsValid_ReturnValue_5) == 0x000068, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_GetShowingId_OutMapId) == 0x00006C, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_GetShowingId_OutMapId' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_GetShowingId_OutAreaId) == 0x000070, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_GetShowingId_OutAreaId' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_LoadMinimapTextureBlocking_BGTexture) == 0x000078, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_LoadMinimapTextureBlocking_BGTexture' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_GetShowingId_OutMapId_1) == 0x000080, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_GetShowingId_OutMapId_1' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_GetShowingId_OutAreaId_1) == 0x000084, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_GetShowingId_OutAreaId_1' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_GetMinimap_Minimap) == 0x000088, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_GetMinimap_Minimap' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_GetMinimapManager_ReturnValue_2) == 0x0000D8, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_GetMinimapManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_GetFootprintManager_ReturnValue) == 0x0000E0, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_GetFootprintManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_IsValid_ReturnValue_6) == 0x0000E8, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_IsValid_ReturnValue_7) == 0x0000E9, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, K2Node_Event_MapID_1) == 0x0000EC, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::K2Node_Event_MapID_1' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, K2Node_Event_AreaID_1) == 0x0000F0, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::K2Node_Event_AreaID_1' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, K2Node_Event_ChangeType_1) == 0x0000F4, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::K2Node_Event_ChangeType_1' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_GetMinimapManager_ReturnValue_3) == 0x0000F8, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_GetMinimapManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_GetShowingId_OutMapId_2) == 0x000100, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_GetShowingId_OutMapId_2' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_GetShowingId_OutAreaId_2) == 0x000104, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_GetShowingId_OutAreaId_2' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, K2Node_Event_MapID) == 0x000108, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::K2Node_Event_MapID' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, K2Node_Event_AreaID) == 0x00010C, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::K2Node_Event_AreaID' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, K2Node_Event_ChangeType) == 0x000110, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::K2Node_Event_ChangeType' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_LoadMinimapTextureBlocking_BGTexture_1) == 0x000118, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_LoadMinimapTextureBlocking_BGTexture_1' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_GetMinimapManager_ReturnValue_4) == 0x000120, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_GetMinimapManager_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_GetBGTextureManager_ReturnValue) == 0x000128, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_GetBGTextureManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_IsInViewport_ReturnValue) == 0x000130, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_AddToWidgetPrio_ReturnValue) == 0x000131, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_AddToWidgetPrio_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_CheckEventFlag_ReturnValue) == 0x000132, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_GetMinimapManager_ReturnValue_5) == 0x000138, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_GetMinimapManager_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_Not_PreBool_ReturnValue) == 0x000140, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_GetBGTextureManager_ReturnValue_1) == 0x000148, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_GetBGTextureManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_GetMapID_ReturnValue) == 0x000150, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_GetMapID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000154, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_IsValid_ReturnValue_8) == 0x000155, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_IsValid_ReturnValue_9) == 0x000156, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, K2Node_Event_Immediate) == 0x000157, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::K2Node_Event_Immediate' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, K2Node_DynamicCast_AsBPI_Map_Chara_Panel_Ctrl) == 0x000158, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::K2Node_DynamicCast_AsBPI_Map_Chara_Panel_Ctrl' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_MakeTransform_ReturnValue) == 0x000170, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_Get_ReturnValue) == 0x0001A0, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_Get_ReturnValue_1) == 0x0001A8, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, K2Node_DynamicCast_AsBPI_UIManager) == 0x0001B0, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, K2Node_DynamicCast_bSuccess_1) == 0x0001C0, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x0001C8, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, K2Node_DynamicCast_bSuccess_2) == 0x0001D8, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_BPI_GetCommonWindowCtrl_OutActor) == 0x0001E0, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_BPI_GetCommonWindowCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_BPI_GetCommonWindowCtrl_Success) == 0x0001F0, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_BPI_GetCommonWindowCtrl_Success' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_BPI_GetCommonWindowCtrl_OutActor_1) == 0x0001F8, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_BPI_GetCommonWindowCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_BPI_GetCommonWindowCtrl_Success_1) == 0x000208, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_BPI_GetCommonWindowCtrl_Success_1' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_IActionWindowIsActive_OutActive) == 0x000209, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_IActionWindowIsActive_OutActive' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_IActionWindowIsActive_OutActive_1) == 0x00020A, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_IActionWindowIsActive_OutActive_1' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_IsValid_ReturnValue_10) == 0x00020B, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_Get_ReturnValue_2) == 0x000210, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_Not_PreBool_ReturnValue_1) == 0x000218, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, K2Node_DynamicCast_AsBPI_UIManager_2) == 0x000220, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::K2Node_DynamicCast_AsBPI_UIManager_2' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, K2Node_DynamicCast_bSuccess_3) == 0x000230, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_IsValid_ReturnValue_11) == 0x000231, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_IsValid_ReturnValue_12) == 0x000232, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_GetMapID_ReturnValue_1) == 0x000234, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_GetMapID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl, CallFunc_GetAreaID_ReturnValue) == 0x000238, "Member 'BP_MapUICtrl_C_ExecuteUbergraph_BP_MapUICtrl::CallFunc_GetAreaID_ReturnValue' has a wrong offset!");
