#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapDebug_Garden_ToggleTalkFlags

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BP_MapDebug_Garden_ToggleTalkFlags.BP_MapDebug_Garden_ToggleTalkFlags_C.ExecFunc
// 0x0340 (0x0340 - 0x0000)
struct BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc final
{
public:
	class FName                                   ItemPathName;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          NewToggleState;                                    // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F97[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TalkFlagPath;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 OriginalPath;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         NkmIndex;                                          // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F98[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x0038(0x00D0)()
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F99[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Split_LeftS;                              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9A[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Split_LeftS_1;                            // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS_1;                           // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue_1;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9B[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Split_LeftS_2;                            // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS_2;                           // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue_2;                      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9C[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNkmDevilId_M_ID;                       // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x01BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9D[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue_1; // 0x01D8(0x00D0)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS_3;                            // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS_3;                           // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue_3;                      // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9E[0x7];                                     // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0300(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNkmIndexByDevilID_ReturnValue;         // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9F[0x7];                                     // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGardenTalkPointManager*                CallFunc_GetGardenTalkPointManager_ReturnValue;    // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Debug_ToggleQuestTalkFlag_ByNkmIndex_ReturnValue; // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Debug_ToggleItemTalkFlag_ByNkmIndex_ReturnValue; // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Debug_TogglePowerUpTalkFlag_ByNkmIndex_ReturnValue; // 0x033A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Debug_ToggleTrustTalkFlag_ByNkmIndex_ReturnValue; // 0x033B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc) == 0x000008, "Wrong alignment on BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc");
static_assert(sizeof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc) == 0x000340, "Wrong size on BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, ItemPathName) == 0x000000, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::ItemPathName' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, ReturnValue) == 0x000008, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, NewToggleState) == 0x000009, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::NewToggleState' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, TalkFlagPath) == 0x000010, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::TalkFlagPath' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, OriginalPath) == 0x000020, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::OriginalPath' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, NkmIndex) == 0x000030, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::NkmIndex' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue) == 0x000038, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Conv_NameToString_ReturnValue) == 0x000108, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Greater_IntInt_ReturnValue) == 0x000118, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000119, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x00011A, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x00011B, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_EqualEqual_StrStr_ReturnValue_3) == 0x00011C, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_EqualEqual_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Split_LeftS) == 0x000120, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Split_RightS) == 0x000130, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Split_ReturnValue) == 0x000140, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Split_LeftS_1) == 0x000148, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Split_LeftS_1' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Split_RightS_1) == 0x000158, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Split_RightS_1' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Split_ReturnValue_1) == 0x000168, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Split_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Split_LeftS_2) == 0x000170, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Split_LeftS_2' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Split_RightS_2) == 0x000180, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Split_RightS_2' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Split_ReturnValue_2) == 0x000190, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Split_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Concat_StrStr_ReturnValue) == 0x000198, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0001A8, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_GetNkmDevilId_M_ID) == 0x0001B8, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_GetNkmDevilId_M_ID' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Conv_StringToName_ReturnValue) == 0x0001BC, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Conv_IntToString_ReturnValue) == 0x0001C8, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue_1) == 0x0001D8, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Conv_IntToString_ReturnValue_1) == 0x0002A8, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0002B8, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0002C8, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Split_LeftS_3) == 0x0002D8, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Split_LeftS_3' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Split_RightS_3) == 0x0002E8, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Split_RightS_3' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Split_ReturnValue_3) == 0x0002F8, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Split_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000300, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000310, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Conv_StringToInt_ReturnValue) == 0x000320, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_GetNkmIndexByDevilID_ReturnValue) == 0x000324, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_GetNkmIndexByDevilID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000328, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_GetGardenTalkPointManager_ReturnValue) == 0x000330, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_GetGardenTalkPointManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Debug_ToggleQuestTalkFlag_ByNkmIndex_ReturnValue) == 0x000338, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Debug_ToggleQuestTalkFlag_ByNkmIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Debug_ToggleItemTalkFlag_ByNkmIndex_ReturnValue) == 0x000339, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Debug_ToggleItemTalkFlag_ByNkmIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Debug_TogglePowerUpTalkFlag_ByNkmIndex_ReturnValue) == 0x00033A, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Debug_TogglePowerUpTalkFlag_ByNkmIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_Debug_ToggleTrustTalkFlag_ByNkmIndex_ReturnValue) == 0x00033B, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_Debug_ToggleTrustTalkFlag_ByNkmIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc, CallFunc_IsValid_ReturnValue) == 0x00033C, "Member 'BP_MapDebug_Garden_ToggleTalkFlags_C_ExecFunc::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

