#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapTaoHeal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MapTaoHeal.BP_MapTaoHeal_C
// 0x0038 (0x0258 - 0x0220)
class ABP_MapTaoHeal_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckSE;                                           // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 NkmIndexList;                                      // 0x0238(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 HealHPList;                                        // 0x0248(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_MapTaoHeal(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ProcHeal();
	void GetPlayerHPMax(int32* HpMax);
	void GetNkmHPMax(int32 NkmIndex, int32* HpMax);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MapTaoHeal_C">();
	}
	static class ABP_MapTaoHeal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MapTaoHeal_C>();
	}
};
static_assert(alignof(ABP_MapTaoHeal_C) == 0x000008, "Wrong alignment on ABP_MapTaoHeal_C");
static_assert(sizeof(ABP_MapTaoHeal_C) == 0x000258, "Wrong size on ABP_MapTaoHeal_C");
static_assert(offsetof(ABP_MapTaoHeal_C, UberGraphFrame) == 0x000220, "Member 'ABP_MapTaoHeal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MapTaoHeal_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_MapTaoHeal_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MapTaoHeal_C, CheckSE) == 0x000230, "Member 'ABP_MapTaoHeal_C::CheckSE' has a wrong offset!");
static_assert(offsetof(ABP_MapTaoHeal_C, NkmIndexList) == 0x000238, "Member 'ABP_MapTaoHeal_C::NkmIndexList' has a wrong offset!");
static_assert(offsetof(ABP_MapTaoHeal_C, HealHPList) == 0x000248, "Member 'ABP_MapTaoHeal_C::HealHPList' has a wrong offset!");

}

