#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MoonAgeCtrl

#include "Basic.hpp"

#include "E_MoonAgeAnimationState_structs.hpp"
#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BP_MoonAgeCtrl.BP_MoonAgeCtrl_C.ExecuteUbergraph_BP_MoonAgeCtrl
// 0x0188 (0x0188 - 0x0000)
struct BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_inAnimation_1;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_inAnimation;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E86[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MOON_AGE                                    K2Node_Event_inMoonType;                           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue;              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TimeAttackMissionUpdateMoonAge_ReturnValue; // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E87[0x1];                                     // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x0010(0x00D0)()
	bool                                          CallFunc_IS_SHIPPING_BUILD_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E88[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E89[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_MoonAge_C*                          CallFunc_Create_ReturnValue;                       // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E8A[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameMode_C>       K2Node_DynamicCast_AsBPI_Game_Mode;                // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ApplyMissionMapBGM_dummy;                 // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_MOON_AGE                                    CallFunc_GetMoonAge_ReturnValue;                   // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MOON_AGE                                    CallFunc_GetMoonAge_ReturnValue_1;                 // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E8B[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_EventScriptArea_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0120(0x0010)(ReferenceParm)
	class ABP_EventScriptArea_C*                  CallFunc_Array_Get_Item;                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E8C[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EventScript_C>    K2Node_DynamicCast_AsBPI_Event_Script;             // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_MOON_AGE                                    CallFunc_GetMoonAge_ReturnValue_2;                 // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SpawnReflesh_NoUse;                       // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_1;             // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0156(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E8D[0x1];                                     // 0x0157(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_inDeltaSeconds_1;                     // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_inDeltaSeconds;                       // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InSecond;                             // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E8E[0x3];                                     // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(E_MoonAgeAnimationState NewParam)> K2Node_CreateDelegate_OutputDelegate;              // 0x0174(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl) == 0x000008, "Wrong alignment on BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl");
static_assert(sizeof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl) == 0x000188, "Wrong size on BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, EntryPoint) == 0x000000, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, K2Node_Event_inAnimation_1) == 0x000004, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::K2Node_Event_inAnimation_1' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, K2Node_Event_inAnimation) == 0x000005, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::K2Node_Event_inAnimation' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, K2Node_Event_inMoonType) == 0x00000C, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::K2Node_Event_inMoonType' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_AddToWidgetPrio_ReturnValue) == 0x00000D, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_AddToWidgetPrio_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_TimeAttackMissionUpdateMoonAge_ReturnValue) == 0x00000E, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_TimeAttackMissionUpdateMoonAge_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue) == 0x000010, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_IS_SHIPPING_BUILD_ReturnValue) == 0x0000E0, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_IS_SHIPPING_BUILD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000E4, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000E8, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_Create_ReturnValue) == 0x0000F0, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_GetGameMode_ReturnValue) == 0x0000F8, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_IsInViewport_ReturnValue) == 0x000100, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, K2Node_DynamicCast_AsBPI_Game_Mode) == 0x000108, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::K2Node_DynamicCast_AsBPI_Game_Mode' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_ApplyMissionMapBGM_dummy) == 0x000119, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_ApplyMissionMapBGM_dummy' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_GetMoonAge_ReturnValue) == 0x00011A, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_GetMoonAge_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_GetMoonAge_ReturnValue_1) == 0x00011B, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_GetMoonAge_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_GetAllActorsOfClass_OutActors) == 0x000120, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_Array_Get_Item) == 0x000130, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_Array_Length_ReturnValue) == 0x000138, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, K2Node_DynamicCast_AsBPI_Event_Script) == 0x000140, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::K2Node_DynamicCast_AsBPI_Event_Script' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, K2Node_DynamicCast_bSuccess_1) == 0x000150, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_GetMoonAge_ReturnValue_2) == 0x000151, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_GetMoonAge_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_SpawnReflesh_NoUse) == 0x000152, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_SpawnReflesh_NoUse' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_CheckEventFlag_ReturnValue) == 0x000153, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_CheckEventFlag_ReturnValue_1) == 0x000154, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_CheckEventFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_Not_PreBool_ReturnValue) == 0x000155, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_Not_PreBool_ReturnValue_1) == 0x000156, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, K2Node_Event_inDeltaSeconds_1) == 0x000158, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::K2Node_Event_inDeltaSeconds_1' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, K2Node_Event_inDeltaSeconds) == 0x00015C, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::K2Node_Event_inDeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, Temp_int_Loop_Counter_Variable) == 0x000160, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, K2Node_Event_InSecond) == 0x000164, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::K2Node_Event_InSecond' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_FClamp_ReturnValue) == 0x000168, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_Less_IntInt_ReturnValue) == 0x00016C, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, CallFunc_Add_IntInt_ReturnValue) == 0x000170, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl, K2Node_CreateDelegate_OutputDelegate) == 0x000174, "Member 'BP_MoonAgeCtrl_C_ExecuteUbergraph_BP_MoonAgeCtrl::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_MoonAgeCtrl.BP_MoonAgeCtrl_C.BPI_SetMoonAgeCntUpdateTime
// 0x0004 (0x0004 - 0x0000)
struct BP_MoonAgeCtrl_C_BPI_SetMoonAgeCntUpdateTime final
{
public:
	float                                         InSecond;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MoonAgeCtrl_C_BPI_SetMoonAgeCntUpdateTime) == 0x000004, "Wrong alignment on BP_MoonAgeCtrl_C_BPI_SetMoonAgeCntUpdateTime");
static_assert(sizeof(BP_MoonAgeCtrl_C_BPI_SetMoonAgeCntUpdateTime) == 0x000004, "Wrong size on BP_MoonAgeCtrl_C_BPI_SetMoonAgeCntUpdateTime");
static_assert(offsetof(BP_MoonAgeCtrl_C_BPI_SetMoonAgeCntUpdateTime, InSecond) == 0x000000, "Member 'BP_MoonAgeCtrl_C_BPI_SetMoonAgeCntUpdateTime::InSecond' has a wrong offset!");

// Function BP_MoonAgeCtrl.BP_MoonAgeCtrl_C.BPI_AddPlayerMoveCount_TokyoLargeMap
// 0x0004 (0x0004 - 0x0000)
struct BP_MoonAgeCtrl_C_BPI_AddPlayerMoveCount_TokyoLargeMap final
{
public:
	float                                         InDeltaSeconds;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MoonAgeCtrl_C_BPI_AddPlayerMoveCount_TokyoLargeMap) == 0x000004, "Wrong alignment on BP_MoonAgeCtrl_C_BPI_AddPlayerMoveCount_TokyoLargeMap");
static_assert(sizeof(BP_MoonAgeCtrl_C_BPI_AddPlayerMoveCount_TokyoLargeMap) == 0x000004, "Wrong size on BP_MoonAgeCtrl_C_BPI_AddPlayerMoveCount_TokyoLargeMap");
static_assert(offsetof(BP_MoonAgeCtrl_C_BPI_AddPlayerMoveCount_TokyoLargeMap, InDeltaSeconds) == 0x000000, "Member 'BP_MoonAgeCtrl_C_BPI_AddPlayerMoveCount_TokyoLargeMap::InDeltaSeconds' has a wrong offset!");

// Function BP_MoonAgeCtrl.BP_MoonAgeCtrl_C.BPI_AddPlayerMoveCount_Normal
// 0x0004 (0x0004 - 0x0000)
struct BP_MoonAgeCtrl_C_BPI_AddPlayerMoveCount_Normal final
{
public:
	float                                         InDeltaSeconds;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MoonAgeCtrl_C_BPI_AddPlayerMoveCount_Normal) == 0x000004, "Wrong alignment on BP_MoonAgeCtrl_C_BPI_AddPlayerMoveCount_Normal");
static_assert(sizeof(BP_MoonAgeCtrl_C_BPI_AddPlayerMoveCount_Normal) == 0x000004, "Wrong size on BP_MoonAgeCtrl_C_BPI_AddPlayerMoveCount_Normal");
static_assert(offsetof(BP_MoonAgeCtrl_C_BPI_AddPlayerMoveCount_Normal, InDeltaSeconds) == 0x000000, "Member 'BP_MoonAgeCtrl_C_BPI_AddPlayerMoveCount_Normal::InDeltaSeconds' has a wrong offset!");

// Function BP_MoonAgeCtrl.BP_MoonAgeCtrl_C.BPI_SetMoonAge
// 0x0001 (0x0001 - 0x0000)
struct BP_MoonAgeCtrl_C_BPI_SetMoonAge final
{
public:
	E_MOON_AGE                                    InMoonType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MoonAgeCtrl_C_BPI_SetMoonAge) == 0x000001, "Wrong alignment on BP_MoonAgeCtrl_C_BPI_SetMoonAge");
static_assert(sizeof(BP_MoonAgeCtrl_C_BPI_SetMoonAge) == 0x000001, "Wrong size on BP_MoonAgeCtrl_C_BPI_SetMoonAge");
static_assert(offsetof(BP_MoonAgeCtrl_C_BPI_SetMoonAge, InMoonType) == 0x000000, "Member 'BP_MoonAgeCtrl_C_BPI_SetMoonAge::InMoonType' has a wrong offset!");

// Function BP_MoonAgeCtrl.BP_MoonAgeCtrl_C.BPI_CloseMoonAge
// 0x0001 (0x0001 - 0x0000)
struct BP_MoonAgeCtrl_C_BPI_CloseMoonAge final
{
public:
	bool                                          InAnimation;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MoonAgeCtrl_C_BPI_CloseMoonAge) == 0x000001, "Wrong alignment on BP_MoonAgeCtrl_C_BPI_CloseMoonAge");
static_assert(sizeof(BP_MoonAgeCtrl_C_BPI_CloseMoonAge) == 0x000001, "Wrong size on BP_MoonAgeCtrl_C_BPI_CloseMoonAge");
static_assert(offsetof(BP_MoonAgeCtrl_C_BPI_CloseMoonAge, InAnimation) == 0x000000, "Member 'BP_MoonAgeCtrl_C_BPI_CloseMoonAge::InAnimation' has a wrong offset!");

// Function BP_MoonAgeCtrl.BP_MoonAgeCtrl_C.BPI_OpenMoonAge
// 0x0001 (0x0001 - 0x0000)
struct BP_MoonAgeCtrl_C_BPI_OpenMoonAge final
{
public:
	bool                                          InAnimation;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MoonAgeCtrl_C_BPI_OpenMoonAge) == 0x000001, "Wrong alignment on BP_MoonAgeCtrl_C_BPI_OpenMoonAge");
static_assert(sizeof(BP_MoonAgeCtrl_C_BPI_OpenMoonAge) == 0x000001, "Wrong size on BP_MoonAgeCtrl_C_BPI_OpenMoonAge");
static_assert(offsetof(BP_MoonAgeCtrl_C_BPI_OpenMoonAge, InAnimation) == 0x000000, "Member 'BP_MoonAgeCtrl_C_BPI_OpenMoonAge::InAnimation' has a wrong offset!");

// Function BP_MoonAgeCtrl.BP_MoonAgeCtrl_C.PlayMoonChangeSE
// 0x0030 (0x0030 - 0x0000)
struct BP_MoonAgeCtrl_C_PlayMoonChangeSE final
{
public:
	bool                                          CallFunc_CurrentMapShouldPlayMoonAgeSE_ReturnValue; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E8F[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue_1;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MOON_AGE                                    CallFunc_GetMoonAge_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E90[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue_2;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MoonAgeCtrl_C_PlayMoonChangeSE) == 0x000008, "Wrong alignment on BP_MoonAgeCtrl_C_PlayMoonChangeSE");
static_assert(sizeof(BP_MoonAgeCtrl_C_PlayMoonChangeSE) == 0x000030, "Wrong size on BP_MoonAgeCtrl_C_PlayMoonChangeSE");
static_assert(offsetof(BP_MoonAgeCtrl_C_PlayMoonChangeSE, CallFunc_CurrentMapShouldPlayMoonAgeSE_ReturnValue) == 0x000000, "Member 'BP_MoonAgeCtrl_C_PlayMoonChangeSE::CallFunc_CurrentMapShouldPlayMoonAgeSE_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_PlayMoonChangeSE, CallFunc_CheckEventFlag_ReturnValue) == 0x000001, "Member 'BP_MoonAgeCtrl_C_PlayMoonChangeSE::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_PlayMoonChangeSE, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'BP_MoonAgeCtrl_C_PlayMoonChangeSE::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_PlayMoonChangeSE, CallFunc_SpawnSound2D_ReturnValue) == 0x000008, "Member 'BP_MoonAgeCtrl_C_PlayMoonChangeSE::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_PlayMoonChangeSE, CallFunc_SpawnSound2D_ReturnValue_1) == 0x000010, "Member 'BP_MoonAgeCtrl_C_PlayMoonChangeSE::CallFunc_SpawnSound2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_PlayMoonChangeSE, CallFunc_GetMoonAge_ReturnValue) == 0x000018, "Member 'BP_MoonAgeCtrl_C_PlayMoonChangeSE::CallFunc_GetMoonAge_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_PlayMoonChangeSE, CallFunc_SpawnSound2D_ReturnValue_2) == 0x000020, "Member 'BP_MoonAgeCtrl_C_PlayMoonChangeSE::CallFunc_SpawnSound2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_PlayMoonChangeSE, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'BP_MoonAgeCtrl_C_PlayMoonChangeSE::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_MoonAgeCtrl.BP_MoonAgeCtrl_C.SetWidgetAnimState
// 0x0001 (0x0001 - 0x0000)
struct BP_MoonAgeCtrl_C_SetWidgetAnimState final
{
public:
	E_MoonAgeAnimationState                       InAnimState;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MoonAgeCtrl_C_SetWidgetAnimState) == 0x000001, "Wrong alignment on BP_MoonAgeCtrl_C_SetWidgetAnimState");
static_assert(sizeof(BP_MoonAgeCtrl_C_SetWidgetAnimState) == 0x000001, "Wrong size on BP_MoonAgeCtrl_C_SetWidgetAnimState");
static_assert(offsetof(BP_MoonAgeCtrl_C_SetWidgetAnimState, InAnimState) == 0x000000, "Member 'BP_MoonAgeCtrl_C_SetWidgetAnimState::InAnimState' has a wrong offset!");

// Function BP_MoonAgeCtrl.BP_MoonAgeCtrl_C.AddPlayerMoveCnt
// 0x001C (0x001C - 0x0000)
struct BP_MoonAgeCtrl_C_AddPlayerMoveCnt final
{
public:
	bool                                          IsLargeMap;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E91[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InDeltaSeconds;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMoonAgeUpdateCount_ReturnValue;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_checkUpdateMoonAge_ReturnValue;           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E92[0x1];                                     // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMapID_ReturnValue;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E93[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MoonAgeCtrl_C_AddPlayerMoveCnt) == 0x000004, "Wrong alignment on BP_MoonAgeCtrl_C_AddPlayerMoveCnt");
static_assert(sizeof(BP_MoonAgeCtrl_C_AddPlayerMoveCnt) == 0x00001C, "Wrong size on BP_MoonAgeCtrl_C_AddPlayerMoveCnt");
static_assert(offsetof(BP_MoonAgeCtrl_C_AddPlayerMoveCnt, IsLargeMap) == 0x000000, "Member 'BP_MoonAgeCtrl_C_AddPlayerMoveCnt::IsLargeMap' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_AddPlayerMoveCnt, InDeltaSeconds) == 0x000004, "Member 'BP_MoonAgeCtrl_C_AddPlayerMoveCnt::InDeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_AddPlayerMoveCnt, CallFunc_GetMoonAgeUpdateCount_ReturnValue) == 0x000008, "Member 'BP_MoonAgeCtrl_C_AddPlayerMoveCnt::CallFunc_GetMoonAgeUpdateCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_AddPlayerMoveCnt, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_MoonAgeCtrl_C_AddPlayerMoveCnt::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_AddPlayerMoveCnt, CallFunc_checkUpdateMoonAge_ReturnValue) == 0x00000D, "Member 'BP_MoonAgeCtrl_C_AddPlayerMoveCnt::CallFunc_checkUpdateMoonAge_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_AddPlayerMoveCnt, CallFunc_CheckEventFlag_ReturnValue) == 0x00000E, "Member 'BP_MoonAgeCtrl_C_AddPlayerMoveCnt::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_AddPlayerMoveCnt, CallFunc_GetMapID_ReturnValue) == 0x000010, "Member 'BP_MoonAgeCtrl_C_AddPlayerMoveCnt::CallFunc_GetMapID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_AddPlayerMoveCnt, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000014, "Member 'BP_MoonAgeCtrl_C_AddPlayerMoveCnt::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_AddPlayerMoveCnt, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000015, "Member 'BP_MoonAgeCtrl_C_AddPlayerMoveCnt::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoonAgeCtrl_C_AddPlayerMoveCnt, CallFunc_Add_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_MoonAgeCtrl_C_AddPlayerMoveCnt::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_MoonAgeCtrl.BP_MoonAgeCtrl_C.BPI_GetMoonAgeAnimState
// 0x0001 (0x0001 - 0x0000)
struct BP_MoonAgeCtrl_C_BPI_GetMoonAgeAnimState final
{
public:
	E_MoonAgeAnimationState                       OutState;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MoonAgeCtrl_C_BPI_GetMoonAgeAnimState) == 0x000001, "Wrong alignment on BP_MoonAgeCtrl_C_BPI_GetMoonAgeAnimState");
static_assert(sizeof(BP_MoonAgeCtrl_C_BPI_GetMoonAgeAnimState) == 0x000001, "Wrong size on BP_MoonAgeCtrl_C_BPI_GetMoonAgeAnimState");
static_assert(offsetof(BP_MoonAgeCtrl_C_BPI_GetMoonAgeAnimState, OutState) == 0x000000, "Member 'BP_MoonAgeCtrl_C_BPI_GetMoonAgeAnimState::OutState' has a wrong offset!");

// Function BP_MoonAgeCtrl.BP_MoonAgeCtrl_C.BPI_GetMoonAgeCntUpdateTime
// 0x0004 (0x0004 - 0x0000)
struct BP_MoonAgeCtrl_C_BPI_GetMoonAgeCntUpdateTime final
{
public:
	float                                         CounterUpdateTime;                                 // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MoonAgeCtrl_C_BPI_GetMoonAgeCntUpdateTime) == 0x000004, "Wrong alignment on BP_MoonAgeCtrl_C_BPI_GetMoonAgeCntUpdateTime");
static_assert(sizeof(BP_MoonAgeCtrl_C_BPI_GetMoonAgeCntUpdateTime) == 0x000004, "Wrong size on BP_MoonAgeCtrl_C_BPI_GetMoonAgeCntUpdateTime");
static_assert(offsetof(BP_MoonAgeCtrl_C_BPI_GetMoonAgeCntUpdateTime, CounterUpdateTime) == 0x000000, "Member 'BP_MoonAgeCtrl_C_BPI_GetMoonAgeCntUpdateTime::CounterUpdateTime' has a wrong offset!");

}

