#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapTaoHeal

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BP_MapTaoHeal.BP_MapTaoHeal_C.GetNkmHPMax
// 0x0128 (0x0128 - 0x0000)
struct BP_MapTaoHeal_C_GetNkmHPMax final
{
public:
	int32                                         NkmIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HpMax;                                             // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNkmData                               CallFunc_GetNkmData_ReturnValue;                   // 0x0008(0x0120)(ConstParm)
};
static_assert(alignof(BP_MapTaoHeal_C_GetNkmHPMax) == 0x000008, "Wrong alignment on BP_MapTaoHeal_C_GetNkmHPMax");
static_assert(sizeof(BP_MapTaoHeal_C_GetNkmHPMax) == 0x000128, "Wrong size on BP_MapTaoHeal_C_GetNkmHPMax");
static_assert(offsetof(BP_MapTaoHeal_C_GetNkmHPMax, NkmIndex) == 0x000000, "Member 'BP_MapTaoHeal_C_GetNkmHPMax::NkmIndex' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_GetNkmHPMax, HpMax) == 0x000004, "Member 'BP_MapTaoHeal_C_GetNkmHPMax::HpMax' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_GetNkmHPMax, CallFunc_GetNkmData_ReturnValue) == 0x000008, "Member 'BP_MapTaoHeal_C_GetNkmHPMax::CallFunc_GetNkmData_ReturnValue' has a wrong offset!");

// Function BP_MapTaoHeal.BP_MapTaoHeal_C.GetPlayerHPMax
// 0x0138 (0x0138 - 0x0000)
struct BP_MapTaoHeal_C_GetPlayerHPMax final
{
public:
	int32                                         HpMax;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_538E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharData                              CallFunc_GetPlayerData_ReturnValue;                // 0x0008(0x0130)(ConstParm)
};
static_assert(alignof(BP_MapTaoHeal_C_GetPlayerHPMax) == 0x000008, "Wrong alignment on BP_MapTaoHeal_C_GetPlayerHPMax");
static_assert(sizeof(BP_MapTaoHeal_C_GetPlayerHPMax) == 0x000138, "Wrong size on BP_MapTaoHeal_C_GetPlayerHPMax");
static_assert(offsetof(BP_MapTaoHeal_C_GetPlayerHPMax, HpMax) == 0x000000, "Member 'BP_MapTaoHeal_C_GetPlayerHPMax::HpMax' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_GetPlayerHPMax, CallFunc_GetPlayerData_ReturnValue) == 0x000008, "Member 'BP_MapTaoHeal_C_GetPlayerHPMax::CallFunc_GetPlayerData_ReturnValue' has a wrong offset!");

// Function BP_MapTaoHeal.BP_MapTaoHeal_C.ProcHeal
// 0x00B8 (0x00B8 - 0x0000)
struct BP_MapTaoHeal_C_ProcHeal final
{
public:
	int32                                         L_PrevHP;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_Heal;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_HealRate;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_NkmIndex;                                        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<uint8>                                 L_EntryList;                                       // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckNkmBstOne_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_538F[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNkmHPMax_HPMax;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNkmHP_ReturnValue;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNkmHPMax_HPMax_1;                      // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NkmIndexIsValid_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5390[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x003C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNkmHP_ReturnValue_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerHP_ReturnValue;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Array_Get_Item;                           // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5391[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerHP_ReturnValue_1;                // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerHPMax_HPMax;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5392[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerHPMax_HPMax_1;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5393[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5394[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 CallFunc_GetNkmEntryListArray_ReturnValue;         // 0x00A0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MapTaoHeal_C_ProcHeal) == 0x000008, "Wrong alignment on BP_MapTaoHeal_C_ProcHeal");
static_assert(sizeof(BP_MapTaoHeal_C_ProcHeal) == 0x0000B8, "Wrong size on BP_MapTaoHeal_C_ProcHeal");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, L_PrevHP) == 0x000000, "Member 'BP_MapTaoHeal_C_ProcHeal::L_PrevHP' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, L_Heal) == 0x000004, "Member 'BP_MapTaoHeal_C_ProcHeal::L_Heal' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, L_HealRate) == 0x000008, "Member 'BP_MapTaoHeal_C_ProcHeal::L_HealRate' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, L_NkmIndex) == 0x00000C, "Member 'BP_MapTaoHeal_C_ProcHeal::L_NkmIndex' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, L_EntryList) == 0x000010, "Member 'BP_MapTaoHeal_C_ProcHeal::L_EntryList' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_CheckNkmBstOne_ReturnValue) == 0x000024, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_CheckNkmBstOne_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_GetNkmHPMax_HPMax) == 0x000028, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_GetNkmHPMax_HPMax' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_GetNkmHP_ReturnValue) == 0x00002C, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_GetNkmHP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_GetNkmHPMax_HPMax_1) == 0x000030, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_GetNkmHPMax_HPMax_1' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_Array_Add_ReturnValue) == 0x000034, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_NkmIndexIsValid_ReturnValue) == 0x000038, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_NkmIndexIsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, Temp_int_Variable) == 0x00003C, "Member 'BP_MapTaoHeal_C_ProcHeal::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_GetNkmHP_ReturnValue_1) == 0x000040, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_GetNkmHP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_Multiply_IntInt_ReturnValue) == 0x000044, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_Subtract_IntInt_ReturnValue) == 0x000048, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_Divide_IntInt_ReturnValue) == 0x00004C, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_Array_Add_ReturnValue_1) == 0x000050, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_Max_ReturnValue) == 0x000054, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_GetPlayerHP_ReturnValue) == 0x000058, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_GetPlayerHP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00005C, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_Array_Add_ReturnValue_2) == 0x000060, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_Array_Add_ReturnValue_3) == 0x000064, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, Temp_int_Array_Index_Variable) == 0x000068, "Member 'BP_MapTaoHeal_C_ProcHeal::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_Array_Get_Item) == 0x00006C, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000070, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_GetPlayerHP_ReturnValue_1) == 0x000074, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_GetPlayerHP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_GetPlayerHPMax_HPMax) == 0x000078, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_GetPlayerHPMax_HPMax' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_GetPlayerHPMax_HPMax_1) == 0x000080, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_GetPlayerHPMax_HPMax_1' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, Temp_int_Loop_Counter_Variable) == 0x000084, "Member 'BP_MapTaoHeal_C_ProcHeal::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x000088, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_Divide_IntInt_ReturnValue_1) == 0x00008C, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_Less_IntInt_ReturnValue_1) == 0x000090, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_Max_ReturnValue_1) == 0x000094, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_Max_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_Add_IntInt_ReturnValue) == 0x000098, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_GetNkmEntryListArray_ReturnValue) == 0x0000A0, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_GetNkmEntryListArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ProcHeal, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000B0, "Member 'BP_MapTaoHeal_C_ProcHeal::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function BP_MapTaoHeal.BP_MapTaoHeal_C.ExecuteUbergraph_BP_MapTaoHeal
// 0x0108 (0x0108 - 0x0000)
struct BP_MapTaoHeal_C_ExecuteUbergraph_BP_MapTaoHeal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5395[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5396[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCharaPanelCtrl_C> CallFunc_BPI_GetMapCharaPanelCtrlUI_OutActor;      // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_GetMapCharaPanelCtrlUI_IsValid;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5397[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_CheckMapPause_IsPause;                // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_UI_FADE_STATE                               CallFunc_GetFadeState_ReturnValue;                 // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_FADE_STATE                               CallFunc_ScreenTransition_getFadeState_outType;    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanTaoHeal_Can;                           // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5398[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	E_OPTION_COMMON_SELECT_TYPE                   CallFunc_GetMoveDisplayPanel_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5399[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACustomPawn*                            K2Node_DynamicCast_AsCustom_Pawn;                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539A[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_1;       // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NkmIsBattleUnit_ReturnValue;              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539B[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_1;                        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539C[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539D[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapCharaPanelCtrl_C> CallFunc_BPI_GetMapCharaPanelCtrlUI_OutActor_1;    // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_GetMapCharaPanelCtrlUI_IsValid_1;     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539E[0x2];                                     // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapTaoHeal_C_ExecuteUbergraph_BP_MapTaoHeal) == 0x000008, "Wrong alignment on BP_MapTaoHeal_C_ExecuteUbergraph_BP_MapTaoHeal");
static_assert(sizeof(BP_MapTaoHeal_C_ExecuteUbergraph_BP_MapTaoHeal) == 0x000108, "Wrong size on BP_MapTaoHeal_C_ExecuteUbergraph_BP_MapTaoHeal");
static_assert(offsetof(BP_MapTaoHeal_C_ExecuteUbergraph_BP_MapTaoHeal, EntryPoint) == 0x000000, "Member 'BP_MapTaoHeal_C_ExecuteUbergraph_BP_MapTaoHeal::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MapTaoHeal_C_ExecuteUbergraph_BP_MapTaoHeal, CallFunc_Get_ReturnValue) == 0x000008, "Member 'BP_MapTaoHeal_C_ExecuteUbergraph_BP_MapTaoHeal::CallFunc_Get_ReturnValue' has a wrong offset!");
