#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MagatsukaFoundEffect

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_MagatsukaFoundEffect.BP_MagatsukaFoundEffect_C.ExecuteUbergraph_BP_MagatsukaFoundEffect
// 0x0068 (0x0068 - 0x0000)
struct BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UParticleSystemComponent* PSystem)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue;   // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               K2Node_CustomEvent_PSystem;                        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8FED[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue_1;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect) == 0x000008, "Wrong alignment on BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect");
static_assert(sizeof(BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect) == 0x000068, "Wrong size on BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect");
static_assert(offsetof(BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect, EntryPoint) == 0x000000, "Member 'BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect, CallFunc_K2_GetVectorParameterValue_ReturnValue) == 0x000014, "Member 'BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect::CallFunc_K2_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect, CallFunc_BooleanAND_ReturnValue) == 0x000024, "Member 'BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect, CallFunc_BooleanAND_ReturnValue_1) == 0x000025, "Member 'BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect, CallFunc_BooleanAND_ReturnValue_2) == 0x000026, "Member 'BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect, CallFunc_BooleanAND_ReturnValue_3) == 0x000027, "Member 'BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect, K2Node_CustomEvent_PSystem) == 0x000028, "Member 'BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect::K2Node_CustomEvent_PSystem' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000030, "Member 'BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000038, "Member 'BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect, K2Node_MakeStruct_LinearColor) == 0x00003C, "Member 'BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect, CallFunc_SpawnSound2D_ReturnValue) == 0x000050, "Member 'BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect, CallFunc_SpawnSound2D_ReturnValue_1) == 0x000058, "Member 'BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect::CallFunc_SpawnSound2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect, CallFunc_IsValid_ReturnValue_1) == 0x000061, "Member 'BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect, CallFunc_IsValid_ReturnValue_2) == 0x000062, "Member 'BP_MagatsukaFoundEffect_C_ExecuteUbergraph_BP_MagatsukaFoundEffect::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function BP_MagatsukaFoundEffect.BP_MagatsukaFoundEffect_C.OnSystemFinished_
// 0x0008 (0x0008 - 0x0000)
struct BP_MagatsukaFoundEffect_C_OnSystemFinished_ final
{
public:
	class UParticleSystemComponent*               PSystem;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MagatsukaFoundEffect_C_OnSystemFinished_) == 0x000008, "Wrong alignment on BP_MagatsukaFoundEffect_C_OnSystemFinished_");
static_assert(sizeof(BP_MagatsukaFoundEffect_C_OnSystemFinished_) == 0x000008, "Wrong size on BP_MagatsukaFoundEffect_C_OnSystemFinished_");
static_assert(offsetof(BP_MagatsukaFoundEffect_C_OnSystemFinished_, PSystem) == 0x000000, "Member 'BP_MagatsukaFoundEffect_C_OnSystemFinished_::PSystem' has a wrong offset!");

}

