#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MagatsukaChangeUndiscovery

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MagatsukaChangeUndiscovery.BP_MagatsukaChangeUndiscovery_C
// 0x0048 (0x0268 - 0x0220)
class ABP_MagatsukaChangeUndiscovery_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          OutBox;                                            // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_DebugBox;                                       // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitSize;                                           // 0x0248(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AddOutHit;                                         // 0x0254(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsView;                                            // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          In;                                                // 0x0261(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_MagatsukaChangeUndiscovery(int32 EntryPoint);
	void BndEvt__OutBox_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MagatsukaChangeUndiscovery_C">();
	}
	static class ABP_MagatsukaChangeUndiscovery_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MagatsukaChangeUndiscovery_C>();
	}
};
static_assert(alignof(ABP_MagatsukaChangeUndiscovery_C) == 0x000008, "Wrong alignment on ABP_MagatsukaChangeUndiscovery_C");
static_assert(sizeof(ABP_MagatsukaChangeUndiscovery_C) == 0x000268, "Wrong size on ABP_MagatsukaChangeUndiscovery_C");
static_assert(offsetof(ABP_MagatsukaChangeUndiscovery_C, UberGraphFrame) == 0x000220, "Member 'ABP_MagatsukaChangeUndiscovery_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MagatsukaChangeUndiscovery_C, OutBox) == 0x000228, "Member 'ABP_MagatsukaChangeUndiscovery_C::OutBox' has a wrong offset!");
static_assert(offsetof(ABP_MagatsukaChangeUndiscovery_C, SM_DebugBox) == 0x000230, "Member 'ABP_MagatsukaChangeUndiscovery_C::SM_DebugBox' has a wrong offset!");
static_assert(offsetof(ABP_MagatsukaChangeUndiscovery_C, Box) == 0x000238, "Member 'ABP_MagatsukaChangeUndiscovery_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_MagatsukaChangeUndiscovery_C, DefaultSceneRoot) == 0x000240, "Member 'ABP_MagatsukaChangeUndiscovery_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MagatsukaChangeUndiscovery_C, HitSize) == 0x000248, "Member 'ABP_MagatsukaChangeUndiscovery_C::HitSize' has a wrong offset!");
static_assert(offsetof(ABP_MagatsukaChangeUndiscovery_C, AddOutHit) == 0x000254, "Member 'ABP_MagatsukaChangeUndiscovery_C::AddOutHit' has a wrong offset!");
static_assert(offsetof(ABP_MagatsukaChangeUndiscovery_C, IsView) == 0x000260, "Member 'ABP_MagatsukaChangeUndiscovery_C::IsView' has a wrong offset!");
static_assert(offsetof(ABP_MagatsukaChangeUndiscovery_C, In) == 0x000261, "Member 'ABP_MagatsukaChangeUndiscovery_C::In' has a wrong offset!");

}

