#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapSymbolDebug_EyeBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MapSymbolDebug_EyeBox.BP_MapSymbolDebug_EyeBox_C
// 0x0028 (0x0248 - 0x0220)
class ABP_MapSymbolDebug_EyeBox_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EyeSize;                                           // 0x0238(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MapSymbolDebug_EyeBox(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MapSymbolDebug_EyeBox_C">();
	}
	static class ABP_MapSymbolDebug_EyeBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MapSymbolDebug_EyeBox_C>();
	}
};
static_assert(alignof(ABP_MapSymbolDebug_EyeBox_C) == 0x000008, "Wrong alignment on ABP_MapSymbolDebug_EyeBox_C");
static_assert(sizeof(ABP_MapSymbolDebug_EyeBox_C) == 0x000248, "Wrong size on ABP_MapSymbolDebug_EyeBox_C");
static_assert(offsetof(ABP_MapSymbolDebug_EyeBox_C, UberGraphFrame) == 0x000220, "Member 'ABP_MapSymbolDebug_EyeBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MapSymbolDebug_EyeBox_C, Box) == 0x000228, "Member 'ABP_MapSymbolDebug_EyeBox_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_MapSymbolDebug_EyeBox_C, DefaultSceneRoot) == 0x000230, "Member 'ABP_MapSymbolDebug_EyeBox_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MapSymbolDebug_EyeBox_C, EyeSize) == 0x000238, "Member 'ABP_MapSymbolDebug_EyeBox_C::EyeSize' has a wrong offset!");

}

