#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NaviDevilGimmick_IgnorePause

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "NaviDevilParam_st_structs.hpp"


namespace SDK::Params
{

// Function BP_NaviDevilGimmick_IgnorePause.BP_NaviDevilGimmick_IgnorePause_C.ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause
// 0x0750 (0x0750 - 0x0000)
struct BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Target, class UBPC_CharaFollower_C* This)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_9804[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9805[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_CheckMapPause_IsPause;                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_1;             // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetMapCommon_rerutn_1;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_1;             // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_CheckMapPause_IsPause_1;              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_ScreenTransition_isFadeFinish_outValue;   // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9806[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn_2;                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_NAVI_DEVIL                                  CallFunc_GetCurrentNaviDevil_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9807[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_2;             // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9808[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_BPI_GetNaviDevilPawn_Pawn;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9809[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_CharaFollower_C*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ScreenTransition_isFadeFinish_outValue_1; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_980A[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_3;                    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_3;             // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Active;                               // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_980B[0x6];                                     // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_View;                                 // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_980C[0x1];                                     // 0x010F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_980D[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_980E[0x3];                                     // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0138(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_980F[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9810[0x4];                                     // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_4;                    // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_4;             // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9811[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_BPI_GetNaviDevilPawn_Pawn_1;              // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9812[0x7];                                     // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_CharaFollower_C*                   CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorFloat_ReturnValue;              // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9813[0x4];                                     // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_NAVI_DEVIL                                  CallFunc_GetCurrentNaviDevil_ReturnValue_1;        // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9814[0x3];                                     // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorFloat_ReturnValue_1;            // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9815[0x7];                                     // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_NaviDevilGimmick_Option_C*          CallFunc_Array_Get_Item;                           // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9816[0x2];                                     // 0x025A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckIgnoreBox_Lock;                      // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionEnabled                             Temp_byte_Variable;                                // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x0263(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x0265(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0266(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9817[0x1];                                     // 0x0267(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9818[0x3];                                     // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_5;                    // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_1;                              // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9819[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_5;             // 0x0280(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_981A[0x7];                                     // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_BPI_GetNaviDevilPawn_Pawn_2;              // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn_6;                    // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_6;             // 0x02A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_981B[0x6];                                     // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_BPI_GetNaviDevilPawn_Pawn_3;              // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_981C[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_CharaFollower_C*                   CallFunc_GetComponentByClass_ReturnValue_2;        // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_981D[0x7];                                     // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Target_2;                       // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPC_CharaFollower_C*                   K2Node_CustomEvent_This_2;                         // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             K2Node_Select_Default;                             // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_981E[0x7];                                     // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Target_1;                       // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPC_CharaFollower_C*                   K2Node_CustomEvent_This_1;                         // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn_7;                    // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_7;             // 0x0310(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_981F[0x6];                                     // 0x0322(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_BPI_GetNaviDevilPawn_Pawn_4;              // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9820[0x7];                                     // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0338(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x034D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9821[0x2];                                     // 0x034E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMapID_ReturnValue;                     // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BPI_GetNaviGimmickSaveID_SaveID;          // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9822[0x7];                                     // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_8;                    // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_8;             // 0x0368(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9823[0x7];                                     // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_BPI_GetNaviDevilPawn_Pawn_5;              // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9824[0x7];                                     // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_CharaFollower_C*                   CallFunc_GetComponentByClass_ReturnValue_3;        // 0x0390(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPopUpIconManager*                      CallFunc_GetPopUpIconManager_ReturnValue;          // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn_9;                    // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_9;             // 0x03A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9825[0x6];                                     // 0x03BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_BPI_GetNaviDevilPawn_Pawn_6;              // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACustomPawn*                            K2Node_DynamicCast_AsCustom_Pawn;                  // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Register_ReturnValue;                     // 0x03D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9826[0x1];                                     // 0x03D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x03D8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9827[0x4];                                     // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors_1; // 0x03F0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9828[0x3];                                     // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9829[0x7];                                     // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNaviDevilParam_st                     CallFunc_GetNaviParam_Param;                       // 0x0410(0x0098)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn_10;                   // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_10;            // 0x04B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_982A[0x7];                                     // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          K2Node_DynamicCast_AsSound_Atom_Cue;               // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_982B[0x7];                                     // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_BPI_GetNaviDevilPawn_Pawn_7;              // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjRef_ReturnValue;            // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_982C[0x7];                                     // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         CallFunc_PlayCharacterVoice_ReturnValue;           // 0x04F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_982D[0x4];                                     // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNaviDevilParam_st                     CallFunc_GetNaviParam_Param_1;                     // 0x0500(0x0098)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_982E[0x4];                                     // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          K2Node_DynamicCast_AsSound_Atom_Cue_1;             // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjRef_ReturnValue_1;          // 0x05B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_982F[0x6];                                     // 0x05B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_11;                   // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_11;            // 0x05C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x05D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9830[0x6];                                     // 0x05D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_BPI_GetNaviDevilPawn_Pawn_8;              // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAtomComponent*                         CallFunc_PlayCharacterVoice_ReturnValue_1;         // 0x05E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9831[0x8];                                     // 0x05E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x05F0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventNaviDevil_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Target;                         // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPC_CharaFollower_C*                   K2Node_CustomEvent_This;                           // 0x0638(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9832[0x7];                                     // 0x0641(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors_2; // 0x0648(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x065C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9833[0x3];                                     // 0x065D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_12;                   // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_12;            // 0x0668(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_CheckMapPause_IsPause_2;              // 0x0679(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x067A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9834[0x1];                                     // 0x067B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x067C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_9835[0x4];                                     // 0x068C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors_3; // 0x0690(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x06A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NaviDevilGimmick_Option_C*          CallFunc_Array_Get_Item_1;                         // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9836[0x3];                                     // 0x06B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x06B4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_9837[0x4];                                     // 0x06C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors_4; // 0x06C8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_4;             // 0x06DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x06DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9838[0x2];                                     // 0x06DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x06E0(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9839[0x4];                                     // 0x06FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventNaviDevil_C*                   K2Node_DynamicCast_AsBP_Event_Navi_Devil;          // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0709(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x070A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_983A[0x5];                                     // 0x070B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBgmScene                                     CallFunc_GetBGMScene_ReturnValue;                  // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0719(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_983B[0x2];                                     // 0x071A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* Target, class UBPC_CharaFollower_C* This)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x071C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x072C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x072D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x072E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x072F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0731(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_983C[0x2];                                     // 0x0732(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* Target, class UBPC_CharaFollower_C* This)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0734(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause) == 0x000010, "Wrong alignment on BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause");
static_assert(sizeof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause) == 0x000750, "Wrong size on BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, EntryPoint) == 0x000000, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_GetMapCommon_rerutn) == 0x000018, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, K2Node_DynamicCast_AsBPI_Map_Common) == 0x000028, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_BPI_CheckMapPause_IsPause) == 0x000039, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_BPI_CheckMapPause_IsPause' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_Not_PreBool_ReturnValue) == 0x00003A, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_CheckEventFlag_ReturnValue) == 0x00003B, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_Not_PreBool_ReturnValue_1) == 0x00003C, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_BooleanOR_ReturnValue) == 0x00003D, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_CheckEventFlag_ReturnValue_1) == 0x00003E, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_CheckEventFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_Not_PreBool_ReturnValue_2) == 0x00003F, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_GetMapCommon_rerutn_1) == 0x000040, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_GetMapCommon_rerutn_1' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, K2Node_DynamicCast_AsBPI_Map_Common_1) == 0x000058, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::K2Node_DynamicCast_AsBPI_Map_Common_1' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_BPI_CheckMapPause_IsPause_1) == 0x000069, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_BPI_CheckMapPause_IsPause_1' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_BooleanOR_ReturnValue_1) == 0x00006A, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_Not_PreBool_ReturnValue_3) == 0x00006B, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, K2Node_CreateDelegate_OutputDelegate_2) == 0x00006C, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_ScreenTransition_isFadeFinish_outValue) == 0x00007C, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_ScreenTransition_isFadeFinish_outValue' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, Temp_int_Loop_Counter_Variable) == 0x000080, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, Temp_object_Variable) == 0x000088, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, K2Node_CustomEvent_Loaded) == 0x000090, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_GetMapCommon_rerutn_2) == 0x000098, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_GetMapCommon_rerutn_2' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_GetCurrentNaviDevil_ReturnValue) == 0x0000A0, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_GetCurrentNaviDevil_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, K2Node_DynamicCast_AsBPI_Map_Common_2) == 0x0000A8, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::K2Node_DynamicCast_AsBPI_Map_Common_2' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, K2Node_DynamicCast_bSuccess_2) == 0x0000B8, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000B9, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_BPI_GetNaviDevilPawn_Pawn) == 0x0000C0, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_BPI_GetNaviDevilPawn_Pawn' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_GetComponentByClass_ReturnValue) == 0x0000D0, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_ScreenTransition_isFadeFinish_outValue_1) == 0x0000D8, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_ScreenTransition_isFadeFinish_outValue_1' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_GetMapCommon_rerutn_3) == 0x0000E0, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_GetMapCommon_rerutn_3' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, K2Node_DynamicCast_AsBPI_Map_Common_3) == 0x0000E8, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::K2Node_DynamicCast_AsBPI_Map_Common_3' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, K2Node_DynamicCast_bSuccess_3) == 0x0000F8, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, K2Node_Event_Active) == 0x0000F9, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::K2Node_Event_Active' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, Temp_object_Variable_1) == 0x000100, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, K2Node_Event_View) == 0x000108, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::K2Node_Event_View' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_Not_PreBool_ReturnValue_4) == 0x000109, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_IsValid_ReturnValue_1) == 0x00010A, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_Not_PreBool_ReturnValue_5) == 0x00010B, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_IsVisible_ReturnValue) == 0x00010C, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_BooleanAND_ReturnValue) == 0x00010D, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, CallFunc_IsValid_ReturnValue_2) == 0x00010E, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause, Temp_int_Loop_Counter_Variable_1) == 0x000110, "Member 'BP_NaviDevilGimmick_IgnorePause_C_ExecuteUbergraph_BP_NaviDevilGimmick_IgnorePause::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
