#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OneWayCtrl

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_OneWayCtrl.BP_OneWayCtrl_C.ExecuteUbergraph_BP_OneWayCtrl
// 0x0018 (0x0018 - 0x0000)
struct BP_OneWayCtrl_C_ExecuteUbergraph_BP_OneWayCtrl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_961D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_OverlappedActor;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OneWayCtrl_C_ExecuteUbergraph_BP_OneWayCtrl) == 0x000008, "Wrong alignment on BP_OneWayCtrl_C_ExecuteUbergraph_BP_OneWayCtrl");
static_assert(sizeof(BP_OneWayCtrl_C_ExecuteUbergraph_BP_OneWayCtrl) == 0x000018, "Wrong size on BP_OneWayCtrl_C_ExecuteUbergraph_BP_OneWayCtrl");
static_assert(offsetof(BP_OneWayCtrl_C_ExecuteUbergraph_BP_OneWayCtrl, EntryPoint) == 0x000000, "Member 'BP_OneWayCtrl_C_ExecuteUbergraph_BP_OneWayCtrl::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_ExecuteUbergraph_BP_OneWayCtrl, K2Node_CustomEvent_OverlappedActor) == 0x000008, "Member 'BP_OneWayCtrl_C_ExecuteUbergraph_BP_OneWayCtrl::K2Node_CustomEvent_OverlappedActor' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_ExecuteUbergraph_BP_OneWayCtrl, K2Node_CustomEvent_OtherActor) == 0x000010, "Member 'BP_OneWayCtrl_C_ExecuteUbergraph_BP_OneWayCtrl::K2Node_CustomEvent_OtherActor' has a wrong offset!");

// Function BP_OneWayCtrl.BP_OneWayCtrl_C.«¹¿à¤ÙóÈ_0
// 0x0010 (0x0010 - 0x0000)
struct BP_OneWayCtrl_C__________0 final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OneWayCtrl_C__________0) == 0x000008, "Wrong alignment on BP_OneWayCtrl_C__________0");
static_assert(sizeof(BP_OneWayCtrl_C__________0) == 0x000010, "Wrong size on BP_OneWayCtrl_C__________0");
static_assert(offsetof(BP_OneWayCtrl_C__________0, OverlappedActor) == 0x000000, "Member 'BP_OneWayCtrl_C__________0::OverlappedActor' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C__________0, OtherActor) == 0x000008, "Member 'BP_OneWayCtrl_C__________0::OtherActor' has a wrong offset!");

// Function BP_OneWayCtrl.BP_OneWayCtrl_C.Init
// 0x0078 (0x0078 - 0x0000)
struct BP_OneWayCtrl_C_Init final
{
public:
	int32                                         L_index;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_961E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       L_Actor;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* OverlappedActor, class AActor* OtherActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_961F[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCollisionProfileName_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9620[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9621[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x005C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9622[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_OneWayCtrl_C_Init) == 0x000008, "Wrong alignment on BP_OneWayCtrl_C_Init");
static_assert(sizeof(BP_OneWayCtrl_C_Init) == 0x000078, "Wrong size on BP_OneWayCtrl_C_Init");
static_assert(offsetof(BP_OneWayCtrl_C_Init, L_index) == 0x000000, "Member 'BP_OneWayCtrl_C_Init::L_index' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_Init, L_Actor) == 0x000008, "Member 'BP_OneWayCtrl_C_Init::L_Actor' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_Init, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_OneWayCtrl_C_Init::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_Init, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_OneWayCtrl_C_Init::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_Init, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'BP_OneWayCtrl_C_Init::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_Init, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'BP_OneWayCtrl_C_Init::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_Init, CallFunc_GetCollisionProfileName_ReturnValue) == 0x000038, "Member 'BP_OneWayCtrl_C_Init::CallFunc_GetCollisionProfileName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_Init, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_OneWayCtrl_C_Init::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_Init, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000044, "Member 'BP_OneWayCtrl_C_Init::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_Init, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_OneWayCtrl_C_Init::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_Init, CallFunc_Array_Length_ReturnValue_1) == 0x000050, "Member 'BP_OneWayCtrl_C_Init::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_Init, CallFunc_IsValid_ReturnValue_1) == 0x000054, "Member 'BP_OneWayCtrl_C_Init::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_Init, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'BP_OneWayCtrl_C_Init::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_Init, Temp_name_Variable) == 0x00005C, "Member 'BP_OneWayCtrl_C_Init::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_Init, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'BP_OneWayCtrl_C_Init::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_Init, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'BP_OneWayCtrl_C_Init::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_Init, CallFunc_Array_Length_ReturnValue_2) == 0x00006C, "Member 'BP_OneWayCtrl_C_Init::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_Init, CallFunc_CheckEventFlag_ReturnValue) == 0x000070, "Member 'BP_OneWayCtrl_C_Init::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_Init, CallFunc_Greater_IntInt_ReturnValue) == 0x000071, "Member 'BP_OneWayCtrl_C_Init::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_OneWayCtrl.BP_OneWayCtrl_C.OnComponentEndOverlap
// 0x01C0 (0x01C0 - 0x0000)
struct BP_OneWayCtrl_C_OnComponentEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9623[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9624[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9625[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0050(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9626[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_1;          // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9627[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9628[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_LineTraceComponent_HitLocation;        // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_LineTraceComponent_HitNormal;          // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_K2_LineTraceComponent_BoneName;           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_LineTraceComponent_OutHit;             // 0x00E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_LineTraceComponent_ReturnValue;        // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9629[0x3];                                     // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_OneWayCtrl_C_OnComponentEndOverlap) == 0x000008, "Wrong alignment on BP_OneWayCtrl_C_OnComponentEndOverlap");
static_assert(sizeof(BP_OneWayCtrl_C_OnComponentEndOverlap) == 0x0001C0, "Wrong size on BP_OneWayCtrl_C_OnComponentEndOverlap");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, OverlappedComponent) == 0x000000, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, OtherActor) == 0x000008, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, OtherComp) == 0x000010, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, OtherBodyIndex) == 0x000018, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, Temp_int_Array_Index_Variable_1) == 0x000028, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_Array_Length_ReturnValue_1) == 0x000048, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_IsValid_ReturnValue_1) == 0x00004C, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_Less_IntInt_ReturnValue) == 0x00004D, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000050, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_Array_Length_ReturnValue_2) == 0x000060, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_Greater_IntInt_ReturnValue) == 0x000064, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_MakeLiteralString_ReturnValue) == 0x000068, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_MakeLiteralString_ReturnValue_1) == 0x000078, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_MakeLiteralString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000088, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_GetPlayerPawn_ReturnValue) == 0x000098, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, Temp_int_Loop_Counter_Variable_1) == 0x0000A0, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A4, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B0, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000BC, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_K2_LineTraceComponent_HitLocation) == 0x0000C0, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_K2_LineTraceComponent_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_K2_LineTraceComponent_HitNormal) == 0x0000CC, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_K2_LineTraceComponent_HitNormal' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_K2_LineTraceComponent_BoneName) == 0x0000D8, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_K2_LineTraceComponent_BoneName' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_K2_LineTraceComponent_OutHit) == 0x0000E0, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_K2_LineTraceComponent_OutHit' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_K2_LineTraceComponent_ReturnValue) == 0x000168, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_K2_LineTraceComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_Add_IntInt_ReturnValue_1) == 0x00016C, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000170, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_GetVelocity_ReturnValue) == 0x000178, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_GetActorForwardVector_ReturnValue) == 0x000184, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_BreakVector_X) == 0x000190, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_BreakVector_Y) == 0x000194, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_BreakVector_Z) == 0x000198, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_MakeVector_ReturnValue) == 0x00019C, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_Normal_ReturnValue) == 0x0001A8, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_VSize_ReturnValue) == 0x0001B4, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnComponentEndOverlap, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x0001B8, "Member 'BP_OneWayCtrl_C_OnComponentEndOverlap::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_OneWayCtrl.BP_OneWayCtrl_C.OnBeginOverlap_ForceOnFlag
// 0x0048 (0x0048 - 0x0000)
struct BP_OneWayCtrl_C_OnBeginOverlap_ForceOnFlag final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_962A[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_962B[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_962C[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OneWayCtrl_C_OnBeginOverlap_ForceOnFlag) == 0x000008, "Wrong alignment on BP_OneWayCtrl_C_OnBeginOverlap_ForceOnFlag");
static_assert(sizeof(BP_OneWayCtrl_C_OnBeginOverlap_ForceOnFlag) == 0x000048, "Wrong size on BP_OneWayCtrl_C_OnBeginOverlap_ForceOnFlag");
static_assert(offsetof(BP_OneWayCtrl_C_OnBeginOverlap_ForceOnFlag, OverlappedActor) == 0x000000, "Member 'BP_OneWayCtrl_C_OnBeginOverlap_ForceOnFlag::OverlappedActor' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnBeginOverlap_ForceOnFlag, OtherActor) == 0x000008, "Member 'BP_OneWayCtrl_C_OnBeginOverlap_ForceOnFlag::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_OneWayCtrl_C_OnBeginOverlap_ForceOnFlag, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_OneWayCtrl_C_OnBeginOverlap_ForceOnFlag::Temp_int_Array_Index_Variable' has a wrong offset!");
