#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RelicAppearanceBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RelicAppearanceBase.BP_RelicAppearanceBase_C
// 0x0028 (0x0248 - 0x0220)
class ABP_RelicAppearanceBase_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Template;                                          // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_RelicAppearanceBase(int32 EntryPoint);
	void Finished(class UParticleSystemComponent* PSystem);
	void ReceiveBeginPlay();
	void HideParticle(bool Immediate);
	void ShowParticle(bool Immediate);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RelicAppearanceBase_C">();
	}
	static class ABP_RelicAppearanceBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RelicAppearanceBase_C>();
	}
};
static_assert(alignof(ABP_RelicAppearanceBase_C) == 0x000008, "Wrong alignment on ABP_RelicAppearanceBase_C");
static_assert(sizeof(ABP_RelicAppearanceBase_C) == 0x000248, "Wrong size on ABP_RelicAppearanceBase_C");
static_assert(offsetof(ABP_RelicAppearanceBase_C, UberGraphFrame) == 0x000220, "Member 'ABP_RelicAppearanceBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_RelicAppearanceBase_C, ParticleSystem) == 0x000228, "Member 'ABP_RelicAppearanceBase_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_RelicAppearanceBase_C, StaticMesh) == 0x000230, "Member 'ABP_RelicAppearanceBase_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_RelicAppearanceBase_C, DefaultSceneRoot) == 0x000238, "Member 'ABP_RelicAppearanceBase_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_RelicAppearanceBase_C, Template) == 0x000240, "Member 'ABP_RelicAppearanceBase_C::Template' has a wrong offset!");

}

