#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ryuketsu_MapBGMRequest

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Ryuketsu_MapBGMRequest.BP_Ryuketsu_MapBGMRequest_C.ExecuteUbergraph_BP_Ryuketsu_MapBGMRequest
// 0x0038 (0x0038 - 0x0000)
struct BP_Ryuketsu_MapBGMRequest_C_ExecuteUbergraph_BP_Ryuketsu_MapBGMRequest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D12[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_CheckMapPause_IsPause;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D13[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D14[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Ryuketsu_MapBGMRequest_C_ExecuteUbergraph_BP_Ryuketsu_MapBGMRequest) == 0x000008, "Wrong alignment on BP_Ryuketsu_MapBGMRequest_C_ExecuteUbergraph_BP_Ryuketsu_MapBGMRequest");
static_assert(sizeof(BP_Ryuketsu_MapBGMRequest_C_ExecuteUbergraph_BP_Ryuketsu_MapBGMRequest) == 0x000038, "Wrong size on BP_Ryuketsu_MapBGMRequest_C_ExecuteUbergraph_BP_Ryuketsu_MapBGMRequest");
static_assert(offsetof(BP_Ryuketsu_MapBGMRequest_C_ExecuteUbergraph_BP_Ryuketsu_MapBGMRequest, EntryPoint) == 0x000000, "Member 'BP_Ryuketsu_MapBGMRequest_C_ExecuteUbergraph_BP_Ryuketsu_MapBGMRequest::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Ryuketsu_MapBGMRequest_C_ExecuteUbergraph_BP_Ryuketsu_MapBGMRequest, CallFunc_GetMapCommon_rerutn) == 0x000008, "Member 'BP_Ryuketsu_MapBGMRequest_C_ExecuteUbergraph_BP_Ryuketsu_MapBGMRequest::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(BP_Ryuketsu_MapBGMRequest_C_ExecuteUbergraph_BP_Ryuketsu_MapBGMRequest, K2Node_DynamicCast_AsBPI_Map_Common) == 0x000010, "Member 'BP_Ryuketsu_MapBGMRequest_C_ExecuteUbergraph_BP_Ryuketsu_MapBGMRequest::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BP_Ryuketsu_MapBGMRequest_C_ExecuteUbergraph_BP_Ryuketsu_MapBGMRequest, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Ryuketsu_MapBGMRequest_C_ExecuteUbergraph_BP_Ryuketsu_MapBGMRequest::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Ryuketsu_MapBGMRequest_C_ExecuteUbergraph_BP_Ryuketsu_MapBGMRequest, CallFunc_BPI_CheckMapPause_IsPause) == 0x000021, "Member 'BP_Ryuketsu_MapBGMRequest_C_ExecuteUbergraph_BP_Ryuketsu_MapBGMRequest::CallFunc_BPI_CheckMapPause_IsPause' has a wrong offset!");
static_assert(offsetof(BP_Ryuketsu_MapBGMRequest_C_ExecuteUbergraph_BP_Ryuketsu_MapBGMRequest, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'BP_Ryuketsu_MapBGMRequest_C_ExecuteUbergraph_BP_Ryuketsu_MapBGMRequest::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Ryuketsu_MapBGMRequest_C_ExecuteUbergraph_BP_Ryuketsu_MapBGMRequest, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'BP_Ryuketsu_MapBGMRequest_C_ExecuteUbergraph_BP_Ryuketsu_MapBGMRequest::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ryuketsu_MapBGMRequest_C_ExecuteUbergraph_BP_Ryuketsu_MapBGMRequest, CallFunc_Get_ReturnValue) == 0x000030, "Member 'BP_Ryuketsu_MapBGMRequest_C_ExecuteUbergraph_BP_Ryuketsu_MapBGMRequest::CallFunc_Get_ReturnValue' has a wrong offset!");

// Function BP_Ryuketsu_MapBGMRequest.BP_Ryuketsu_MapBGMRequest_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Ryuketsu_MapBGMRequest_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Ryuketsu_MapBGMRequest_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Ryuketsu_MapBGMRequest_C_ReceiveTick");
static_assert(sizeof(BP_Ryuketsu_MapBGMRequest_C_ReceiveTick) == 0x000004, "Wrong size on BP_Ryuketsu_MapBGMRequest_C_ReceiveTick");
static_assert(offsetof(BP_Ryuketsu_MapBGMRequest_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Ryuketsu_MapBGMRequest_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

