#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ryuketsu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_RyuketsuBase_classes.hpp"
#include "E_MapGimmickHideReason_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Ryuketsu.BP_Ryuketsu_C
// 0x0040 (0x04B0 - 0x0470)
class ABP_Ryuketsu_C final : public ABP_RyuketsuBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Ryuketsu_C;                      // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      Capsule;                                           // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ResidentSound_C*                   BPC_ResidentSound;                                 // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         HideReason;                                        // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9203[0x4];                                     // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        ParticleTemplate;                                  // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Ryuketsu(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Evt_ShowObjects_WhenReturnMap();
	void Evt_HideObjects_WhenExitMap();
	void BPI_HideGimmick(E_MapGimmickHideReason Param_HideReason);
	void BPI_ShowGimmick(E_MapGimmickHideReason Param_HideReason);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Ryuketsu_C">();
	}
	static class ABP_Ryuketsu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Ryuketsu_C>();
	}
};
static_assert(alignof(ABP_Ryuketsu_C) == 0x000008, "Wrong alignment on ABP_Ryuketsu_C");
static_assert(sizeof(ABP_Ryuketsu_C) == 0x0004B0, "Wrong size on ABP_Ryuketsu_C");
static_assert(offsetof(ABP_Ryuketsu_C, UberGraphFrame_BP_Ryuketsu_C) == 0x000470, "Member 'ABP_Ryuketsu_C::UberGraphFrame_BP_Ryuketsu_C' has a wrong offset!");
static_assert(offsetof(ABP_Ryuketsu_C, Capsule) == 0x000478, "Member 'ABP_Ryuketsu_C::Capsule' has a wrong offset!");
static_assert(offsetof(ABP_Ryuketsu_C, PointLight) == 0x000480, "Member 'ABP_Ryuketsu_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_Ryuketsu_C, Decal) == 0x000488, "Member 'ABP_Ryuketsu_C::Decal' has a wrong offset!");
static_assert(offsetof(ABP_Ryuketsu_C, BPC_ResidentSound) == 0x000490, "Member 'ABP_Ryuketsu_C::BPC_ResidentSound' has a wrong offset!");
static_assert(offsetof(ABP_Ryuketsu_C, ParticleSystem) == 0x000498, "Member 'ABP_Ryuketsu_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_Ryuketsu_C, HideReason) == 0x0004A0, "Member 'ABP_Ryuketsu_C::HideReason' has a wrong offset!");
static_assert(offsetof(ABP_Ryuketsu_C, ParticleTemplate) == 0x0004A8, "Member 'ABP_Ryuketsu_C::ParticleTemplate' has a wrong offset!");

}

