#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RyuketsuBase

#include "Basic.hpp"

#include "E_MapGimmickHideReason_structs.hpp"
#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_RyuketsuBase.BP_RyuketsuBase_C.ExecuteUbergraph_BP_RyuketsuBase
// 0x0370 (0x0370 - 0x0000)
struct BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97CD[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    K2Node_DynamicCast_AsScript_Message_Asset;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97CE[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97CF[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97D0[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97D1[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl;                 // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97D2[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_1;               // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97D3[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_2;               // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97D4[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_3;               // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IIsFinishedWindowOut_OutFinished;         // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_MapGimmickHideReason                        K2Node_Event_HideReason_1;                         // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MapGimmickHideReason                        K2Node_Event_HideReason;                           // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMapID_ReturnValue;                     // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97D5[0x2];                                     // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAreaID_ReturnValue;                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRyuketsuData_FromMapID_id;             // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRyuketsuData                          CallFunc_GetRyuketsuData_FromMapID_ReturnValue;    // 0x0118(0x003C)(ConstParm, NoDestructor)
	uint8                                         Pad_97D6[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97D7[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_1;             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue;            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_3;              // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97D8[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_1;                // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMapID_ReturnValue_1;                   // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_97D9[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_4;               // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97DA[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_5;               // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97DB[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_6;               // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97DC[0x3];                                     // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAreaID_ReturnValue_1;                  // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue_1;          // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSaveUniqueIdFromDataId_ReturnValue;    // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97DD[0x3];                                     // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0208(0x0010)(ZeroConstructor, NoDestructor)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_4;              // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97DE[0x6];                                     // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_2;             // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_5;              // 0x0240(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97DF[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_2;                // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_7;               // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97E0[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_8;               // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd;             // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97E1[0x6];                                     // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProjectGameMode_C*                     K2Node_DynamicCast_AsProject_Game_Mode;            // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97E2[0x7];                                     // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProjectGameMode_C*                     K2Node_DynamicCast_AsProject_Game_Mode_1;          // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97E3[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_97E4[0x8];                                     // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x02D0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0318(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0330(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97E5[0x4];                                     // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0340(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase) == 0x000010, "Wrong alignment on BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase");
static_assert(sizeof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase) == 0x000370, "Wrong size on BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, EntryPoint) == 0x000000, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, Temp_bool_Variable) == 0x000004, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, Temp_object_Variable) == 0x000010, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_AsScript_Message_Asset) == 0x000018, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_AsScript_Message_Asset' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, Temp_bool_Has_Been_Initd_Variable) == 0x000044, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_GetGameInstance_ReturnValue) == 0x000048, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_AsBPI_UIManager) == 0x000050, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_BPI_GetUIManager_UIManager) == 0x000068, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000070, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_BPI_GetMsgCtrl_OutActor) == 0x000088, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_BPI_GetMsgCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_AsBPI_Msg_Ctrl) == 0x000090, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_AsBPI_Msg_Ctrl' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_bSuccess_3) == 0x0000A0, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_AsBPI_Msg_Ctrl_1) == 0x0000A8, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_AsBPI_Msg_Ctrl_1' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_bSuccess_4) == 0x0000B8, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_AsBPI_Msg_Ctrl_2) == 0x0000C0, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_AsBPI_Msg_Ctrl_2' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_bSuccess_5) == 0x0000D0, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_AsBPI_Msg_Ctrl_3) == 0x0000D8, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_AsBPI_Msg_Ctrl_3' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_bSuccess_6) == 0x0000E8, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_IIsFinishedWindowOut_OutFinished) == 0x0000E9, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_IIsFinishedWindowOut_OutFinished' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_Event_HideReason_1) == 0x0000EA, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_Event_HideReason_1' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_Event_HideReason) == 0x0000EB, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_Event_HideReason' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_GetMapID_ReturnValue) == 0x0000EC, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_GetMapID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_GetMapCommon_rerutn) == 0x0000F0, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_AsBPI_Map_Common) == 0x0000F8, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_bSuccess_7) == 0x000108, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000109, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_GetAreaID_ReturnValue) == 0x00010C, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_GetAreaID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_Select_Default) == 0x000110, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_GetRyuketsuData_FromMapID_id) == 0x000114, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_GetRyuketsuData_FromMapID_id' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_GetRyuketsuData_FromMapID_ReturnValue) == 0x000118, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_GetRyuketsuData_FromMapID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_GetGameInstance_ReturnValue_1) == 0x000158, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_AsBPI_UIManager_2) == 0x000160, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_AsBPI_UIManager_2' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_bSuccess_8) == 0x000170, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_BPI_GetUIManager_UIManager_1) == 0x000178, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_BPI_GetUIManager_UIManager_1' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_GetMinimapManager_ReturnValue) == 0x000180, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_GetMinimapManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_AsBPI_UIManager_3) == 0x000188, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_AsBPI_UIManager_3' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_bSuccess_9) == 0x000198, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_BPI_GetMsgCtrl_OutActor_1) == 0x0001A0, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_BPI_GetMsgCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_GetMapID_ReturnValue_1) == 0x0001A8, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_GetMapID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_AsBPI_Msg_Ctrl_4) == 0x0001B0, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_AsBPI_Msg_Ctrl_4' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_bSuccess_10) == 0x0001C0, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_AsBPI_Msg_Ctrl_5) == 0x0001C8, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_AsBPI_Msg_Ctrl_5' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_bSuccess_11) == 0x0001D8, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_AsBPI_Msg_Ctrl_6) == 0x0001E0, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_AsBPI_Msg_Ctrl_6' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_bSuccess_12) == 0x0001F0, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_GetAreaID_ReturnValue_1) == 0x0001F4, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_GetAreaID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_GetMinimapManager_ReturnValue_1) == 0x0001F8, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_GetMinimapManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_GetSaveUniqueIdFromDataId_ReturnValue) == 0x000200, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_GetSaveUniqueIdFromDataId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, Temp_bool_IsClosed_Variable) == 0x000204, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_CreateDelegate_OutputDelegate_2) == 0x000208, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_GetGameInstance_ReturnValue_2) == 0x000218, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_AsBPI_UIManager_4) == 0x000220, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_AsBPI_UIManager_4' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_bSuccess_13) == 0x000230, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000231, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_BPI_GetUIManager_UIManager_2) == 0x000238, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_BPI_GetUIManager_UIManager_2' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_AsBPI_UIManager_5) == 0x000240, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_AsBPI_UIManager_5' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_bSuccess_14) == 0x000250, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_BPI_GetMsgCtrl_OutActor_2) == 0x000258, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_BPI_GetMsgCtrl_OutActor_2' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_AsBPI_Msg_Ctrl_7) == 0x000260, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_AsBPI_Msg_Ctrl_7' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_bSuccess_15) == 0x000270, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_bSuccess_15' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_AsBPI_Msg_Ctrl_8) == 0x000278, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_AsBPI_Msg_Ctrl_8' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_bSuccess_16) == 0x000288, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_bSuccess_16' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd) == 0x000289, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_GetGameMode_ReturnValue) == 0x000290, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_AsProject_Game_Mode) == 0x000298, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_AsProject_Game_Mode' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_bSuccess_17) == 0x0002A0, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_bSuccess_17' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_GetGameMode_ReturnValue_1) == 0x0002A8, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_AsProject_Game_Mode_1) == 0x0002B0, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_AsProject_Game_Mode_1' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, K2Node_DynamicCast_bSuccess_18) == 0x0002B8, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::K2Node_DynamicCast_bSuccess_18' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_GetPlayerPawn_ReturnValue) == 0x0002C0, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_GetTransform_ReturnValue) == 0x0002D0, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_BreakTransform_Location) == 0x000300, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_BreakTransform_Rotation) == 0x00030C, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_BreakTransform_Scale) == 0x000318, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_BreakRotator_Roll) == 0x000324, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_BreakRotator_Pitch) == 0x000328, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_BreakRotator_Yaw) == 0x00032C, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_MakeRotator_ReturnValue) == 0x000330, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase, CallFunc_MakeTransform_ReturnValue) == 0x000340, "Member 'BP_RyuketsuBase_C_ExecuteUbergraph_BP_RyuketsuBase::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function BP_RyuketsuBase.BP_RyuketsuBase_C.BPI_HideGimmick
// 0x0001 (0x0001 - 0x0000)
struct BP_RyuketsuBase_C_BPI_HideGimmick final
{
public:
	E_MapGimmickHideReason                        HideReason;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RyuketsuBase_C_BPI_HideGimmick) == 0x000001, "Wrong alignment on BP_RyuketsuBase_C_BPI_HideGimmick");
static_assert(sizeof(BP_RyuketsuBase_C_BPI_HideGimmick) == 0x000001, "Wrong size on BP_RyuketsuBase_C_BPI_HideGimmick");
static_assert(offsetof(BP_RyuketsuBase_C_BPI_HideGimmick, HideReason) == 0x000000, "Member 'BP_RyuketsuBase_C_BPI_HideGimmick::HideReason' has a wrong offset!");

// Function BP_RyuketsuBase.BP_RyuketsuBase_C.BPI_ShowGimmick
// 0x0001 (0x0001 - 0x0000)
struct BP_RyuketsuBase_C_BPI_ShowGimmick final
{
public:
	E_MapGimmickHideReason                        HideReason;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RyuketsuBase_C_BPI_ShowGimmick) == 0x000001, "Wrong alignment on BP_RyuketsuBase_C_BPI_ShowGimmick");
static_assert(sizeof(BP_RyuketsuBase_C_BPI_ShowGimmick) == 0x000001, "Wrong size on BP_RyuketsuBase_C_BPI_ShowGimmick");
static_assert(offsetof(BP_RyuketsuBase_C_BPI_ShowGimmick, HideReason) == 0x000000, "Member 'BP_RyuketsuBase_C_BPI_ShowGimmick::HideReason' has a wrong offset!");

// Function BP_RyuketsuBase.BP_RyuketsuBase_C.OnLoaded_209DEC174BEC1F7CBA8DC19645F38F65
// 0x0008 (0x0008 - 0x0000)
struct BP_RyuketsuBase_C_OnLoaded_209DEC174BEC1F7CBA8DC19645F38F65 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RyuketsuBase_C_OnLoaded_209DEC174BEC1F7CBA8DC19645F38F65) == 0x000008, "Wrong alignment on BP_RyuketsuBase_C_OnLoaded_209DEC174BEC1F7CBA8DC19645F38F65");
static_assert(sizeof(BP_RyuketsuBase_C_OnLoaded_209DEC174BEC1F7CBA8DC19645F38F65) == 0x000008, "Wrong size on BP_RyuketsuBase_C_OnLoaded_209DEC174BEC1F7CBA8DC19645F38F65");
static_assert(offsetof(BP_RyuketsuBase_C_OnLoaded_209DEC174BEC1F7CBA8DC19645F38F65, Loaded) == 0x000000, "Member 'BP_RyuketsuBase_C_OnLoaded_209DEC174BEC1F7CBA8DC19645F38F65::Loaded' has a wrong offset!");

// Function BP_RyuketsuBase.BP_RyuketsuBase_C.ProcDistanceView
// 0x0088 (0x0088 - 0x0000)
struct BP_RyuketsuBase_C_ProcDistanceView final
{
public:
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0000(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_RyuketsuBase_C_ProcDistanceView) == 0x000004, "Wrong alignment on BP_RyuketsuBase_C_ProcDistanceView");
static_assert(sizeof(BP_RyuketsuBase_C_ProcDistanceView) == 0x000088, "Wrong size on BP_RyuketsuBase_C_ProcDistanceView");
static_assert(offsetof(BP_RyuketsuBase_C_ProcDistanceView, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000000, "Member 'BP_RyuketsuBase_C_ProcDistanceView::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");

// Function BP_RyuketsuBase.BP_RyuketsuBase_C.SetMinimapIconTableRow
// 0x00F0 (0x00F0 - 0x0000)
struct BP_RyuketsuBase_C_SetMinimapIconTableRow final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_97E6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMinimapIconTableRow                   OutRow;                                            // 0x0008(0x0058)(Parm, OutParm)
	bool                                          NeedToAddMore;                                     // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97E7[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAreaID_ReturnValue;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMapID_ReturnValue;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_97E8[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMinimapIconTableRow                   K2Node_MakeStruct_MinimapIconTableRow;             // 0x0098(0x0058)()
};
static_assert(alignof(BP_RyuketsuBase_C_SetMinimapIconTableRow) == 0x000008, "Wrong alignment on BP_RyuketsuBase_C_SetMinimapIconTableRow");
static_assert(sizeof(BP_RyuketsuBase_C_SetMinimapIconTableRow) == 0x0000F0, "Wrong size on BP_RyuketsuBase_C_SetMinimapIconTableRow");
static_assert(offsetof(BP_RyuketsuBase_C_SetMinimapIconTableRow, Param_Index) == 0x000000, "Member 'BP_RyuketsuBase_C_SetMinimapIconTableRow::Param_Index' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_SetMinimapIconTableRow, OutRow) == 0x000008, "Member 'BP_RyuketsuBase_C_SetMinimapIconTableRow::OutRow' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_SetMinimapIconTableRow, NeedToAddMore) == 0x000060, "Member 'BP_RyuketsuBase_C_SetMinimapIconTableRow::NeedToAddMore' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_SetMinimapIconTableRow, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000064, "Member 'BP_RyuketsuBase_C_SetMinimapIconTableRow::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_SetMinimapIconTableRow, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000070, "Member 'BP_RyuketsuBase_C_SetMinimapIconTableRow::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_SetMinimapIconTableRow, CallFunc_BreakRotator_Roll) == 0x00007C, "Member 'BP_RyuketsuBase_C_SetMinimapIconTableRow::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_SetMinimapIconTableRow, CallFunc_BreakRotator_Pitch) == 0x000080, "Member 'BP_RyuketsuBase_C_SetMinimapIconTableRow::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_SetMinimapIconTableRow, CallFunc_BreakRotator_Yaw) == 0x000084, "Member 'BP_RyuketsuBase_C_SetMinimapIconTableRow::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_SetMinimapIconTableRow, CallFunc_FTrunc_ReturnValue) == 0x000088, "Member 'BP_RyuketsuBase_C_SetMinimapIconTableRow::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_SetMinimapIconTableRow, CallFunc_GetAreaID_ReturnValue) == 0x00008C, "Member 'BP_RyuketsuBase_C_SetMinimapIconTableRow::CallFunc_GetAreaID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_SetMinimapIconTableRow, CallFunc_GetMapID_ReturnValue) == 0x000090, "Member 'BP_RyuketsuBase_C_SetMinimapIconTableRow::CallFunc_GetMapID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RyuketsuBase_C_SetMinimapIconTableRow, K2Node_MakeStruct_MinimapIconTableRow) == 0x000098, "Member 'BP_RyuketsuBase_C_SetMinimapIconTableRow::K2Node_MakeStruct_MinimapIconTableRow' has a wrong offset!");

// Function BP_RyuketsuBase.BP_RyuketsuBase_C.BPI_GetRyuketsuIndex
// 0x0004 (0x0004 - 0x0000)
struct BP_RyuketsuBase_C_BPI_GetRyuketsuIndex final
{
public:
	int32                                         RyuketsuIndex;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RyuketsuBase_C_BPI_GetRyuketsuIndex) == 0x000004, "Wrong alignment on BP_RyuketsuBase_C_BPI_GetRyuketsuIndex");
static_assert(sizeof(BP_RyuketsuBase_C_BPI_GetRyuketsuIndex) == 0x000004, "Wrong size on BP_RyuketsuBase_C_BPI_GetRyuketsuIndex");
static_assert(offsetof(BP_RyuketsuBase_C_BPI_GetRyuketsuIndex, RyuketsuIndex) == 0x000000, "Member 'BP_RyuketsuBase_C_BPI_GetRyuketsuIndex::RyuketsuIndex' has a wrong offset!");

}

