#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RelicAppearance_Blue

#include "Basic.hpp"

#include "BP_RelicAppearanceBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RelicAppearance_Blue.BP_RelicAppearance_Blue_C
// 0x0018 (0x0260 - 0x0248)
class ABP_RelicAppearance_Blue_C final : public ABP_RelicAppearanceBase_C
{
public:
	class UDecalComponent*                        Decal3;                                            // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal2;                                            // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RelicAppearance_Blue_C">();
	}
	static class ABP_RelicAppearance_Blue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RelicAppearance_Blue_C>();
	}
};
static_assert(alignof(ABP_RelicAppearance_Blue_C) == 0x000008, "Wrong alignment on ABP_RelicAppearance_Blue_C");
static_assert(sizeof(ABP_RelicAppearance_Blue_C) == 0x000260, "Wrong size on ABP_RelicAppearance_Blue_C");
static_assert(offsetof(ABP_RelicAppearance_Blue_C, Decal3) == 0x000248, "Member 'ABP_RelicAppearance_Blue_C::Decal3' has a wrong offset!");
static_assert(offsetof(ABP_RelicAppearance_Blue_C, Decal2) == 0x000250, "Member 'ABP_RelicAppearance_Blue_C::Decal2' has a wrong offset!");
static_assert(offsetof(ABP_RelicAppearance_Blue_C, Decal) == 0x000258, "Member 'ABP_RelicAppearance_Blue_C::Decal' has a wrong offset!");

}

