#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResultMain

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_ScreenTransitionFadeType_structs.hpp"


namespace SDK::Params
{

// Function BP_ResultMain.BP_ResultMain_C.ExecuteUbergraph_BP_ResultMain
// 0x08D0 (0x08D0 - 0x0000)
struct BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D16[0xB];                                     // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LvUpEventStart_dummy;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEndLvUpEvent_IsEnd;                     // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ModelLoadReq_Return;                      // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEndCtrl_IsEnd;                          // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D17[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor;                   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D18[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMapID_ReturnValue;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D19[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EBgmScene                                     CallFunc_GetBGMScene_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1A[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          CallFunc_GetBGM_ReturnValue;                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x00B8(0x00D0)()
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StatusCameraStart_Success;                // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InitializeLvUpEvent_Success;              // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StatusCameraEnd_Success;                  // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ScreenTransition_isFadeFinish_outValue;   // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1B[0x3];                                     // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable_1;                             // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CloseUI_dummy;                            // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1C[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsActor_1;                 // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CloseUI_dummy_1;                          // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CloseUI_dummy_2;                          // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SpawnComplete_complete;                   // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1D[0x3];                                     // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FResultData                            CallFunc_PopResultData_outResultData;              // 0x01B0(0x0068)()
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_1;                       // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Init_success;                             // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GrowUpFromResultData_ExistLvUpChara;      // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SpawnComplete_complete_1;                 // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInitialized_Complete;                   // 0x0223(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PreLoadModel_Dummy;                       // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1E[0x2];                                     // 0x0226(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable_2;                             // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1F[0x4];                                     // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsActor_2;                 // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_2;                // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D20[0x6];                                     // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameMode_C>       K2Node_DynamicCast_AsBPI_Game_Mode;                // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D21[0x3];                                     // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMapID_ReturnValue_1;                   // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_2;                       // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameMode_C>       K2Node_DynamicCast_AsBPI_Game_Mode_1;              // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D22[0x3];                                     // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D23[0xC];                                     // 0x0294(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x02A0(0x0030)(IsPlainOldData, NoDestructor)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_2;                // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameMode_C>       K2Node_DynamicCast_AsBPI_Game_Mode_2;              // 0x02D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D24[0x7];                                     // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D25[0x7];                                     // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_3;              // 0x0300(0x0030)(IsPlainOldData, NoDestructor)
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue_1; // 0x0330(0x00D0)()
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_3;                // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameMode_C>       K2Node_DynamicCast_AsBPI_Game_Mode_3;              // 0x0408(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMapSystemBKLoadEnd_end;                 // 0x041A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x041B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ImmediateInit_dummy;                      // 0x041C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMapSystemLevelLoadEnd_End;              // 0x041D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D26[0x2];                                     // 0x041E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_4;                // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameMode_C>       K2Node_DynamicCast_AsBPI_Game_Mode_4;              // 0x0428(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_isPlaying;                      // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D27[0x6];                                     // 0x043A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_5;                // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameMode_C>       K2Node_DynamicCast_AsBPI_Game_Mode_5;              // 0x0448(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMapSystemHideEnd_End;                   // 0x0459(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetTopDataObj_Success;                    // 0x045A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartTransitionOut_Dummy;                 // 0x045B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEndTransitionOut_IsEnd;                 // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartCtrl_success;                        // 0x045D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_UI_FADE_STATE                               CallFunc_GetFadeState_ReturnValue;                 // 0x045E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x045F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReplaceFillScreen_success;                // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D28[0x7];                                     // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable_3;                             // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor_3;                 // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_3;                // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D29[0x7];                                     // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_3;                       // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FMouseCursorState                      CallFunc_PopShowMouseCursor_ReturnValue;           // 0x0488(0x0018)()
	class UClass*                                 Temp_class_Variable_4;                             // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor_4;                 // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_4;                // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D2A[0x7];                                     // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGardenTalkPointManager*                CallFunc_GetGardenTalkPointManager_ReturnValue;    // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_5;                             // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor_5;                 // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_5;                // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D2B[0x7];                                     // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_4;                       // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetDelayInInit_Dummy;                     // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D2C[0x7];                                     // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x04F0(0x0010)(ReferenceParm)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0500(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D2D[0x7];                                     // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EnvCtrl_C>        K2Node_DynamicCast_AsBPI_Env_Ctrl;                 // 0x0520(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D2E[0x3];                                     // 0x0531(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D2F[0x7];                                     // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_5;                       // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_3D30[0x8];                                     // 0x0548(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_4;              // 0x0550(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClearWidgetAndActor_Finished;             // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D31[0x7];                                     // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue_2; // 0x0598(0x00D0)()
	TArray<ERESULT_JOINDATA>                      CallFunc_CreateInitializedJoinData_ReturnValue;    // 0x0668(0x0010)(ReferenceParm)
	struct FResultData                            K2Node_SetFieldsInStruct_StructOut;                // 0x0678(0x0068)()
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x06E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D32[0x2];                                     // 0x06E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate;              // 0x06E4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x06F4(0x0010)(ZeroConstructor, NoDestructor)
	E_ScreenTransitionFadeType                    Temp_byte_Variable;                                // 0x0704(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D33[0x3];                                     // 0x0705(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0708(0x0010)(ZeroConstructor, NoDestructor)
	E_ScreenTransitionFadeType                    Temp_byte_Variable_1;                              // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D34[0x3];                                     // 0x0719(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x071C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3D35[0x4];                                     // 0x072C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue_3; // 0x0730(0x00D0)()
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0800(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_2;            // 0x0810(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D36[0x3];                                     // 0x0811(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0814(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3D37[0x4];                                     // 0x0824(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0828(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0830(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D38[0x7];                                     // 0x0839(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_StatusCharaChanger_C> K2Node_DynamicCast_AsBPI_Status_Chara_Changer;     // 0x0840(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0850(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_ScreenTransitionFadeType                    K2Node_Select_Default;                             // 0x0851(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D39[0x6];                                     // 0x0852(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0860(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIMovieCtrl_C>    K2Node_DynamicCast_AsBPI_UIMovie_Ctrl;             // 0x0868(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0878(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D3A[0x7];                                     // 0x0879(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x0880(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x0888(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_ResultTopCtrl_C>  K2Node_DynamicCast_AsBPI_Result_Top_Ctrl;          // 0x0890(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x08A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D3B[0x7];                                     // 0x08A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4; // 0x08A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_4;        // 0x08B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_LvUpEvent_C>      K2Node_DynamicCast_AsBPI_Lv_Up_Event;              // 0x08B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x08C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain) == 0x000010, "Wrong alignment on BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain");
static_assert(sizeof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain) == 0x0008D0, "Wrong size on BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, EntryPoint) == 0x000000, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_MakeTransform_ReturnValue_1) == 0x000040, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_LvUpEventStart_dummy) == 0x000070, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_LvUpEventStart_dummy' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_IsEndLvUpEvent_IsEnd) == 0x000071, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_IsEndLvUpEvent_IsEnd' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_ModelLoadReq_Return) == 0x000072, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_ModelLoadReq_Return' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_SwitchInteger_CmpSuccess) == 0x000073, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_IsEndCtrl_IsEnd) == 0x000074, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_IsEndCtrl_IsEnd' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, Temp_class_Variable) == 0x000078, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_ClassDynamicCast_AsActor) == 0x000080, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_ClassDynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_ClassDynamicCast_bSuccess) == 0x000088, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_Event_DeltaSeconds) == 0x00008C, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_GetMapID_ReturnValue) == 0x000090, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_GetMapID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000094, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_Get_ReturnValue) == 0x000098, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_CustomEvent_Loaded) == 0x0000A0, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_GetBGMScene_ReturnValue) == 0x0000A8, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_GetBGMScene_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_GetBGM_ReturnValue) == 0x0000B0, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_GetBGM_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue) == 0x0000B8, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000188, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_StatusCameraStart_Success) == 0x000189, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_StatusCameraStart_Success' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_InitializeLvUpEvent_Success) == 0x00018A, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_InitializeLvUpEvent_Success' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_StatusCameraEnd_Success) == 0x00018B, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_StatusCameraEnd_Success' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_ScreenTransition_isFadeFinish_outValue) == 0x00018C, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_ScreenTransition_isFadeFinish_outValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, Temp_class_Variable_1) == 0x000190, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_CloseUI_dummy) == 0x000198, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_CloseUI_dummy' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_ClassDynamicCast_AsActor_1) == 0x0001A0, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_ClassDynamicCast_AsActor_1' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_ClassDynamicCast_bSuccess_1) == 0x0001A8, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_ClassDynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_CloseUI_dummy_1) == 0x0001A9, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_CloseUI_dummy_1' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_CloseUI_dummy_2) == 0x0001AA, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_CloseUI_dummy_2' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_IsValid_ReturnValue) == 0x0001AB, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_SpawnComplete_complete) == 0x0001AC, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_SpawnComplete_complete' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_PopResultData_outResultData) == 0x0001B0, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_PopResultData_outResultData' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_CustomEvent_Loaded_1) == 0x000218, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_Init_success) == 0x000220, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_Init_success' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_GrowUpFromResultData_ExistLvUpChara) == 0x000221, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_GrowUpFromResultData_ExistLvUpChara' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_SpawnComplete_complete_1) == 0x000222, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_SpawnComplete_complete_1' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_IsInitialized_Complete) == 0x000223, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_IsInitialized_Complete' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_BooleanAND_ReturnValue) == 0x000224, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_PreLoadModel_Dummy) == 0x000225, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_PreLoadModel_Dummy' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, Temp_class_Variable_2) == 0x000228, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, Temp_int_Array_Index_Variable) == 0x000230, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_ClassDynamicCast_AsActor_2) == 0x000238, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_ClassDynamicCast_AsActor_2' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_ClassDynamicCast_bSuccess_2) == 0x000240, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_ClassDynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, Temp_bool_Variable) == 0x000241, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_GetGameMode_ReturnValue) == 0x000248, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_DynamicCast_AsBPI_Game_Mode) == 0x000250, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_DynamicCast_AsBPI_Game_Mode' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_DynamicCast_bSuccess) == 0x000260, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_GetMapID_ReturnValue_1) == 0x000264, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_GetMapID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_GetGameMode_ReturnValue_1) == 0x000268, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_CustomEvent_Loaded_2) == 0x000270, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_DynamicCast_AsBPI_Game_Mode_1) == 0x000278, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_DynamicCast_AsBPI_Game_Mode_1' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_DynamicCast_bSuccess_1) == 0x000288, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, Temp_int_Loop_Counter_Variable) == 0x00028C, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_Add_IntInt_ReturnValue) == 0x000290, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_MakeTransform_ReturnValue_2) == 0x0002A0, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_GetGameMode_ReturnValue_2) == 0x0002D0, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_GetGameMode_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_DynamicCast_AsBPI_Game_Mode_2) == 0x0002D8, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_DynamicCast_AsBPI_Game_Mode_2' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_DynamicCast_bSuccess_2) == 0x0002E8, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_GetPlayerController_ReturnValue) == 0x0002F0, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_IsValid_ReturnValue_1) == 0x0002F8, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_MakeTransform_ReturnValue_3) == 0x000300, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_MakeTransform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue_1) == 0x000330, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_GetGameMode_ReturnValue_3) == 0x000400, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_GetGameMode_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_DynamicCast_AsBPI_Game_Mode_3) == 0x000408, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_DynamicCast_AsBPI_Game_Mode_3' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_DynamicCast_bSuccess_3) == 0x000418, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000419, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_IsMapSystemBKLoadEnd_end) == 0x00041A, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_IsMapSystemBKLoadEnd_end' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00041B, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_ImmediateInit_dummy) == 0x00041C, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_ImmediateInit_dummy' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_IsMapSystemLevelLoadEnd_End) == 0x00041D, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_IsMapSystemLevelLoadEnd_End' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_GetGameMode_ReturnValue_4) == 0x000420, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_GetGameMode_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_DynamicCast_AsBPI_Game_Mode_4) == 0x000428, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_DynamicCast_AsBPI_Game_Mode_4' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_DynamicCast_bSuccess_4) == 0x000438, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_IsPlaying_isPlaying) == 0x000439, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_IsPlaying_isPlaying' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_GetGameMode_ReturnValue_5) == 0x000440, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_GetGameMode_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_DynamicCast_AsBPI_Game_Mode_5) == 0x000448, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_DynamicCast_AsBPI_Game_Mode_5' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_DynamicCast_bSuccess_5) == 0x000458, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_IsMapSystemHideEnd_End) == 0x000459, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_IsMapSystemHideEnd_End' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_SetTopDataObj_Success) == 0x00045A, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_SetTopDataObj_Success' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_StartTransitionOut_Dummy) == 0x00045B, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_StartTransitionOut_Dummy' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_IsEndTransitionOut_IsEnd) == 0x00045C, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_IsEndTransitionOut_IsEnd' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_StartCtrl_success) == 0x00045D, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_StartCtrl_success' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_GetFadeState_ReturnValue) == 0x00045E, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_GetFadeState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00045F, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_ReplaceFillScreen_success) == 0x000460, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_ReplaceFillScreen_success' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, Temp_class_Variable_3) == 0x000468, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::Temp_class_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_ClassDynamicCast_AsActor_3) == 0x000470, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_ClassDynamicCast_AsActor_3' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_ClassDynamicCast_bSuccess_3) == 0x000478, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_ClassDynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_CustomEvent_Loaded_3) == 0x000480, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_PopShowMouseCursor_ReturnValue) == 0x000488, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_PopShowMouseCursor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, Temp_class_Variable_4) == 0x0004A0, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::Temp_class_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_ClassDynamicCast_AsActor_4) == 0x0004A8, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_ClassDynamicCast_AsActor_4' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_ClassDynamicCast_bSuccess_4) == 0x0004B0, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_ClassDynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_GetGardenTalkPointManager_ReturnValue) == 0x0004B8, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_GetGardenTalkPointManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, Temp_class_Variable_5) == 0x0004C0, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::Temp_class_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_ClassDynamicCast_AsActor_5) == 0x0004C8, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_ClassDynamicCast_AsActor_5' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_ClassDynamicCast_bSuccess_5) == 0x0004D0, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_ClassDynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_CustomEvent_Loaded_4) == 0x0004D8, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_CustomEvent_Loaded_4' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_SetDelayInInit_Dummy) == 0x0004E0, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_SetDelayInInit_Dummy' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_GetMapCommon_rerutn) == 0x0004E8, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_GetAllActorsWithTag_OutActors) == 0x0004F0, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_DynamicCast_AsBPI_Map_Common) == 0x000500, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_DynamicCast_bSuccess_6) == 0x000510, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_Array_Get_Item) == 0x000518, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_DynamicCast_AsBPI_Env_Ctrl) == 0x000520, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_DynamicCast_AsBPI_Env_Ctrl' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_DynamicCast_bSuccess_7) == 0x000530, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_Array_Length_ReturnValue) == 0x000534, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_Less_IntInt_ReturnValue) == 0x000538, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_CustomEvent_Loaded_5) == 0x000540, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_CustomEvent_Loaded_5' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_MakeTransform_ReturnValue_4) == 0x000550, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_MakeTransform_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_ClearWidgetAndActor_Finished) == 0x000580, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_ClearWidgetAndActor_Finished' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000588, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_FinishSpawningActor_ReturnValue) == 0x000590, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue_2) == 0x000598, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_CreateInitializedJoinData_ReturnValue) == 0x000668, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_CreateInitializedJoinData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_SetFieldsInStruct_StructOut) == 0x000678, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x0006E0, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, Temp_bool_Variable_1) == 0x0006E1, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain, K2Node_CreateDelegate_OutputDelegate) == 0x0006E4, "Member 'BP_ResultMain_C_ExecuteUbergraph_BP_ResultMain::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
