#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ScreenFade

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BP_ScreenFade.BP_ScreenFade_C.ExecuteUbergraph_BP_ScreenFade
// 0x0004 (0x0004 - 0x0000)
struct BP_ScreenFade_C_ExecuteUbergraph_BP_ScreenFade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ScreenFade_C_ExecuteUbergraph_BP_ScreenFade) == 0x000004, "Wrong alignment on BP_ScreenFade_C_ExecuteUbergraph_BP_ScreenFade");
static_assert(sizeof(BP_ScreenFade_C_ExecuteUbergraph_BP_ScreenFade) == 0x000004, "Wrong size on BP_ScreenFade_C_ExecuteUbergraph_BP_ScreenFade");
static_assert(offsetof(BP_ScreenFade_C_ExecuteUbergraph_BP_ScreenFade, EntryPoint) == 0x000000, "Member 'BP_ScreenFade_C_ExecuteUbergraph_BP_ScreenFade::EntryPoint' has a wrong offset!");

// Function BP_ScreenFade.BP_ScreenFade_C.GetWBScreenFade
// 0x0048 (0x0048 - 0x0000)
struct BP_ScreenFade_C_GetWBScreenFade final
{
public:
	bool                                          IsCreate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BCA[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ScreenFade_C*                       Widget;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BCB[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BPI_GetScreenFadeWidget_Obj;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ScreenFade_C*                       K2Node_DynamicCast_AsWB_Screen_Fade;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ScreenFade_C_GetWBScreenFade) == 0x000008, "Wrong alignment on BP_ScreenFade_C_GetWBScreenFade");
static_assert(sizeof(BP_ScreenFade_C_GetWBScreenFade) == 0x000048, "Wrong size on BP_ScreenFade_C_GetWBScreenFade");
static_assert(offsetof(BP_ScreenFade_C_GetWBScreenFade, IsCreate) == 0x000000, "Member 'BP_ScreenFade_C_GetWBScreenFade::IsCreate' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_GetWBScreenFade, Widget) == 0x000008, "Member 'BP_ScreenFade_C_GetWBScreenFade::Widget' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_GetWBScreenFade, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BP_ScreenFade_C_GetWBScreenFade::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_GetWBScreenFade, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BP_ScreenFade_C_GetWBScreenFade::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_GetWBScreenFade, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_ScreenFade_C_GetWBScreenFade::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_GetWBScreenFade, CallFunc_BPI_GetScreenFadeWidget_Obj) == 0x000030, "Member 'BP_ScreenFade_C_GetWBScreenFade::CallFunc_BPI_GetScreenFadeWidget_Obj' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_GetWBScreenFade, K2Node_DynamicCast_AsWB_Screen_Fade) == 0x000038, "Member 'BP_ScreenFade_C_GetWBScreenFade::K2Node_DynamicCast_AsWB_Screen_Fade' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_GetWBScreenFade, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_ScreenFade_C_GetWBScreenFade::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_ScreenFade.BP_ScreenFade_C.IsFadeOut
// 0x0018 (0x0018 - 0x0000)
struct BP_ScreenFade_C_IsFadeOut final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BCC[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ScreenFade_C*                       CallFunc_GetWBScreenFade_Widget;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ScreenFade_C_IsFadeOut) == 0x000008, "Wrong alignment on BP_ScreenFade_C_IsFadeOut");
static_assert(sizeof(BP_ScreenFade_C_IsFadeOut) == 0x000018, "Wrong size on BP_ScreenFade_C_IsFadeOut");
static_assert(offsetof(BP_ScreenFade_C_IsFadeOut, ReturnValue) == 0x000000, "Member 'BP_ScreenFade_C_IsFadeOut::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_IsFadeOut, CallFunc_GetWBScreenFade_Widget) == 0x000008, "Member 'BP_ScreenFade_C_IsFadeOut::CallFunc_GetWBScreenFade_Widget' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_IsFadeOut, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_ScreenFade_C_IsFadeOut::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_IsFadeOut, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'BP_ScreenFade_C_IsFadeOut::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_ScreenFade.BP_ScreenFade_C.IsFadeIn
// 0x0018 (0x0018 - 0x0000)
struct BP_ScreenFade_C_IsFadeIn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BCD[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ScreenFade_C*                       CallFunc_GetWBScreenFade_Widget;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ScreenFade_C_IsFadeIn) == 0x000008, "Wrong alignment on BP_ScreenFade_C_IsFadeIn");
static_assert(sizeof(BP_ScreenFade_C_IsFadeIn) == 0x000018, "Wrong size on BP_ScreenFade_C_IsFadeIn");
static_assert(offsetof(BP_ScreenFade_C_IsFadeIn, ReturnValue) == 0x000000, "Member 'BP_ScreenFade_C_IsFadeIn::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_IsFadeIn, CallFunc_GetWBScreenFade_Widget) == 0x000008, "Member 'BP_ScreenFade_C_IsFadeIn::CallFunc_GetWBScreenFade_Widget' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_IsFadeIn, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'BP_ScreenFade_C_IsFadeIn::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_IsFadeIn, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'BP_ScreenFade_C_IsFadeIn::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_ScreenFade.BP_ScreenFade_C.IsFadeAnim
// 0x0018 (0x0018 - 0x0000)
struct BP_ScreenFade_C_IsFadeAnim final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BCE[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ScreenFade_C*                       CallFunc_GetWBScreenFade_Widget;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ScreenFade_C_IsFadeAnim) == 0x000008, "Wrong alignment on BP_ScreenFade_C_IsFadeAnim");
static_assert(sizeof(BP_ScreenFade_C_IsFadeAnim) == 0x000018, "Wrong size on BP_ScreenFade_C_IsFadeAnim");
static_assert(offsetof(BP_ScreenFade_C_IsFadeAnim, ReturnValue) == 0x000000, "Member 'BP_ScreenFade_C_IsFadeAnim::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_IsFadeAnim, CallFunc_GetWBScreenFade_Widget) == 0x000008, "Member 'BP_ScreenFade_C_IsFadeAnim::CallFunc_GetWBScreenFade_Widget' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_IsFadeAnim, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'BP_ScreenFade_C_IsFadeAnim::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_IsFadeAnim, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'BP_ScreenFade_C_IsFadeAnim::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_IsFadeAnim, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000012, "Member 'BP_ScreenFade_C_IsFadeAnim::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_IsFadeAnim, CallFunc_BooleanOR_ReturnValue) == 0x000013, "Member 'BP_ScreenFade_C_IsFadeAnim::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_ScreenFade.BP_ScreenFade_C.GetFadeState
// 0x0018 (0x0018 - 0x0000)
struct BP_ScreenFade_C_GetFadeState final
{
public:
	E_UI_FADE_STATE                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BCF[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ScreenFade_C*                       CallFunc_GetWBScreenFade_Widget;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ScreenFade_C_GetFadeState) == 0x000008, "Wrong alignment on BP_ScreenFade_C_GetFadeState");
static_assert(sizeof(BP_ScreenFade_C_GetFadeState) == 0x000018, "Wrong size on BP_ScreenFade_C_GetFadeState");
static_assert(offsetof(BP_ScreenFade_C_GetFadeState, ReturnValue) == 0x000000, "Member 'BP_ScreenFade_C_GetFadeState::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_GetFadeState, CallFunc_GetWBScreenFade_Widget) == 0x000008, "Member 'BP_ScreenFade_C_GetFadeState::CallFunc_GetWBScreenFade_Widget' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_GetFadeState, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'BP_ScreenFade_C_GetFadeState::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_ScreenFade.BP_ScreenFade_C.FadeIn
// 0x0030 (0x0030 - 0x0000)
struct BP_ScreenFade_C_FadeIn final
{
public:
	struct FColor                                 Color;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInterrupt;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BD0[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BD1[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ScreenFade_C*                       CallFunc_GetWBScreenFade_Widget;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ScreenFade_C_FadeIn) == 0x000008, "Wrong alignment on BP_ScreenFade_C_FadeIn");
static_assert(sizeof(BP_ScreenFade_C_FadeIn) == 0x000030, "Wrong size on BP_ScreenFade_C_FadeIn");
static_assert(offsetof(BP_ScreenFade_C_FadeIn, Color) == 0x000000, "Member 'BP_ScreenFade_C_FadeIn::Color' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_FadeIn, Time) == 0x000004, "Member 'BP_ScreenFade_C_FadeIn::Time' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_FadeIn, IsInterrupt) == 0x000008, "Member 'BP_ScreenFade_C_FadeIn::IsInterrupt' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_FadeIn, ReturnValue) == 0x000009, "Member 'BP_ScreenFade_C_FadeIn::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_FadeIn, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x00000C, "Member 'BP_ScreenFade_C_FadeIn::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_FadeIn, CallFunc_GetWBScreenFade_Widget) == 0x000020, "Member 'BP_ScreenFade_C_FadeIn::CallFunc_GetWBScreenFade_Widget' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_FadeIn, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_ScreenFade_C_FadeIn::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_ScreenFade.BP_ScreenFade_C.FadeOut
// 0x0030 (0x0030 - 0x0000)
struct BP_ScreenFade_C_FadeOut final
{
public:
	struct FColor                                 Color;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInterrupt;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BD2[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BD3[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ScreenFade_C*                       CallFunc_GetWBScreenFade_Widget;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ScreenFade_C_FadeOut) == 0x000008, "Wrong alignment on BP_ScreenFade_C_FadeOut");
static_assert(sizeof(BP_ScreenFade_C_FadeOut) == 0x000030, "Wrong size on BP_ScreenFade_C_FadeOut");
static_assert(offsetof(BP_ScreenFade_C_FadeOut, Color) == 0x000000, "Member 'BP_ScreenFade_C_FadeOut::Color' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_FadeOut, Time) == 0x000004, "Member 'BP_ScreenFade_C_FadeOut::Time' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_FadeOut, IsInterrupt) == 0x000008, "Member 'BP_ScreenFade_C_FadeOut::IsInterrupt' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_FadeOut, ReturnValue) == 0x000009, "Member 'BP_ScreenFade_C_FadeOut::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_FadeOut, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x00000C, "Member 'BP_ScreenFade_C_FadeOut::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_FadeOut, CallFunc_GetWBScreenFade_Widget) == 0x000020, "Member 'BP_ScreenFade_C_FadeOut::CallFunc_GetWBScreenFade_Widget' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_FadeOut, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_ScreenFade_C_FadeOut::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_ScreenFade.BP_ScreenFade_C.FadeClear
// 0x0018 (0x0018 - 0x0000)
struct BP_ScreenFade_C_FadeClear final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BD4[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ScreenFade_C*                       CallFunc_GetWBScreenFade_Widget;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ScreenFade_C_FadeClear) == 0x000008, "Wrong alignment on BP_ScreenFade_C_FadeClear");
static_assert(sizeof(BP_ScreenFade_C_FadeClear) == 0x000018, "Wrong size on BP_ScreenFade_C_FadeClear");
static_assert(offsetof(BP_ScreenFade_C_FadeClear, ReturnValue) == 0x000000, "Member 'BP_ScreenFade_C_FadeClear::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_FadeClear, CallFunc_GetWBScreenFade_Widget) == 0x000008, "Member 'BP_ScreenFade_C_FadeClear::CallFunc_GetWBScreenFade_Widget' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_FadeClear, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_ScreenFade_C_FadeClear::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_ScreenFade.BP_ScreenFade_C.IsFadePaused
// 0x0018 (0x0018 - 0x0000)
struct BP_ScreenFade_C_IsFadePaused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BD5[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ScreenFade_C*                       CallFunc_GetWBScreenFade_Widget;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsPaused_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ScreenFade_C_IsFadePaused) == 0x000008, "Wrong alignment on BP_ScreenFade_C_IsFadePaused");
static_assert(sizeof(BP_ScreenFade_C_IsFadePaused) == 0x000018, "Wrong size on BP_ScreenFade_C_IsFadePaused");
static_assert(offsetof(BP_ScreenFade_C_IsFadePaused, ReturnValue) == 0x000000, "Member 'BP_ScreenFade_C_IsFadePaused::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_IsFadePaused, CallFunc_GetWBScreenFade_Widget) == 0x000008, "Member 'BP_ScreenFade_C_IsFadePaused::CallFunc_GetWBScreenFade_Widget' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_IsFadePaused, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_ScreenFade_C_IsFadePaused::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_IsFadePaused, CallFunc_GetIsPaused_ReturnValue) == 0x000011, "Member 'BP_ScreenFade_C_IsFadePaused::CallFunc_GetIsPaused_ReturnValue' has a wrong offset!");

// Function BP_ScreenFade.BP_ScreenFade_C.SetFadePaused
// 0x0018 (0x0018 - 0x0000)
struct BP_ScreenFade_C_SetFadePaused final
{
public:
	bool                                          Sw;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BD6[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ScreenFade_C*                       CallFunc_GetWBScreenFade_Widget;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ScreenFade_C_SetFadePaused) == 0x000008, "Wrong alignment on BP_ScreenFade_C_SetFadePaused");
static_assert(sizeof(BP_ScreenFade_C_SetFadePaused) == 0x000018, "Wrong size on BP_ScreenFade_C_SetFadePaused");
static_assert(offsetof(BP_ScreenFade_C_SetFadePaused, Sw) == 0x000000, "Member 'BP_ScreenFade_C_SetFadePaused::Sw' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_SetFadePaused, ReturnValue) == 0x000001, "Member 'BP_ScreenFade_C_SetFadePaused::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_SetFadePaused, CallFunc_GetWBScreenFade_Widget) == 0x000008, "Member 'BP_ScreenFade_C_SetFadePaused::CallFunc_GetWBScreenFade_Widget' has a wrong offset!");
static_assert(offsetof(BP_ScreenFade_C_SetFadePaused, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_ScreenFade_C_SetFadePaused::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

