#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StatueLvUp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_EventMissionBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StatueLvUp.BP_StatueLvUp_C
// 0x0060 (0x0380 - 0x0320)
class ABP_StatueLvUp_C final : public ABP_EventMissionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_StatueLvUp_C;                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDecalComponent*                        Decal;                                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Cm_404_000;                                        // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneEmitter;                                      // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectIndex;                                       // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StatueFlagFirst;                                   // 0x0344(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StatueFlagFinish;                                  // 0x034C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CB8[0x4];                                     // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               SpawenEmitter;                                     // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MessageAsset;                                      // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventStatueLvUp_C*                  StatueLvUp;                                        // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        SpawnDecal;                                        // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SetFlag_CheckStatue;                               // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_StatueLvUp(int32 EntryPoint);
	void EndStatueEvent();
	void QuestExecute();
	void ReceiveBeginPlay();
	void CallDeactivate();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_StatueLvUp_C">();
	}
	static class ABP_StatueLvUp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_StatueLvUp_C>();
	}
};
static_assert(alignof(ABP_StatueLvUp_C) == 0x000008, "Wrong alignment on ABP_StatueLvUp_C");
static_assert(sizeof(ABP_StatueLvUp_C) == 0x000380, "Wrong size on ABP_StatueLvUp_C");
static_assert(offsetof(ABP_StatueLvUp_C, UberGraphFrame_BP_StatueLvUp_C) == 0x000320, "Member 'ABP_StatueLvUp_C::UberGraphFrame_BP_StatueLvUp_C' has a wrong offset!");
static_assert(offsetof(ABP_StatueLvUp_C, Decal) == 0x000328, "Member 'ABP_StatueLvUp_C::Decal' has a wrong offset!");
static_assert(offsetof(ABP_StatueLvUp_C, Cm_404_000) == 0x000330, "Member 'ABP_StatueLvUp_C::Cm_404_000' has a wrong offset!");
static_assert(offsetof(ABP_StatueLvUp_C, SceneEmitter) == 0x000338, "Member 'ABP_StatueLvUp_C::SceneEmitter' has a wrong offset!");
static_assert(offsetof(ABP_StatueLvUp_C, SelectIndex) == 0x000340, "Member 'ABP_StatueLvUp_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(ABP_StatueLvUp_C, StatueFlagFirst) == 0x000344, "Member 'ABP_StatueLvUp_C::StatueFlagFirst' has a wrong offset!");
static_assert(offsetof(ABP_StatueLvUp_C, StatueFlagFinish) == 0x00034C, "Member 'ABP_StatueLvUp_C::StatueFlagFinish' has a wrong offset!");
static_assert(offsetof(ABP_StatueLvUp_C, SpawenEmitter) == 0x000358, "Member 'ABP_StatueLvUp_C::SpawenEmitter' has a wrong offset!");
static_assert(offsetof(ABP_StatueLvUp_C, MessageAsset) == 0x000360, "Member 'ABP_StatueLvUp_C::MessageAsset' has a wrong offset!");
static_assert(offsetof(ABP_StatueLvUp_C, StatueLvUp) == 0x000368, "Member 'ABP_StatueLvUp_C::StatueLvUp' has a wrong offset!");
static_assert(offsetof(ABP_StatueLvUp_C, SpawnDecal) == 0x000370, "Member 'ABP_StatueLvUp_C::SpawnDecal' has a wrong offset!");
static_assert(offsetof(ABP_StatueLvUp_C, SetFlag_CheckStatue) == 0x000378, "Member 'ABP_StatueLvUp_C::SetFlag_CheckStatue' has a wrong offset!");

}

