#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillSearchSortCtrl

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_SORTWINDOW_ANIM_STATE_structs.hpp"
#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BP_SkillSearchSortCtrl.BP_SkillSearchSortCtrl_C.ExecuteUbergraph_BP_SkillSearchSortCtrl
// 0x0040 (0x0040 - 0x0000)
struct BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsSkipAnimation_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsSkipAnimation;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_CATEGORY_CURSOR_MOVE_DIRECTION              K2Node_Event_InChangeDirection;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InCursorIndex;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InScrollOffset;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsISkipListIn;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_6;                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_5;                           // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_4;                           // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_3;                           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_2;                           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_1;                           // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8026[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InScrollNum;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsPlaySE;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8027[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InElementIdx;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8028[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ElementCategory_C*                  CallFunc_GetCategoryWidget_CategoryWidget;         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_SortWindow2_C*                      CallFunc_GetSortWindowWidget_SortWindowWidget;     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue;              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl) == 0x000008, "Wrong alignment on BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl");
static_assert(sizeof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl) == 0x000040, "Wrong size on BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl, EntryPoint) == 0x000000, "Member 'BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl, CallFunc_IsInViewport_ReturnValue) == 0x000004, "Member 'BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl, K2Node_Event_IsSkipAnimation_1) == 0x000005, "Member 'BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl::K2Node_Event_IsSkipAnimation_1' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl, K2Node_Event_IsSkipAnimation) == 0x000006, "Member 'BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl::K2Node_Event_IsSkipAnimation' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl, K2Node_Event_InChangeDirection) == 0x000007, "Member 'BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl::K2Node_Event_InChangeDirection' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl, K2Node_Event_InCursorIndex) == 0x000008, "Member 'BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl::K2Node_Event_InCursorIndex' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl, K2Node_Event_InScrollOffset) == 0x00000C, "Member 'BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl::K2Node_Event_InScrollOffset' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl, K2Node_Event_IsISkipListIn) == 0x000010, "Member 'BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl::K2Node_Event_IsISkipListIn' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl, K2Node_Event_IsPlaySE_6) == 0x000011, "Member 'BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl::K2Node_Event_IsPlaySE_6' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl, K2Node_Event_IsPlaySE_5) == 0x000012, "Member 'BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl::K2Node_Event_IsPlaySE_5' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl, K2Node_Event_IsPlaySE_4) == 0x000013, "Member 'BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl::K2Node_Event_IsPlaySE_4' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl, K2Node_Event_IsPlaySE_3) == 0x000014, "Member 'BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl::K2Node_Event_IsPlaySE_3' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl, K2Node_Event_IsPlaySE_2) == 0x000015, "Member 'BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl::K2Node_Event_IsPlaySE_2' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl, K2Node_Event_IsPlaySE_1) == 0x000016, "Member 'BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl::K2Node_Event_IsPlaySE_1' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl, K2Node_Event_InScrollNum) == 0x000018, "Member 'BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl::K2Node_Event_InScrollNum' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl, K2Node_Event_IsPlaySE) == 0x00001C, "Member 'BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl::K2Node_Event_IsPlaySE' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl, K2Node_Event_InElementIdx) == 0x000020, "Member 'BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl::K2Node_Event_InElementIdx' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl, K2Node_Event_EndPlayReason) == 0x000024, "Member 'BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl, CallFunc_GetCategoryWidget_CategoryWidget) == 0x000028, "Member 'BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl::CallFunc_GetCategoryWidget_CategoryWidget' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl, CallFunc_GetSortWindowWidget_SortWindowWidget) == 0x000030, "Member 'BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl::CallFunc_GetSortWindowWidget_SortWindowWidget' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl, CallFunc_AddToWidgetPrio_ReturnValue) == 0x00003C, "Member 'BP_SkillSearchSortCtrl_C_ExecuteUbergraph_BP_SkillSearchSortCtrl::CallFunc_AddToWidgetPrio_ReturnValue' has a wrong offset!");

// Function BP_SkillSearchSortCtrl.BP_SkillSearchSortCtrl_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SkillSearchSortCtrl_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillSearchSortCtrl_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SkillSearchSortCtrl_C_ReceiveTick");
static_assert(sizeof(BP_SkillSearchSortCtrl_C_ReceiveTick) == 0x000004, "Wrong size on BP_SkillSearchSortCtrl_C_ReceiveTick");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SkillSearchSortCtrl_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SkillSearchSortCtrl.BP_SkillSearchSortCtrl_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_SkillSearchSortCtrl_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillSearchSortCtrl_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_SkillSearchSortCtrl_C_ReceiveEndPlay");
static_assert(sizeof(BP_SkillSearchSortCtrl_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_SkillSearchSortCtrl_C_ReceiveEndPlay");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_SkillSearchSortCtrl_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_SkillSearchSortCtrl.BP_SkillSearchSortCtrl_C.BPI_TabSet
// 0x0004 (0x0004 - 0x0000)
struct BP_SkillSearchSortCtrl_C_BPI_TabSet final
{
public:
	int32                                         InElementIdx;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillSearchSortCtrl_C_BPI_TabSet) == 0x000004, "Wrong alignment on BP_SkillSearchSortCtrl_C_BPI_TabSet");
static_assert(sizeof(BP_SkillSearchSortCtrl_C_BPI_TabSet) == 0x000004, "Wrong size on BP_SkillSearchSortCtrl_C_BPI_TabSet");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_BPI_TabSet, InElementIdx) == 0x000000, "Member 'BP_SkillSearchSortCtrl_C_BPI_TabSet::InElementIdx' has a wrong offset!");

// Function BP_SkillSearchSortCtrl.BP_SkillSearchSortCtrl_C.BPI_ScrollList
// 0x0008 (0x0008 - 0x0000)
struct BP_SkillSearchSortCtrl_C_BPI_ScrollList final
{
public:
	int32                                         InScrollNum;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlaySE;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SkillSearchSortCtrl_C_BPI_ScrollList) == 0x000004, "Wrong alignment on BP_SkillSearchSortCtrl_C_BPI_ScrollList");
static_assert(sizeof(BP_SkillSearchSortCtrl_C_BPI_ScrollList) == 0x000008, "Wrong size on BP_SkillSearchSortCtrl_C_BPI_ScrollList");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_BPI_ScrollList, InScrollNum) == 0x000000, "Member 'BP_SkillSearchSortCtrl_C_BPI_ScrollList::InScrollNum' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_BPI_ScrollList, IsPlaySE) == 0x000004, "Member 'BP_SkillSearchSortCtrl_C_BPI_ScrollList::IsPlaySE' has a wrong offset!");

// Function BP_SkillSearchSortCtrl.BP_SkillSearchSortCtrl_C.BPI_CheckMouseWheel
// 0x0001 (0x0001 - 0x0000)
struct BP_SkillSearchSortCtrl_C_BPI_CheckMouseWheel final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SkillSearchSortCtrl_C_BPI_CheckMouseWheel) == 0x000001, "Wrong alignment on BP_SkillSearchSortCtrl_C_BPI_CheckMouseWheel");
static_assert(sizeof(BP_SkillSearchSortCtrl_C_BPI_CheckMouseWheel) == 0x000001, "Wrong size on BP_SkillSearchSortCtrl_C_BPI_CheckMouseWheel");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_BPI_CheckMouseWheel, IsPlaySE) == 0x000000, "Member 'BP_SkillSearchSortCtrl_C_BPI_CheckMouseWheel::IsPlaySE' has a wrong offset!");

// Function BP_SkillSearchSortCtrl.BP_SkillSearchSortCtrl_C.BPI_Page_Down
// 0x0001 (0x0001 - 0x0000)
struct BP_SkillSearchSortCtrl_C_BPI_Page_Down final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SkillSearchSortCtrl_C_BPI_Page_Down) == 0x000001, "Wrong alignment on BP_SkillSearchSortCtrl_C_BPI_Page_Down");
static_assert(sizeof(BP_SkillSearchSortCtrl_C_BPI_Page_Down) == 0x000001, "Wrong size on BP_SkillSearchSortCtrl_C_BPI_Page_Down");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_BPI_Page_Down, IsPlaySE) == 0x000000, "Member 'BP_SkillSearchSortCtrl_C_BPI_Page_Down::IsPlaySE' has a wrong offset!");

// Function BP_SkillSearchSortCtrl.BP_SkillSearchSortCtrl_C.BPI_Page_UP
// 0x0001 (0x0001 - 0x0000)
struct BP_SkillSearchSortCtrl_C_BPI_Page_UP final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SkillSearchSortCtrl_C_BPI_Page_UP) == 0x000001, "Wrong alignment on BP_SkillSearchSortCtrl_C_BPI_Page_UP");
static_assert(sizeof(BP_SkillSearchSortCtrl_C_BPI_Page_UP) == 0x000001, "Wrong size on BP_SkillSearchSortCtrl_C_BPI_Page_UP");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_BPI_Page_UP, IsPlaySE) == 0x000000, "Member 'BP_SkillSearchSortCtrl_C_BPI_Page_UP::IsPlaySE' has a wrong offset!");

// Function BP_SkillSearchSortCtrl.BP_SkillSearchSortCtrl_C.BPI_CursorMove_Down
// 0x0001 (0x0001 - 0x0000)
struct BP_SkillSearchSortCtrl_C_BPI_CursorMove_Down final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SkillSearchSortCtrl_C_BPI_CursorMove_Down) == 0x000001, "Wrong alignment on BP_SkillSearchSortCtrl_C_BPI_CursorMove_Down");
static_assert(sizeof(BP_SkillSearchSortCtrl_C_BPI_CursorMove_Down) == 0x000001, "Wrong size on BP_SkillSearchSortCtrl_C_BPI_CursorMove_Down");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_BPI_CursorMove_Down, IsPlaySE) == 0x000000, "Member 'BP_SkillSearchSortCtrl_C_BPI_CursorMove_Down::IsPlaySE' has a wrong offset!");

// Function BP_SkillSearchSortCtrl.BP_SkillSearchSortCtrl_C.BPI_CursorMove_Up
// 0x0001 (0x0001 - 0x0000)
struct BP_SkillSearchSortCtrl_C_BPI_CursorMove_Up final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SkillSearchSortCtrl_C_BPI_CursorMove_Up) == 0x000001, "Wrong alignment on BP_SkillSearchSortCtrl_C_BPI_CursorMove_Up");
static_assert(sizeof(BP_SkillSearchSortCtrl_C_BPI_CursorMove_Up) == 0x000001, "Wrong size on BP_SkillSearchSortCtrl_C_BPI_CursorMove_Up");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_BPI_CursorMove_Up, IsPlaySE) == 0x000000, "Member 'BP_SkillSearchSortCtrl_C_BPI_CursorMove_Up::IsPlaySE' has a wrong offset!");

// Function BP_SkillSearchSortCtrl.BP_SkillSearchSortCtrl_C.BPI_SetCursorAndOffset
// 0x000C (0x000C - 0x0000)
struct BP_SkillSearchSortCtrl_C_BPI_SetCursorAndOffset final
{
public:
	int32                                         InCursorIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InScrollOffset;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsISkipListIn;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsPlaySE;                                          // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SkillSearchSortCtrl_C_BPI_SetCursorAndOffset) == 0x000004, "Wrong alignment on BP_SkillSearchSortCtrl_C_BPI_SetCursorAndOffset");
static_assert(sizeof(BP_SkillSearchSortCtrl_C_BPI_SetCursorAndOffset) == 0x00000C, "Wrong size on BP_SkillSearchSortCtrl_C_BPI_SetCursorAndOffset");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_BPI_SetCursorAndOffset, InCursorIndex) == 0x000000, "Member 'BP_SkillSearchSortCtrl_C_BPI_SetCursorAndOffset::InCursorIndex' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_BPI_SetCursorAndOffset, InScrollOffset) == 0x000004, "Member 'BP_SkillSearchSortCtrl_C_BPI_SetCursorAndOffset::InScrollOffset' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_BPI_SetCursorAndOffset, IsISkipListIn) == 0x000008, "Member 'BP_SkillSearchSortCtrl_C_BPI_SetCursorAndOffset::IsISkipListIn' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_BPI_SetCursorAndOffset, IsPlaySE) == 0x000009, "Member 'BP_SkillSearchSortCtrl_C_BPI_SetCursorAndOffset::IsPlaySE' has a wrong offset!");

// Function BP_SkillSearchSortCtrl.BP_SkillSearchSortCtrl_C.BPI_TabChange
// 0x0001 (0x0001 - 0x0000)
struct BP_SkillSearchSortCtrl_C_BPI_TabChange final
{
public:
	E_CATEGORY_CURSOR_MOVE_DIRECTION              InChangeDirection;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillSearchSortCtrl_C_BPI_TabChange) == 0x000001, "Wrong alignment on BP_SkillSearchSortCtrl_C_BPI_TabChange");
static_assert(sizeof(BP_SkillSearchSortCtrl_C_BPI_TabChange) == 0x000001, "Wrong size on BP_SkillSearchSortCtrl_C_BPI_TabChange");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_BPI_TabChange, InChangeDirection) == 0x000000, "Member 'BP_SkillSearchSortCtrl_C_BPI_TabChange::InChangeDirection' has a wrong offset!");

// Function BP_SkillSearchSortCtrl.BP_SkillSearchSortCtrl_C.BPI_CloseWindow
// 0x0001 (0x0001 - 0x0000)
struct BP_SkillSearchSortCtrl_C_BPI_CloseWindow final
{
public:
	bool                                          IsSkipAnimation;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SkillSearchSortCtrl_C_BPI_CloseWindow) == 0x000001, "Wrong alignment on BP_SkillSearchSortCtrl_C_BPI_CloseWindow");
static_assert(sizeof(BP_SkillSearchSortCtrl_C_BPI_CloseWindow) == 0x000001, "Wrong size on BP_SkillSearchSortCtrl_C_BPI_CloseWindow");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_BPI_CloseWindow, IsSkipAnimation) == 0x000000, "Member 'BP_SkillSearchSortCtrl_C_BPI_CloseWindow::IsSkipAnimation' has a wrong offset!");

// Function BP_SkillSearchSortCtrl.BP_SkillSearchSortCtrl_C.BPI_OpenWindow
// 0x0001 (0x0001 - 0x0000)
struct BP_SkillSearchSortCtrl_C_BPI_OpenWindow final
{
public:
	bool                                          IsSkipAnimation;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SkillSearchSortCtrl_C_BPI_OpenWindow) == 0x000001, "Wrong alignment on BP_SkillSearchSortCtrl_C_BPI_OpenWindow");
static_assert(sizeof(BP_SkillSearchSortCtrl_C_BPI_OpenWindow) == 0x000001, "Wrong size on BP_SkillSearchSortCtrl_C_BPI_OpenWindow");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_BPI_OpenWindow, IsSkipAnimation) == 0x000000, "Member 'BP_SkillSearchSortCtrl_C_BPI_OpenWindow::IsSkipAnimation' has a wrong offset!");

// Function BP_SkillSearchSortCtrl.BP_SkillSearchSortCtrl_C.Init
// 0x0010 (0x0010 - 0x0000)
struct BP_SkillSearchSortCtrl_C_Init final
{
public:
	class UWB_SkillSearchSort_C*                  CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SkillSearchSortCtrl_C_Init) == 0x000008, "Wrong alignment on BP_SkillSearchSortCtrl_C_Init");
static_assert(sizeof(BP_SkillSearchSortCtrl_C_Init) == 0x000010, "Wrong size on BP_SkillSearchSortCtrl_C_Init");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_Init, CallFunc_Create_ReturnValue) == 0x000000, "Member 'BP_SkillSearchSortCtrl_C_Init::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_Init, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_SkillSearchSortCtrl_C_Init::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_SkillSearchSortCtrl.BP_SkillSearchSortCtrl_C.End
// 0x0018 (0x0018 - 0x0000)
struct BP_SkillSearchSortCtrl_C_End final
{
public:
	class UWB_SortWindow2_C*                      CallFunc_GetSortWindowWidget_SortWindowWidget;     // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ElementCategory_C*                  CallFunc_GetCategoryWidget_CategoryWidget;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SkillSearchSortCtrl_C_End) == 0x000008, "Wrong alignment on BP_SkillSearchSortCtrl_C_End");
static_assert(sizeof(BP_SkillSearchSortCtrl_C_End) == 0x000018, "Wrong size on BP_SkillSearchSortCtrl_C_End");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_End, CallFunc_GetSortWindowWidget_SortWindowWidget) == 0x000000, "Member 'BP_SkillSearchSortCtrl_C_End::CallFunc_GetSortWindowWidget_SortWindowWidget' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_End, CallFunc_GetCategoryWidget_CategoryWidget) == 0x000008, "Member 'BP_SkillSearchSortCtrl_C_End::CallFunc_GetCategoryWidget_CategoryWidget' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_End, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_SkillSearchSortCtrl_C_End::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_End, CallFunc_IsInViewport_ReturnValue) == 0x000011, "Member 'BP_SkillSearchSortCtrl_C_End::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");

// Function BP_SkillSearchSortCtrl.BP_SkillSearchSortCtrl_C.SetupCursorParam
// 0x0068 (0x0068 - 0x0000)
struct BP_SkillSearchSortCtrl_C_SetupCursorParam final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSearchSkillNum_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotDrawNum_SlotNum;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUtsusemiSortSkillId_ReturnValue;       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_GetSearchSkillIDList_ReturnValue;         // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetSearchSkillNum_ReturnValue_1;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8029[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_802A[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSearchSkillNum_ReturnValue_2;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_802B[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSlotDrawNum_SlotNum_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_802C[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_802D[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillSearchSortCtrl_C_SetupCursorParam) == 0x000008, "Wrong alignment on BP_SkillSearchSortCtrl_C_SetupCursorParam");
static_assert(sizeof(BP_SkillSearchSortCtrl_C_SetupCursorParam) == 0x000068, "Wrong size on BP_SkillSearchSortCtrl_C_SetupCursorParam");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, Temp_int_Variable) == 0x000000, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, CallFunc_GetSearchSkillNum_ReturnValue) == 0x000004, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::CallFunc_GetSearchSkillNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, CallFunc_GetSlotDrawNum_SlotNum) == 0x00000C, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::CallFunc_GetSlotDrawNum_SlotNum' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, CallFunc_GetUtsusemiSortSkillId_ReturnValue) == 0x000014, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::CallFunc_GetUtsusemiSortSkillId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, CallFunc_Max_ReturnValue) == 0x000018, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, Temp_int_Variable_1) == 0x00001C, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, CallFunc_GetSearchSkillIDList_ReturnValue) == 0x000020, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::CallFunc_GetSearchSkillIDList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, CallFunc_GetSearchSkillNum_ReturnValue_1) == 0x000030, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::CallFunc_GetSearchSkillNum_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000034, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000038, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00003C, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, CallFunc_GetSearchSkillNum_ReturnValue_2) == 0x000040, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::CallFunc_GetSearchSkillNum_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000044, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, CallFunc_GetSlotDrawNum_SlotNum_1) == 0x000048, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::CallFunc_GetSlotDrawNum_SlotNum_1' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00004C, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, CallFunc_FTrunc_ReturnValue) == 0x000050, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, Temp_bool_Variable) == 0x000054, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000058, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, CallFunc_Clamp_ReturnValue) == 0x00005C, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000060, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetupCursorParam, K2Node_Select_Default) == 0x000064, "Member 'BP_SkillSearchSortCtrl_C_SetupCursorParam::K2Node_Select_Default' has a wrong offset!");

// Function BP_SkillSearchSortCtrl.BP_SkillSearchSortCtrl_C.OpenSkillSearchSort
// 0x0118 (0x0118 - 0x0000)
struct BP_SkillSearchSortCtrl_C_OpenSkillSearchSort final
{
public:
	bool                                          IsSkipAnim;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_SORTWINDOW_ANIM_STATE                       Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SORTWINDOW_ANIM_STATE                       Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_802E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_BtnHelp_GetTextByEnum_HelpText;           // 0x0008(0x0018)()
	struct FBtnHelpInfo                           K2Node_MakeStruct_BtnHelpInfo;                     // 0x0020(0x0020)()
	TArray<struct FBtnHelpInfo>                   K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_GetUtsusemiSortSkillId_ReturnValue;       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_802F[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ElementCategory_C*                  CallFunc_GetCategoryWidget_CategoryWidget;         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCategoryBySkillID_Category;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8030[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ElementCategory_C*                  CallFunc_GetCategoryWidget_CategoryWidget_1;       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8031[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_1;                        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8032[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8033[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonHelpWindowCtrl_C> CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor;     // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_CommonHelpWindowCtrl_C> CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor_1;   // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8034[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CommonHelpWindowCtrl_C> CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor_2;   // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Select_Default;                             // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8035[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_SortWindow2_C*                      CallFunc_GetSortWindowWidget_SortWindowWidget;     // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SORTWINDOW_ANIM_STATE                       K2Node_Select_Default_1;                           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort) == 0x000008, "Wrong alignment on BP_SkillSearchSortCtrl_C_OpenSkillSearchSort");
static_assert(sizeof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort) == 0x000118, "Wrong size on BP_SkillSearchSortCtrl_C_OpenSkillSearchSort");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, IsSkipAnim) == 0x000000, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::IsSkipAnim' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, Temp_bool_Variable) == 0x000001, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, Temp_byte_Variable) == 0x000002, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, Temp_byte_Variable_1) == 0x000003, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, CallFunc_BtnHelp_GetTextByEnum_HelpText) == 0x000008, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::CallFunc_BtnHelp_GetTextByEnum_HelpText' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, K2Node_MakeStruct_BtnHelpInfo) == 0x000020, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::K2Node_MakeStruct_BtnHelpInfo' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, K2Node_MakeArray_Array) == 0x000040, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, CallFunc_GetUtsusemiSortSkillId_ReturnValue) == 0x000050, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::CallFunc_GetUtsusemiSortSkillId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, CallFunc_GetCategoryWidget_CategoryWidget) == 0x000058, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::CallFunc_GetCategoryWidget_CategoryWidget' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, CallFunc_GetCategoryBySkillID_Category) == 0x000060, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::CallFunc_GetCategoryBySkillID_Category' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000064, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, CallFunc_GetCategoryWidget_CategoryWidget_1) == 0x000068, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::CallFunc_GetCategoryWidget_CategoryWidget_1' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, Temp_bool_Variable_1) == 0x000070, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, CallFunc_Get_ReturnValue) == 0x000078, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, CallFunc_Get_ReturnValue_1) == 0x000080, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, K2Node_DynamicCast_AsBPI_UIManager) == 0x000088, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x0000A0, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor) == 0x0000B8, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor_1) == 0x0000C8, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, K2Node_DynamicCast_AsBPI_UIManager_2) == 0x0000D8, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::K2Node_DynamicCast_AsBPI_UIManager_2' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, K2Node_DynamicCast_bSuccess_2) == 0x0000E8, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, Temp_int_Variable) == 0x0000EC, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor_2) == 0x0000F0, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor_2' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, K2Node_Select_Default) == 0x000100, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, CallFunc_GetSortWindowWidget_SortWindowWidget) == 0x000108, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::CallFunc_GetSortWindowWidget_SortWindowWidget' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_OpenSkillSearchSort, K2Node_Select_Default_1) == 0x000110, "Member 'BP_SkillSearchSortCtrl_C_OpenSkillSearchSort::K2Node_Select_Default_1' has a wrong offset!");

// Function BP_SkillSearchSortCtrl.BP_SkillSearchSortCtrl_C.CloseSkillSearchSort
// 0x0078 (0x0078 - 0x0000)
struct BP_SkillSearchSortCtrl_C_CloseSkillSearchSort final
{
public:
	bool                                          IsSkipAnim;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_SORTWINDOW_ANIM_STATE                       Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SORTWINDOW_ANIM_STATE                       Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8036[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8037[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8038[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonHelpWindowCtrl_C> CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor;     // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_CommonHelpWindowCtrl_C> CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor_1;   // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWB_ElementCategory_C*                  CallFunc_GetCategoryWidget_CategoryWidget;         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SORTWINDOW_ANIM_STATE                       K2Node_Select_Default;                             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8039[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_SortWindow2_C*                      CallFunc_GetSortWindowWidget_SortWindowWidget;     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillSearchSortCtrl_C_CloseSkillSearchSort) == 0x000008, "Wrong alignment on BP_SkillSearchSortCtrl_C_CloseSkillSearchSort");
static_assert(sizeof(BP_SkillSearchSortCtrl_C_CloseSkillSearchSort) == 0x000078, "Wrong size on BP_SkillSearchSortCtrl_C_CloseSkillSearchSort");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_CloseSkillSearchSort, IsSkipAnim) == 0x000000, "Member 'BP_SkillSearchSortCtrl_C_CloseSkillSearchSort::IsSkipAnim' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_CloseSkillSearchSort, Temp_bool_Variable) == 0x000001, "Member 'BP_SkillSearchSortCtrl_C_CloseSkillSearchSort::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_CloseSkillSearchSort, Temp_byte_Variable) == 0x000002, "Member 'BP_SkillSearchSortCtrl_C_CloseSkillSearchSort::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_CloseSkillSearchSort, Temp_byte_Variable_1) == 0x000003, "Member 'BP_SkillSearchSortCtrl_C_CloseSkillSearchSort::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_CloseSkillSearchSort, CallFunc_Get_ReturnValue) == 0x000008, "Member 'BP_SkillSearchSortCtrl_C_CloseSkillSearchSort::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_CloseSkillSearchSort, K2Node_DynamicCast_AsBPI_UIManager) == 0x000010, "Member 'BP_SkillSearchSortCtrl_C_CloseSkillSearchSort::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_CloseSkillSearchSort, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_SkillSearchSortCtrl_C_CloseSkillSearchSort::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_CloseSkillSearchSort, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000028, "Member 'BP_SkillSearchSortCtrl_C_CloseSkillSearchSort::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_CloseSkillSearchSort, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_SkillSearchSortCtrl_C_CloseSkillSearchSort::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_CloseSkillSearchSort, CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor) == 0x000040, "Member 'BP_SkillSearchSortCtrl_C_CloseSkillSearchSort::CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_CloseSkillSearchSort, CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor_1) == 0x000050, "Member 'BP_SkillSearchSortCtrl_C_CloseSkillSearchSort::CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_CloseSkillSearchSort, CallFunc_GetCategoryWidget_CategoryWidget) == 0x000060, "Member 'BP_SkillSearchSortCtrl_C_CloseSkillSearchSort::CallFunc_GetCategoryWidget_CategoryWidget' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_CloseSkillSearchSort, K2Node_Select_Default) == 0x000068, "Member 'BP_SkillSearchSortCtrl_C_CloseSkillSearchSort::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_CloseSkillSearchSort, CallFunc_GetSortWindowWidget_SortWindowWidget) == 0x000070, "Member 'BP_SkillSearchSortCtrl_C_CloseSkillSearchSort::CallFunc_GetSortWindowWidget_SortWindowWidget' has a wrong offset!");

// Function BP_SkillSearchSortCtrl.BP_SkillSearchSortCtrl_C.SetElementTab
// 0x0030 (0x0030 - 0x0000)
struct BP_SkillSearchSortCtrl_C_SetElementTab final
{
public:
	int32                                         InElementIdx;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_803A[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_SortWindow2_C*                      CallFunc_GetSortWindowWidget_SortWindowWidget;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_SortWindow2_C*                      CallFunc_GetSortWindowWidget_SortWindowWidget_1;   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_SortWindow2_C*                      CallFunc_GetSortWindowWidget_SortWindowWidget_2;   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SORTWINDOW_ANIM_STATE                       CallFunc_GetAnimState_AinmState;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_803B[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ElementCategory_C*                  CallFunc_GetCategoryWidget_CategoryWidget;         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillSearchSortCtrl_C_SetElementTab) == 0x000008, "Wrong alignment on BP_SkillSearchSortCtrl_C_SetElementTab");
static_assert(sizeof(BP_SkillSearchSortCtrl_C_SetElementTab) == 0x000030, "Wrong size on BP_SkillSearchSortCtrl_C_SetElementTab");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetElementTab, InElementIdx) == 0x000000, "Member 'BP_SkillSearchSortCtrl_C_SetElementTab::InElementIdx' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetElementTab, CallFunc_Less_IntInt_ReturnValue) == 0x000004, "Member 'BP_SkillSearchSortCtrl_C_SetElementTab::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillSearchSortCtrl_C_SetElementTab, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000005, "Member 'BP_SkillSearchSortCtrl_C_SetElementTab::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
