#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ScreenTransitionCtrl

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Project_structs.hpp"
#include "Project_classes.hpp"
#include "E_ScreenTransitionFadeType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ScreenTransitionCtrl.BP_ScreenTransitionCtrl_C
// 0x0028 (0x0250 - 0x0228)
class ABP_ScreenTransitionCtrl_C final : public AScreenTransitionBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWB_ScreenTransition_C*                 M_screenTransitionWidget;                          // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          M_isComplete;                                      // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          M_isFadeFinish;                                    // 0x0241(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2858[0x2];                                     // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         M_requestGrabCount;                                // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             M_captureTexture;                                  // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ScreenTransitionCtrl(int32 EntryPoint);
	void AddToScreenWidget();
	void FadeIn(E_ScreenTransitionFadeType Type);
	void ReceiveBeginPlay();
	void ScreenClear();
	void ScreenCover(E_ScreenTransitionFadeType InType);
	void ResetParameter();
	void SetCaptureTexture(class UTexture2D* InTexture);
	void FadeOut(E_ScreenTransitionFadeType Type);
	void IsFadeFinish(bool* OutValue);
	void GetFinishByFrame(float* OutValue);
	void GetCaptureTexture(class UTexture2D** OutTexture);
	void GetFadeState(E_UI_FADE_STATE* OutType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ScreenTransitionCtrl_C">();
	}
	static class ABP_ScreenTransitionCtrl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ScreenTransitionCtrl_C>();
	}
};
static_assert(alignof(ABP_ScreenTransitionCtrl_C) == 0x000008, "Wrong alignment on ABP_ScreenTransitionCtrl_C");
static_assert(sizeof(ABP_ScreenTransitionCtrl_C) == 0x000250, "Wrong size on ABP_ScreenTransitionCtrl_C");
static_assert(offsetof(ABP_ScreenTransitionCtrl_C, UberGraphFrame) == 0x000228, "Member 'ABP_ScreenTransitionCtrl_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ScreenTransitionCtrl_C, DefaultSceneRoot) == 0x000230, "Member 'ABP_ScreenTransitionCtrl_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ScreenTransitionCtrl_C, M_screenTransitionWidget) == 0x000238, "Member 'ABP_ScreenTransitionCtrl_C::M_screenTransitionWidget' has a wrong offset!");
static_assert(offsetof(ABP_ScreenTransitionCtrl_C, M_isComplete) == 0x000240, "Member 'ABP_ScreenTransitionCtrl_C::M_isComplete' has a wrong offset!");
static_assert(offsetof(ABP_ScreenTransitionCtrl_C, M_isFadeFinish) == 0x000241, "Member 'ABP_ScreenTransitionCtrl_C::M_isFadeFinish' has a wrong offset!");
static_assert(offsetof(ABP_ScreenTransitionCtrl_C, M_requestGrabCount) == 0x000244, "Member 'ABP_ScreenTransitionCtrl_C::M_requestGrabCount' has a wrong offset!");
static_assert(offsetof(ABP_ScreenTransitionCtrl_C, M_captureTexture) == 0x000248, "Member 'ABP_ScreenTransitionCtrl_C::M_captureTexture' has a wrong offset!");

}

