#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StatusUICtrl

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "E_TutorialWindow_WidgetState_structs.hpp"
#include "UMG_structs.hpp"
#include "ST_BtnHelp_ColorInfo_byIdx_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_Init_SimpleStatus
// 0x0020 (0x0020 - 0x0000)
struct BP_StatusUICtrl_C_BPI_Init_SimpleStatus final
{
public:
	class UObject*                                StatusData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_WIDGET_PRIO                                 WidgetPriority;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84C2[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIStatusCtrlDataObjBase*               K2Node_DynamicCast_AsUIStatus_Ctrl_Data_Obj_Base;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_Init_SimpleStatus) == 0x000008, "Wrong alignment on BP_StatusUICtrl_C_BPI_Init_SimpleStatus");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_Init_SimpleStatus) == 0x000020, "Wrong size on BP_StatusUICtrl_C_BPI_Init_SimpleStatus");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_Init_SimpleStatus, StatusData) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_Init_SimpleStatus::StatusData' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_Init_SimpleStatus, WidgetPriority) == 0x000008, "Member 'BP_StatusUICtrl_C_BPI_Init_SimpleStatus::WidgetPriority' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_Init_SimpleStatus, Success) == 0x000009, "Member 'BP_StatusUICtrl_C_BPI_Init_SimpleStatus::Success' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_Init_SimpleStatus, K2Node_DynamicCast_AsUIStatus_Ctrl_Data_Obj_Base) == 0x000010, "Member 'BP_StatusUICtrl_C_BPI_Init_SimpleStatus::K2Node_DynamicCast_AsUIStatus_Ctrl_Data_Obj_Base' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_Init_SimpleStatus, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_StatusUICtrl_C_BPI_Init_SimpleStatus::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_Open_SimpleStatus
// 0x000C (0x000C - 0x0000)
struct BP_StatusUICtrl_C_BPI_Open_SimpleStatus final
{
public:
	bool                                          Immediate;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Dummy;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84C3[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_Open_SimpleStatus) == 0x000004, "Wrong alignment on BP_StatusUICtrl_C_BPI_Open_SimpleStatus");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_Open_SimpleStatus) == 0x00000C, "Wrong size on BP_StatusUICtrl_C_BPI_Open_SimpleStatus");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_Open_SimpleStatus, Immediate) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_Open_SimpleStatus::Immediate' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_Open_SimpleStatus, Dummy) == 0x000001, "Member 'BP_StatusUICtrl_C_BPI_Open_SimpleStatus::Dummy' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_Open_SimpleStatus, CallFunc_SelectInt_ReturnValue) == 0x000004, "Member 'BP_StatusUICtrl_C_BPI_Open_SimpleStatus::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_Open_SimpleStatus, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_StatusUICtrl_C_BPI_Open_SimpleStatus::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_Close_SimpleStatus
// 0x000C (0x000C - 0x0000)
struct BP_StatusUICtrl_C_BPI_Close_SimpleStatus final
{
public:
	bool                                          Immediate;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Dummy;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84C4[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_Close_SimpleStatus) == 0x000004, "Wrong alignment on BP_StatusUICtrl_C_BPI_Close_SimpleStatus");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_Close_SimpleStatus) == 0x00000C, "Wrong size on BP_StatusUICtrl_C_BPI_Close_SimpleStatus");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_Close_SimpleStatus, Immediate) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_Close_SimpleStatus::Immediate' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_Close_SimpleStatus, Dummy) == 0x000001, "Member 'BP_StatusUICtrl_C_BPI_Close_SimpleStatus::Dummy' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_Close_SimpleStatus, CallFunc_SelectInt_ReturnValue) == 0x000004, "Member 'BP_StatusUICtrl_C_BPI_Close_SimpleStatus::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_Close_SimpleStatus, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_StatusUICtrl_C_BPI_Close_SimpleStatus::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_IsEndAnimation_SimpleStatus
// 0x0001 (0x0001 - 0x0000)
struct BP_StatusUICtrl_C_BPI_IsEndAnimation_SimpleStatus final
{
public:
	bool                                          IsEnd;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_IsEndAnimation_SimpleStatus) == 0x000001, "Wrong alignment on BP_StatusUICtrl_C_BPI_IsEndAnimation_SimpleStatus");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_IsEndAnimation_SimpleStatus) == 0x000001, "Wrong size on BP_StatusUICtrl_C_BPI_IsEndAnimation_SimpleStatus");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_IsEndAnimation_SimpleStatus, IsEnd) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_IsEndAnimation_SimpleStatus::IsEnd' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_ChangeStatus
// 0x0002 (0x0002 - 0x0000)
struct BP_StatusUICtrl_C_BPI_ChangeStatus final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_ChangeStatus) == 0x000001, "Wrong alignment on BP_StatusUICtrl_C_BPI_ChangeStatus");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_ChangeStatus) == 0x000002, "Wrong size on BP_StatusUICtrl_C_BPI_ChangeStatus");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ChangeStatus, Dummy) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_ChangeStatus::Dummy' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ChangeStatus, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_StatusUICtrl_C_BPI_ChangeStatus::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_ChangeBtnHelpStatus_StatusUI
// 0x0002 (0x0002 - 0x0000)
struct BP_StatusUICtrl_C_BPI_ChangeBtnHelpStatus_StatusUI final
{
public:
	bool                                          Visibility;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Success;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_ChangeBtnHelpStatus_StatusUI) == 0x000001, "Wrong alignment on BP_StatusUICtrl_C_BPI_ChangeBtnHelpStatus_StatusUI");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_ChangeBtnHelpStatus_StatusUI) == 0x000002, "Wrong size on BP_StatusUICtrl_C_BPI_ChangeBtnHelpStatus_StatusUI");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ChangeBtnHelpStatus_StatusUI, Visibility) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_ChangeBtnHelpStatus_StatusUI::Visibility' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ChangeBtnHelpStatus_StatusUI, Success) == 0x000001, "Member 'BP_StatusUICtrl_C_BPI_ChangeBtnHelpStatus_StatusUI::Success' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_SetVisibility
// 0x0004 (0x0004 - 0x0000)
struct BP_StatusUICtrl_C_BPI_SetVisibility final
{
public:
	ESlateVisibility                              Visibility;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_SetVisibility) == 0x000001, "Wrong alignment on BP_StatusUICtrl_C_BPI_SetVisibility");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_SetVisibility) == 0x000004, "Wrong size on BP_StatusUICtrl_C_BPI_SetVisibility");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_SetVisibility, Visibility) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_SetVisibility::Visibility' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_SetVisibility, Success) == 0x000001, "Member 'BP_StatusUICtrl_C_BPI_SetVisibility::Success' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_SetVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'BP_StatusUICtrl_C_BPI_SetVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_SetVisibility, CallFunc_IsValid_ReturnValue) == 0x000003, "Member 'BP_StatusUICtrl_C_BPI_SetVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_GetHoverIndex
// 0x0014 (0x0014 - 0x0000)
struct BP_StatusUICtrl_C_BPI_GetHoverIndex final
{
public:
	int32                                         Main;                                              // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Sub;                                               // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHoverIndex_Right;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHoverIndex_Parent;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_GetHoverIndex) == 0x000004, "Wrong alignment on BP_StatusUICtrl_C_BPI_GetHoverIndex");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_GetHoverIndex) == 0x000014, "Wrong size on BP_StatusUICtrl_C_BPI_GetHoverIndex");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_GetHoverIndex, Main) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_GetHoverIndex::Main' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_GetHoverIndex, Sub) == 0x000004, "Member 'BP_StatusUICtrl_C_BPI_GetHoverIndex::Sub' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_GetHoverIndex, CallFunc_GetHoverIndex_Right) == 0x000008, "Member 'BP_StatusUICtrl_C_BPI_GetHoverIndex::CallFunc_GetHoverIndex_Right' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_GetHoverIndex, CallFunc_GetHoverIndex_Parent) == 0x00000C, "Member 'BP_StatusUICtrl_C_BPI_GetHoverIndex::CallFunc_GetHoverIndex_Parent' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_GetHoverIndex, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_StatusUICtrl_C_BPI_GetHoverIndex::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_CheckMouseHoverList
// 0x0004 (0x0004 - 0x0000)
struct BP_StatusUICtrl_C_BPI_CheckMouseHoverList final
{
public:
	bool                                          Main;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Sub;                                               // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetWheelListHover_Parent;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetWheelListHover_Right;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_CheckMouseHoverList) == 0x000001, "Wrong alignment on BP_StatusUICtrl_C_BPI_CheckMouseHoverList");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_CheckMouseHoverList) == 0x000004, "Wrong size on BP_StatusUICtrl_C_BPI_CheckMouseHoverList");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_CheckMouseHoverList, Main) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_CheckMouseHoverList::Main' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_CheckMouseHoverList, Sub) == 0x000001, "Member 'BP_StatusUICtrl_C_BPI_CheckMouseHoverList::Sub' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_CheckMouseHoverList, CallFunc_GetWheelListHover_Parent) == 0x000002, "Member 'BP_StatusUICtrl_C_BPI_CheckMouseHoverList::CallFunc_GetWheelListHover_Parent' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_CheckMouseHoverList, CallFunc_GetWheelListHover_Right) == 0x000003, "Member 'BP_StatusUICtrl_C_BPI_CheckMouseHoverList::CallFunc_GetWheelListHover_Right' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_ClearMouseMediator
// 0x0001 (0x0001 - 0x0000)
struct BP_StatusUICtrl_C_BPI_ClearMouseMediator final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_ClearMouseMediator) == 0x000001, "Wrong alignment on BP_StatusUICtrl_C_BPI_ClearMouseMediator");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_ClearMouseMediator) == 0x000001, "Wrong size on BP_StatusUICtrl_C_BPI_ClearMouseMediator");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ClearMouseMediator, Success) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_ClearMouseMediator::Success' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_SetMouseMediator
// 0x0020 (0x0020 - 0x0000)
struct BP_StatusUICtrl_C_BPI_SetMouseMediator final
{
public:
	class UObject*                                MouseMediator;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84C5[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MouseMediator_InheritStatus_C*      K2Node_DynamicCast_AsBP_Mouse_Mediator_Inherit_Status; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_SetMouseMediator) == 0x000008, "Wrong alignment on BP_StatusUICtrl_C_BPI_SetMouseMediator");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_SetMouseMediator) == 0x000020, "Wrong size on BP_StatusUICtrl_C_BPI_SetMouseMediator");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_SetMouseMediator, MouseMediator) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_SetMouseMediator::MouseMediator' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_SetMouseMediator, Success) == 0x000008, "Member 'BP_StatusUICtrl_C_BPI_SetMouseMediator::Success' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_SetMouseMediator, K2Node_DynamicCast_AsBP_Mouse_Mediator_Inherit_Status) == 0x000010, "Member 'BP_StatusUICtrl_C_BPI_SetMouseMediator::K2Node_DynamicCast_AsBP_Mouse_Mediator_Inherit_Status' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_SetMouseMediator, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_StatusUICtrl_C_BPI_SetMouseMediator::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_RestartResultCtrl_FromMessage
// 0x0001 (0x0001 - 0x0000)
struct BP_StatusUICtrl_C_BPI_RestartResultCtrl_FromMessage final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_RestartResultCtrl_FromMessage) == 0x000001, "Wrong alignment on BP_StatusUICtrl_C_BPI_RestartResultCtrl_FromMessage");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_RestartResultCtrl_FromMessage) == 0x000001, "Wrong size on BP_StatusUICtrl_C_BPI_RestartResultCtrl_FromMessage");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_RestartResultCtrl_FromMessage, Dummy) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_RestartResultCtrl_FromMessage::Dummy' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_TickFunc_InheritResult
// 0x0020 (0x0020 - 0x0000)
struct BP_StatusUICtrl_C_BPI_TickFunc_InheritResult final
{
public:
	bool                                          Decide;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Cancel;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DisableRotation_NoUse;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DisableRotation_NoUse_1;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_2;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84C6[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_3;               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NewTickFunc_StatusEnd;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_TickFunc_InheritResult) == 0x000008, "Wrong alignment on BP_StatusUICtrl_C_BPI_TickFunc_InheritResult");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_TickFunc_InheritResult) == 0x000020, "Wrong size on BP_StatusUICtrl_C_BPI_TickFunc_InheritResult");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_TickFunc_InheritResult, Decide) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_TickFunc_InheritResult::Decide' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_TickFunc_InheritResult, Cancel) == 0x000001, "Member 'BP_StatusUICtrl_C_BPI_TickFunc_InheritResult::Cancel' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_TickFunc_InheritResult, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000002, "Member 'BP_StatusUICtrl_C_BPI_TickFunc_InheritResult::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_TickFunc_InheritResult, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000003, "Member 'BP_StatusUICtrl_C_BPI_TickFunc_InheritResult::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_TickFunc_InheritResult, CallFunc_IsActionPadCheck_Success) == 0x000004, "Member 'BP_StatusUICtrl_C_BPI_TickFunc_InheritResult::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_TickFunc_InheritResult, CallFunc_IsActionPadCheck_Success_1) == 0x000005, "Member 'BP_StatusUICtrl_C_BPI_TickFunc_InheritResult::CallFunc_IsActionPadCheck_Success_1' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_TickFunc_InheritResult, CallFunc_DisableRotation_NoUse) == 0x000006, "Member 'BP_StatusUICtrl_C_BPI_TickFunc_InheritResult::CallFunc_DisableRotation_NoUse' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_TickFunc_InheritResult, CallFunc_DisableRotation_NoUse_1) == 0x000007, "Member 'BP_StatusUICtrl_C_BPI_TickFunc_InheritResult::CallFunc_DisableRotation_NoUse_1' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_TickFunc_InheritResult, CallFunc_IsActionPadCheck_Success_2) == 0x000008, "Member 'BP_StatusUICtrl_C_BPI_TickFunc_InheritResult::CallFunc_IsActionPadCheck_Success_2' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_TickFunc_InheritResult, CallFunc_Get_ReturnValue) == 0x000010, "Member 'BP_StatusUICtrl_C_BPI_TickFunc_InheritResult::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_TickFunc_InheritResult, CallFunc_BooleanOR_ReturnValue) == 0x000018, "Member 'BP_StatusUICtrl_C_BPI_TickFunc_InheritResult::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_TickFunc_InheritResult, CallFunc_BooleanOR_ReturnValue_1) == 0x000019, "Member 'BP_StatusUICtrl_C_BPI_TickFunc_InheritResult::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_TickFunc_InheritResult, CallFunc_IsActionPadCheck_Success_3) == 0x00001A, "Member 'BP_StatusUICtrl_C_BPI_TickFunc_InheritResult::CallFunc_IsActionPadCheck_Success_3' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_TickFunc_InheritResult, CallFunc_NewTickFunc_StatusEnd) == 0x00001B, "Member 'BP_StatusUICtrl_C_BPI_TickFunc_InheritResult::CallFunc_NewTickFunc_StatusEnd' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_TickFunc_InheritResult, CallFunc_BooleanOR_ReturnValue_2) == 0x00001C, "Member 'BP_StatusUICtrl_C_BPI_TickFunc_InheritResult::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_ShowResistancesInheritResultUI
// 0x000C (0x000C - 0x0000)
struct BP_StatusUICtrl_C_BPI_ShowResistancesInheritResultUI final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDevilUnknown_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84C7[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDevilID_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DisableRotation_NoUse;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_ShowResistancesInheritResultUI) == 0x000004, "Wrong alignment on BP_StatusUICtrl_C_BPI_ShowResistancesInheritResultUI");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_ShowResistancesInheritResultUI) == 0x00000C, "Wrong size on BP_StatusUICtrl_C_BPI_ShowResistancesInheritResultUI");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ShowResistancesInheritResultUI, Dummy) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_ShowResistancesInheritResultUI::Dummy' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ShowResistancesInheritResultUI, CallFunc_IsDevilUnknown_ReturnValue) == 0x000001, "Member 'BP_StatusUICtrl_C_BPI_ShowResistancesInheritResultUI::CallFunc_IsDevilUnknown_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ShowResistancesInheritResultUI, CallFunc_GetDevilID_ReturnValue) == 0x000004, "Member 'BP_StatusUICtrl_C_BPI_ShowResistancesInheritResultUI::CallFunc_GetDevilID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ShowResistancesInheritResultUI, CallFunc_DisableRotation_NoUse) == 0x000008, "Member 'BP_StatusUICtrl_C_BPI_ShowResistancesInheritResultUI::CallFunc_DisableRotation_NoUse' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_IsEndAnimation_InheritStatus
// 0x0001 (0x0001 - 0x0000)
struct BP_StatusUICtrl_C_BPI_IsEndAnimation_InheritStatus final
{
public:
	bool                                          IsEnd;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_IsEndAnimation_InheritStatus) == 0x000001, "Wrong alignment on BP_StatusUICtrl_C_BPI_IsEndAnimation_InheritStatus");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_IsEndAnimation_InheritStatus) == 0x000001, "Wrong size on BP_StatusUICtrl_C_BPI_IsEndAnimation_InheritStatus");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_IsEndAnimation_InheritStatus, IsEnd) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_IsEndAnimation_InheritStatus::IsEnd' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_InitInheritUI
// 0x0040 (0x0040 - 0x0000)
struct BP_StatusUICtrl_C_BPI_InitInheritUI final
{
public:
	class UObject*                                CharaChanger;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                UIStatusCtrlDataObjUnite;                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84C8[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIStatusCtrlDataObjUnite*              K2Node_DynamicCast_AsUIStatus_Ctrl_Data_Obj_Unite; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84C9[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_StatusCharaChanger_C> K2Node_DynamicCast_AsBPI_Status_Chara_Changer;     // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_InitInheritUI) == 0x000008, "Wrong alignment on BP_StatusUICtrl_C_BPI_InitInheritUI");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_InitInheritUI) == 0x000040, "Wrong size on BP_StatusUICtrl_C_BPI_InitInheritUI");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_InitInheritUI, CharaChanger) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_InitInheritUI::CharaChanger' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_InitInheritUI, UIStatusCtrlDataObjUnite) == 0x000008, "Member 'BP_StatusUICtrl_C_BPI_InitInheritUI::UIStatusCtrlDataObjUnite' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_InitInheritUI, Success) == 0x000010, "Member 'BP_StatusUICtrl_C_BPI_InitInheritUI::Success' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_InitInheritUI, K2Node_DynamicCast_AsUIStatus_Ctrl_Data_Obj_Unite) == 0x000018, "Member 'BP_StatusUICtrl_C_BPI_InitInheritUI::K2Node_DynamicCast_AsUIStatus_Ctrl_Data_Obj_Unite' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_InitInheritUI, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_StatusUICtrl_C_BPI_InitInheritUI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_InitInheritUI, K2Node_DynamicCast_AsBPI_Status_Chara_Changer) == 0x000028, "Member 'BP_StatusUICtrl_C_BPI_InitInheritUI::K2Node_DynamicCast_AsBPI_Status_Chara_Changer' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_InitInheritUI, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_StatusUICtrl_C_BPI_InitInheritUI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_ShowInheritUI
// 0x0020 (0x0020 - 0x0000)
struct BP_StatusUICtrl_C_BPI_ShowInheritUI final
{
public:
	int32                                         ParentTop;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FirstCursorIndex;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ChildTop;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCostWindow;                                     // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Dummy;                                             // 0x000D(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DisableRotation_NoUse;                    // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DisableRotation_NoUse_1;                  // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDevilUnknown_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84CA[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDevilID_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAdditionalCost_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateSkillInherit_Moved;                 // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateSkillInherit_Moved_1;               // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_ShowInheritUI) == 0x000004, "Wrong alignment on BP_StatusUICtrl_C_BPI_ShowInheritUI");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_ShowInheritUI) == 0x000020, "Wrong size on BP_StatusUICtrl_C_BPI_ShowInheritUI");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ShowInheritUI, ParentTop) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_ShowInheritUI::ParentTop' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ShowInheritUI, FirstCursorIndex) == 0x000004, "Member 'BP_StatusUICtrl_C_BPI_ShowInheritUI::FirstCursorIndex' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ShowInheritUI, ChildTop) == 0x000008, "Member 'BP_StatusUICtrl_C_BPI_ShowInheritUI::ChildTop' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ShowInheritUI, UseCostWindow) == 0x00000C, "Member 'BP_StatusUICtrl_C_BPI_ShowInheritUI::UseCostWindow' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ShowInheritUI, Dummy) == 0x00000D, "Member 'BP_StatusUICtrl_C_BPI_ShowInheritUI::Dummy' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ShowInheritUI, CallFunc_DisableRotation_NoUse) == 0x00000E, "Member 'BP_StatusUICtrl_C_BPI_ShowInheritUI::CallFunc_DisableRotation_NoUse' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ShowInheritUI, CallFunc_DisableRotation_NoUse_1) == 0x00000F, "Member 'BP_StatusUICtrl_C_BPI_ShowInheritUI::CallFunc_DisableRotation_NoUse_1' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ShowInheritUI, CallFunc_IsDevilUnknown_ReturnValue) == 0x000010, "Member 'BP_StatusUICtrl_C_BPI_ShowInheritUI::CallFunc_IsDevilUnknown_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ShowInheritUI, CallFunc_GetDevilID_ReturnValue) == 0x000014, "Member 'BP_StatusUICtrl_C_BPI_ShowInheritUI::CallFunc_GetDevilID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ShowInheritUI, CallFunc_GetAdditionalCost_ReturnValue) == 0x000018, "Member 'BP_StatusUICtrl_C_BPI_ShowInheritUI::CallFunc_GetAdditionalCost_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ShowInheritUI, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'BP_StatusUICtrl_C_BPI_ShowInheritUI::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ShowInheritUI, CallFunc_BooleanOR_ReturnValue) == 0x00001D, "Member 'BP_StatusUICtrl_C_BPI_ShowInheritUI::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ShowInheritUI, CallFunc_UpdateSkillInherit_Moved) == 0x00001E, "Member 'BP_StatusUICtrl_C_BPI_ShowInheritUI::CallFunc_UpdateSkillInherit_Moved' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ShowInheritUI, CallFunc_UpdateSkillInherit_Moved_1) == 0x00001F, "Member 'BP_StatusUICtrl_C_BPI_ShowInheritUI::CallFunc_UpdateSkillInherit_Moved_1' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_UpdateInheritUI
// 0x0018 (0x0018 - 0x0000)
struct BP_StatusUICtrl_C_BPI_UpdateInheritUI final
{
public:
	int32                                         ParentTop;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ParentCurrent;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ChildTop;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ChildCategory;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ChildCurrent;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateSkillInherit_Moved;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_UpdateInheritUI) == 0x000004, "Wrong alignment on BP_StatusUICtrl_C_BPI_UpdateInheritUI");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_UpdateInheritUI) == 0x000018, "Wrong size on BP_StatusUICtrl_C_BPI_UpdateInheritUI");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_UpdateInheritUI, ParentTop) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_UpdateInheritUI::ParentTop' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_UpdateInheritUI, ParentCurrent) == 0x000004, "Member 'BP_StatusUICtrl_C_BPI_UpdateInheritUI::ParentCurrent' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_UpdateInheritUI, ChildTop) == 0x000008, "Member 'BP_StatusUICtrl_C_BPI_UpdateInheritUI::ChildTop' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_UpdateInheritUI, ChildCategory) == 0x00000C, "Member 'BP_StatusUICtrl_C_BPI_UpdateInheritUI::ChildCategory' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_UpdateInheritUI, ChildCurrent) == 0x000010, "Member 'BP_StatusUICtrl_C_BPI_UpdateInheritUI::ChildCurrent' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_UpdateInheritUI, Dummy) == 0x000014, "Member 'BP_StatusUICtrl_C_BPI_UpdateInheritUI::Dummy' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_UpdateInheritUI, CallFunc_UpdateSkillInherit_Moved) == 0x000015, "Member 'BP_StatusUICtrl_C_BPI_UpdateInheritUI::CallFunc_UpdateSkillInherit_Moved' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_CloseInheritUI
// 0x0018 (0x0018 - 0x0000)
struct BP_StatusUICtrl_C_BPI_CloseInheritUI final
{
public:
	bool                                          CloseUI;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnCamera;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Immediate;                                         // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Dummy;                                             // 0x0003(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Lo_Immediate;                                      // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUtsusemiInherit_ReturnValue;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84CB[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DisableRotation_NoUse;                    // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_CloseInheritUI) == 0x000004, "Wrong alignment on BP_StatusUICtrl_C_BPI_CloseInheritUI");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_CloseInheritUI) == 0x000018, "Wrong size on BP_StatusUICtrl_C_BPI_CloseInheritUI");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_CloseInheritUI, CloseUI) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_CloseInheritUI::CloseUI' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_CloseInheritUI, ReturnCamera) == 0x000001, "Member 'BP_StatusUICtrl_C_BPI_CloseInheritUI::ReturnCamera' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_CloseInheritUI, Immediate) == 0x000002, "Member 'BP_StatusUICtrl_C_BPI_CloseInheritUI::Immediate' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_CloseInheritUI, Dummy) == 0x000003, "Member 'BP_StatusUICtrl_C_BPI_CloseInheritUI::Dummy' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_CloseInheritUI, Lo_Immediate) == 0x000004, "Member 'BP_StatusUICtrl_C_BPI_CloseInheritUI::Lo_Immediate' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_CloseInheritUI, CallFunc_BooleanOR_ReturnValue) == 0x000005, "Member 'BP_StatusUICtrl_C_BPI_CloseInheritUI::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_CloseInheritUI, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'BP_StatusUICtrl_C_BPI_CloseInheritUI::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_CloseInheritUI, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'BP_StatusUICtrl_C_BPI_CloseInheritUI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_CloseInheritUI, CallFunc_Not_PreBool_ReturnValue_1) == 0x000008, "Member 'BP_StatusUICtrl_C_BPI_CloseInheritUI::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_CloseInheritUI, CallFunc_BooleanAND_ReturnValue_1) == 0x000009, "Member 'BP_StatusUICtrl_C_BPI_CloseInheritUI::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_CloseInheritUI, CallFunc_IsUtsusemiInherit_ReturnValue) == 0x00000A, "Member 'BP_StatusUICtrl_C_BPI_CloseInheritUI::CallFunc_IsUtsusemiInherit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_CloseInheritUI, CallFunc_Not_PreBool_ReturnValue_2) == 0x00000B, "Member 'BP_StatusUICtrl_C_BPI_CloseInheritUI::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_CloseInheritUI, CallFunc_BooleanAND_ReturnValue_2) == 0x00000C, "Member 'BP_StatusUICtrl_C_BPI_CloseInheritUI::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_CloseInheritUI, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'BP_StatusUICtrl_C_BPI_CloseInheritUI::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_CloseInheritUI, CallFunc_Not_PreBool_ReturnValue_3) == 0x000014, "Member 'BP_StatusUICtrl_C_BPI_CloseInheritUI::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_CloseInheritUI, CallFunc_Not_PreBool_ReturnValue_4) == 0x000015, "Member 'BP_StatusUICtrl_C_BPI_CloseInheritUI::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_CloseInheritUI, CallFunc_Not_PreBool_ReturnValue_5) == 0x000016, "Member 'BP_StatusUICtrl_C_BPI_CloseInheritUI::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_CloseInheritUI, CallFunc_DisableRotation_NoUse) == 0x000017, "Member 'BP_StatusUICtrl_C_BPI_CloseInheritUI::CallFunc_DisableRotation_NoUse' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_ShowFusionResultUI
// 0x0003 (0x0003 - 0x0000)
struct BP_StatusUICtrl_C_BPI_ShowFusionResultUI final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DisableRotation_NoUse;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateSkillInherit_Moved;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_ShowFusionResultUI) == 0x000001, "Wrong alignment on BP_StatusUICtrl_C_BPI_ShowFusionResultUI");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_ShowFusionResultUI) == 0x000003, "Wrong size on BP_StatusUICtrl_C_BPI_ShowFusionResultUI");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ShowFusionResultUI, Dummy) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_ShowFusionResultUI::Dummy' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ShowFusionResultUI, CallFunc_DisableRotation_NoUse) == 0x000001, "Member 'BP_StatusUICtrl_C_BPI_ShowFusionResultUI::CallFunc_DisableRotation_NoUse' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_ShowFusionResultUI, CallFunc_UpdateSkillInherit_Moved) == 0x000002, "Member 'BP_StatusUICtrl_C_BPI_ShowFusionResultUI::CallFunc_UpdateSkillInherit_Moved' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_TickFunc_InheritStatus
// 0x0008 (0x0008 - 0x0000)
struct BP_StatusUICtrl_C_BPI_TickFunc_InheritStatus final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_TickFunc_InheritStatus) == 0x000004, "Wrong alignment on BP_StatusUICtrl_C_BPI_TickFunc_InheritStatus");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_TickFunc_InheritStatus) == 0x000008, "Wrong size on BP_StatusUICtrl_C_BPI_TickFunc_InheritStatus");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_TickFunc_InheritStatus, DeltaTime) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_TickFunc_InheritStatus::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_TickFunc_InheritStatus, Dummy) == 0x000004, "Member 'BP_StatusUICtrl_C_BPI_TickFunc_InheritStatus::Dummy' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_SetTaskBeforeViewEnd
// 0x0028 (0x0028 - 0x0000)
struct BP_StatusUICtrl_C_BPI_SetTaskBeforeViewEnd final
{
public:
	class UObject*                                Runner;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84CC[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_StatusUITask_BeforeViewEnd_C> K2Node_DynamicCast_AsBPI_Status_UITask_Before_View_End; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_SetTaskBeforeViewEnd) == 0x000008, "Wrong alignment on BP_StatusUICtrl_C_BPI_SetTaskBeforeViewEnd");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_SetTaskBeforeViewEnd) == 0x000028, "Wrong size on BP_StatusUICtrl_C_BPI_SetTaskBeforeViewEnd");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_SetTaskBeforeViewEnd, Runner) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_SetTaskBeforeViewEnd::Runner' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_SetTaskBeforeViewEnd, Success) == 0x000008, "Member 'BP_StatusUICtrl_C_BPI_SetTaskBeforeViewEnd::Success' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_SetTaskBeforeViewEnd, K2Node_DynamicCast_AsBPI_Status_UITask_Before_View_End) == 0x000010, "Member 'BP_StatusUICtrl_C_BPI_SetTaskBeforeViewEnd::K2Node_DynamicCast_AsBPI_Status_UITask_Before_View_End' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_SetTaskBeforeViewEnd, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_StatusUICtrl_C_BPI_SetTaskBeforeViewEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_StartCtrl
// 0x0028 (0x0028 - 0x0000)
struct BP_StatusUICtrl_C_BPI_StartCtrl final
{
public:
	class UUIStatusCtrlDataObjBase*               DataObj;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_STATUS_CTRL_TYPE                         CtrlType;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84CD[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_StatusCharaChanger_C> StatusCharaChanger;                                // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_WIDGET_PRIO                                 WidgetPriority;                                    // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_StartCtrl) == 0x000008, "Wrong alignment on BP_StatusUICtrl_C_BPI_StartCtrl");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_StartCtrl) == 0x000028, "Wrong size on BP_StatusUICtrl_C_BPI_StartCtrl");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_StartCtrl, DataObj) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_StartCtrl::DataObj' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_StartCtrl, CtrlType) == 0x000008, "Member 'BP_StatusUICtrl_C_BPI_StartCtrl::CtrlType' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_StartCtrl, StatusCharaChanger) == 0x000010, "Member 'BP_StatusUICtrl_C_BPI_StartCtrl::StatusCharaChanger' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_StartCtrl, WidgetPriority) == 0x000020, "Member 'BP_StatusUICtrl_C_BPI_StartCtrl::WidgetPriority' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_StartCtrl, Success) == 0x000021, "Member 'BP_StatusUICtrl_C_BPI_StartCtrl::Success' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_TickEvent
// 0x0010 (0x0010 - 0x0000)
struct BP_StatusUICtrl_C_BPI_TickEvent final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StatusEnd;                                         // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84CE[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NewTickFunc_StatusEnd;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StatusUICtrl_C_BPI_TickEvent) == 0x000004, "Wrong alignment on BP_StatusUICtrl_C_BPI_TickEvent");
static_assert(sizeof(BP_StatusUICtrl_C_BPI_TickEvent) == 0x000010, "Wrong size on BP_StatusUICtrl_C_BPI_TickEvent");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_TickEvent, DeltaSeconds) == 0x000000, "Member 'BP_StatusUICtrl_C_BPI_TickEvent::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_TickEvent, StatusEnd) == 0x000004, "Member 'BP_StatusUICtrl_C_BPI_TickEvent::StatusEnd' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_TickEvent, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000008, "Member 'BP_StatusUICtrl_C_BPI_TickEvent::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_TickEvent, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'BP_StatusUICtrl_C_BPI_TickEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StatusUICtrl_C_BPI_TickEvent, CallFunc_NewTickFunc_StatusEnd) == 0x00000D, "Member 'BP_StatusUICtrl_C_BPI_TickEvent::CallFunc_NewTickFunc_StatusEnd' has a wrong offset!");

// Function BP_StatusUICtrl.BP_StatusUICtrl_C.BPI_IsComplete
// 0x0002 (0x0002 - 0x0000)
struct BP_StatusUICtrl_C_BPI_IsComplete final
{
public:
	bool                                          IsComplete;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsComplete_IsComplete;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
