#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SystemMenu_Base

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "E_SYSMENU_STEP_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SystemMenu_Base.BP_SystemMenu_Base_C
// 0x0020 (0x0240 - 0x0220)
class ABP_SystemMenu_Base_C final : public AActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             Evdis_EndMenu;                                     // 0x0228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         M_SetLoadSlotId;                                   // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         M_SetSaveSlotId;                                   // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetSaveSlot(int32 Slot, bool* Ret);
	void SetLoadSlot(int32 Slot, bool* Ret);
	void ChangeMenuStep(E_SYSMENU_STEP NextStep, bool* Ret);
	void CheckActionSave(bool* IsActionSave, int32* Param_SetSaveSlot);
	void CheckActionLoad(bool* IsActionLoad, int32* SelSlotId);
	void Evdis_EndMenu__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SystemMenu_Base_C">();
	}
	static class ABP_SystemMenu_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SystemMenu_Base_C>();
	}
};
static_assert(alignof(ABP_SystemMenu_Base_C) == 0x000008, "Wrong alignment on ABP_SystemMenu_Base_C");
static_assert(sizeof(ABP_SystemMenu_Base_C) == 0x000240, "Wrong size on ABP_SystemMenu_Base_C");
static_assert(offsetof(ABP_SystemMenu_Base_C, DefaultSceneRoot) == 0x000220, "Member 'ABP_SystemMenu_Base_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_SystemMenu_Base_C, Evdis_EndMenu) == 0x000228, "Member 'ABP_SystemMenu_Base_C::Evdis_EndMenu' has a wrong offset!");
static_assert(offsetof(ABP_SystemMenu_Base_C, M_SetLoadSlotId) == 0x000238, "Member 'ABP_SystemMenu_Base_C::M_SetLoadSlotId' has a wrong offset!");
static_assert(offsetof(ABP_SystemMenu_Base_C, M_SetSaveSlotId) == 0x00023C, "Member 'ABP_SystemMenu_Base_C::M_SetSaveSlotId' has a wrong offset!");

}

