#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShinseiGetEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ShinseiGetEffect.BP_ShinseiGetEffect_C
// 0x0030 (0x0250 - 0x0220)
class ABP_ShinseiGetEffect_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Cm_409_001;                                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        End;                                               // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Dir;                                               // 0x0240(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PointAttractorStrength;                            // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ShinseiGetEffect(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Finish(class UParticleSystemComponent* PSystem);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ShinseiGetEffect_C">();
	}
	static class ABP_ShinseiGetEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ShinseiGetEffect_C>();
	}
};
static_assert(alignof(ABP_ShinseiGetEffect_C) == 0x000008, "Wrong alignment on ABP_ShinseiGetEffect_C");
static_assert(sizeof(ABP_ShinseiGetEffect_C) == 0x000250, "Wrong size on ABP_ShinseiGetEffect_C");
static_assert(offsetof(ABP_ShinseiGetEffect_C, UberGraphFrame) == 0x000220, "Member 'ABP_ShinseiGetEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ShinseiGetEffect_C, Cm_409_001) == 0x000228, "Member 'ABP_ShinseiGetEffect_C::Cm_409_001' has a wrong offset!");
static_assert(offsetof(ABP_ShinseiGetEffect_C, End) == 0x000230, "Member 'ABP_ShinseiGetEffect_C::End' has a wrong offset!");
static_assert(offsetof(ABP_ShinseiGetEffect_C, DefaultSceneRoot) == 0x000238, "Member 'ABP_ShinseiGetEffect_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ShinseiGetEffect_C, Dir) == 0x000240, "Member 'ABP_ShinseiGetEffect_C::Dir' has a wrong offset!");
static_assert(offsetof(ABP_ShinseiGetEffect_C, PointAttractorStrength) == 0x00024C, "Member 'ABP_ShinseiGetEffect_C::PointAttractorStrength' has a wrong offset!");

}

