#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SortWindowCtrl2

#include "Basic.hpp"

#include "E_SORTWINDOW_SCROLL_OFFSET_PATTERN_structs.hpp"
#include "Engine_structs.hpp"
#include "E_SORTWINDOW_ANIM_STATE_structs.hpp"
#include "Project_structs.hpp"
#include "E_SORTWINDOW_POS_TYPE_structs.hpp"
#include "E_SORTWINDOW_MOUSE_EVENT_TYPE_structs.hpp"


namespace SDK::Params
{

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.MouseInputEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_SortWindowCtrl2_C_MouseInputEvent__DelegateSignature final
{
public:
	E_SORTWINDOW_MOUSE_EVENT_TYPE                 MouseEventType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C33[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectListIdx;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectSlotIdx;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ListDrawOffset;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SortWindowCtrl2_C_MouseInputEvent__DelegateSignature) == 0x000004, "Wrong alignment on BP_SortWindowCtrl2_C_MouseInputEvent__DelegateSignature");
static_assert(sizeof(BP_SortWindowCtrl2_C_MouseInputEvent__DelegateSignature) == 0x000010, "Wrong size on BP_SortWindowCtrl2_C_MouseInputEvent__DelegateSignature");
static_assert(offsetof(BP_SortWindowCtrl2_C_MouseInputEvent__DelegateSignature, MouseEventType) == 0x000000, "Member 'BP_SortWindowCtrl2_C_MouseInputEvent__DelegateSignature::MouseEventType' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_MouseInputEvent__DelegateSignature, SelectListIdx) == 0x000004, "Member 'BP_SortWindowCtrl2_C_MouseInputEvent__DelegateSignature::SelectListIdx' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_MouseInputEvent__DelegateSignature, SelectSlotIdx) == 0x000008, "Member 'BP_SortWindowCtrl2_C_MouseInputEvent__DelegateSignature::SelectSlotIdx' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_MouseInputEvent__DelegateSignature, ListDrawOffset) == 0x00000C, "Member 'BP_SortWindowCtrl2_C_MouseInputEvent__DelegateSignature::ListDrawOffset' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.ExecuteUbergraph_BP_SortWindowCtrl2
// 0x003C (0x003C - 0x0000)
struct BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_10;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C34[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InScrollNum;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsPlaySE_9;                           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_EnableMouseHit;                       // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue;              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InListIndex_2;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsSave_SortSetting;                   // 0x0018(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsSave_SortOrder;                     // 0x0019(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_8;                           // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C35[0x1];                                     // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InListIndex_1;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SORTWINDOW_SCROLL_OFFSET_PATTERN            K2Node_Event_InScrollOffsetPattern;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsInitSetting_1;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_7;                           // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsSkipAnimation_1;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Event_InListIndex;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InScrollOffset;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsInitSetting;                        // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_6;                           // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_SORT_WINDOW_SORT_TYPE                       K2Node_Event_InSortScene;                          // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SORTWINDOW_POS_TYPE                         K2Node_Event_InPosType;                            // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsSkipAnimation;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsAutoSetupCursor;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsAutoSetupDecideSlot;                // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_5;                           // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_4;                           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_3;                           // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_2;                           // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_1;                           // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE;                             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2) == 0x000004, "Wrong alignment on BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2");
static_assert(sizeof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2) == 0x00003C, "Wrong size on BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, EntryPoint) == 0x000000, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, CallFunc_IsInViewport_ReturnValue) == 0x000004, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_IsPlaySE_10) == 0x000005, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_IsPlaySE_10' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_InScrollNum) == 0x000008, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_InScrollNum' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_IsPlaySE_9) == 0x00000C, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_IsPlaySE_9' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_EnableMouseHit) == 0x00000D, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_EnableMouseHit' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_EndPlayReason) == 0x00000E, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, CallFunc_AddToWidgetPrio_ReturnValue) == 0x00000F, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::CallFunc_AddToWidgetPrio_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_InListIndex_2) == 0x000014, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_InListIndex_2' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_IsSave_SortSetting) == 0x000018, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_IsSave_SortSetting' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_IsSave_SortOrder) == 0x000019, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_IsSave_SortOrder' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_IsPlaySE_8) == 0x00001A, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_IsPlaySE_8' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_InListIndex_1) == 0x00001C, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_InListIndex_1' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_InScrollOffsetPattern) == 0x000020, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_InScrollOffsetPattern' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_IsInitSetting_1) == 0x000021, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_IsInitSetting_1' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_IsPlaySE_7) == 0x000022, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_IsPlaySE_7' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_IsSkipAnimation_1) == 0x000023, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_IsSkipAnimation_1' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_InListIndex) == 0x000024, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_InListIndex' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_InScrollOffset) == 0x000028, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_InScrollOffset' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_IsInitSetting) == 0x00002C, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_IsInitSetting' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_IsPlaySE_6) == 0x00002D, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_IsPlaySE_6' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_InSortScene) == 0x00002E, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_InSortScene' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_InPosType) == 0x00002F, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_InPosType' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_IsSkipAnimation) == 0x000030, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_IsSkipAnimation' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_IsAutoSetupCursor) == 0x000031, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_IsAutoSetupCursor' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_IsAutoSetupDecideSlot) == 0x000032, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_IsAutoSetupDecideSlot' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_IsPlaySE_5) == 0x000033, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_IsPlaySE_5' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_IsPlaySE_4) == 0x000034, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_IsPlaySE_4' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_IsPlaySE_3) == 0x000035, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_IsPlaySE_3' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_IsPlaySE_2) == 0x000036, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_IsPlaySE_2' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_IsPlaySE_1) == 0x000037, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_IsPlaySE_1' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2, K2Node_Event_IsPlaySE) == 0x000038, "Member 'BP_SortWindowCtrl2_C_ExecuteUbergraph_BP_SortWindowCtrl2::K2Node_Event_IsPlaySE' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.BPI_MoveCursor_Up
// 0x0001 (0x0001 - 0x0000)
struct BP_SortWindowCtrl2_C_BPI_MoveCursor_Up final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SortWindowCtrl2_C_BPI_MoveCursor_Up) == 0x000001, "Wrong alignment on BP_SortWindowCtrl2_C_BPI_MoveCursor_Up");
static_assert(sizeof(BP_SortWindowCtrl2_C_BPI_MoveCursor_Up) == 0x000001, "Wrong size on BP_SortWindowCtrl2_C_BPI_MoveCursor_Up");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_MoveCursor_Up, IsPlaySE) == 0x000000, "Member 'BP_SortWindowCtrl2_C_BPI_MoveCursor_Up::IsPlaySE' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.BPI_MoveCursor_Down
// 0x0001 (0x0001 - 0x0000)
struct BP_SortWindowCtrl2_C_BPI_MoveCursor_Down final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SortWindowCtrl2_C_BPI_MoveCursor_Down) == 0x000001, "Wrong alignment on BP_SortWindowCtrl2_C_BPI_MoveCursor_Down");
static_assert(sizeof(BP_SortWindowCtrl2_C_BPI_MoveCursor_Down) == 0x000001, "Wrong size on BP_SortWindowCtrl2_C_BPI_MoveCursor_Down");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_MoveCursor_Down, IsPlaySE) == 0x000000, "Member 'BP_SortWindowCtrl2_C_BPI_MoveCursor_Down::IsPlaySE' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.BPI_Page_UP
// 0x0001 (0x0001 - 0x0000)
struct BP_SortWindowCtrl2_C_BPI_Page_UP final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SortWindowCtrl2_C_BPI_Page_UP) == 0x000001, "Wrong alignment on BP_SortWindowCtrl2_C_BPI_Page_UP");
static_assert(sizeof(BP_SortWindowCtrl2_C_BPI_Page_UP) == 0x000001, "Wrong size on BP_SortWindowCtrl2_C_BPI_Page_UP");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_Page_UP, IsPlaySE) == 0x000000, "Member 'BP_SortWindowCtrl2_C_BPI_Page_UP::IsPlaySE' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.BPI_Page_Down
// 0x0001 (0x0001 - 0x0000)
struct BP_SortWindowCtrl2_C_BPI_Page_Down final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SortWindowCtrl2_C_BPI_Page_Down) == 0x000001, "Wrong alignment on BP_SortWindowCtrl2_C_BPI_Page_Down");
static_assert(sizeof(BP_SortWindowCtrl2_C_BPI_Page_Down) == 0x000001, "Wrong size on BP_SortWindowCtrl2_C_BPI_Page_Down");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_Page_Down, IsPlaySE) == 0x000000, "Member 'BP_SortWindowCtrl2_C_BPI_Page_Down::IsPlaySE' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.BPI_MoveCursor_Top
// 0x0001 (0x0001 - 0x0000)
struct BP_SortWindowCtrl2_C_BPI_MoveCursor_Top final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SortWindowCtrl2_C_BPI_MoveCursor_Top) == 0x000001, "Wrong alignment on BP_SortWindowCtrl2_C_BPI_MoveCursor_Top");
static_assert(sizeof(BP_SortWindowCtrl2_C_BPI_MoveCursor_Top) == 0x000001, "Wrong size on BP_SortWindowCtrl2_C_BPI_MoveCursor_Top");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_MoveCursor_Top, IsPlaySE) == 0x000000, "Member 'BP_SortWindowCtrl2_C_BPI_MoveCursor_Top::IsPlaySE' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.BPI_MoveCursor_Bottom
// 0x0001 (0x0001 - 0x0000)
struct BP_SortWindowCtrl2_C_BPI_MoveCursor_Bottom final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SortWindowCtrl2_C_BPI_MoveCursor_Bottom) == 0x000001, "Wrong alignment on BP_SortWindowCtrl2_C_BPI_MoveCursor_Bottom");
static_assert(sizeof(BP_SortWindowCtrl2_C_BPI_MoveCursor_Bottom) == 0x000001, "Wrong size on BP_SortWindowCtrl2_C_BPI_MoveCursor_Bottom");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_MoveCursor_Bottom, IsPlaySE) == 0x000000, "Member 'BP_SortWindowCtrl2_C_BPI_MoveCursor_Bottom::IsPlaySE' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.BPI_OpenWindow
// 0x0005 (0x0005 - 0x0000)
struct BP_SortWindowCtrl2_C_BPI_OpenWindow final
{
public:
	E_SORT_WINDOW_SORT_TYPE                       InSortScene;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SORTWINDOW_POS_TYPE                         InPosType;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSkipAnimation;                                   // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsAutoSetupCursor;                                 // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsAutoSetupDecideSlot;                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SortWindowCtrl2_C_BPI_OpenWindow) == 0x000001, "Wrong alignment on BP_SortWindowCtrl2_C_BPI_OpenWindow");
static_assert(sizeof(BP_SortWindowCtrl2_C_BPI_OpenWindow) == 0x000005, "Wrong size on BP_SortWindowCtrl2_C_BPI_OpenWindow");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_OpenWindow, InSortScene) == 0x000000, "Member 'BP_SortWindowCtrl2_C_BPI_OpenWindow::InSortScene' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_OpenWindow, InPosType) == 0x000001, "Member 'BP_SortWindowCtrl2_C_BPI_OpenWindow::InPosType' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_OpenWindow, IsSkipAnimation) == 0x000002, "Member 'BP_SortWindowCtrl2_C_BPI_OpenWindow::IsSkipAnimation' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_OpenWindow, IsAutoSetupCursor) == 0x000003, "Member 'BP_SortWindowCtrl2_C_BPI_OpenWindow::IsAutoSetupCursor' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_OpenWindow, IsAutoSetupDecideSlot) == 0x000004, "Member 'BP_SortWindowCtrl2_C_BPI_OpenWindow::IsAutoSetupDecideSlot' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.BPI_SetCursorAndOffsetIdx
// 0x000C (0x000C - 0x0000)
struct BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetIdx final
{
public:
	int32                                         InListIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InScrollOffset;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInitSetting;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsPlaySE;                                          // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetIdx) == 0x000004, "Wrong alignment on BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetIdx");
static_assert(sizeof(BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetIdx) == 0x00000C, "Wrong size on BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetIdx");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetIdx, InListIndex) == 0x000000, "Member 'BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetIdx::InListIndex' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetIdx, InScrollOffset) == 0x000004, "Member 'BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetIdx::InScrollOffset' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetIdx, IsInitSetting) == 0x000008, "Member 'BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetIdx::IsInitSetting' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetIdx, IsPlaySE) == 0x000009, "Member 'BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetIdx::IsPlaySE' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.BPI_CloseWindow
// 0x0001 (0x0001 - 0x0000)
struct BP_SortWindowCtrl2_C_BPI_CloseWindow final
{
public:
	bool                                          IsSkipAnimation;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SortWindowCtrl2_C_BPI_CloseWindow) == 0x000001, "Wrong alignment on BP_SortWindowCtrl2_C_BPI_CloseWindow");
static_assert(sizeof(BP_SortWindowCtrl2_C_BPI_CloseWindow) == 0x000001, "Wrong size on BP_SortWindowCtrl2_C_BPI_CloseWindow");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_CloseWindow, IsSkipAnimation) == 0x000000, "Member 'BP_SortWindowCtrl2_C_BPI_CloseWindow::IsSkipAnimation' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.BPI_SetCursorAndOffsetPattern
// 0x0008 (0x0008 - 0x0000)
struct BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetPattern final
{
public:
	int32                                         InListIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SORTWINDOW_SCROLL_OFFSET_PATTERN            InScrollOffsetPattern;                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInitSetting;                                     // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsPlaySE;                                          // 0x0006(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetPattern) == 0x000004, "Wrong alignment on BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetPattern");
static_assert(sizeof(BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetPattern) == 0x000008, "Wrong size on BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetPattern");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetPattern, InListIndex) == 0x000000, "Member 'BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetPattern::InListIndex' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetPattern, InScrollOffsetPattern) == 0x000004, "Member 'BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetPattern::InScrollOffsetPattern' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetPattern, IsInitSetting) == 0x000005, "Member 'BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetPattern::IsInitSetting' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetPattern, IsPlaySE) == 0x000006, "Member 'BP_SortWindowCtrl2_C_BPI_SetCursorAndOffsetPattern::IsPlaySE' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.BPI_SetDecideSlot
// 0x0008 (0x0008 - 0x0000)
struct BP_SortWindowCtrl2_C_BPI_SetDecideSlot final
{
public:
	int32                                         InListIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSave_SortSetting;                                // 0x0004(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsSave_SortOrder;                                  // 0x0005(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsPlaySE;                                          // 0x0006(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SortWindowCtrl2_C_BPI_SetDecideSlot) == 0x000004, "Wrong alignment on BP_SortWindowCtrl2_C_BPI_SetDecideSlot");
static_assert(sizeof(BP_SortWindowCtrl2_C_BPI_SetDecideSlot) == 0x000008, "Wrong size on BP_SortWindowCtrl2_C_BPI_SetDecideSlot");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_SetDecideSlot, InListIndex) == 0x000000, "Member 'BP_SortWindowCtrl2_C_BPI_SetDecideSlot::InListIndex' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_SetDecideSlot, IsSave_SortSetting) == 0x000004, "Member 'BP_SortWindowCtrl2_C_BPI_SetDecideSlot::IsSave_SortSetting' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_SetDecideSlot, IsSave_SortOrder) == 0x000005, "Member 'BP_SortWindowCtrl2_C_BPI_SetDecideSlot::IsSave_SortOrder' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_SetDecideSlot, IsPlaySE) == 0x000006, "Member 'BP_SortWindowCtrl2_C_BPI_SetDecideSlot::IsPlaySE' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SortWindowCtrl2_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SortWindowCtrl2_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SortWindowCtrl2_C_ReceiveTick");
static_assert(sizeof(BP_SortWindowCtrl2_C_ReceiveTick) == 0x000004, "Wrong size on BP_SortWindowCtrl2_C_ReceiveTick");
static_assert(offsetof(BP_SortWindowCtrl2_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SortWindowCtrl2_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_SortWindowCtrl2_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SortWindowCtrl2_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_SortWindowCtrl2_C_ReceiveEndPlay");
static_assert(sizeof(BP_SortWindowCtrl2_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_SortWindowCtrl2_C_ReceiveEndPlay");
static_assert(offsetof(BP_SortWindowCtrl2_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_SortWindowCtrl2_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.BPI_SetMouseHitVisibility
// 0x0001 (0x0001 - 0x0000)
struct BP_SortWindowCtrl2_C_BPI_SetMouseHitVisibility final
{
public:
	bool                                          EnableMouseHit;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SortWindowCtrl2_C_BPI_SetMouseHitVisibility) == 0x000001, "Wrong alignment on BP_SortWindowCtrl2_C_BPI_SetMouseHitVisibility");
static_assert(sizeof(BP_SortWindowCtrl2_C_BPI_SetMouseHitVisibility) == 0x000001, "Wrong size on BP_SortWindowCtrl2_C_BPI_SetMouseHitVisibility");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_SetMouseHitVisibility, EnableMouseHit) == 0x000000, "Member 'BP_SortWindowCtrl2_C_BPI_SetMouseHitVisibility::EnableMouseHit' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.BPI_ScrollList
// 0x0008 (0x0008 - 0x0000)
struct BP_SortWindowCtrl2_C_BPI_ScrollList final
{
public:
	int32                                         InScrollNum;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlaySE;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SortWindowCtrl2_C_BPI_ScrollList) == 0x000004, "Wrong alignment on BP_SortWindowCtrl2_C_BPI_ScrollList");
static_assert(sizeof(BP_SortWindowCtrl2_C_BPI_ScrollList) == 0x000008, "Wrong size on BP_SortWindowCtrl2_C_BPI_ScrollList");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_ScrollList, InScrollNum) == 0x000000, "Member 'BP_SortWindowCtrl2_C_BPI_ScrollList::InScrollNum' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_ScrollList, IsPlaySE) == 0x000004, "Member 'BP_SortWindowCtrl2_C_BPI_ScrollList::IsPlaySE' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.BPI_CheckMouseWheel
// 0x0001 (0x0001 - 0x0000)
struct BP_SortWindowCtrl2_C_BPI_CheckMouseWheel final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SortWindowCtrl2_C_BPI_CheckMouseWheel) == 0x000001, "Wrong alignment on BP_SortWindowCtrl2_C_BPI_CheckMouseWheel");
static_assert(sizeof(BP_SortWindowCtrl2_C_BPI_CheckMouseWheel) == 0x000001, "Wrong size on BP_SortWindowCtrl2_C_BPI_CheckMouseWheel");
static_assert(offsetof(BP_SortWindowCtrl2_C_BPI_CheckMouseWheel, IsPlaySE) == 0x000000, "Member 'BP_SortWindowCtrl2_C_BPI_CheckMouseWheel::IsPlaySE' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.Init
// 0x0010 (0x0010 - 0x0000)
struct BP_SortWindowCtrl2_C_Init final
{
public:
	class UWB_SortWindow2_C*                      CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SortWindowCtrl2_C_Init) == 0x000008, "Wrong alignment on BP_SortWindowCtrl2_C_Init");
static_assert(sizeof(BP_SortWindowCtrl2_C_Init) == 0x000010, "Wrong size on BP_SortWindowCtrl2_C_Init");
static_assert(offsetof(BP_SortWindowCtrl2_C_Init, CallFunc_Create_ReturnValue) == 0x000000, "Member 'BP_SortWindowCtrl2_C_Init::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_Init, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_SortWindowCtrl2_C_Init::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.OpenSortWindow
// 0x00A0 (0x00A0 - 0x0000)
struct BP_SortWindowCtrl2_C_OpenSortWindow final
{
public:
	E_SORT_WINDOW_SORT_TYPE                       InSortScene;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SORTWINDOW_POS_TYPE                         InPosType;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSkipAnimaiton;                                   // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsAutoSetupCursorPos;                              // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsAutoSetupDecideSlot;                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_SORT_WINDOW_SORT_TYPE                       L_PreviousScene;                                   // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C36[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C37[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonHelpWindowCtrl_C> CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor;     // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C38[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonHelpWindowCtrl_C> CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor_1;   // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_1;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C39[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonHelpWindowCtrl_C> CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor_2;   // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C3A[0x2];                                     // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ClampCursorAndOffset_ClampCursor;         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ClampCursorAndOffset_ClampOffset;         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_getSotrWindowIndex_ReturnValue;           // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SortWindowCtrl2_C_OpenSortWindow) == 0x000008, "Wrong alignment on BP_SortWindowCtrl2_C_OpenSortWindow");
static_assert(sizeof(BP_SortWindowCtrl2_C_OpenSortWindow) == 0x0000A0, "Wrong size on BP_SortWindowCtrl2_C_OpenSortWindow");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, InSortScene) == 0x000000, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::InSortScene' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, InPosType) == 0x000001, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::InPosType' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, IsSkipAnimaiton) == 0x000002, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::IsSkipAnimaiton' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, IsAutoSetupCursorPos) == 0x000003, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::IsAutoSetupCursorPos' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, IsAutoSetupDecideSlot) == 0x000004, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::IsAutoSetupDecideSlot' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, L_PreviousScene) == 0x000005, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::L_PreviousScene' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, CallFunc_Get_ReturnValue) == 0x000008, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, K2Node_DynamicCast_AsBPI_UIManager) == 0x000010, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor) == 0x000028, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor_1) == 0x000050, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, CallFunc_Get_ReturnValue_1) == 0x000060, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, K2Node_DynamicCast_AsBPI_UIManager_2) == 0x000068, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::K2Node_DynamicCast_AsBPI_UIManager_2' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000079, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor_2) == 0x000080, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor_2' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000090, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000091, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, CallFunc_ClampCursorAndOffset_ClampCursor) == 0x000094, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::CallFunc_ClampCursorAndOffset_ClampCursor' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, CallFunc_ClampCursorAndOffset_ClampOffset) == 0x000098, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::CallFunc_ClampCursorAndOffset_ClampOffset' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_OpenSortWindow, CallFunc_getSotrWindowIndex_ReturnValue) == 0x00009C, "Member 'BP_SortWindowCtrl2_C_OpenSortWindow::CallFunc_getSotrWindowIndex_ReturnValue' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.CloseSortWindow
// 0x0068 (0x0068 - 0x0000)
struct BP_SortWindowCtrl2_C_CloseSortWindow final
{
public:
	bool                                          IsSkipAnimation;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C3B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C3C[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonHelpWindowCtrl_C> CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor;     // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_1;                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C3D[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonHelpWindowCtrl_C> CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor_1;   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SortWindowCtrl2_C_CloseSortWindow) == 0x000008, "Wrong alignment on BP_SortWindowCtrl2_C_CloseSortWindow");
static_assert(sizeof(BP_SortWindowCtrl2_C_CloseSortWindow) == 0x000068, "Wrong size on BP_SortWindowCtrl2_C_CloseSortWindow");
static_assert(offsetof(BP_SortWindowCtrl2_C_CloseSortWindow, IsSkipAnimation) == 0x000000, "Member 'BP_SortWindowCtrl2_C_CloseSortWindow::IsSkipAnimation' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_CloseSortWindow, CallFunc_Get_ReturnValue) == 0x000008, "Member 'BP_SortWindowCtrl2_C_CloseSortWindow::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_CloseSortWindow, K2Node_DynamicCast_AsBPI_UIManager) == 0x000010, "Member 'BP_SortWindowCtrl2_C_CloseSortWindow::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_CloseSortWindow, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_SortWindowCtrl2_C_CloseSortWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_CloseSortWindow, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000021, "Member 'BP_SortWindowCtrl2_C_CloseSortWindow::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_CloseSortWindow, CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor) == 0x000028, "Member 'BP_SortWindowCtrl2_C_CloseSortWindow::CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_CloseSortWindow, CallFunc_Get_ReturnValue_1) == 0x000038, "Member 'BP_SortWindowCtrl2_C_CloseSortWindow::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_CloseSortWindow, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000040, "Member 'BP_SortWindowCtrl2_C_CloseSortWindow::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_CloseSortWindow, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_SortWindowCtrl2_C_CloseSortWindow::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_CloseSortWindow, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000051, "Member 'BP_SortWindowCtrl2_C_CloseSortWindow::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_CloseSortWindow, CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor_1) == 0x000058, "Member 'BP_SortWindowCtrl2_C_CloseSortWindow::CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor_1' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.End
// 0x0002 (0x0002 - 0x0000)
struct BP_SortWindowCtrl2_C_End final
{
public:
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SortWindowCtrl2_C_End) == 0x000001, "Wrong alignment on BP_SortWindowCtrl2_C_End");
static_assert(sizeof(BP_SortWindowCtrl2_C_End) == 0x000002, "Wrong size on BP_SortWindowCtrl2_C_End");
static_assert(offsetof(BP_SortWindowCtrl2_C_End, CallFunc_IsInViewport_ReturnValue) == 0x000000, "Member 'BP_SortWindowCtrl2_C_End::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_End, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_SortWindowCtrl2_C_End::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.UpdateScrollBarRate
// 0x0050 (0x0050 - 0x0000)
struct BP_SortWindowCtrl2_C_UpdateScrollBarRate final
{
public:
	int32                                         CallFunc_GetSlotDrawNum_SlotNum;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C3E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           CallFunc_GetSortItemList_All_ReturnValue;          // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotDrawNum_SlotNum_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           CallFunc_GetSortItemList_All_ReturnValue_1;        // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C3F[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SortWindowCtrl2_C_UpdateScrollBarRate) == 0x000008, "Wrong alignment on BP_SortWindowCtrl2_C_UpdateScrollBarRate");
static_assert(sizeof(BP_SortWindowCtrl2_C_UpdateScrollBarRate) == 0x000050, "Wrong size on BP_SortWindowCtrl2_C_UpdateScrollBarRate");
static_assert(offsetof(BP_SortWindowCtrl2_C_UpdateScrollBarRate, CallFunc_GetSlotDrawNum_SlotNum) == 0x000000, "Member 'BP_SortWindowCtrl2_C_UpdateScrollBarRate::CallFunc_GetSlotDrawNum_SlotNum' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_UpdateScrollBarRate, CallFunc_GetSortItemList_All_ReturnValue) == 0x000008, "Member 'BP_SortWindowCtrl2_C_UpdateScrollBarRate::CallFunc_GetSortItemList_All_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_UpdateScrollBarRate, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_SortWindowCtrl2_C_UpdateScrollBarRate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_UpdateScrollBarRate, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'BP_SortWindowCtrl2_C_UpdateScrollBarRate::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_UpdateScrollBarRate, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000020, "Member 'BP_SortWindowCtrl2_C_UpdateScrollBarRate::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_UpdateScrollBarRate, CallFunc_GetSlotDrawNum_SlotNum_1) == 0x000024, "Member 'BP_SortWindowCtrl2_C_UpdateScrollBarRate::CallFunc_GetSlotDrawNum_SlotNum_1' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_UpdateScrollBarRate, CallFunc_GetSortItemList_All_ReturnValue_1) == 0x000028, "Member 'BP_SortWindowCtrl2_C_UpdateScrollBarRate::CallFunc_GetSortItemList_All_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_UpdateScrollBarRate, CallFunc_Array_Length_ReturnValue_1) == 0x000038, "Member 'BP_SortWindowCtrl2_C_UpdateScrollBarRate::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_UpdateScrollBarRate, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00003C, "Member 'BP_SortWindowCtrl2_C_UpdateScrollBarRate::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_UpdateScrollBarRate, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000040, "Member 'BP_SortWindowCtrl2_C_UpdateScrollBarRate::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_UpdateScrollBarRate, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000041, "Member 'BP_SortWindowCtrl2_C_UpdateScrollBarRate::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_UpdateScrollBarRate, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000044, "Member 'BP_SortWindowCtrl2_C_UpdateScrollBarRate::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_UpdateScrollBarRate, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000048, "Member 'BP_SortWindowCtrl2_C_UpdateScrollBarRate::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SortWindowCtrl2_C_UpdateScrollBarRate, CallFunc_FClamp_ReturnValue) == 0x00004C, "Member 'BP_SortWindowCtrl2_C_UpdateScrollBarRate::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function BP_SortWindowCtrl2.BP_SortWindowCtrl2_C.UpdateWidgetInfo
