#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShopCtrlBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_ShopType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ShopCtrlBase.BP_ShopCtrlBase_C
// 0x0038 (0x0258 - 0x0220)
class ABP_ShopCtrlBase_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	E_ShopType                                    ShopType;                                          // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_BC20[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             EventShopEnterFadeOut;                             // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EventShopExitFadeOut;                              // 0x0248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void EventShopEnterFadeOut__DelegateSignature();
	void EventShopExitFadeOut__DelegateSignature();
	void ExecuteUbergraph_BP_ShopCtrlBase(int32 EntryPoint);
	void CallEvShopExitFadeOut();
	void CallEvShopEnterFadeOut();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ShopCtrlBase_C">();
	}
	static class ABP_ShopCtrlBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ShopCtrlBase_C>();
	}
};
static_assert(alignof(ABP_ShopCtrlBase_C) == 0x000008, "Wrong alignment on ABP_ShopCtrlBase_C");
static_assert(sizeof(ABP_ShopCtrlBase_C) == 0x000258, "Wrong size on ABP_ShopCtrlBase_C");
static_assert(offsetof(ABP_ShopCtrlBase_C, UberGraphFrame) == 0x000220, "Member 'ABP_ShopCtrlBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ShopCtrlBase_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_ShopCtrlBase_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ShopCtrlBase_C, ShopType) == 0x000230, "Member 'ABP_ShopCtrlBase_C::ShopType' has a wrong offset!");
static_assert(offsetof(ABP_ShopCtrlBase_C, EventShopEnterFadeOut) == 0x000238, "Member 'ABP_ShopCtrlBase_C::EventShopEnterFadeOut' has a wrong offset!");
static_assert(offsetof(ABP_ShopCtrlBase_C, EventShopExitFadeOut) == 0x000248, "Member 'ABP_ShopCtrlBase_C::EventShopExitFadeOut' has a wrong offset!");

}

