#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TransportListMouseEvent

#include "Basic.hpp"

#include "E_SORTWINDOW_MOUSE_EVENT_TYPE_structs.hpp"


namespace SDK::Params
{

// Function BP_TransportListMouseEvent.BP_TransportListMouseEvent_C.TransportList_MouseEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_TransportListMouseEvent_C_TransportList_MouseEvent__DelegateSignature final
{
public:
	E_SORTWINDOW_MOUSE_EVENT_TYPE                 MouseEventType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_937E[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectListIdx;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectSlotIdx;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ListScrollOffset;                                  // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TransportListMouseEvent_C_TransportList_MouseEvent__DelegateSignature) == 0x000004, "Wrong alignment on BP_TransportListMouseEvent_C_TransportList_MouseEvent__DelegateSignature");
static_assert(sizeof(BP_TransportListMouseEvent_C_TransportList_MouseEvent__DelegateSignature) == 0x000010, "Wrong size on BP_TransportListMouseEvent_C_TransportList_MouseEvent__DelegateSignature");
static_assert(offsetof(BP_TransportListMouseEvent_C_TransportList_MouseEvent__DelegateSignature, MouseEventType) == 0x000000, "Member 'BP_TransportListMouseEvent_C_TransportList_MouseEvent__DelegateSignature::MouseEventType' has a wrong offset!");
static_assert(offsetof(BP_TransportListMouseEvent_C_TransportList_MouseEvent__DelegateSignature, SelectListIdx) == 0x000004, "Member 'BP_TransportListMouseEvent_C_TransportList_MouseEvent__DelegateSignature::SelectListIdx' has a wrong offset!");
static_assert(offsetof(BP_TransportListMouseEvent_C_TransportList_MouseEvent__DelegateSignature, SelectSlotIdx) == 0x000008, "Member 'BP_TransportListMouseEvent_C_TransportList_MouseEvent__DelegateSignature::SelectSlotIdx' has a wrong offset!");
static_assert(offsetof(BP_TransportListMouseEvent_C_TransportList_MouseEvent__DelegateSignature, ListScrollOffset) == 0x00000C, "Member 'BP_TransportListMouseEvent_C_TransportList_MouseEvent__DelegateSignature::ListScrollOffset' has a wrong offset!");

}

