#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TitleMovieCtrl2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Project_structs.hpp"
#include "CriWareRuntime_structs.hpp"


namespace SDK::Params
{

// Function BP_TitleMovieCtrl2.BP_TitleMovieCtrl2_C.ExecuteUbergraph_BP_TitleMovieCtrl2
// 0x0130 (0x0130 - 0x0000)
struct BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EB8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_EventMovie_C*                      CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EB9[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetFrameNumber_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EManaComponentStatus                          CallFunc_GetStatus_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFadeAnim_ReturnValue;                   // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FadeOut_Black_ReturnValue;                // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetOptionVolume_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsFirstMovie;                         // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FadeOut_Black_ReturnValue_1;              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FadeOut_Black_ReturnValue_2;              // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EBA[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EBB[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPaused_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EBC[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EBD[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventInstance_C>  K2Node_DynamicCast_AsBPI_Event_Instance;           // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EBE[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 FrameNumber, class UManaComponent* ManaComponent)> K2Node_CreateDelegate_OutputDelegate;              // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BPI_SetEventBase_NoUse;                   // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EBF[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventInstance_C>  K2Node_DynamicCast_AsBPI_Event_Instance_1;         // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_SetEventBase_NoUse_1;                 // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EC0[0x2];                                     // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_FrameNumber;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManaComponent*                         K2Node_CustomEvent_ManaComponent;                  // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPreparing_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EC1[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOriginalMovieResolution_ReturnValue;    // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EC2[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMouseCursorState                      CallFunc_PopShowMouseCursor_ReturnValue;           // 0x00E0(0x0018)()
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_2;               // 0x0106(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0107(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_3;               // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_4;               // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EC3[0x1];                                     // 0x010F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EManaComponentStatus                          CallFunc_GetStatus_ReturnValue_1;                  // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EC4[0x1];                                     // 0x011F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMovedMouseCursor_Moved;                 // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue;              // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EManaComponentStatus                          CallFunc_GetStatus_ReturnValue_2;                  // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2) == 0x000008, "Wrong alignment on BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2");
static_assert(sizeof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2) == 0x000130, "Wrong size on BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, EntryPoint) == 0x000000, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_GetFrameNumber_ReturnValue) == 0x000014, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_GetFrameNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_GetStatus_ReturnValue) == 0x000018, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_GetStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_Less_IntInt_ReturnValue) == 0x000019, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001B, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_BooleanAND_ReturnValue) == 0x00001C, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_IsFadeAnim_ReturnValue) == 0x00001D, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_IsFadeAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, Temp_bool_Variable) == 0x00001E, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_FadeOut_Black_ReturnValue) == 0x00001F, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_FadeOut_Black_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_Get_ReturnValue) == 0x000020, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_GetOptionVolume_ReturnValue) == 0x000028, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_GetOptionVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, K2Node_SwitchInteger_CmpSuccess) == 0x00002C, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_IsValid_ReturnValue_1) == 0x00002D, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, K2Node_Event_IsFirstMovie) == 0x00002E, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::K2Node_Event_IsFirstMovie' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, K2Node_Event_EndPlayReason) == 0x00002F, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, K2Node_Event_DeltaSeconds) == 0x000034, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_FadeOut_Black_ReturnValue_1) == 0x00003C, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_FadeOut_Black_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_FadeOut_Black_ReturnValue_2) == 0x00003D, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_FadeOut_Black_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_Add_IntInt_ReturnValue_2) == 0x000040, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_Add_IntInt_ReturnValue_3) == 0x000044, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000048, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00004C, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000050, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, Temp_int_Variable) == 0x000054, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_IsPaused_ReturnValue) == 0x000058, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_IsPaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, Temp_int_Variable_1) == 0x00005C, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, Temp_object_Variable) == 0x000060, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000068, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000069, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_BooleanOR_ReturnValue) == 0x00006A, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_Greater_IntInt_ReturnValue) == 0x00006B, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_GetGameInstance_ReturnValue) == 0x000070, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, K2Node_DynamicCast_AsBPI_Event_Instance) == 0x000078, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::K2Node_DynamicCast_AsBPI_Event_Instance' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, K2Node_CreateDelegate_OutputDelegate) == 0x00008C, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_BPI_SetEventBase_NoUse) == 0x00009C, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_BPI_SetEventBase_NoUse' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_GetGameInstance_ReturnValue_1) == 0x0000A0, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, K2Node_DynamicCast_AsBPI_Event_Instance_1) == 0x0000A8, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::K2Node_DynamicCast_AsBPI_Event_Instance_1' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_BPI_SetEventBase_NoUse_1) == 0x0000B9, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_BPI_SetEventBase_NoUse_1' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, K2Node_CustomEvent_FrameNumber) == 0x0000BC, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::K2Node_CustomEvent_FrameNumber' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, K2Node_CustomEvent_ManaComponent) == 0x0000C0, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::K2Node_CustomEvent_ManaComponent' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_IsPreparing_ReturnValue) == 0x0000C8, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_IsPreparing_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, Temp_object_Variable_1) == 0x0000D0, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000D8, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_IsOriginalMovieResolution_ReturnValue) == 0x0000DC, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_IsOriginalMovieResolution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_PopShowMouseCursor_ReturnValue) == 0x0000E0, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_PopShowMouseCursor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, K2Node_Select_Default) == 0x0000F8, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, Temp_int_Variable_2) == 0x000100, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_IsActionPadCheck_Success) == 0x000104, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_IsActionPadCheck_Success_1) == 0x000105, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_IsActionPadCheck_Success_1' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_IsActionPadCheck_Success_2) == 0x000106, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_IsActionPadCheck_Success_2' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_BooleanOR_ReturnValue_1) == 0x000107, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_IsActionPadCheck_Success_3) == 0x000108, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_IsActionPadCheck_Success_3' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_BooleanAND_ReturnValue_1) == 0x000109, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_IsActionPadCheck_Success_4) == 0x00010A, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_IsActionPadCheck_Success_4' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_BooleanOR_ReturnValue_2) == 0x00010B, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00010C, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_BooleanOR_ReturnValue_3) == 0x00010D, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_BooleanOR_ReturnValue_4) == 0x00010E, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000110, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_FMax_ReturnValue) == 0x000114, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, Temp_int_Variable_3) == 0x000118, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_GetStatus_ReturnValue_1) == 0x00011C, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_GetStatus_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, K2Node_SwitchEnum_CmpSuccess) == 0x00011D, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x00011E, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, Temp_int_Variable_4) == 0x000120, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000124, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_IsMovedMouseCursor_Moved) == 0x000128, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_IsMovedMouseCursor_Moved' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_AddToWidgetPrio_ReturnValue) == 0x000129, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_AddToWidgetPrio_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, CallFunc_GetStatus_ReturnValue_2) == 0x00012A, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::CallFunc_GetStatus_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2, K2Node_SwitchEnum_CmpSuccess_1) == 0x00012B, "Member 'BP_TitleMovieCtrl2_C_ExecuteUbergraph_BP_TitleMovieCtrl2::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function BP_TitleMovieCtrl2.BP_TitleMovieCtrl2_C.private_SeekCompleteNext
// 0x0010 (0x0010 - 0x0000)
struct BP_TitleMovieCtrl2_C_Private_SeekCompleteNext final
{
public:
	int32                                         FrameNumber;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EC5[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UManaComponent*                         ManaComponent;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TitleMovieCtrl2_C_Private_SeekCompleteNext) == 0x000008, "Wrong alignment on BP_TitleMovieCtrl2_C_Private_SeekCompleteNext");
static_assert(sizeof(BP_TitleMovieCtrl2_C_Private_SeekCompleteNext) == 0x000010, "Wrong size on BP_TitleMovieCtrl2_C_Private_SeekCompleteNext");
static_assert(offsetof(BP_TitleMovieCtrl2_C_Private_SeekCompleteNext, FrameNumber) == 0x000000, "Member 'BP_TitleMovieCtrl2_C_Private_SeekCompleteNext::FrameNumber' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_Private_SeekCompleteNext, ManaComponent) == 0x000008, "Member 'BP_TitleMovieCtrl2_C_Private_SeekCompleteNext::ManaComponent' has a wrong offset!");

// Function BP_TitleMovieCtrl2.BP_TitleMovieCtrl2_C.StartTitleMovieCtrl
// 0x0001 (0x0001 - 0x0000)
struct BP_TitleMovieCtrl2_C_StartTitleMovieCtrl final
{
public:
	bool                                          IsFirstMovie;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TitleMovieCtrl2_C_StartTitleMovieCtrl) == 0x000001, "Wrong alignment on BP_TitleMovieCtrl2_C_StartTitleMovieCtrl");
static_assert(sizeof(BP_TitleMovieCtrl2_C_StartTitleMovieCtrl) == 0x000001, "Wrong size on BP_TitleMovieCtrl2_C_StartTitleMovieCtrl");
static_assert(offsetof(BP_TitleMovieCtrl2_C_StartTitleMovieCtrl, IsFirstMovie) == 0x000000, "Member 'BP_TitleMovieCtrl2_C_StartTitleMovieCtrl::IsFirstMovie' has a wrong offset!");

// Function BP_TitleMovieCtrl2.BP_TitleMovieCtrl2_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_TitleMovieCtrl2_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TitleMovieCtrl2_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_TitleMovieCtrl2_C_ReceiveEndPlay");
static_assert(sizeof(BP_TitleMovieCtrl2_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_TitleMovieCtrl2_C_ReceiveEndPlay");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_TitleMovieCtrl2_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_TitleMovieCtrl2.BP_TitleMovieCtrl2_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_TitleMovieCtrl2_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TitleMovieCtrl2_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_TitleMovieCtrl2_C_ReceiveTick");
static_assert(sizeof(BP_TitleMovieCtrl2_C_ReceiveTick) == 0x000004, "Wrong size on BP_TitleMovieCtrl2_C_ReceiveTick");
static_assert(offsetof(BP_TitleMovieCtrl2_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_TitleMovieCtrl2_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_TitleMovieCtrl2.BP_TitleMovieCtrl2_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct BP_TitleMovieCtrl2_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsOriginalMovieResolution_ReturnValue;    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TitleMovieCtrl2_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_TitleMovieCtrl2_C_UserConstructionScript");
static_assert(sizeof(BP_TitleMovieCtrl2_C_UserConstructionScript) == 0x000001, "Wrong size on BP_TitleMovieCtrl2_C_UserConstructionScript");
static_assert(offsetof(BP_TitleMovieCtrl2_C_UserConstructionScript, CallFunc_IsOriginalMovieResolution_ReturnValue) == 0x000000, "Member 'BP_TitleMovieCtrl2_C_UserConstructionScript::CallFunc_IsOriginalMovieResolution_ReturnValue' has a wrong offset!");

// Function BP_TitleMovieCtrl2.BP_TitleMovieCtrl2_C.SetMyPause
// 0x0005 (0x0005 - 0x0000)
struct BP_TitleMovieCtrl2_C_SetMyPause final
{
public:
	bool                                          Param_M_IsPause;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TitleMovieCtrl2_C_SetMyPause) == 0x000001, "Wrong alignment on BP_TitleMovieCtrl2_C_SetMyPause");
static_assert(sizeof(BP_TitleMovieCtrl2_C_SetMyPause) == 0x000005, "Wrong size on BP_TitleMovieCtrl2_C_SetMyPause");
static_assert(offsetof(BP_TitleMovieCtrl2_C_SetMyPause, Param_M_IsPause) == 0x000000, "Member 'BP_TitleMovieCtrl2_C_SetMyPause::Param_M_IsPause' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_SetMyPause, CallFunc_SetGamePaused_ReturnValue) == 0x000001, "Member 'BP_TitleMovieCtrl2_C_SetMyPause::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_SetMyPause, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000002, "Member 'BP_TitleMovieCtrl2_C_SetMyPause::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_SetMyPause, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000003, "Member 'BP_TitleMovieCtrl2_C_SetMyPause::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_SetMyPause, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'BP_TitleMovieCtrl2_C_SetMyPause::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_TitleMovieCtrl2.BP_TitleMovieCtrl2_C.IsPlayingMovieEvent
// 0x0001 (0x0001 - 0x0000)
struct BP_TitleMovieCtrl2_C_IsPlayingMovieEvent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TitleMovieCtrl2_C_IsPlayingMovieEvent) == 0x000001, "Wrong alignment on BP_TitleMovieCtrl2_C_IsPlayingMovieEvent");
static_assert(sizeof(BP_TitleMovieCtrl2_C_IsPlayingMovieEvent) == 0x000001, "Wrong size on BP_TitleMovieCtrl2_C_IsPlayingMovieEvent");
static_assert(offsetof(BP_TitleMovieCtrl2_C_IsPlayingMovieEvent, ReturnValue) == 0x000000, "Member 'BP_TitleMovieCtrl2_C_IsPlayingMovieEvent::ReturnValue' has a wrong offset!");

// Function BP_TitleMovieCtrl2.BP_TitleMovieCtrl2_C.IsPauseMovieEvent
// 0x0001 (0x0001 - 0x0000)
struct BP_TitleMovieCtrl2_C_IsPauseMovieEvent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TitleMovieCtrl2_C_IsPauseMovieEvent) == 0x000001, "Wrong alignment on BP_TitleMovieCtrl2_C_IsPauseMovieEvent");
static_assert(sizeof(BP_TitleMovieCtrl2_C_IsPauseMovieEvent) == 0x000001, "Wrong size on BP_TitleMovieCtrl2_C_IsPauseMovieEvent");
static_assert(offsetof(BP_TitleMovieCtrl2_C_IsPauseMovieEvent, ReturnValue) == 0x000000, "Member 'BP_TitleMovieCtrl2_C_IsPauseMovieEvent::ReturnValue' has a wrong offset!");

// Function BP_TitleMovieCtrl2.BP_TitleMovieCtrl2_C.IsTalkPart
// 0x0001 (0x0001 - 0x0000)
struct BP_TitleMovieCtrl2_C_IsTalkPart final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TitleMovieCtrl2_C_IsTalkPart) == 0x000001, "Wrong alignment on BP_TitleMovieCtrl2_C_IsTalkPart");
static_assert(sizeof(BP_TitleMovieCtrl2_C_IsTalkPart) == 0x000001, "Wrong size on BP_TitleMovieCtrl2_C_IsTalkPart");
static_assert(offsetof(BP_TitleMovieCtrl2_C_IsTalkPart, ReturnValue) == 0x000000, "Member 'BP_TitleMovieCtrl2_C_IsTalkPart::ReturnValue' has a wrong offset!");

// Function BP_TitleMovieCtrl2.BP_TitleMovieCtrl2_C.CheckPauseEvent
// 0x0001 (0x0001 - 0x0000)
struct BP_TitleMovieCtrl2_C_CheckPauseEvent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TitleMovieCtrl2_C_CheckPauseEvent) == 0x000001, "Wrong alignment on BP_TitleMovieCtrl2_C_CheckPauseEvent");
static_assert(sizeof(BP_TitleMovieCtrl2_C_CheckPauseEvent) == 0x000001, "Wrong size on BP_TitleMovieCtrl2_C_CheckPauseEvent");
static_assert(offsetof(BP_TitleMovieCtrl2_C_CheckPauseEvent, ReturnValue) == 0x000000, "Member 'BP_TitleMovieCtrl2_C_CheckPauseEvent::ReturnValue' has a wrong offset!");

// Function BP_TitleMovieCtrl2.BP_TitleMovieCtrl2_C.SetMyMouseVisibility
// 0x0002 (0x0002 - 0x0000)
struct BP_TitleMovieCtrl2_C_SetMyMouseVisibility final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TitleMovieCtrl2_C_SetMyMouseVisibility) == 0x000001, "Wrong alignment on BP_TitleMovieCtrl2_C_SetMyMouseVisibility");
static_assert(sizeof(BP_TitleMovieCtrl2_C_SetMyMouseVisibility) == 0x000002, "Wrong size on BP_TitleMovieCtrl2_C_SetMyMouseVisibility");
static_assert(offsetof(BP_TitleMovieCtrl2_C_SetMyMouseVisibility, Show) == 0x000000, "Member 'BP_TitleMovieCtrl2_C_SetMyMouseVisibility::Show' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_SetMyMouseVisibility, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'BP_TitleMovieCtrl2_C_SetMyMouseVisibility::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function BP_TitleMovieCtrl2.BP_TitleMovieCtrl2_C.IsEndTitleMovieCtrl
// 0x0002 (0x0002 - 0x0000)
struct BP_TitleMovieCtrl2_C_IsEndTitleMovieCtrl final
{
public:
	bool                                          IsEnd;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TitleMovieCtrl2_C_IsEndTitleMovieCtrl) == 0x000001, "Wrong alignment on BP_TitleMovieCtrl2_C_IsEndTitleMovieCtrl");
static_assert(sizeof(BP_TitleMovieCtrl2_C_IsEndTitleMovieCtrl) == 0x000002, "Wrong size on BP_TitleMovieCtrl2_C_IsEndTitleMovieCtrl");
static_assert(offsetof(BP_TitleMovieCtrl2_C_IsEndTitleMovieCtrl, IsEnd) == 0x000000, "Member 'BP_TitleMovieCtrl2_C_IsEndTitleMovieCtrl::IsEnd' has a wrong offset!");
static_assert(offsetof(BP_TitleMovieCtrl2_C_IsEndTitleMovieCtrl, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000001, "Member 'BP_TitleMovieCtrl2_C_IsEndTitleMovieCtrl::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

