#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TitleCtrl

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "E_TitleEndType_structs.hpp"
#include "E_NewGameType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "E_DifficulitySelectEndType_structs.hpp"
#include "E_SaveLoadEndType_structs.hpp"


namespace SDK::Params
{

// Function BP_TitleCtrl.BP_TitleCtrl_C.ExecuteUbergraph_BP_TitleCtrl
// 0x0158 (0x0158 - 0x0000)
struct BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_TITLE_TOP_SELECTION>                 CallFunc_GetTitleTopSelection_retSelection;        // 0x0008(0x0010)(ReferenceParm)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_2;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_1;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_2;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_3;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_3;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_4;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_4;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isAnySlotSaveData_ReturnValue;            // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FadeOut_Black_ReturnValue;                // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_MultiGate_FirstRun;                         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_MultiGate_ScratchBool;                      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_ScratchIndex;                     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable_5;                             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate_4;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate_5;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	E_UI_FADE_STATE                               CallFunc_GetFadeState_ReturnValue;                 // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_5;                       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetLoadAllSaveDataHeaderResult_ReturnValue; // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WaitLoadAllSaveDataHeaderAsync_ReturnValue; // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10B[0x5];                                      // 0x010B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_TitleBack_C*                        CallFunc_Create_ReturnValue;                       // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue;              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue_1;            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_TitleMainMenu_2_C*                  CallFunc_Create_ReturnValue_1;                     // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CheckEnableConvertSaveData_ReturnValue;   // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl) == 0x000008, "Wrong alignment on BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl");
static_assert(sizeof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl) == 0x000158, "Wrong size on BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, EntryPoint) == 0x000000, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, CallFunc_GetTitleTopSelection_retSelection) == 0x000008, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::CallFunc_GetTitleTopSelection_retSelection' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, K2Node_CustomEvent_Loaded_2) == 0x000018, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, Temp_class_Variable) == 0x000020, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, K2Node_CustomEvent_Loaded_1) == 0x000028, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, Temp_class_Variable_1) == 0x000030, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, K2Node_CustomEvent_Loaded) == 0x000038, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, Temp_class_Variable_2) == 0x000040, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, K2Node_Event_DeltaSeconds) == 0x00004C, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, Temp_class_Variable_3) == 0x000050, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::Temp_class_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, K2Node_CustomEvent_Loaded_3) == 0x000058, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, Temp_class_Variable_4) == 0x000060, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::Temp_class_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, K2Node_CustomEvent_Loaded_4) == 0x000068, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::K2Node_CustomEvent_Loaded_4' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, K2Node_CreateDelegate_OutputDelegate_1) == 0x000084, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, CallFunc_IsValid_ReturnValue_1) == 0x000094, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, CallFunc_isAnySlotSaveData_ReturnValue) == 0x000095, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::CallFunc_isAnySlotSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, Temp_int_Variable) == 0x000098, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00009C, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, K2Node_SwitchEnum_CmpSuccess) == 0x00009D, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, CallFunc_FadeOut_Black_ReturnValue) == 0x00009E, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::CallFunc_FadeOut_Black_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, K2Node_SwitchEnum_CmpSuccess_1) == 0x00009F, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, K2Node_MultiGate_FirstRun) == 0x0000A0, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::K2Node_MultiGate_FirstRun' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, K2Node_MultiGate_ScratchBool) == 0x0000A1, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::K2Node_MultiGate_ScratchBool' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, K2Node_MultiGate_ScratchIndex) == 0x0000A4, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::K2Node_MultiGate_ScratchIndex' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A8, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000B8, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, K2Node_Event_EndPlayReason) == 0x0000C8, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, Temp_class_Variable_5) == 0x0000D0, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::Temp_class_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000D8, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000E8, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, CallFunc_GetFadeState_ReturnValue) == 0x0000F8, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::CallFunc_GetFadeState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, K2Node_CustomEvent_Loaded_5) == 0x000100, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::K2Node_CustomEvent_Loaded_5' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000108, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, CallFunc_GetLoadAllSaveDataHeaderResult_ReturnValue) == 0x000109, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::CallFunc_GetLoadAllSaveDataHeaderResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, CallFunc_WaitLoadAllSaveDataHeaderAsync_ReturnValue) == 0x00010A, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::CallFunc_WaitLoadAllSaveDataHeaderAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, CallFunc_Create_ReturnValue) == 0x000110, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, CallFunc_AddToWidgetPrio_ReturnValue) == 0x000118, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::CallFunc_AddToWidgetPrio_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, CallFunc_SelectInt_ReturnValue) == 0x00011C, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, CallFunc_AddToWidgetPrio_ReturnValue_1) == 0x000120, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::CallFunc_AddToWidgetPrio_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, CallFunc_Create_ReturnValue_1) == 0x000128, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, K2Node_CreateDelegate_OutputDelegate_6) == 0x000130, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, K2Node_CreateDelegate_OutputDelegate_7) == 0x000140, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl, CallFunc_CheckEnableConvertSaveData_ReturnValue) == 0x000150, "Member 'BP_TitleCtrl_C_ExecuteUbergraph_BP_TitleCtrl::CallFunc_CheckEnableConvertSaveData_ReturnValue' has a wrong offset!");

// Function BP_TitleCtrl.BP_TitleCtrl_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_TitleCtrl_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TitleCtrl_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_TitleCtrl_C_ReceiveEndPlay");
static_assert(sizeof(BP_TitleCtrl_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_TitleCtrl_C_ReceiveEndPlay");
static_assert(offsetof(BP_TitleCtrl_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_TitleCtrl_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_TitleCtrl.BP_TitleCtrl_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_TitleCtrl_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TitleCtrl_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_TitleCtrl_C_ReceiveTick");
static_assert(sizeof(BP_TitleCtrl_C_ReceiveTick) == 0x000004, "Wrong size on BP_TitleCtrl_C_ReceiveTick");
static_assert(offsetof(BP_TitleCtrl_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_TitleCtrl_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_TitleCtrl.BP_TitleCtrl_C.OnLoaded_73E854CA4A4A00CCF0276EAD888280E9
// 0x0008 (0x0008 - 0x0000)
struct BP_TitleCtrl_C_OnLoaded_73E854CA4A4A00CCF0276EAD888280E9 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_TitleCtrl_C_OnLoaded_73E854CA4A4A00CCF0276EAD888280E9) == 0x000008, "Wrong alignment on BP_TitleCtrl_C_OnLoaded_73E854CA4A4A00CCF0276EAD888280E9");
static_assert(sizeof(BP_TitleCtrl_C_OnLoaded_73E854CA4A4A00CCF0276EAD888280E9) == 0x000008, "Wrong size on BP_TitleCtrl_C_OnLoaded_73E854CA4A4A00CCF0276EAD888280E9");
static_assert(offsetof(BP_TitleCtrl_C_OnLoaded_73E854CA4A4A00CCF0276EAD888280E9, Loaded) == 0x000000, "Member 'BP_TitleCtrl_C_OnLoaded_73E854CA4A4A00CCF0276EAD888280E9::Loaded' has a wrong offset!");

// Function BP_TitleCtrl.BP_TitleCtrl_C.OnLoaded_F626ACB2404288A4FBFAD08736779276
// 0x0008 (0x0008 - 0x0000)
struct BP_TitleCtrl_C_OnLoaded_F626ACB2404288A4FBFAD08736779276 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_TitleCtrl_C_OnLoaded_F626ACB2404288A4FBFAD08736779276) == 0x000008, "Wrong alignment on BP_TitleCtrl_C_OnLoaded_F626ACB2404288A4FBFAD08736779276");
static_assert(sizeof(BP_TitleCtrl_C_OnLoaded_F626ACB2404288A4FBFAD08736779276) == 0x000008, "Wrong size on BP_TitleCtrl_C_OnLoaded_F626ACB2404288A4FBFAD08736779276");
static_assert(offsetof(BP_TitleCtrl_C_OnLoaded_F626ACB2404288A4FBFAD08736779276, Loaded) == 0x000000, "Member 'BP_TitleCtrl_C_OnLoaded_F626ACB2404288A4FBFAD08736779276::Loaded' has a wrong offset!");

// Function BP_TitleCtrl.BP_TitleCtrl_C.OnLoaded_70DE6DFF41872028BF2E12927655FE49
// 0x0008 (0x0008 - 0x0000)
struct BP_TitleCtrl_C_OnLoaded_70DE6DFF41872028BF2E12927655FE49 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_TitleCtrl_C_OnLoaded_70DE6DFF41872028BF2E12927655FE49) == 0x000008, "Wrong alignment on BP_TitleCtrl_C_OnLoaded_70DE6DFF41872028BF2E12927655FE49");
static_assert(sizeof(BP_TitleCtrl_C_OnLoaded_70DE6DFF41872028BF2E12927655FE49) == 0x000008, "Wrong size on BP_TitleCtrl_C_OnLoaded_70DE6DFF41872028BF2E12927655FE49");
static_assert(offsetof(BP_TitleCtrl_C_OnLoaded_70DE6DFF41872028BF2E12927655FE49, Loaded) == 0x000000, "Member 'BP_TitleCtrl_C_OnLoaded_70DE6DFF41872028BF2E12927655FE49::Loaded' has a wrong offset!");

// Function BP_TitleCtrl.BP_TitleCtrl_C.OnLoaded_2D484EA94E42E2485BA45CAB3377E4D6
// 0x0008 (0x0008 - 0x0000)
struct BP_TitleCtrl_C_OnLoaded_2D484EA94E42E2485BA45CAB3377E4D6 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_TitleCtrl_C_OnLoaded_2D484EA94E42E2485BA45CAB3377E4D6) == 0x000008, "Wrong alignment on BP_TitleCtrl_C_OnLoaded_2D484EA94E42E2485BA45CAB3377E4D6");
static_assert(sizeof(BP_TitleCtrl_C_OnLoaded_2D484EA94E42E2485BA45CAB3377E4D6) == 0x000008, "Wrong size on BP_TitleCtrl_C_OnLoaded_2D484EA94E42E2485BA45CAB3377E4D6");
static_assert(offsetof(BP_TitleCtrl_C_OnLoaded_2D484EA94E42E2485BA45CAB3377E4D6, Loaded) == 0x000000, "Member 'BP_TitleCtrl_C_OnLoaded_2D484EA94E42E2485BA45CAB3377E4D6::Loaded' has a wrong offset!");

// Function BP_TitleCtrl.BP_TitleCtrl_C.OnLoaded_74EC4B344489C4AD2B7E65945E9C49A2
// 0x0008 (0x0008 - 0x0000)
struct BP_TitleCtrl_C_OnLoaded_74EC4B344489C4AD2B7E65945E9C49A2 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_TitleCtrl_C_OnLoaded_74EC4B344489C4AD2B7E65945E9C49A2) == 0x000008, "Wrong alignment on BP_TitleCtrl_C_OnLoaded_74EC4B344489C4AD2B7E65945E9C49A2");
static_assert(sizeof(BP_TitleCtrl_C_OnLoaded_74EC4B344489C4AD2B7E65945E9C49A2) == 0x000008, "Wrong size on BP_TitleCtrl_C_OnLoaded_74EC4B344489C4AD2B7E65945E9C49A2");
static_assert(offsetof(BP_TitleCtrl_C_OnLoaded_74EC4B344489C4AD2B7E65945E9C49A2, Loaded) == 0x000000, "Member 'BP_TitleCtrl_C_OnLoaded_74EC4B344489C4AD2B7E65945E9C49A2::Loaded' has a wrong offset!");

// Function BP_TitleCtrl.BP_TitleCtrl_C.OnLoaded_39B295964692A44CB6EAE6A93C776812
// 0x0008 (0x0008 - 0x0000)
struct BP_TitleCtrl_C_OnLoaded_39B295964692A44CB6EAE6A93C776812 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_TitleCtrl_C_OnLoaded_39B295964692A44CB6EAE6A93C776812) == 0x000008, "Wrong alignment on BP_TitleCtrl_C_OnLoaded_39B295964692A44CB6EAE6A93C776812");
static_assert(sizeof(BP_TitleCtrl_C_OnLoaded_39B295964692A44CB6EAE6A93C776812) == 0x000008, "Wrong size on BP_TitleCtrl_C_OnLoaded_39B295964692A44CB6EAE6A93C776812");
static_assert(offsetof(BP_TitleCtrl_C_OnLoaded_39B295964692A44CB6EAE6A93C776812, Loaded) == 0x000000, "Member 'BP_TitleCtrl_C_OnLoaded_39B295964692A44CB6EAE6A93C776812::Loaded' has a wrong offset!");

// Function BP_TitleCtrl.BP_TitleCtrl_C.TickFunc_TitleTop
// 0x00B0 (0x00B0 - 0x0000)
struct BP_TitleCtrl_C_TickFunc_TitleTop final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EnableCountUpNoInputTime_ReturnValue;     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMouseCursorState                      CallFunc_PopShowMouseCursor_ReturnValue;           // 0x0020(0x0018)()
	bool                                          CallFunc_IsMovedMouseCursor_Moved;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIMovieCtrl_C>    CallFunc_Stop_self_CastInput;                      // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_UIMovieCtrl_C>    CallFunc_IsPlaying_self_CastInput;                 // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_isPlaying;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FadeIn_Black_ReturnValue;                 // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFadeAnim_ReturnValue;                   // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectGCManager*                      CallFunc_Get_ReturnValue_1;                        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFadeOut_ReturnValue;                    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FadeOut_Black_ReturnValue;                // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UpdateTopInput_ButtonNum;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UpdateTopInput_CursorNum;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateTopInput_TriggerNum;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_2;                 // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TitleCtrl_C_TickFunc_TitleTop) == 0x000008, "Wrong alignment on BP_TitleCtrl_C_TickFunc_TitleTop");
static_assert(sizeof(BP_TitleCtrl_C_TickFunc_TitleTop) == 0x0000B0, "Wrong size on BP_TitleCtrl_C_TickFunc_TitleTop");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, DeltaSeconds) == 0x000000, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_Get_ReturnValue) == 0x000008, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_EnableCountUpNoInputTime_ReturnValue) == 0x000018, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_EnableCountUpNoInputTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, Temp_int_Variable) == 0x00001C, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_PopShowMouseCursor_ReturnValue) == 0x000020, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_PopShowMouseCursor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_IsMovedMouseCursor_Moved) == 0x000038, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_IsMovedMouseCursor_Moved' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_Stop_self_CastInput) == 0x000040, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_Stop_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_IsPlaying_self_CastInput) == 0x000050, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_IsPlaying_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_IsPlaying_isPlaying) == 0x000060, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_IsPlaying_isPlaying' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_FadeIn_Black_ReturnValue) == 0x000061, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_FadeIn_Black_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_IsFadeAnim_ReturnValue) == 0x000062, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_IsFadeAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_Get_ReturnValue_1) == 0x000068, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_Max_ReturnValue) == 0x000070, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_IsFadeOut_ReturnValue) == 0x000074, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_IsFadeOut_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_FadeOut_Black_ReturnValue) == 0x000075, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_FadeOut_Black_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, Temp_int_Variable_1) == 0x000078, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_Add_IntInt_ReturnValue_1) == 0x000080, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_Add_IntInt_ReturnValue_2) == 0x000084, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_Add_IntInt_ReturnValue_3) == 0x000088, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, K2Node_SwitchInteger_CmpSuccess) == 0x00008C, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, Temp_int_Variable_2) == 0x000090, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000094, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_Add_FloatFloat_ReturnValue) == 0x000098, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, Temp_int_Variable_3) == 0x00009C, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_UpdateTopInput_ButtonNum) == 0x0000A0, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_UpdateTopInput_ButtonNum' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_UpdateTopInput_CursorNum) == 0x0000A4, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_UpdateTopInput_CursorNum' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_UpdateTopInput_TriggerNum) == 0x0000A8, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_UpdateTopInput_TriggerNum' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, CallFunc_Not_PreBool_ReturnValue) == 0x0000A9, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, K2Node_SwitchInteger_CmpSuccess_1) == 0x0000AA, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_TitleTop, K2Node_SwitchInteger_CmpSuccess_2) == 0x0000AB, "Member 'BP_TitleCtrl_C_TickFunc_TitleTop::K2Node_SwitchInteger_CmpSuccess_2' has a wrong offset!");

// Function BP_TitleCtrl.BP_TitleCtrl_C.DestroyCreatedObj
// 0x000A (0x000A - 0x0000)
struct BP_TitleCtrl_C_DestroyCreatedObj final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TitleCtrl_C_DestroyCreatedObj) == 0x000001, "Wrong alignment on BP_TitleCtrl_C_DestroyCreatedObj");
static_assert(sizeof(BP_TitleCtrl_C_DestroyCreatedObj) == 0x00000A, "Wrong size on BP_TitleCtrl_C_DestroyCreatedObj");
static_assert(offsetof(BP_TitleCtrl_C_DestroyCreatedObj, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_TitleCtrl_C_DestroyCreatedObj::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_DestroyCreatedObj, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'BP_TitleCtrl_C_DestroyCreatedObj::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_DestroyCreatedObj, CallFunc_IsValid_ReturnValue_2) == 0x000002, "Member 'BP_TitleCtrl_C_DestroyCreatedObj::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_DestroyCreatedObj, CallFunc_IsValid_ReturnValue_3) == 0x000003, "Member 'BP_TitleCtrl_C_DestroyCreatedObj::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_DestroyCreatedObj, CallFunc_IsValid_ReturnValue_4) == 0x000004, "Member 'BP_TitleCtrl_C_DestroyCreatedObj::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_DestroyCreatedObj, CallFunc_IsValid_ReturnValue_5) == 0x000005, "Member 'BP_TitleCtrl_C_DestroyCreatedObj::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_DestroyCreatedObj, CallFunc_IsValid_ReturnValue_6) == 0x000006, "Member 'BP_TitleCtrl_C_DestroyCreatedObj::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_DestroyCreatedObj, CallFunc_IsValid_ReturnValue_7) == 0x000007, "Member 'BP_TitleCtrl_C_DestroyCreatedObj::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_DestroyCreatedObj, CallFunc_IsValid_ReturnValue_8) == 0x000008, "Member 'BP_TitleCtrl_C_DestroyCreatedObj::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_DestroyCreatedObj, CallFunc_IsValid_ReturnValue_9) == 0x000009, "Member 'BP_TitleCtrl_C_DestroyCreatedObj::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");

// Function BP_TitleCtrl.BP_TitleCtrl_C.UpdateTopInput
// 0x0024 (0x0024 - 0x0000)
struct BP_TitleCtrl_C_UpdateTopInput final
{
public:
	int32                                         ButtonNum;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Cursornum;                                         // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TriggerNum;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_2;               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_3;               // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_4;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_5;               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_6;               // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_7;               // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_8;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_9;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_10;              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_11;              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_12;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TitleCtrl_C_UpdateTopInput) == 0x000004, "Wrong alignment on BP_TitleCtrl_C_UpdateTopInput");
static_assert(sizeof(BP_TitleCtrl_C_UpdateTopInput) == 0x000024, "Wrong size on BP_TitleCtrl_C_UpdateTopInput");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, ButtonNum) == 0x000000, "Member 'BP_TitleCtrl_C_UpdateTopInput::ButtonNum' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, Cursornum) == 0x000004, "Member 'BP_TitleCtrl_C_UpdateTopInput::Cursornum' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, TriggerNum) == 0x000008, "Member 'BP_TitleCtrl_C_UpdateTopInput::TriggerNum' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_IsActionPadCheck_Success) == 0x000009, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_IsActionPadCheck_Success_1) == 0x00000A, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_IsActionPadCheck_Success_1' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_Not_PreBool_ReturnValue) == 0x00000B, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_Not_PreBool_ReturnValue_1) == 0x00000C, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_IsActionPadCheck_Success_2) == 0x00000D, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_IsActionPadCheck_Success_2' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_IsActionPadCheck_Success_3) == 0x00000E, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_IsActionPadCheck_Success_3' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_Not_PreBool_ReturnValue_2) == 0x00000F, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_Not_PreBool_ReturnValue_3) == 0x000010, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_IsActionPadCheck_Success_4) == 0x000011, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_IsActionPadCheck_Success_4' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_IsActionPadCheck_Success_5) == 0x000012, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_IsActionPadCheck_Success_5' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_BooleanOR_ReturnValue) == 0x000013, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_BooleanOR_ReturnValue_1) == 0x000014, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_BooleanAND_ReturnValue) == 0x000015, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_IsActionPadCheck_Success_6) == 0x000016, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_IsActionPadCheck_Success_6' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_IsActionPadCheck_Success_7) == 0x000017, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_IsActionPadCheck_Success_7' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_BooleanOR_ReturnValue_2) == 0x000018, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_BooleanOR_ReturnValue_3) == 0x000019, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_BooleanAND_ReturnValue_1) == 0x00001A, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_BooleanAND_ReturnValue_2) == 0x00001B, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_IsActionPadCheck_Success_8) == 0x00001C, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_IsActionPadCheck_Success_8' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_IsActionPadCheck_Success_9) == 0x00001D, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_IsActionPadCheck_Success_9' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_IsActionPadCheck_Success_10) == 0x00001E, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_IsActionPadCheck_Success_10' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_IsActionPadCheck_Success_11) == 0x00001F, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_IsActionPadCheck_Success_11' has a wrong offset!");
static_assert(offsetof(BP_TitleCtrl_C_UpdateTopInput, CallFunc_IsActionPadCheck_Success_12) == 0x000020, "Member 'BP_TitleCtrl_C_UpdateTopInput::CallFunc_IsActionPadCheck_Success_12' has a wrong offset!");

// Function BP_TitleCtrl.BP_TitleCtrl_C.TickFunc_Initializing
// 0x0008 (0x0008 - 0x0000)
struct BP_TitleCtrl_C_TickFunc_Initializing final
{
public:
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TitleCtrl_C_TickFunc_Initializing) == 0x000008, "Wrong alignment on BP_TitleCtrl_C_TickFunc_Initializing");
static_assert(sizeof(BP_TitleCtrl_C_TickFunc_Initializing) == 0x000008, "Wrong size on BP_TitleCtrl_C_TickFunc_Initializing");
static_assert(offsetof(BP_TitleCtrl_C_TickFunc_Initializing, CallFunc_Get_ReturnValue) == 0x000000, "Member 'BP_TitleCtrl_C_TickFunc_Initializing::CallFunc_Get_ReturnValue' has a wrong offset!");

// Function BP_TitleCtrl.BP_TitleCtrl_C.TickStartTitleTop
// 0x0150 (0x0150 - 0x0000)
struct BP_TitleCtrl_C_TickStartTitleTop final
{
public:
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromName_ReturnValue;     // 0x0000(0x00D0)()
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IS_EDITOR_BUILD_ReturnValue;              // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIMovieCtrl_C>    CallFunc_Play_self_CastInput;                      // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_UIMovieCtrl_C>    CallFunc_IsPlaying_self_CastInput;                 // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_isPlaying;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0100(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_bgmv_title_Ctrl_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FadeIn_Black_ReturnValue;                 // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
