#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TransportListCtrl2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_SORTWINDOW_ANIM_STATE_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_SORTWINDOW_SCROLL_OFFSET_PATTERN_structs.hpp"
#include "Project_structs.hpp"
#include "E_TRANSPORT_LIST_HEADER_TYPE_structs.hpp"
#include "RyuketsuFTList_st_structs.hpp"


namespace SDK::Params
{

// Function BP_TransportListCtrl2.BP_TransportListCtrl2_C.ExecuteUbergraph_BP_TransportListCtrl2
// 0x0040 (0x0040 - 0x0000)
struct BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B2C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRyuketsuFTList_st>             K2Node_Event_InSlotInfo;                           // 0x0008(0x0010)(ConstParm, ReferenceParm)
	E_TRANSPORT_LIST_HEADER_TYPE                  K2Node_Event_InHeaderType;                         // 0x0018(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InSkipAnim;                           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsSkipAnim;                           // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_9;                           // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_8;                           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_7;                           // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_6;                           // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_5;                           // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_4;                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B2D[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InListIndex_2;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InScrollOffset;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsInitSetting_1;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_3;                           // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B2E[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InListIndex_1;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SORTWINDOW_SCROLL_OFFSET_PATTERN            K2Node_Event_InScrollOffsetPattern;                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsInitSetting;                        // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE_2;                           // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B2F[0x1];                                     // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InListIndex;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsPlaySE_1;                           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsPlaySE;                             // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue;              // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2) == 0x000008, "Wrong alignment on BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2");
static_assert(sizeof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2) == 0x000040, "Wrong size on BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, EntryPoint) == 0x000000, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, K2Node_Event_InSlotInfo) == 0x000008, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::K2Node_Event_InSlotInfo' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, K2Node_Event_InHeaderType) == 0x000018, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::K2Node_Event_InHeaderType' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, K2Node_Event_InSkipAnim) == 0x000019, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::K2Node_Event_InSkipAnim' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, K2Node_Event_IsSkipAnim) == 0x00001A, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::K2Node_Event_IsSkipAnim' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, K2Node_Event_IsPlaySE_9) == 0x00001B, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::K2Node_Event_IsPlaySE_9' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, K2Node_Event_IsPlaySE_8) == 0x00001C, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::K2Node_Event_IsPlaySE_8' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, K2Node_Event_IsPlaySE_7) == 0x00001D, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::K2Node_Event_IsPlaySE_7' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, K2Node_Event_IsPlaySE_6) == 0x00001E, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::K2Node_Event_IsPlaySE_6' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, K2Node_Event_IsPlaySE_5) == 0x00001F, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::K2Node_Event_IsPlaySE_5' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, K2Node_Event_IsPlaySE_4) == 0x000020, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::K2Node_Event_IsPlaySE_4' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, K2Node_Event_InListIndex_2) == 0x000024, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::K2Node_Event_InListIndex_2' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, K2Node_Event_InScrollOffset) == 0x000028, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::K2Node_Event_InScrollOffset' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, K2Node_Event_IsInitSetting_1) == 0x00002C, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::K2Node_Event_IsInitSetting_1' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, K2Node_Event_IsPlaySE_3) == 0x00002D, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::K2Node_Event_IsPlaySE_3' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, K2Node_Event_InListIndex_1) == 0x000030, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::K2Node_Event_InListIndex_1' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, K2Node_Event_InScrollOffsetPattern) == 0x000034, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::K2Node_Event_InScrollOffsetPattern' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, K2Node_Event_IsInitSetting) == 0x000035, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::K2Node_Event_IsInitSetting' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, K2Node_Event_IsPlaySE_2) == 0x000036, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::K2Node_Event_IsPlaySE_2' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, K2Node_Event_InListIndex) == 0x000038, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::K2Node_Event_InListIndex' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, K2Node_Event_IsPlaySE_1) == 0x00003C, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::K2Node_Event_IsPlaySE_1' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, K2Node_Event_IsPlaySE) == 0x00003D, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::K2Node_Event_IsPlaySE' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, K2Node_Event_EndPlayReason) == 0x00003E, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2, CallFunc_AddToWidgetPrio_ReturnValue) == 0x00003F, "Member 'BP_TransportListCtrl2_C_ExecuteUbergraph_BP_TransportListCtrl2::CallFunc_AddToWidgetPrio_ReturnValue' has a wrong offset!");

// Function BP_TransportListCtrl2.BP_TransportListCtrl2_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_TransportListCtrl2_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TransportListCtrl2_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_TransportListCtrl2_C_ReceiveEndPlay");
static_assert(sizeof(BP_TransportListCtrl2_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_TransportListCtrl2_C_ReceiveEndPlay");
static_assert(offsetof(BP_TransportListCtrl2_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_TransportListCtrl2_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_TransportListCtrl2.BP_TransportListCtrl2_C.BPI_CheckMouseWheel
// 0x0001 (0x0001 - 0x0000)
struct BP_TransportListCtrl2_C_BPI_CheckMouseWheel final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TransportListCtrl2_C_BPI_CheckMouseWheel) == 0x000001, "Wrong alignment on BP_TransportListCtrl2_C_BPI_CheckMouseWheel");
static_assert(sizeof(BP_TransportListCtrl2_C_BPI_CheckMouseWheel) == 0x000001, "Wrong size on BP_TransportListCtrl2_C_BPI_CheckMouseWheel");
static_assert(offsetof(BP_TransportListCtrl2_C_BPI_CheckMouseWheel, IsPlaySE) == 0x000000, "Member 'BP_TransportListCtrl2_C_BPI_CheckMouseWheel::IsPlaySE' has a wrong offset!");

// Function BP_TransportListCtrl2.BP_TransportListCtrl2_C.BPI_SetDecideSlot
// 0x0008 (0x0008 - 0x0000)
struct BP_TransportListCtrl2_C_BPI_SetDecideSlot final
{
public:
	int32                                         InListIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlaySE;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TransportListCtrl2_C_BPI_SetDecideSlot) == 0x000004, "Wrong alignment on BP_TransportListCtrl2_C_BPI_SetDecideSlot");
static_assert(sizeof(BP_TransportListCtrl2_C_BPI_SetDecideSlot) == 0x000008, "Wrong size on BP_TransportListCtrl2_C_BPI_SetDecideSlot");
static_assert(offsetof(BP_TransportListCtrl2_C_BPI_SetDecideSlot, InListIndex) == 0x000000, "Member 'BP_TransportListCtrl2_C_BPI_SetDecideSlot::InListIndex' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_BPI_SetDecideSlot, IsPlaySE) == 0x000004, "Member 'BP_TransportListCtrl2_C_BPI_SetDecideSlot::IsPlaySE' has a wrong offset!");

// Function BP_TransportListCtrl2.BP_TransportListCtrl2_C.BPI_SetCursorAndOffsetPattern
// 0x0008 (0x0008 - 0x0000)
struct BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetPattern final
{
public:
	int32                                         InListIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SORTWINDOW_SCROLL_OFFSET_PATTERN            InScrollOffsetPattern;                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInitSetting;                                     // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsPlaySE;                                          // 0x0006(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetPattern) == 0x000004, "Wrong alignment on BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetPattern");
static_assert(sizeof(BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetPattern) == 0x000008, "Wrong size on BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetPattern");
static_assert(offsetof(BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetPattern, InListIndex) == 0x000000, "Member 'BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetPattern::InListIndex' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetPattern, InScrollOffsetPattern) == 0x000004, "Member 'BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetPattern::InScrollOffsetPattern' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetPattern, IsInitSetting) == 0x000005, "Member 'BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetPattern::IsInitSetting' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetPattern, IsPlaySE) == 0x000006, "Member 'BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetPattern::IsPlaySE' has a wrong offset!");

// Function BP_TransportListCtrl2.BP_TransportListCtrl2_C.BPI_SetCursorAndOffsetIdx
// 0x000C (0x000C - 0x0000)
struct BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetIdx final
{
public:
	int32                                         InListIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InScrollOffset;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInitSetting;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsPlaySE;                                          // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetIdx) == 0x000004, "Wrong alignment on BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetIdx");
static_assert(sizeof(BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetIdx) == 0x00000C, "Wrong size on BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetIdx");
static_assert(offsetof(BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetIdx, InListIndex) == 0x000000, "Member 'BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetIdx::InListIndex' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetIdx, InScrollOffset) == 0x000004, "Member 'BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetIdx::InScrollOffset' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetIdx, IsInitSetting) == 0x000008, "Member 'BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetIdx::IsInitSetting' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetIdx, IsPlaySE) == 0x000009, "Member 'BP_TransportListCtrl2_C_BPI_SetCursorAndOffsetIdx::IsPlaySE' has a wrong offset!");

// Function BP_TransportListCtrl2.BP_TransportListCtrl2_C.BPI_MoveCursor_Bottom
// 0x0001 (0x0001 - 0x0000)
struct BP_TransportListCtrl2_C_BPI_MoveCursor_Bottom final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TransportListCtrl2_C_BPI_MoveCursor_Bottom) == 0x000001, "Wrong alignment on BP_TransportListCtrl2_C_BPI_MoveCursor_Bottom");
static_assert(sizeof(BP_TransportListCtrl2_C_BPI_MoveCursor_Bottom) == 0x000001, "Wrong size on BP_TransportListCtrl2_C_BPI_MoveCursor_Bottom");
static_assert(offsetof(BP_TransportListCtrl2_C_BPI_MoveCursor_Bottom, IsPlaySE) == 0x000000, "Member 'BP_TransportListCtrl2_C_BPI_MoveCursor_Bottom::IsPlaySE' has a wrong offset!");

// Function BP_TransportListCtrl2.BP_TransportListCtrl2_C.BPI_MoveCursor_Top
// 0x0001 (0x0001 - 0x0000)
struct BP_TransportListCtrl2_C_BPI_MoveCursor_Top final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TransportListCtrl2_C_BPI_MoveCursor_Top) == 0x000001, "Wrong alignment on BP_TransportListCtrl2_C_BPI_MoveCursor_Top");
static_assert(sizeof(BP_TransportListCtrl2_C_BPI_MoveCursor_Top) == 0x000001, "Wrong size on BP_TransportListCtrl2_C_BPI_MoveCursor_Top");
static_assert(offsetof(BP_TransportListCtrl2_C_BPI_MoveCursor_Top, IsPlaySE) == 0x000000, "Member 'BP_TransportListCtrl2_C_BPI_MoveCursor_Top::IsPlaySE' has a wrong offset!");

// Function BP_TransportListCtrl2.BP_TransportListCtrl2_C.BPI_Page_Down
// 0x0001 (0x0001 - 0x0000)
struct BP_TransportListCtrl2_C_BPI_Page_Down final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TransportListCtrl2_C_BPI_Page_Down) == 0x000001, "Wrong alignment on BP_TransportListCtrl2_C_BPI_Page_Down");
static_assert(sizeof(BP_TransportListCtrl2_C_BPI_Page_Down) == 0x000001, "Wrong size on BP_TransportListCtrl2_C_BPI_Page_Down");
static_assert(offsetof(BP_TransportListCtrl2_C_BPI_Page_Down, IsPlaySE) == 0x000000, "Member 'BP_TransportListCtrl2_C_BPI_Page_Down::IsPlaySE' has a wrong offset!");

// Function BP_TransportListCtrl2.BP_TransportListCtrl2_C.BPI_Page_UP
// 0x0001 (0x0001 - 0x0000)
struct BP_TransportListCtrl2_C_BPI_Page_UP final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TransportListCtrl2_C_BPI_Page_UP) == 0x000001, "Wrong alignment on BP_TransportListCtrl2_C_BPI_Page_UP");
static_assert(sizeof(BP_TransportListCtrl2_C_BPI_Page_UP) == 0x000001, "Wrong size on BP_TransportListCtrl2_C_BPI_Page_UP");
static_assert(offsetof(BP_TransportListCtrl2_C_BPI_Page_UP, IsPlaySE) == 0x000000, "Member 'BP_TransportListCtrl2_C_BPI_Page_UP::IsPlaySE' has a wrong offset!");

// Function BP_TransportListCtrl2.BP_TransportListCtrl2_C.BPI_MoveCursor_Down
// 0x0001 (0x0001 - 0x0000)
struct BP_TransportListCtrl2_C_BPI_MoveCursor_Down final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TransportListCtrl2_C_BPI_MoveCursor_Down) == 0x000001, "Wrong alignment on BP_TransportListCtrl2_C_BPI_MoveCursor_Down");
static_assert(sizeof(BP_TransportListCtrl2_C_BPI_MoveCursor_Down) == 0x000001, "Wrong size on BP_TransportListCtrl2_C_BPI_MoveCursor_Down");
static_assert(offsetof(BP_TransportListCtrl2_C_BPI_MoveCursor_Down, IsPlaySE) == 0x000000, "Member 'BP_TransportListCtrl2_C_BPI_MoveCursor_Down::IsPlaySE' has a wrong offset!");

// Function BP_TransportListCtrl2.BP_TransportListCtrl2_C.BPI_MoveCursor_Up
// 0x0001 (0x0001 - 0x0000)
struct BP_TransportListCtrl2_C_BPI_MoveCursor_Up final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TransportListCtrl2_C_BPI_MoveCursor_Up) == 0x000001, "Wrong alignment on BP_TransportListCtrl2_C_BPI_MoveCursor_Up");
static_assert(sizeof(BP_TransportListCtrl2_C_BPI_MoveCursor_Up) == 0x000001, "Wrong size on BP_TransportListCtrl2_C_BPI_MoveCursor_Up");
static_assert(offsetof(BP_TransportListCtrl2_C_BPI_MoveCursor_Up, IsPlaySE) == 0x000000, "Member 'BP_TransportListCtrl2_C_BPI_MoveCursor_Up::IsPlaySE' has a wrong offset!");

// Function BP_TransportListCtrl2.BP_TransportListCtrl2_C.BPI_CloseWindow
// 0x0001 (0x0001 - 0x0000)
struct BP_TransportListCtrl2_C_BPI_CloseWindow final
{
public:
	bool                                          IsSkipAnim;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TransportListCtrl2_C_BPI_CloseWindow) == 0x000001, "Wrong alignment on BP_TransportListCtrl2_C_BPI_CloseWindow");
static_assert(sizeof(BP_TransportListCtrl2_C_BPI_CloseWindow) == 0x000001, "Wrong size on BP_TransportListCtrl2_C_BPI_CloseWindow");
static_assert(offsetof(BP_TransportListCtrl2_C_BPI_CloseWindow, IsSkipAnim) == 0x000000, "Member 'BP_TransportListCtrl2_C_BPI_CloseWindow::IsSkipAnim' has a wrong offset!");

// Function BP_TransportListCtrl2.BP_TransportListCtrl2_C.BPI_OpenWindow
// 0x0018 (0x0018 - 0x0000)
struct BP_TransportListCtrl2_C_BPI_OpenWindow final
{
public:
	TArray<struct FRyuketsuFTList_st>             InSlotInfo;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	E_TRANSPORT_LIST_HEADER_TYPE                  InHeaderType;                                      // 0x0010(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InSkipAnim;                                        // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TransportListCtrl2_C_BPI_OpenWindow) == 0x000008, "Wrong alignment on BP_TransportListCtrl2_C_BPI_OpenWindow");
static_assert(sizeof(BP_TransportListCtrl2_C_BPI_OpenWindow) == 0x000018, "Wrong size on BP_TransportListCtrl2_C_BPI_OpenWindow");
static_assert(offsetof(BP_TransportListCtrl2_C_BPI_OpenWindow, InSlotInfo) == 0x000000, "Member 'BP_TransportListCtrl2_C_BPI_OpenWindow::InSlotInfo' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_BPI_OpenWindow, InHeaderType) == 0x000010, "Member 'BP_TransportListCtrl2_C_BPI_OpenWindow::InHeaderType' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_BPI_OpenWindow, InSkipAnim) == 0x000011, "Member 'BP_TransportListCtrl2_C_BPI_OpenWindow::InSkipAnim' has a wrong offset!");

// Function BP_TransportListCtrl2.BP_TransportListCtrl2_C.Init
// 0x0050 (0x0050 - 0x0000)
struct BP_TransportListCtrl2_C_Init final
{
public:
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	class UWB_TransportList2_C*                   CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_TransportListMouseEvent_C*          CallFunc_FinishSpawningActor_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TransportListCtrl2_C_Init) == 0x000010, "Wrong alignment on BP_TransportListCtrl2_C_Init");
static_assert(sizeof(BP_TransportListCtrl2_C_Init) == 0x000050, "Wrong size on BP_TransportListCtrl2_C_Init");
static_assert(offsetof(BP_TransportListCtrl2_C_Init, CallFunc_MakeTransform_ReturnValue) == 0x000000, "Member 'BP_TransportListCtrl2_C_Init::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_Init, CallFunc_Create_ReturnValue) == 0x000030, "Member 'BP_TransportListCtrl2_C_Init::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_Init, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000038, "Member 'BP_TransportListCtrl2_C_Init::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_Init, CallFunc_FinishSpawningActor_ReturnValue) == 0x000040, "Member 'BP_TransportListCtrl2_C_Init::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_Init, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_TransportListCtrl2_C_Init::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_TransportListCtrl2.BP_TransportListCtrl2_C.End
// 0x0003 (0x0003 - 0x0000)
struct BP_TransportListCtrl2_C_End final
{
public:
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TransportListCtrl2_C_End) == 0x000001, "Wrong alignment on BP_TransportListCtrl2_C_End");
static_assert(sizeof(BP_TransportListCtrl2_C_End) == 0x000003, "Wrong size on BP_TransportListCtrl2_C_End");
static_assert(offsetof(BP_TransportListCtrl2_C_End, CallFunc_IsInViewport_ReturnValue) == 0x000000, "Member 'BP_TransportListCtrl2_C_End::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_End, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_TransportListCtrl2_C_End::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_End, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'BP_TransportListCtrl2_C_End::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_TransportListCtrl2.BP_TransportListCtrl2_C.OpenTransportList
// 0x0030 (0x0030 - 0x0000)
struct BP_TransportListCtrl2_C_OpenTransportList final
{
public:
	TArray<struct FRyuketsuFTList_st>             InListInfo;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	E_TRANSPORT_LIST_HEADER_TYPE                  InHeaderType;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSkipAnim;                                        // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B30[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B31[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetClampCursorAndOffset_ClampCursor;      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetClampCursorAndOffset_ClampOffset;      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TransportListCtrl2_C_OpenTransportList) == 0x000008, "Wrong alignment on BP_TransportListCtrl2_C_OpenTransportList");
static_assert(sizeof(BP_TransportListCtrl2_C_OpenTransportList) == 0x000030, "Wrong size on BP_TransportListCtrl2_C_OpenTransportList");
static_assert(offsetof(BP_TransportListCtrl2_C_OpenTransportList, InListInfo) == 0x000000, "Member 'BP_TransportListCtrl2_C_OpenTransportList::InListInfo' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_OpenTransportList, InHeaderType) == 0x000010, "Member 'BP_TransportListCtrl2_C_OpenTransportList::InHeaderType' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_OpenTransportList, IsSkipAnim) == 0x000011, "Member 'BP_TransportListCtrl2_C_OpenTransportList::IsSkipAnim' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_OpenTransportList, Temp_int_Variable) == 0x000014, "Member 'BP_TransportListCtrl2_C_OpenTransportList::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_OpenTransportList, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_TransportListCtrl2_C_OpenTransportList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_OpenTransportList, CallFunc_Array_LastIndex_ReturnValue) == 0x00001C, "Member 'BP_TransportListCtrl2_C_OpenTransportList::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_OpenTransportList, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_TransportListCtrl2_C_OpenTransportList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_OpenTransportList, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000024, "Member 'BP_TransportListCtrl2_C_OpenTransportList::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_OpenTransportList, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000025, "Member 'BP_TransportListCtrl2_C_OpenTransportList::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_OpenTransportList, CallFunc_GetClampCursorAndOffset_ClampCursor) == 0x000028, "Member 'BP_TransportListCtrl2_C_OpenTransportList::CallFunc_GetClampCursorAndOffset_ClampCursor' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_OpenTransportList, CallFunc_GetClampCursorAndOffset_ClampOffset) == 0x00002C, "Member 'BP_TransportListCtrl2_C_OpenTransportList::CallFunc_GetClampCursorAndOffset_ClampOffset' has a wrong offset!");

// Function BP_TransportListCtrl2.BP_TransportListCtrl2_C.UpdateScrollBarRate
// 0x0050 (0x0050 - 0x0000)
struct BP_TransportListCtrl2_C_UpdateScrollBarRate final
{
public:
	int32                                         CallFunc_GetSlotDrawNum_SlotNum;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotDrawNum_SlotNum_1;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B32[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransportLocationSlotInfo>     CallFunc_GetListInfo_All_ReturnValue;              // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransportLocationSlotInfo>     CallFunc_GetListInfo_All_ReturnValue_1;            // 0x0028(0x0010)(ReferenceParm)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B33[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TransportListCtrl2_C_UpdateScrollBarRate) == 0x000008, "Wrong alignment on BP_TransportListCtrl2_C_UpdateScrollBarRate");
static_assert(sizeof(BP_TransportListCtrl2_C_UpdateScrollBarRate) == 0x000050, "Wrong size on BP_TransportListCtrl2_C_UpdateScrollBarRate");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateScrollBarRate, CallFunc_GetSlotDrawNum_SlotNum) == 0x000000, "Member 'BP_TransportListCtrl2_C_UpdateScrollBarRate::CallFunc_GetSlotDrawNum_SlotNum' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateScrollBarRate, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'BP_TransportListCtrl2_C_UpdateScrollBarRate::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateScrollBarRate, CallFunc_GetSlotDrawNum_SlotNum_1) == 0x000008, "Member 'BP_TransportListCtrl2_C_UpdateScrollBarRate::CallFunc_GetSlotDrawNum_SlotNum_1' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateScrollBarRate, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'BP_TransportListCtrl2_C_UpdateScrollBarRate::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateScrollBarRate, CallFunc_GetListInfo_All_ReturnValue) == 0x000010, "Member 'BP_TransportListCtrl2_C_UpdateScrollBarRate::CallFunc_GetListInfo_All_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateScrollBarRate, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_TransportListCtrl2_C_UpdateScrollBarRate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateScrollBarRate, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'BP_TransportListCtrl2_C_UpdateScrollBarRate::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateScrollBarRate, CallFunc_GetListInfo_All_ReturnValue_1) == 0x000028, "Member 'BP_TransportListCtrl2_C_UpdateScrollBarRate::CallFunc_GetListInfo_All_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateScrollBarRate, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000038, "Member 'BP_TransportListCtrl2_C_UpdateScrollBarRate::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateScrollBarRate, CallFunc_Array_Length_ReturnValue_1) == 0x00003C, "Member 'BP_TransportListCtrl2_C_UpdateScrollBarRate::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateScrollBarRate, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000040, "Member 'BP_TransportListCtrl2_C_UpdateScrollBarRate::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateScrollBarRate, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000044, "Member 'BP_TransportListCtrl2_C_UpdateScrollBarRate::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateScrollBarRate, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000048, "Member 'BP_TransportListCtrl2_C_UpdateScrollBarRate::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateScrollBarRate, CallFunc_FClamp_ReturnValue) == 0x00004C, "Member 'BP_TransportListCtrl2_C_UpdateScrollBarRate::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function BP_TransportListCtrl2.BP_TransportListCtrl2_C.UpdateWidgetInfo
// 0x0068 (0x0068 - 0x0000)
struct BP_TransportListCtrl2_C_UpdateWidgetInfo final
{
public:
	bool                                          IsUpdateTextAndActiveSlot;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsUpdateScrollBar;                                 // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsUpdateCursorSlot;                                // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsUpdateDecideSlot;                                // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsUpdateAnim;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B34[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotDrawNum_SlotNum;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B35[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B36[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSlotDrawNum_SlotNum_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B37[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransportLocationSlotInfo>     CallFunc_GetListInfo_All_ReturnValue;              // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B38[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSlotDrawNum_SlotNum_2;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B39[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransportLocationSlotInfo>     CallFunc_GetListInfo_InRange_ReturnValue;          // 0x0058(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_TransportListCtrl2_C_UpdateWidgetInfo) == 0x000008, "Wrong alignment on BP_TransportListCtrl2_C_UpdateWidgetInfo");
static_assert(sizeof(BP_TransportListCtrl2_C_UpdateWidgetInfo) == 0x000068, "Wrong size on BP_TransportListCtrl2_C_UpdateWidgetInfo");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateWidgetInfo, IsUpdateTextAndActiveSlot) == 0x000000, "Member 'BP_TransportListCtrl2_C_UpdateWidgetInfo::IsUpdateTextAndActiveSlot' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateWidgetInfo, IsUpdateScrollBar) == 0x000001, "Member 'BP_TransportListCtrl2_C_UpdateWidgetInfo::IsUpdateScrollBar' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateWidgetInfo, IsUpdateCursorSlot) == 0x000002, "Member 'BP_TransportListCtrl2_C_UpdateWidgetInfo::IsUpdateCursorSlot' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateWidgetInfo, IsUpdateDecideSlot) == 0x000003, "Member 'BP_TransportListCtrl2_C_UpdateWidgetInfo::IsUpdateDecideSlot' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateWidgetInfo, IsUpdateAnim) == 0x000004, "Member 'BP_TransportListCtrl2_C_UpdateWidgetInfo::IsUpdateAnim' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateWidgetInfo, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'BP_TransportListCtrl2_C_UpdateWidgetInfo::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateWidgetInfo, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00000C, "Member 'BP_TransportListCtrl2_C_UpdateWidgetInfo::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateWidgetInfo, CallFunc_GetSlotDrawNum_SlotNum) == 0x000010, "Member 'BP_TransportListCtrl2_C_UpdateWidgetInfo::CallFunc_GetSlotDrawNum_SlotNum' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateWidgetInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_TransportListCtrl2_C_UpdateWidgetInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateWidgetInfo, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'BP_TransportListCtrl2_C_UpdateWidgetInfo::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateWidgetInfo, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x00001C, "Member 'BP_TransportListCtrl2_C_UpdateWidgetInfo::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateWidgetInfo, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000020, "Member 'BP_TransportListCtrl2_C_UpdateWidgetInfo::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateWidgetInfo, CallFunc_GetSlotDrawNum_SlotNum_1) == 0x000024, "Member 'BP_TransportListCtrl2_C_UpdateWidgetInfo::CallFunc_GetSlotDrawNum_SlotNum_1' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateWidgetInfo, CallFunc_BooleanAND_ReturnValue) == 0x000028, "Member 'BP_TransportListCtrl2_C_UpdateWidgetInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateWidgetInfo, CallFunc_GetListInfo_All_ReturnValue) == 0x000030, "Member 'BP_TransportListCtrl2_C_UpdateWidgetInfo::CallFunc_GetListInfo_All_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateWidgetInfo, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_TransportListCtrl2_C_UpdateWidgetInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateWidgetInfo, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'BP_TransportListCtrl2_C_UpdateWidgetInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateWidgetInfo, CallFunc_GetSlotDrawNum_SlotNum_2) == 0x000048, "Member 'BP_TransportListCtrl2_C_UpdateWidgetInfo::CallFunc_GetSlotDrawNum_SlotNum_2' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateWidgetInfo, CallFunc_Add_IntInt_ReturnValue_1) == 0x00004C, "Member 'BP_TransportListCtrl2_C_UpdateWidgetInfo::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateWidgetInfo, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x000050, "Member 'BP_TransportListCtrl2_C_UpdateWidgetInfo::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_UpdateWidgetInfo, CallFunc_GetListInfo_InRange_ReturnValue) == 0x000058, "Member 'BP_TransportListCtrl2_C_UpdateWidgetInfo::CallFunc_GetListInfo_InRange_ReturnValue' has a wrong offset!");

// Function BP_TransportListCtrl2.BP_TransportListCtrl2_C.GetSlotDrawNum
// 0x0028 (0x0028 - 0x0000)
struct BP_TransportListCtrl2_C_GetSlotDrawNum final
{
public:
	int32                                         SlotNum;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B3A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransportLocationSlotInfo>     CallFunc_GetListInfo_All_ReturnValue;              // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotMaxNum_SlotMaxNum;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TransportListCtrl2_C_GetSlotDrawNum) == 0x000008, "Wrong alignment on BP_TransportListCtrl2_C_GetSlotDrawNum");
static_assert(sizeof(BP_TransportListCtrl2_C_GetSlotDrawNum) == 0x000028, "Wrong size on BP_TransportListCtrl2_C_GetSlotDrawNum");
static_assert(offsetof(BP_TransportListCtrl2_C_GetSlotDrawNum, SlotNum) == 0x000000, "Member 'BP_TransportListCtrl2_C_GetSlotDrawNum::SlotNum' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_GetSlotDrawNum, CallFunc_GetListInfo_All_ReturnValue) == 0x000008, "Member 'BP_TransportListCtrl2_C_GetSlotDrawNum::CallFunc_GetListInfo_All_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_GetSlotDrawNum, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_TransportListCtrl2_C_GetSlotDrawNum::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_GetSlotDrawNum, CallFunc_GetSlotMaxNum_SlotMaxNum) == 0x00001C, "Member 'BP_TransportListCtrl2_C_GetSlotDrawNum::CallFunc_GetSlotMaxNum_SlotMaxNum' has a wrong offset!");
static_assert(offsetof(BP_TransportListCtrl2_C_GetSlotDrawNum, CallFunc_Min_ReturnValue) == 0x000020, "Member 'BP_TransportListCtrl2_C_GetSlotDrawNum::CallFunc_Min_ReturnValue' has a wrong offset!");

// Function BP_TransportListCtrl2.BP_TransportListCtrl2_C.GetClampCursorAndOffset
// 0x0098 (0x0098 - 0x0000)
struct BP_TransportListCtrl2_C_GetClampCursorAndOffset final
{
public:
	int32                                         In_cursor;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         In_Offset;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ClampCursor;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ClampOffset;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_RetOffset;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_RetCursor;                                       // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_Offset_Max;                                      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_Offset_Min;                                      // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotDrawNum_SlotNum;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotDrawNum_SlotNum_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotDrawNum_SlotNum_2;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B3B[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransportLocationSlotInfo>     CallFunc_GetListInfo_All_ReturnValue;              // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B3C[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransportLocationSlotInfo>     CallFunc_GetListInfo_All_ReturnValue_1;            // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B3D[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransportLocationSlotInfo>     CallFunc_GetListInfo_All_ReturnValue_2;            // 0x0078(0x0010)(ReferenceParm)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B3E[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_4;            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
