#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TalkCamera

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"
#include "E_TalkCamera_structs.hpp"
#include "Engine_structs.hpp"
#include "ST_TalkCameraOffset_structs.hpp"
#include "E_TALK_DEBUG_CAMERA_structs.hpp"


namespace SDK::Params
{

// Function BP_TalkCamera.BP_TalkCamera_C.EvtDis_CameraChange__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_TalkCamera_C_EvtDis_CameraChange__DelegateSignature final
{
public:
	E_TalkCamera                                  StartType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_TalkCamera                                  EndType;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2873[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Alpha;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TalkCamera_C_EvtDis_CameraChange__DelegateSignature) == 0x000004, "Wrong alignment on BP_TalkCamera_C_EvtDis_CameraChange__DelegateSignature");
static_assert(sizeof(BP_TalkCamera_C_EvtDis_CameraChange__DelegateSignature) == 0x000008, "Wrong size on BP_TalkCamera_C_EvtDis_CameraChange__DelegateSignature");
static_assert(offsetof(BP_TalkCamera_C_EvtDis_CameraChange__DelegateSignature, StartType) == 0x000000, "Member 'BP_TalkCamera_C_EvtDis_CameraChange__DelegateSignature::StartType' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_EvtDis_CameraChange__DelegateSignature, EndType) == 0x000001, "Member 'BP_TalkCamera_C_EvtDis_CameraChange__DelegateSignature::EndType' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_EvtDis_CameraChange__DelegateSignature, Alpha) == 0x000004, "Member 'BP_TalkCamera_C_EvtDis_CameraChange__DelegateSignature::Alpha' has a wrong offset!");

// Function BP_TalkCamera.BP_TalkCamera_C.ExecuteUbergraph_BP_TalkCamera
// 0x0250 (0x0250 - 0x0000)
struct BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2874[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TalkDebug_GetCamera_IsDebugMode_Out;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_TalkCamera                                  CallFunc_TalkDebug_GetCamera_NormalType_Out;       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_TalkCamera                                  K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_TALK_DEBUG_CAMERA                           CallFunc_TalkDebug_GetDebugCameraType_CameraType;  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2875[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_TalkDebug_GetCamera_CameraTable_Out;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2876[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2877[0xC];                                     // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_Start;                          // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             K2Node_CustomEvent_Target;                         // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_Time;                           // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsEase;                         // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_TALK_CAMERA_MODEL_HIDE                      K2Node_CustomEvent_ModelHide;                      // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2878[0x1];                                     // 0x0097(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2879[0x1];                                     // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_TLerp_ReturnValue;                        // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x00D4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_287A[0x3];                                     // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult_1;    // 0x0164(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue_1;       // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_287B[0x3];                                     // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTargetHeight_Out;                      // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_287C[0xA];                                     // 0x01F6(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0200(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenDebugMenu_ReturnValue;              // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_287D[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleCameraSeamless_C*                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera) == 0x000010, "Wrong alignment on BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera");
static_assert(sizeof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera) == 0x000250, "Wrong size on BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, EntryPoint) == 0x000000, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, Temp_bool_Variable) == 0x000004, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_Ease_ReturnValue) == 0x000008, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_TalkDebug_GetCamera_IsDebugMode_Out) == 0x000010, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_TalkDebug_GetCamera_IsDebugMode_Out' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_TalkDebug_GetCamera_NormalType_Out) == 0x000011, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_TalkDebug_GetCamera_NormalType_Out' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, Temp_bool_Variable_1) == 0x000012, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000013, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, K2Node_Select_Default) == 0x000014, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_TalkDebug_GetDebugCameraType_CameraType) == 0x000015, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_TalkDebug_GetDebugCameraType_CameraType' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, K2Node_SwitchEnum_CmpSuccess) == 0x000016, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_TalkDebug_GetCamera_CameraTable_Out) == 0x000018, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_TalkDebug_GetCamera_CameraTable_Out' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00001C, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_SelectInt_ReturnValue) == 0x000020, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, K2Node_CustomEvent_Start) == 0x000030, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::K2Node_CustomEvent_Start' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, K2Node_CustomEvent_Target) == 0x000060, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, K2Node_CustomEvent_Time) == 0x000090, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::K2Node_CustomEvent_Time' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, K2Node_CustomEvent_IsEase) == 0x000094, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::K2Node_CustomEvent_IsEase' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, K2Node_CustomEvent_ModelHide) == 0x000095, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::K2Node_CustomEvent_ModelHide' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_Not_PreBool_ReturnValue) == 0x000096, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, K2Node_Select_Default_1) == 0x000098, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x00009C, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00009D, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_BooleanAND_ReturnValue) == 0x00009E, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_TLerp_ReturnValue) == 0x0000A0, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_TLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_FMax_ReturnValue) == 0x0000D0, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0000D4, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_K2_SetActorTransform_ReturnValue) == 0x00015C, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000160, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_K2_SetActorTransform_SweepHitResult_1) == 0x000164, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_K2_SetActorTransform_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_K2_SetActorTransform_ReturnValue_1) == 0x0001EC, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_K2_SetActorTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_GetTargetHeight_Out) == 0x0001F0, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_GetTargetHeight_Out' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, K2Node_Event_EndPlayReason) == 0x0001F4, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_IsValid_ReturnValue) == 0x0001F5, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_GetTransform_ReturnValue) == 0x000200, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000230, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_IsOpenDebugMenu_ReturnValue) == 0x000238, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_IsOpenDebugMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_FinishSpawningActor_ReturnValue) == 0x000240, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_BooleanAND_ReturnValue_1) == 0x000248, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000249, "Member 'BP_TalkCamera_C_ExecuteUbergraph_BP_TalkCamera::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function BP_TalkCamera.BP_TalkCamera_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_TalkCamera_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TalkCamera_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_TalkCamera_C_ReceiveEndPlay");
static_assert(sizeof(BP_TalkCamera_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_TalkCamera_C_ReceiveEndPlay");
static_assert(offsetof(BP_TalkCamera_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_TalkCamera_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_TalkCamera.BP_TalkCamera_C.Evt_MoveCameraCore
// 0x0070 (0x0070 - 0x0000)
struct BP_TalkCamera_C_Evt_MoveCameraCore final
{
public:
	struct FTransform                             Start;                                             // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FTransform                             Target;                                            // 0x0030(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         Time;                                              // 0x0060(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEase;                                            // 0x0064(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_TALK_CAMERA_MODEL_HIDE                      ModelHide;                                         // 0x0065(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TalkCamera_C_Evt_MoveCameraCore) == 0x000010, "Wrong alignment on BP_TalkCamera_C_Evt_MoveCameraCore");
static_assert(sizeof(BP_TalkCamera_C_Evt_MoveCameraCore) == 0x000070, "Wrong size on BP_TalkCamera_C_Evt_MoveCameraCore");
static_assert(offsetof(BP_TalkCamera_C_Evt_MoveCameraCore, Start) == 0x000000, "Member 'BP_TalkCamera_C_Evt_MoveCameraCore::Start' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_Evt_MoveCameraCore, Target) == 0x000030, "Member 'BP_TalkCamera_C_Evt_MoveCameraCore::Target' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_Evt_MoveCameraCore, Time) == 0x000060, "Member 'BP_TalkCamera_C_Evt_MoveCameraCore::Time' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_Evt_MoveCameraCore, IsEase) == 0x000064, "Member 'BP_TalkCamera_C_Evt_MoveCameraCore::IsEase' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_Evt_MoveCameraCore, ModelHide) == 0x000065, "Member 'BP_TalkCamera_C_Evt_MoveCameraCore::ModelHide' has a wrong offset!");

// Function BP_TalkCamera.BP_TalkCamera_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_TalkCamera_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TalkCamera_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_TalkCamera_C_ReceiveTick");
static_assert(sizeof(BP_TalkCamera_C_ReceiveTick) == 0x000004, "Wrong size on BP_TalkCamera_C_ReceiveTick");
static_assert(offsetof(BP_TalkCamera_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_TalkCamera_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_TalkCamera.BP_TalkCamera_C.UserConstructionScript
// 0x0040 (0x0040 - 0x0000)
struct BP_TalkCamera_C_UserConstructionScript final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TalkCamera_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_TalkCamera_C_UserConstructionScript");
static_assert(sizeof(BP_TalkCamera_C_UserConstructionScript) == 0x000040, "Wrong size on BP_TalkCamera_C_UserConstructionScript");
static_assert(offsetof(BP_TalkCamera_C_UserConstructionScript, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'BP_TalkCamera_C_UserConstructionScript::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_UserConstructionScript, CallFunc_MakeLiteralInt_ReturnValue) == 0x000030, "Member 'BP_TalkCamera_C_UserConstructionScript::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");

// Function BP_TalkCamera.BP_TalkCamera_C.SetCameraTransform
// 0x0050 (0x0050 - 0x0000)
struct BP_TalkCamera_C_SetCameraTransform final
{
public:
	E_TalkCamera                                  Param_CameraType;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_287E[0xF];                                     // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TalkCamera_C_SetCameraTransform) == 0x000010, "Wrong alignment on BP_TalkCamera_C_SetCameraTransform");
static_assert(sizeof(BP_TalkCamera_C_SetCameraTransform) == 0x000050, "Wrong size on BP_TalkCamera_C_SetCameraTransform");
static_assert(offsetof(BP_TalkCamera_C_SetCameraTransform, Param_CameraType) == 0x000000, "Member 'BP_TalkCamera_C_SetCameraTransform::Param_CameraType' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_SetCameraTransform, Transform) == 0x000010, "Member 'BP_TalkCamera_C_SetCameraTransform::Transform' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_SetCameraTransform, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000040, "Member 'BP_TalkCamera_C_SetCameraTransform::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function BP_TalkCamera.BP_TalkCamera_C.GetCameraTransform
// 0x0080 (0x0080 - 0x0000)
struct BP_TalkCamera_C_GetCameraTransform final
{
public:
	E_TalkCamera                                  Param_CameraType;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_287F[0xF];                                     // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2880[0xC];                                     // 0x0044(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item;                           // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TalkCamera_C_GetCameraTransform) == 0x000010, "Wrong alignment on BP_TalkCamera_C_GetCameraTransform");
static_assert(sizeof(BP_TalkCamera_C_GetCameraTransform) == 0x000080, "Wrong size on BP_TalkCamera_C_GetCameraTransform");
static_assert(offsetof(BP_TalkCamera_C_GetCameraTransform, Param_CameraType) == 0x000000, "Member 'BP_TalkCamera_C_GetCameraTransform::Param_CameraType' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetCameraTransform, Transform) == 0x000010, "Member 'BP_TalkCamera_C_GetCameraTransform::Transform' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetCameraTransform, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000040, "Member 'BP_TalkCamera_C_GetCameraTransform::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetCameraTransform, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_TalkCamera_C_GetCameraTransform::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_TalkCamera.BP_TalkCamera_C.MoveCamera_ByType
// 0x0070 (0x0070 - 0x0000)
struct BP_TalkCamera_C_MoveCamera_ByType final
{
public:
	E_TalkCamera                                  Param_CameraType;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2881[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Time;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceMove;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Ease;                                              // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2882[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetCameraTransform_Transform;             // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0040(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TalkCamera_C_MoveCamera_ByType) == 0x000010, "Wrong alignment on BP_TalkCamera_C_MoveCamera_ByType");
static_assert(sizeof(BP_TalkCamera_C_MoveCamera_ByType) == 0x000070, "Wrong size on BP_TalkCamera_C_MoveCamera_ByType");
static_assert(offsetof(BP_TalkCamera_C_MoveCamera_ByType, Param_CameraType) == 0x000000, "Member 'BP_TalkCamera_C_MoveCamera_ByType::Param_CameraType' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_MoveCamera_ByType, Time) == 0x000004, "Member 'BP_TalkCamera_C_MoveCamera_ByType::Time' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_MoveCamera_ByType, ForceMove) == 0x000008, "Member 'BP_TalkCamera_C_MoveCamera_ByType::ForceMove' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_MoveCamera_ByType, Ease) == 0x000009, "Member 'BP_TalkCamera_C_MoveCamera_ByType::Ease' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_MoveCamera_ByType, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000A, "Member 'BP_TalkCamera_C_MoveCamera_ByType::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_MoveCamera_ByType, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00000B, "Member 'BP_TalkCamera_C_MoveCamera_ByType::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_MoveCamera_ByType, CallFunc_GetCameraTransform_Transform) == 0x000010, "Member 'BP_TalkCamera_C_MoveCamera_ByType::CallFunc_GetCameraTransform_Transform' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_MoveCamera_ByType, CallFunc_GetTransform_ReturnValue) == 0x000040, "Member 'BP_TalkCamera_C_MoveCamera_ByType::CallFunc_GetTransform_ReturnValue' has a wrong offset!");

// Function BP_TalkCamera.BP_TalkCamera_C.GetCameraParam_Yoro
// 0x00F0 (0x00F0 - 0x0000)
struct BP_TalkCamera_C_GetCameraParam_Yoro final
{
public:
	struct FVector                                Eye;                                               // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Look;                                              // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetEyeOffset_Yoro_EyeOffset;              // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLookOffset_Yoro_LookOffset;            // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRocation_Daath_ReturnValue;     // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue_1;          // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ModifyEyeFromCameraScale_ModifiedEye;     // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TalkCamera_C_GetCameraParam_Yoro) == 0x000010, "Wrong alignment on BP_TalkCamera_C_GetCameraParam_Yoro");
static_assert(sizeof(BP_TalkCamera_C_GetCameraParam_Yoro) == 0x0000F0, "Wrong size on BP_TalkCamera_C_GetCameraParam_Yoro");
static_assert(offsetof(BP_TalkCamera_C_GetCameraParam_Yoro, Eye) == 0x000000, "Member 'BP_TalkCamera_C_GetCameraParam_Yoro::Eye' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetCameraParam_Yoro, Look) == 0x00000C, "Member 'BP_TalkCamera_C_GetCameraParam_Yoro::Look' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetCameraParam_Yoro, CallFunc_GetEyeOffset_Yoro_EyeOffset) == 0x000018, "Member 'BP_TalkCamera_C_GetCameraParam_Yoro::CallFunc_GetEyeOffset_Yoro_EyeOffset' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetCameraParam_Yoro, CallFunc_GetLookOffset_Yoro_LookOffset) == 0x000024, "Member 'BP_TalkCamera_C_GetCameraParam_Yoro::CallFunc_GetLookOffset_Yoro_LookOffset' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetCameraParam_Yoro, CallFunc_BreakTransform_Location) == 0x000030, "Member 'BP_TalkCamera_C_GetCameraParam_Yoro::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetCameraParam_Yoro, CallFunc_BreakTransform_Rotation) == 0x00003C, "Member 'BP_TalkCamera_C_GetCameraParam_Yoro::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetCameraParam_Yoro, CallFunc_BreakTransform_Scale) == 0x000048, "Member 'BP_TalkCamera_C_GetCameraParam_Yoro::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetCameraParam_Yoro, CallFunc_BreakTransform_Location_1) == 0x000054, "Member 'BP_TalkCamera_C_GetCameraParam_Yoro::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetCameraParam_Yoro, CallFunc_BreakTransform_Rotation_1) == 0x000060, "Member 'BP_TalkCamera_C_GetCameraParam_Yoro::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetCameraParam_Yoro, CallFunc_BreakTransform_Scale_1) == 0x00006C, "Member 'BP_TalkCamera_C_GetCameraParam_Yoro::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetCameraParam_Yoro, CallFunc_Add_VectorVector_ReturnValue) == 0x000078, "Member 'BP_TalkCamera_C_GetCameraParam_Yoro::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetCameraParam_Yoro, CallFunc_FindLookAtRocation_Daath_ReturnValue) == 0x000084, "Member 'BP_TalkCamera_C_GetCameraParam_Yoro::CallFunc_FindLookAtRocation_Daath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetCameraParam_Yoro, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'BP_TalkCamera_C_GetCameraParam_Yoro::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetCameraParam_Yoro, CallFunc_TransformLocation_ReturnValue) == 0x0000C0, "Member 'BP_TalkCamera_C_GetCameraParam_Yoro::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetCameraParam_Yoro, CallFunc_TransformLocation_ReturnValue_1) == 0x0000CC, "Member 'BP_TalkCamera_C_GetCameraParam_Yoro::CallFunc_TransformLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetCameraParam_Yoro, CallFunc_ModifyEyeFromCameraScale_ModifiedEye) == 0x0000D8, "Member 'BP_TalkCamera_C_GetCameraParam_Yoro::CallFunc_ModifyEyeFromCameraScale_ModifiedEye' has a wrong offset!");

// Function BP_TalkCamera.BP_TalkCamera_C.GetEyeOffset_Yoro
// 0x003C (0x003C - 0x0000)
struct BP_TalkCamera_C_GetEyeOffset_Yoro final
{
public:
	struct FVector                                EyeOffset;                                         // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TalkDebug_GetCameraUpOffset_Param;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TalkDebug_GetCameraUpOffset_Param_1;      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TalkDebug_GetCameraUpOffset_Param_2;      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TalkCamera_C_GetEyeOffset_Yoro) == 0x000004, "Wrong alignment on BP_TalkCamera_C_GetEyeOffset_Yoro");
static_assert(sizeof(BP_TalkCamera_C_GetEyeOffset_Yoro) == 0x00003C, "Wrong size on BP_TalkCamera_C_GetEyeOffset_Yoro");
static_assert(offsetof(BP_TalkCamera_C_GetEyeOffset_Yoro, EyeOffset) == 0x000000, "Member 'BP_TalkCamera_C_GetEyeOffset_Yoro::EyeOffset' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetEyeOffset_Yoro, CallFunc_TalkDebug_GetCameraUpOffset_Param) == 0x00000C, "Member 'BP_TalkCamera_C_GetEyeOffset_Yoro::CallFunc_TalkDebug_GetCameraUpOffset_Param' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetEyeOffset_Yoro, CallFunc_TalkDebug_GetCameraUpOffset_Param_1) == 0x000010, "Member 'BP_TalkCamera_C_GetEyeOffset_Yoro::CallFunc_TalkDebug_GetCameraUpOffset_Param_1' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetEyeOffset_Yoro, CallFunc_TalkDebug_GetCameraUpOffset_Param_2) == 0x000014, "Member 'BP_TalkCamera_C_GetEyeOffset_Yoro::CallFunc_TalkDebug_GetCameraUpOffset_Param_2' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetEyeOffset_Yoro, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'BP_TalkCamera_C_GetEyeOffset_Yoro::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetEyeOffset_Yoro, CallFunc_Add_VectorVector_ReturnValue) == 0x000024, "Member 'BP_TalkCamera_C_GetEyeOffset_Yoro::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetEyeOffset_Yoro, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000030, "Member 'BP_TalkCamera_C_GetEyeOffset_Yoro::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");

// Function BP_TalkCamera.BP_TalkCamera_C.GetLookOffset_Yoro
// 0x003C (0x003C - 0x0000)
struct BP_TalkCamera_C_GetLookOffset_Yoro final
{
public:
	struct FVector                                LookOffset;                                        // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TalkDebug_GetCameraUpOffset_Param;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TalkDebug_GetCameraUpOffset_Param_1;      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TalkDebug_GetCameraUpOffset_Param_2;      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TalkCamera_C_GetLookOffset_Yoro) == 0x000004, "Wrong alignment on BP_TalkCamera_C_GetLookOffset_Yoro");
static_assert(sizeof(BP_TalkCamera_C_GetLookOffset_Yoro) == 0x00003C, "Wrong size on BP_TalkCamera_C_GetLookOffset_Yoro");
static_assert(offsetof(BP_TalkCamera_C_GetLookOffset_Yoro, LookOffset) == 0x000000, "Member 'BP_TalkCamera_C_GetLookOffset_Yoro::LookOffset' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetLookOffset_Yoro, CallFunc_TalkDebug_GetCameraUpOffset_Param) == 0x00000C, "Member 'BP_TalkCamera_C_GetLookOffset_Yoro::CallFunc_TalkDebug_GetCameraUpOffset_Param' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetLookOffset_Yoro, CallFunc_TalkDebug_GetCameraUpOffset_Param_1) == 0x000010, "Member 'BP_TalkCamera_C_GetLookOffset_Yoro::CallFunc_TalkDebug_GetCameraUpOffset_Param_1' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetLookOffset_Yoro, CallFunc_TalkDebug_GetCameraUpOffset_Param_2) == 0x000014, "Member 'BP_TalkCamera_C_GetLookOffset_Yoro::CallFunc_TalkDebug_GetCameraUpOffset_Param_2' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetLookOffset_Yoro, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'BP_TalkCamera_C_GetLookOffset_Yoro::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetLookOffset_Yoro, CallFunc_Add_VectorVector_ReturnValue) == 0x000024, "Member 'BP_TalkCamera_C_GetLookOffset_Yoro::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_GetLookOffset_Yoro, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000030, "Member 'BP_TalkCamera_C_GetLookOffset_Yoro::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");

// Function BP_TalkCamera.BP_TalkCamera_C.CheckCameraAnim
// 0x0002 (0x0002 - 0x0000)
struct BP_TalkCamera_C_CheckCameraAnim final
{
public:
	bool                                          IsMove;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TalkCamera_C_CheckCameraAnim) == 0x000001, "Wrong alignment on BP_TalkCamera_C_CheckCameraAnim");
static_assert(sizeof(BP_TalkCamera_C_CheckCameraAnim) == 0x000002, "Wrong size on BP_TalkCamera_C_CheckCameraAnim");
static_assert(offsetof(BP_TalkCamera_C_CheckCameraAnim, IsMove) == 0x000000, "Member 'BP_TalkCamera_C_CheckCameraAnim::IsMove' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_CheckCameraAnim, CallFunc_IsPlaying_ReturnValue) == 0x000001, "Member 'BP_TalkCamera_C_CheckCameraAnim::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");

// Function BP_TalkCamera.BP_TalkCamera_C.MoveCamera
// 0x0070 (0x0070 - 0x0000)
struct BP_TalkCamera_C_MoveCamera final
{
public:
	struct FTransform                             Target;                                            // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         Time;                                              // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEase;                                            // 0x0034(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2883[0xB];                                     // 0x0035(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0040(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TalkCamera_C_MoveCamera) == 0x000010, "Wrong alignment on BP_TalkCamera_C_MoveCamera");
static_assert(sizeof(BP_TalkCamera_C_MoveCamera) == 0x000070, "Wrong size on BP_TalkCamera_C_MoveCamera");
static_assert(offsetof(BP_TalkCamera_C_MoveCamera, Target) == 0x000000, "Member 'BP_TalkCamera_C_MoveCamera::Target' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_MoveCamera, Time) == 0x000030, "Member 'BP_TalkCamera_C_MoveCamera::Time' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_MoveCamera, IsEase) == 0x000034, "Member 'BP_TalkCamera_C_MoveCamera::IsEase' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_MoveCamera, CallFunc_GetTransform_ReturnValue) == 0x000040, "Member 'BP_TalkCamera_C_MoveCamera::CallFunc_GetTransform_ReturnValue' has a wrong offset!");

// Function BP_TalkCamera.BP_TalkCamera_C.FindLookAtRocation_Daath
// 0x0074 (0x0074 - 0x0000)
struct BP_TalkCamera_C_FindLookAtRocation_Daath final
{
public:
	struct FVector                                Start;                                             // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Target;                                            // 0x000C(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ZOnly;                                             // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2884[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ReturnValue;                                       // 0x001C(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	struct FVector                                L_Target;                                          // 0x0028(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                L_Start;                                           // 0x0034(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          L_ZOnly;                                           // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2885[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_ProjectPointOnToPlane_ReturnValue;        // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Find_Look_at_Rotation_with_UpVec_ReturnValue; // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Find_Look_at_Rotation_with_UpVec_ReturnValue_1; // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               K2Node_Select_Default;                             // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TalkCamera_C_FindLookAtRocation_Daath) == 0x000004, "Wrong alignment on BP_TalkCamera_C_FindLookAtRocation_Daath");
static_assert(sizeof(BP_TalkCamera_C_FindLookAtRocation_Daath) == 0x000074, "Wrong size on BP_TalkCamera_C_FindLookAtRocation_Daath");
static_assert(offsetof(BP_TalkCamera_C_FindLookAtRocation_Daath, Start) == 0x000000, "Member 'BP_TalkCamera_C_FindLookAtRocation_Daath::Start' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_FindLookAtRocation_Daath, Target) == 0x00000C, "Member 'BP_TalkCamera_C_FindLookAtRocation_Daath::Target' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_FindLookAtRocation_Daath, ZOnly) == 0x000018, "Member 'BP_TalkCamera_C_FindLookAtRocation_Daath::ZOnly' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_FindLookAtRocation_Daath, ReturnValue) == 0x00001C, "Member 'BP_TalkCamera_C_FindLookAtRocation_Daath::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_FindLookAtRocation_Daath, L_Target) == 0x000028, "Member 'BP_TalkCamera_C_FindLookAtRocation_Daath::L_Target' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_FindLookAtRocation_Daath, L_Start) == 0x000034, "Member 'BP_TalkCamera_C_FindLookAtRocation_Daath::L_Start' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_FindLookAtRocation_Daath, L_ZOnly) == 0x000040, "Member 'BP_TalkCamera_C_FindLookAtRocation_Daath::L_ZOnly' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_FindLookAtRocation_Daath, Temp_bool_Variable) == 0x000041, "Member 'BP_TalkCamera_C_FindLookAtRocation_Daath::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_FindLookAtRocation_Daath, CallFunc_ProjectPointOnToPlane_ReturnValue) == 0x000044, "Member 'BP_TalkCamera_C_FindLookAtRocation_Daath::CallFunc_ProjectPointOnToPlane_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_FindLookAtRocation_Daath, CallFunc_Find_Look_at_Rotation_with_UpVec_ReturnValue) == 0x000050, "Member 'BP_TalkCamera_C_FindLookAtRocation_Daath::CallFunc_Find_Look_at_Rotation_with_UpVec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_FindLookAtRocation_Daath, CallFunc_Find_Look_at_Rotation_with_UpVec_ReturnValue_1) == 0x00005C, "Member 'BP_TalkCamera_C_FindLookAtRocation_Daath::CallFunc_Find_Look_at_Rotation_with_UpVec_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_FindLookAtRocation_Daath, K2Node_Select_Default) == 0x000068, "Member 'BP_TalkCamera_C_FindLookAtRocation_Daath::K2Node_Select_Default' has a wrong offset!");

// Function BP_TalkCamera.BP_TalkCamera_C.ModifyEyeFromCameraScale
// 0x0058 (0x0058 - 0x0000)
struct BP_TalkCamera_C_ModifyEyeFromCameraScale final
{
public:
	struct FVector                                Eye;                                               // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Look;                                              // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraScale;                                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ModifiedEye;                                       // 0x001C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LLookToEye;                                        // 0x0028(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TalkCamera_C_ModifyEyeFromCameraScale) == 0x000004, "Wrong alignment on BP_TalkCamera_C_ModifyEyeFromCameraScale");
static_assert(sizeof(BP_TalkCamera_C_ModifyEyeFromCameraScale) == 0x000058, "Wrong size on BP_TalkCamera_C_ModifyEyeFromCameraScale");
static_assert(offsetof(BP_TalkCamera_C_ModifyEyeFromCameraScale, Eye) == 0x000000, "Member 'BP_TalkCamera_C_ModifyEyeFromCameraScale::Eye' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ModifyEyeFromCameraScale, Look) == 0x00000C, "Member 'BP_TalkCamera_C_ModifyEyeFromCameraScale::Look' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ModifyEyeFromCameraScale, CameraScale) == 0x000018, "Member 'BP_TalkCamera_C_ModifyEyeFromCameraScale::CameraScale' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ModifyEyeFromCameraScale, ModifiedEye) == 0x00001C, "Member 'BP_TalkCamera_C_ModifyEyeFromCameraScale::ModifiedEye' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ModifyEyeFromCameraScale, LLookToEye) == 0x000028, "Member 'BP_TalkCamera_C_ModifyEyeFromCameraScale::LLookToEye' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ModifyEyeFromCameraScale, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000034, "Member 'BP_TalkCamera_C_ModifyEyeFromCameraScale::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ModifyEyeFromCameraScale, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000040, "Member 'BP_TalkCamera_C_ModifyEyeFromCameraScale::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TalkCamera_C_ModifyEyeFromCameraScale, CallFunc_Add_VectorVector_ReturnValue) == 0x00004C, "Member 'BP_TalkCamera_C_ModifyEyeFromCameraScale::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function BP_TalkCamera.BP_TalkCamera_C.SetParam
// 0x0280 (0x0280 - 0x0000)
struct BP_TalkCamera_C_SetParam final
{
public:
	struct FTransform                             Param_BaseCameraTransform;                         // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FTransform                             PlayerFace;                                        // 0x0030(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FTransform                             PlayerChest;                                       // 0x0060(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FTransform                             EnemyFace;                                         // 0x0090(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FTransform                             EnemyBody;                                         // 0x00C0(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FTransform                             Param_HeroTalkTransform;                           // 0x00F0(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
