#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MapGimmickAreaEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_MapGimmickAreaEntry.BPC_MapGimmickAreaEntry_C
// 0x0048 (0x00F8 - 0x00B0)
class UBPC_MapGimmickAreaEntry_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         GimmickAreaCount;                                  // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGetEnd;                                          // 0x00BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CheckInitGimmickArea;                              // 0x00BD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A089[0x2];                                     // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             EvtDis_Show;                                       // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EvtDis_Hide;                                       // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsView;                                            // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A08A[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             EvtDis_Show_WalkedIn;                              // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void EvtDis_Show__DelegateSignature();
	void EvtDis_Hide__DelegateSignature();
	void EvtDis_Show_WalkedIn__DelegateSignature(bool WalkedIn);
	void ExecuteUbergraph_BPC_MapGimmickAreaEntry(int32 EntryPoint);
	void InitArea();
	void ExitArea();
	void EnterArea(bool WalkedIn);
	void CheckView(bool* View);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_MapGimmickAreaEntry_C">();
	}
	static class UBPC_MapGimmickAreaEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_MapGimmickAreaEntry_C>();
	}
};
static_assert(alignof(UBPC_MapGimmickAreaEntry_C) == 0x000008, "Wrong alignment on UBPC_MapGimmickAreaEntry_C");
static_assert(sizeof(UBPC_MapGimmickAreaEntry_C) == 0x0000F8, "Wrong size on UBPC_MapGimmickAreaEntry_C");
static_assert(offsetof(UBPC_MapGimmickAreaEntry_C, UberGraphFrame) == 0x0000B0, "Member 'UBPC_MapGimmickAreaEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_MapGimmickAreaEntry_C, GimmickAreaCount) == 0x0000B8, "Member 'UBPC_MapGimmickAreaEntry_C::GimmickAreaCount' has a wrong offset!");
static_assert(offsetof(UBPC_MapGimmickAreaEntry_C, IsGetEnd) == 0x0000BC, "Member 'UBPC_MapGimmickAreaEntry_C::IsGetEnd' has a wrong offset!");
static_assert(offsetof(UBPC_MapGimmickAreaEntry_C, CheckInitGimmickArea) == 0x0000BD, "Member 'UBPC_MapGimmickAreaEntry_C::CheckInitGimmickArea' has a wrong offset!");
static_assert(offsetof(UBPC_MapGimmickAreaEntry_C, EvtDis_Show) == 0x0000C0, "Member 'UBPC_MapGimmickAreaEntry_C::EvtDis_Show' has a wrong offset!");
static_assert(offsetof(UBPC_MapGimmickAreaEntry_C, EvtDis_Hide) == 0x0000D0, "Member 'UBPC_MapGimmickAreaEntry_C::EvtDis_Hide' has a wrong offset!");
static_assert(offsetof(UBPC_MapGimmickAreaEntry_C, IsView) == 0x0000E0, "Member 'UBPC_MapGimmickAreaEntry_C::IsView' has a wrong offset!");
static_assert(offsetof(UBPC_MapGimmickAreaEntry_C, EvtDis_Show_WalkedIn) == 0x0000E8, "Member 'UBPC_MapGimmickAreaEntry_C::EvtDis_Show_WalkedIn' has a wrong offset!");

}

