#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MapGimmickAreaEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPC_MapGimmickAreaEntry.BPC_MapGimmickAreaEntry_C.EvtDis_Show_WalkedIn__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BPC_MapGimmickAreaEntry_C_EvtDis_Show_WalkedIn__DelegateSignature final
{
public:
	bool                                          WalkedIn;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_MapGimmickAreaEntry_C_EvtDis_Show_WalkedIn__DelegateSignature) == 0x000001, "Wrong alignment on BPC_MapGimmickAreaEntry_C_EvtDis_Show_WalkedIn__DelegateSignature");
static_assert(sizeof(BPC_MapGimmickAreaEntry_C_EvtDis_Show_WalkedIn__DelegateSignature) == 0x000001, "Wrong size on BPC_MapGimmickAreaEntry_C_EvtDis_Show_WalkedIn__DelegateSignature");
static_assert(offsetof(BPC_MapGimmickAreaEntry_C_EvtDis_Show_WalkedIn__DelegateSignature, WalkedIn) == 0x000000, "Member 'BPC_MapGimmickAreaEntry_C_EvtDis_Show_WalkedIn__DelegateSignature::WalkedIn' has a wrong offset!");

// Function BPC_MapGimmickAreaEntry.BPC_MapGimmickAreaEntry_C.ExecuteUbergraph_BPC_MapGimmickAreaEntry
// 0x0020 (0x0020 - 0x0000)
struct BPC_MapGimmickAreaEntry_C_ExecuteUbergraph_BPC_MapGimmickAreaEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A08B[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A08C[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_WalkedIn;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_MapGimmickAreaEntry_C_ExecuteUbergraph_BPC_MapGimmickAreaEntry) == 0x000004, "Wrong alignment on BPC_MapGimmickAreaEntry_C_ExecuteUbergraph_BPC_MapGimmickAreaEntry");
static_assert(sizeof(BPC_MapGimmickAreaEntry_C_ExecuteUbergraph_BPC_MapGimmickAreaEntry) == 0x000020, "Wrong size on BPC_MapGimmickAreaEntry_C_ExecuteUbergraph_BPC_MapGimmickAreaEntry");
static_assert(offsetof(BPC_MapGimmickAreaEntry_C_ExecuteUbergraph_BPC_MapGimmickAreaEntry, EntryPoint) == 0x000000, "Member 'BPC_MapGimmickAreaEntry_C_ExecuteUbergraph_BPC_MapGimmickAreaEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_MapGimmickAreaEntry_C_ExecuteUbergraph_BPC_MapGimmickAreaEntry, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000004, "Member 'BPC_MapGimmickAreaEntry_C_ExecuteUbergraph_BPC_MapGimmickAreaEntry::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MapGimmickAreaEntry_C_ExecuteUbergraph_BPC_MapGimmickAreaEntry, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BPC_MapGimmickAreaEntry_C_ExecuteUbergraph_BPC_MapGimmickAreaEntry::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MapGimmickAreaEntry_C_ExecuteUbergraph_BPC_MapGimmickAreaEntry, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'BPC_MapGimmickAreaEntry_C_ExecuteUbergraph_BPC_MapGimmickAreaEntry::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MapGimmickAreaEntry_C_ExecuteUbergraph_BPC_MapGimmickAreaEntry, CallFunc_Max_ReturnValue) == 0x000010, "Member 'BPC_MapGimmickAreaEntry_C_ExecuteUbergraph_BPC_MapGimmickAreaEntry::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MapGimmickAreaEntry_C_ExecuteUbergraph_BPC_MapGimmickAreaEntry, CallFunc_Greater_IntInt_ReturnValue) == 0x000014, "Member 'BPC_MapGimmickAreaEntry_C_ExecuteUbergraph_BPC_MapGimmickAreaEntry::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MapGimmickAreaEntry_C_ExecuteUbergraph_BPC_MapGimmickAreaEntry, Temp_int_Variable) == 0x000018, "Member 'BPC_MapGimmickAreaEntry_C_ExecuteUbergraph_BPC_MapGimmickAreaEntry::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPC_MapGimmickAreaEntry_C_ExecuteUbergraph_BPC_MapGimmickAreaEntry, K2Node_Event_WalkedIn) == 0x00001C, "Member 'BPC_MapGimmickAreaEntry_C_ExecuteUbergraph_BPC_MapGimmickAreaEntry::K2Node_Event_WalkedIn' has a wrong offset!");

// Function BPC_MapGimmickAreaEntry.BPC_MapGimmickAreaEntry_C.EnterArea
// 0x0001 (0x0001 - 0x0000)
struct BPC_MapGimmickAreaEntry_C_EnterArea final
{
public:
	bool                                          WalkedIn;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_MapGimmickAreaEntry_C_EnterArea) == 0x000001, "Wrong alignment on BPC_MapGimmickAreaEntry_C_EnterArea");
static_assert(sizeof(BPC_MapGimmickAreaEntry_C_EnterArea) == 0x000001, "Wrong size on BPC_MapGimmickAreaEntry_C_EnterArea");
static_assert(offsetof(BPC_MapGimmickAreaEntry_C_EnterArea, WalkedIn) == 0x000000, "Member 'BPC_MapGimmickAreaEntry_C_EnterArea::WalkedIn' has a wrong offset!");

// Function BPC_MapGimmickAreaEntry.BPC_MapGimmickAreaEntry_C.CheckView
// 0x0001 (0x0001 - 0x0000)
struct BPC_MapGimmickAreaEntry_C_CheckView final
{
public:
	bool                                          View;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_MapGimmickAreaEntry_C_CheckView) == 0x000001, "Wrong alignment on BPC_MapGimmickAreaEntry_C_CheckView");
static_assert(sizeof(BPC_MapGimmickAreaEntry_C_CheckView) == 0x000001, "Wrong size on BPC_MapGimmickAreaEntry_C_CheckView");
static_assert(offsetof(BPC_MapGimmickAreaEntry_C_CheckView, View) == 0x000000, "Member 'BPC_MapGimmickAreaEntry_C_CheckView::View' has a wrong offset!");

}

