#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MapSymbolEx_Shikiouji

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_MapSymbolEx_Shikiouji.BPC_MapSymbolEx_Shikiouji_C
// 0x0050 (0x0100 - 0x00B0)
class UBPC_MapSymbolEx_Shikiouji_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 AttackEffectActor;                                 // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   AttackEffectActor_Soft;                            // 0x00C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 AttackEffectActor_Class;                           // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACustomPawn*                            CustomPawn;                                        // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMapSymbolBaseCompornent_C*             SymbolComponent;                                   // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPC_MapSymbolEx_Shikiouji(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnEvtDis_AttackMotion();
	void OnLoaded_860D4AC843B27BCC7EB7FDA45134F559(TSubclassOf<class UObject> Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_MapSymbolEx_Shikiouji_C">();
	}
	static class UBPC_MapSymbolEx_Shikiouji_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_MapSymbolEx_Shikiouji_C>();
	}
};
static_assert(alignof(UBPC_MapSymbolEx_Shikiouji_C) == 0x000008, "Wrong alignment on UBPC_MapSymbolEx_Shikiouji_C");
static_assert(sizeof(UBPC_MapSymbolEx_Shikiouji_C) == 0x000100, "Wrong size on UBPC_MapSymbolEx_Shikiouji_C");
static_assert(offsetof(UBPC_MapSymbolEx_Shikiouji_C, UberGraphFrame) == 0x0000B0, "Member 'UBPC_MapSymbolEx_Shikiouji_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_MapSymbolEx_Shikiouji_C, AttackEffectActor) == 0x0000B8, "Member 'UBPC_MapSymbolEx_Shikiouji_C::AttackEffectActor' has a wrong offset!");
static_assert(offsetof(UBPC_MapSymbolEx_Shikiouji_C, AttackEffectActor_Soft) == 0x0000C0, "Member 'UBPC_MapSymbolEx_Shikiouji_C::AttackEffectActor_Soft' has a wrong offset!");
static_assert(offsetof(UBPC_MapSymbolEx_Shikiouji_C, AttackEffectActor_Class) == 0x0000E8, "Member 'UBPC_MapSymbolEx_Shikiouji_C::AttackEffectActor_Class' has a wrong offset!");
static_assert(offsetof(UBPC_MapSymbolEx_Shikiouji_C, CustomPawn) == 0x0000F0, "Member 'UBPC_MapSymbolEx_Shikiouji_C::CustomPawn' has a wrong offset!");
static_assert(offsetof(UBPC_MapSymbolEx_Shikiouji_C, SymbolComponent) == 0x0000F8, "Member 'UBPC_MapSymbolEx_Shikiouji_C::SymbolComponent' has a wrong offset!");

}

