#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_ResidentSound

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_ResidentSound.BPC_ResidentSound_C
// 0x0030 (0x0230 - 0x0200)
class UBPC_ResidentSound_C final : public USceneComponent
{
public:
	uint8                                         Pad_236B[0x8];                                     // 0x01F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0200(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USoundAtomCue*                          Cue;                                               // 0x0208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         PlayDistance;                                      // 0x0210(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_236C[0x4];                                     // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         AtomComponent;                                     // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAutoPlay;                                         // 0x0220(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_236D[0x3];                                     // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartDelay_Min;                                    // 0x0224(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         StartDelay_Max;                                    // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPC_ResidentSound(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Stop();
	void Play();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_ResidentSound_C">();
	}
	static class UBPC_ResidentSound_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_ResidentSound_C>();
	}
};
static_assert(alignof(UBPC_ResidentSound_C) == 0x000010, "Wrong alignment on UBPC_ResidentSound_C");
static_assert(sizeof(UBPC_ResidentSound_C) == 0x000230, "Wrong size on UBPC_ResidentSound_C");
static_assert(offsetof(UBPC_ResidentSound_C, UberGraphFrame) == 0x000200, "Member 'UBPC_ResidentSound_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_ResidentSound_C, Cue) == 0x000208, "Member 'UBPC_ResidentSound_C::Cue' has a wrong offset!");
static_assert(offsetof(UBPC_ResidentSound_C, PlayDistance) == 0x000210, "Member 'UBPC_ResidentSound_C::PlayDistance' has a wrong offset!");
static_assert(offsetof(UBPC_ResidentSound_C, AtomComponent) == 0x000218, "Member 'UBPC_ResidentSound_C::AtomComponent' has a wrong offset!");
static_assert(offsetof(UBPC_ResidentSound_C, bAutoPlay) == 0x000220, "Member 'UBPC_ResidentSound_C::bAutoPlay' has a wrong offset!");
static_assert(offsetof(UBPC_ResidentSound_C, StartDelay_Min) == 0x000224, "Member 'UBPC_ResidentSound_C::StartDelay_Min' has a wrong offset!");
static_assert(offsetof(UBPC_ResidentSound_C, StartDelay_Max) == 0x000228, "Member 'UBPC_ResidentSound_C::StartDelay_Max' has a wrong offset!");

}

