#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_OptionFieldBrightnessCtrl

#include "Basic.hpp"

#include "DaathTypeList_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "OptionFieldBrightnessPP_st_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_OptionFieldBrightnessCtrl.BPC_OptionFieldBrightnessCtrl_C
// 0x0068 (0x0118 - 0x00B0)
class UBPC_OptionFieldBrightnessCtrl_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCurveFloat*                            BrightnessCurve;                                   // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        EnvLevelID;                                        // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPrimaryAssetId>                AreaEnvLevelIDs;                                   // 0x00D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          OptionBrightnessActive;                            // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B98[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryAssetId                        SpecialEnvLevelID;                                 // 0x00E4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B99[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOptionFieldBrightnessPP_st>    PostInfoList;                                      // 0x00F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FPrimaryAssetId>                GardenEnvLevelIDs;                                 // 0x0108(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BPC_OptionFieldBrightnessCtrl(int32 EntryPoint);
	void ReceiveBeginPlay();
	void MultiplyBrightness();
	void MultiplyBrightness_SelectPP(class APostProcessVolume* PostProcess);
	void ResetBrightness();
	void SetOptionBrightnessActive(bool Active);
	void GetDefaultGainColor(const struct FOptionFieldBrightnessPP_st& Info, struct FVector4* Color);
	void OnMainEnvLevelLoaded();
	void OnSpecialEnvLevelLoaded();
	void OnAreaEnvLevelLoaded();
	void OnBattleEnvLevelLoaded();
	void OnEnvLevelLoaded_Base(class ULevelStreaming* Level);
	void UpdateBrightnessVolume();
	void OnGardenEnvLevelLoaded();
	void BPI_MultiplyBrightness_SelectPP(class APostProcessVolume* PostProcess, bool* NewParam);
	void BPI_SetOptionBrightnessActive(bool Active, bool* NewParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_OptionFieldBrightnessCtrl_C">();
	}
	static class UBPC_OptionFieldBrightnessCtrl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_OptionFieldBrightnessCtrl_C>();
	}
};
static_assert(alignof(UBPC_OptionFieldBrightnessCtrl_C) == 0x000008, "Wrong alignment on UBPC_OptionFieldBrightnessCtrl_C");
static_assert(sizeof(UBPC_OptionFieldBrightnessCtrl_C) == 0x000118, "Wrong size on UBPC_OptionFieldBrightnessCtrl_C");
static_assert(offsetof(UBPC_OptionFieldBrightnessCtrl_C, UberGraphFrame) == 0x0000B0, "Member 'UBPC_OptionFieldBrightnessCtrl_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_OptionFieldBrightnessCtrl_C, BrightnessCurve) == 0x0000B8, "Member 'UBPC_OptionFieldBrightnessCtrl_C::BrightnessCurve' has a wrong offset!");
static_assert(offsetof(UBPC_OptionFieldBrightnessCtrl_C, EnvLevelID) == 0x0000C0, "Member 'UBPC_OptionFieldBrightnessCtrl_C::EnvLevelID' has a wrong offset!");
static_assert(offsetof(UBPC_OptionFieldBrightnessCtrl_C, AreaEnvLevelIDs) == 0x0000D0, "Member 'UBPC_OptionFieldBrightnessCtrl_C::AreaEnvLevelIDs' has a wrong offset!");
static_assert(offsetof(UBPC_OptionFieldBrightnessCtrl_C, OptionBrightnessActive) == 0x0000E0, "Member 'UBPC_OptionFieldBrightnessCtrl_C::OptionBrightnessActive' has a wrong offset!");
static_assert(offsetof(UBPC_OptionFieldBrightnessCtrl_C, SpecialEnvLevelID) == 0x0000E4, "Member 'UBPC_OptionFieldBrightnessCtrl_C::SpecialEnvLevelID' has a wrong offset!");
static_assert(offsetof(UBPC_OptionFieldBrightnessCtrl_C, PostInfoList) == 0x0000F8, "Member 'UBPC_OptionFieldBrightnessCtrl_C::PostInfoList' has a wrong offset!");
static_assert(offsetof(UBPC_OptionFieldBrightnessCtrl_C, GardenEnvLevelIDs) == 0x000108, "Member 'UBPC_OptionFieldBrightnessCtrl_C::GardenEnvLevelIDs' has a wrong offset!");

}

