#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MapSoundSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPC_MapSoundSelector.BPC_MapSoundSelector_C.ExecuteUbergraph_BPC_MapSoundSelector
// 0x0030 (0x0030 - 0x0000)
struct BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4209[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_420A[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_1;                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bEventRunning;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_420B[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMapID_ReturnValue;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector) == 0x000008, "Wrong alignment on BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector");
static_assert(sizeof(BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector) == 0x000030, "Wrong size on BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector");
static_assert(offsetof(BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector, EntryPoint) == 0x000000, "Member 'BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector, CallFunc_Get_ReturnValue) == 0x000008, "Member 'BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector, K2Node_Event_EndPlayReason) == 0x000010, "Member 'BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector, CallFunc_Get_ReturnValue_1) == 0x000018, "Member 'BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector, Temp_bool_IsClosed_Variable) == 0x000020, "Member 'BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector, K2Node_CustomEvent_bEventRunning) == 0x000021, "Member 'BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector::K2Node_CustomEvent_bEventRunning' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector, CallFunc_GetMapID_ReturnValue) == 0x000024, "Member 'BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector::CallFunc_GetMapID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000028, "Member 'BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000029, "Member 'BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector, CallFunc_BooleanOR_ReturnValue) == 0x00002A, "Member 'BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector, CallFunc_BooleanOR_ReturnValue_1) == 0x00002B, "Member 'BPC_MapSoundSelector_C_ExecuteUbergraph_BPC_MapSoundSelector::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function BPC_MapSoundSelector.BPC_MapSoundSelector_C.InitMapSoundSelector
// 0x0001 (0x0001 - 0x0000)
struct BPC_MapSoundSelector_C_InitMapSoundSelector final
{
public:
	bool                                          bEventRunning;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_MapSoundSelector_C_InitMapSoundSelector) == 0x000001, "Wrong alignment on BPC_MapSoundSelector_C_InitMapSoundSelector");
static_assert(sizeof(BPC_MapSoundSelector_C_InitMapSoundSelector) == 0x000001, "Wrong size on BPC_MapSoundSelector_C_InitMapSoundSelector");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapSoundSelector, bEventRunning) == 0x000000, "Member 'BPC_MapSoundSelector_C_InitMapSoundSelector::bEventRunning' has a wrong offset!");

// Function BPC_MapSoundSelector.BPC_MapSoundSelector_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BPC_MapSoundSelector_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MapSoundSelector_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BPC_MapSoundSelector_C_ReceiveEndPlay");
static_assert(sizeof(BPC_MapSoundSelector_C_ReceiveEndPlay) == 0x000001, "Wrong size on BPC_MapSoundSelector_C_ReceiveEndPlay");
static_assert(offsetof(BPC_MapSoundSelector_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BPC_MapSoundSelector_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BPC_MapSoundSelector.BPC_MapSoundSelector_C.InitMapENV
// 0x01A0 (0x01A0 - 0x0000)
struct BPC_MapSoundSelector_C_InitMapENV final
{
public:
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_420C[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_1;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_420D[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_2;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_420E[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_3;                        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_4;                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_420F[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_5;                        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_6;                        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_6;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_7;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4210[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_7;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_8;                        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_8;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4211[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_9;                        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_10;                       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_11;                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_12;                       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_9;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4212[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_13;                       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_10;         // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_11;         // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_12;         // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4213[0x5];                                     // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_14;                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_13;         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_14;         // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4214[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_15;                       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_16;                       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_15;         // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_16;         // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4215[0x6];                                     // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_17;                       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_18;                       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_17;         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4216[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_19;                       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_18;         // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_19;         // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4217[0x6];                                     // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_20;                       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_21;                       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_20;         // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4218[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_22;                       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_23;                       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_24;                       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_21;         // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4219[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_25;                       // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_22;         // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_23;         // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_24;         // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_25;         // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421A[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_26;                       // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_27;                       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_26;         // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421B[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_28;                       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_27;         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_28;         // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_29;         // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421C[0x5];                                     // 0x016B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_29;                       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_30;                       // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_30;         // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421D[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_31;                       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_31;         // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421E[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_32;                       // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MapSoundSelector_C_InitMapENV) == 0x000008, "Wrong alignment on BPC_MapSoundSelector_C_InitMapENV");
static_assert(sizeof(BPC_MapSoundSelector_C_InitMapENV) == 0x0001A0, "Wrong size on BPC_MapSoundSelector_C_InitMapENV");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue) == 0x000000, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_1) == 0x000010, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000018, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000019, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_2) == 0x000020, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000028, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x000029, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_3) == 0x000030, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_4) == 0x000038, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_5) == 0x000040, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_5) == 0x000048, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_6) == 0x000050, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_6) == 0x000058, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_7) == 0x000059, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_7) == 0x000060, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_8) == 0x000068, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_8) == 0x000070, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_9) == 0x000078, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_10) == 0x000080, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_11) == 0x000088, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_12) == 0x000090, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_9) == 0x000098, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_13) == 0x0000A0, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_10) == 0x0000A8, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_11) == 0x0000A9, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_12) == 0x0000AA, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_14) == 0x0000B0, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_13) == 0x0000B8, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_14) == 0x0000B9, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_15) == 0x0000C0, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_16) == 0x0000C8, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_15) == 0x0000D0, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_16) == 0x0000D1, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_17) == 0x0000D8, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_18) == 0x0000E0, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_17) == 0x0000E8, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_19) == 0x0000F0, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_18) == 0x0000F8, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_19) == 0x0000F9, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_20) == 0x000100, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_21) == 0x000108, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_20) == 0x000110, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_22) == 0x000118, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_23) == 0x000120, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_24) == 0x000128, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_21) == 0x000130, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_25) == 0x000138, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_22) == 0x000140, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_23) == 0x000141, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_24) == 0x000142, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_25) == 0x000143, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_26) == 0x000148, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_27) == 0x000150, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_26) == 0x000158, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_28) == 0x000160, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_27) == 0x000168, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_28) == 0x000169, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_29) == 0x00016A, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_29) == 0x000170, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_30) == 0x000178, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_30' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_30) == 0x000180, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_30' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_31) == 0x000188, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_31' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_EqualEqual_IntInt_ReturnValue_31) == 0x000190, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_EqualEqual_IntInt_ReturnValue_31' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapENV, CallFunc_Get_ReturnValue_32) == 0x000198, "Member 'BPC_MapSoundSelector_C_InitMapENV::CallFunc_Get_ReturnValue_32' has a wrong offset!");

// Function BPC_MapSoundSelector.BPC_MapSoundSelector_C.InitMapBGM
// 0x0030 (0x0030 - 0x0000)
struct BPC_MapSoundSelector_C_InitMapBGM final
{
public:
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_6;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_7;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_8;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_9;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_10;         // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_11;         // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_12;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_13;         // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_14;         // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_15;         // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_16;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_17;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_18;         // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_19;         // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_20;         // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_1;             // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_21;         // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_22;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_2;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_3;             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_23;         // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_4;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_5;             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_24;         // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_6;             // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_7;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_8;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_25;         // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_26;         // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_9;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_10;            // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_11;            // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_27;         // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_12;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_28;         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_29;         // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_13;            // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_14;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_30;         // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_31;         // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_32;         // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_MapSoundSelector_C_InitMapBGM) == 0x000001, "Wrong alignment on BPC_MapSoundSelector_C_InitMapBGM");
static_assert(sizeof(BPC_MapSoundSelector_C_InitMapBGM) == 0x000030, "Wrong size on BPC_MapSoundSelector_C_InitMapBGM");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapBGM, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000000, "Member 'BPC_MapSoundSelector_C_InitMapBGM::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapBGM, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000001, "Member 'BPC_MapSoundSelector_C_InitMapBGM::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MapSoundSelector_C_InitMapBGM, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000002, "Member 'BPC_MapSoundSelector_C_InitMapBGM::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
