#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_HeightFogCtrl

#include "Basic.hpp"

#include "ST_DirectionalLightParameter_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ST_HeightFogParameter_structs.hpp"


namespace SDK::Params
{

// Function BPFL_HeightFogCtrl.BPFL_HeightFogCtrl_C.InterpHeightFogParameter
// 0x0198 (0x0198 - 0x0000)
struct BPFL_HeightFogCtrl_C_InterpHeightFogParameter final
{
public:
	float                                         Alpha;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_HeightFogParameter                 Src;                                               // 0x0004(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_HeightFogParameter                 Dst;                                               // 0x0044(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5082[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0088(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_HeightFogParameter                 Result;                                            // 0x0090(0x0040)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_ColorHSVInterp_ReturnValue;               // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_ColorHSVInterp_ReturnValue_1;             // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_8;        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_9;        // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_10;       // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_11;       // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_12;       // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_13;       // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_14;       // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_6;             // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_15;       // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_7;             // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_HeightFogParameter                 K2Node_MakeStruct_ST_HeightFogParameter;           // 0x0154(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter) == 0x000008, "Wrong alignment on BPFL_HeightFogCtrl_C_InterpHeightFogParameter");
static_assert(sizeof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter) == 0x000198, "Wrong size on BPFL_HeightFogCtrl_C_InterpHeightFogParameter");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, Alpha) == 0x000000, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::Alpha' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, Src) == 0x000004, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::Src' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, Dst) == 0x000044, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::Dst' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, __WorldContext) == 0x000088, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, Result) == 0x000090, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::Result' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000D0, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000D4, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000D8, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0000DC, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000E0, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0000E4, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_ColorHSVInterp_ReturnValue) == 0x0000E8, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_ColorHSVInterp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x0000F8, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x0000FC, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_ColorHSVInterp_ReturnValue_1) == 0x000100, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_ColorHSVInterp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x000110, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Multiply_FloatFloat_ReturnValue_7) == 0x000114, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Multiply_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Multiply_FloatFloat_ReturnValue_8) == 0x000118, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Multiply_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Multiply_FloatFloat_ReturnValue_9) == 0x00011C, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Multiply_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Multiply_FloatFloat_ReturnValue_10) == 0x000120, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Multiply_FloatFloat_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000124, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000128, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Multiply_FloatFloat_ReturnValue_11) == 0x00012C, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Multiply_FloatFloat_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Multiply_FloatFloat_ReturnValue_12) == 0x000130, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Multiply_FloatFloat_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x000134, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Add_FloatFloat_ReturnValue_4) == 0x000138, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Add_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Multiply_FloatFloat_ReturnValue_13) == 0x00013C, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Multiply_FloatFloat_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Multiply_FloatFloat_ReturnValue_14) == 0x000140, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Multiply_FloatFloat_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Add_FloatFloat_ReturnValue_5) == 0x000144, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Add_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Add_FloatFloat_ReturnValue_6) == 0x000148, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Add_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Multiply_FloatFloat_ReturnValue_15) == 0x00014C, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Multiply_FloatFloat_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, CallFunc_Add_FloatFloat_ReturnValue_7) == 0x000150, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::CallFunc_Add_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpHeightFogParameter, K2Node_MakeStruct_ST_HeightFogParameter) == 0x000154, "Member 'BPFL_HeightFogCtrl_C_InterpHeightFogParameter::K2Node_MakeStruct_ST_HeightFogParameter' has a wrong offset!");

// Function BPFL_HeightFogCtrl.BPFL_HeightFogCtrl_C.SetHeightFogParameterFromComponent
// 0x0050 (0x0050 - 0x0000)
struct BPFL_HeightFogCtrl_C_SetHeightFogParameterFromComponent final
{
public:
	struct FST_HeightFogParameter                 Param;                                             // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UExponentialHeightFogComponent*         Component;                                         // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_HeightFogCtrl_C_SetHeightFogParameterFromComponent) == 0x000008, "Wrong alignment on BPFL_HeightFogCtrl_C_SetHeightFogParameterFromComponent");
static_assert(sizeof(BPFL_HeightFogCtrl_C_SetHeightFogParameterFromComponent) == 0x000050, "Wrong size on BPFL_HeightFogCtrl_C_SetHeightFogParameterFromComponent");
static_assert(offsetof(BPFL_HeightFogCtrl_C_SetHeightFogParameterFromComponent, Param) == 0x000000, "Member 'BPFL_HeightFogCtrl_C_SetHeightFogParameterFromComponent::Param' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_SetHeightFogParameterFromComponent, Component) == 0x000040, "Member 'BPFL_HeightFogCtrl_C_SetHeightFogParameterFromComponent::Component' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_SetHeightFogParameterFromComponent, __WorldContext) == 0x000048, "Member 'BPFL_HeightFogCtrl_C_SetHeightFogParameterFromComponent::__WorldContext' has a wrong offset!");

// Function BPFL_HeightFogCtrl.BPFL_HeightFogCtrl_C.OnBattleStart_HeightFogCtrl
// 0x00D8 (0x00D8 - 0x0000)
struct BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewStartDistance;                                  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bStartDistanceOverride;                            // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5083[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AExponentialHeightFog*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExponentialHeightFog*                  CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0038(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5084[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FogCtrlHolder_C*                    K2Node_DynamicCast_AsBP_Fog_Ctrl_Holder;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5085[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HeightFogCtrlSphere_C*              CallFunc_Array_Get_Item_2;                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5086[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5087[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5088[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5089[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_508A[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HeightFogCtrlBox_C*                 CallFunc_Array_Get_Item_3;                         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HeightFogCtrlBox_ForBattle_C*       CallFunc_Array_Get_Item_4;                         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl) == 0x000008, "Wrong alignment on BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl");
static_assert(sizeof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl) == 0x0000D8, "Wrong size on BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, WorldContextObject) == 0x000000, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::WorldContextObject' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, __WorldContext) == 0x000008, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, NewStartDistance) == 0x000010, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::NewStartDistance' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, bStartDistanceOverride) == 0x000014, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::bStartDistanceOverride' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, CallFunc_Array_Get_Item) == 0x000030, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, CallFunc_GetAttachedActors_OutActors) == 0x000038, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, CallFunc_Array_Length_ReturnValue_1) == 0x00004C, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, Temp_int_Loop_Counter_Variable_1) == 0x000058, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, Temp_int_Loop_Counter_Variable_2) == 0x000060, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, CallFunc_Add_IntInt_ReturnValue_2) == 0x000064, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, Temp_int_Array_Index_Variable_1) == 0x000068, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, Temp_int_Array_Index_Variable_2) == 0x00006C, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, K2Node_DynamicCast_AsBP_Fog_Ctrl_Holder) == 0x000078, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::K2Node_DynamicCast_AsBP_Fog_Ctrl_Holder' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, CallFunc_Array_Get_Item_2) == 0x000088, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, CallFunc_Array_Length_ReturnValue_2) == 0x000090, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, CallFunc_Array_Length_ReturnValue_3) == 0x000094, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, CallFunc_Less_IntInt_ReturnValue_1) == 0x000098, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, CallFunc_Array_Length_ReturnValue_4) == 0x00009C, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000A0, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, Temp_int_Loop_Counter_Variable_3) == 0x0000A4, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, CallFunc_Less_IntInt_ReturnValue_3) == 0x0000A8, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000AC, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, Temp_int_Loop_Counter_Variable_4) == 0x0000B0, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, CallFunc_Less_IntInt_ReturnValue_4) == 0x0000B4, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000B8, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, Temp_int_Array_Index_Variable_3) == 0x0000BC, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, Temp_int_Array_Index_Variable_4) == 0x0000C0, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, CallFunc_Array_Get_Item_3) == 0x0000C8, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl, CallFunc_Array_Get_Item_4) == 0x0000D0, "Member 'BPFL_HeightFogCtrl_C_OnBattleStart_HeightFogCtrl::CallFunc_Array_Get_Item_4' has a wrong offset!");

// Function BPFL_HeightFogCtrl.BPFL_HeightFogCtrl_C.InterpDirectionalLightParameter
// 0x00C8 (0x00C8 - 0x0000)
struct BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter final
{
public:
	float                                         Alpha;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_DirectionalLightParameter          Src;                                               // 0x0004(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_DirectionalLightParameter          Dst;                                               // 0x0018(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_508B[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_DirectionalLightParameter          Result;                                            // 0x0038(0x0014)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_ColorHSVInterp_ReturnValue;               // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_Conv_LinearColorToColor_ReturnValue;      // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_DirectionalLightParameter          K2Node_MakeStruct_ST_DirectionalLightParameter;    // 0x00B4(0x0014)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter) == 0x000008, "Wrong alignment on BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter");
static_assert(sizeof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter) == 0x0000C8, "Wrong size on BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, Alpha) == 0x000000, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::Alpha' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, Src) == 0x000004, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::Src' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, Dst) == 0x000018, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::Dst' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, __WorldContext) == 0x000030, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, Result) == 0x000038, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::Result' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00004C, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000050, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, CallFunc_Conv_ColorToLinearColor_ReturnValue_1) == 0x000060, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::CallFunc_Conv_ColorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000070, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, CallFunc_ColorHSVInterp_ReturnValue) == 0x000074, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::CallFunc_ColorHSVInterp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000084, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, CallFunc_Conv_LinearColorToColor_ReturnValue) == 0x000088, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::CallFunc_Conv_LinearColorToColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00008C, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000090, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000094, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x000098, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, CallFunc_Add_FloatFloat_ReturnValue) == 0x00009C, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0000A0, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x0000A4, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, CallFunc_Multiply_FloatFloat_ReturnValue_7) == 0x0000A8, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::CallFunc_Multiply_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0000AC, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x0000B0, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter, K2Node_MakeStruct_ST_DirectionalLightParameter) == 0x0000B4, "Member 'BPFL_HeightFogCtrl_C_InterpDirectionalLightParameter::K2Node_MakeStruct_ST_DirectionalLightParameter' has a wrong offset!");

// Function BPFL_HeightFogCtrl.BPFL_HeightFogCtrl_C.SetDirectionalLightParameterFromComponent
// 0x0028 (0x0028 - 0x0000)
struct BPFL_HeightFogCtrl_C_SetDirectionalLightParameterFromComponent final
{
public:
	struct FST_DirectionalLightParameter          Param;                                             // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_508C[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDirectionalLightComponent*             Component;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_HeightFogCtrl_C_SetDirectionalLightParameterFromComponent) == 0x000008, "Wrong alignment on BPFL_HeightFogCtrl_C_SetDirectionalLightParameterFromComponent");
static_assert(sizeof(BPFL_HeightFogCtrl_C_SetDirectionalLightParameterFromComponent) == 0x000028, "Wrong size on BPFL_HeightFogCtrl_C_SetDirectionalLightParameterFromComponent");
static_assert(offsetof(BPFL_HeightFogCtrl_C_SetDirectionalLightParameterFromComponent, Param) == 0x000000, "Member 'BPFL_HeightFogCtrl_C_SetDirectionalLightParameterFromComponent::Param' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_SetDirectionalLightParameterFromComponent, Component) == 0x000018, "Member 'BPFL_HeightFogCtrl_C_SetDirectionalLightParameterFromComponent::Component' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_SetDirectionalLightParameterFromComponent, __WorldContext) == 0x000020, "Member 'BPFL_HeightFogCtrl_C_SetDirectionalLightParameterFromComponent::__WorldContext' has a wrong offset!");

// Function BPFL_HeightFogCtrl.BPFL_HeightFogCtrl_C.DirectionalLightParamStr
// 0x01B0 (0x01B0 - 0x0000)
struct BPFL_HeightFogCtrl_C_DirectionalLightParamStr final
{
public:
	struct FST_DirectionalLightParameter          InParam;                                           // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_508D[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 OutStr;                                            // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue_1;          // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue_2;          // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue_3;          // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_2;         // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_3;         // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_11;             // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_12;             // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_13;             // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_14;             // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_15;             // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr) == 0x000008, "Wrong alignment on BPFL_HeightFogCtrl_C_DirectionalLightParamStr");
static_assert(sizeof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr) == 0x0001B0, "Wrong size on BPFL_HeightFogCtrl_C_DirectionalLightParamStr");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, InParam) == 0x000000, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::InParam' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, __WorldContext) == 0x000018, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, OutStr) == 0x000020, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::OutStr' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Conv_FloatToString_ReturnValue) == 0x000030, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Conv_ByteToString_ReturnValue) == 0x000050, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Conv_ByteToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000060, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Conv_ByteToString_ReturnValue_1) == 0x000070, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Conv_ByteToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Conv_ByteToString_ReturnValue_2) == 0x000080, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Conv_ByteToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Conv_ByteToString_ReturnValue_3) == 0x000090, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Conv_ByteToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Conv_FloatToString_ReturnValue_1) == 0x0000A0, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Conv_FloatToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Conv_FloatToString_ReturnValue_2) == 0x0000B0, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Conv_FloatToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Conv_FloatToString_ReturnValue_3) == 0x0000C0, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Conv_FloatToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000D0, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000E0, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000F0, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000100, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000110, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000120, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000130, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000140, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Concat_StrStr_ReturnValue_10) == 0x000150, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Concat_StrStr_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Concat_StrStr_ReturnValue_11) == 0x000160, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Concat_StrStr_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Concat_StrStr_ReturnValue_12) == 0x000170, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Concat_StrStr_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Concat_StrStr_ReturnValue_13) == 0x000180, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Concat_StrStr_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Concat_StrStr_ReturnValue_14) == 0x000190, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Concat_StrStr_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BPFL_HeightFogCtrl_C_DirectionalLightParamStr, CallFunc_Concat_StrStr_ReturnValue_15) == 0x0001A0, "Member 'BPFL_HeightFogCtrl_C_DirectionalLightParamStr::CallFunc_Concat_StrStr_ReturnValue_15' has a wrong offset!");

// Function BPFL_HeightFogCtrl.BPFL_HeightFogCtrl_C.SetHeightFogFadeRate
// 0x0048 (0x0048 - 0x0000)
struct BPFL_HeightFogCtrl_C_SetHeightFogFadeRate final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InRate;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_508E[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_HeightFogCtrlBox_C*>         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
