#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_MapCommon

#include "Basic.hpp"

#include "ST_LightParam_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_MAP_SYSTEMRESIDENT_ID_structs.hpp"
#include "E_MAP_PLAYER_TYPE_structs.hpp"
#include "Project_structs.hpp"
#include "LoadOnlyResident_ST_structs.hpp"
#include "EventBattleListStruct_structs.hpp"
#include "E_MAP_DEBUG_MES_TYPE_structs.hpp"


namespace SDK::Params
{

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_SetMapCommon
// 0x0008 (0x0008 - 0x0000)
struct BPI_MapCommon_C_BPI_SetMapCommon final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCommon_C_BPI_SetMapCommon) == 0x000008, "Wrong alignment on BPI_MapCommon_C_BPI_SetMapCommon");
static_assert(sizeof(BPI_MapCommon_C_BPI_SetMapCommon) == 0x000008, "Wrong size on BPI_MapCommon_C_BPI_SetMapCommon");
static_assert(offsetof(BPI_MapCommon_C_BPI_SetMapCommon, Actor) == 0x000000, "Member 'BPI_MapCommon_C_BPI_SetMapCommon::Actor' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_GetMapCommon
// 0x0008 (0x0008 - 0x0000)
struct BPI_MapCommon_C_BPI_GetMapCommon final
{
public:
	class AActor*                                 Rerutn;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCommon_C_BPI_GetMapCommon) == 0x000008, "Wrong alignment on BPI_MapCommon_C_BPI_GetMapCommon");
static_assert(sizeof(BPI_MapCommon_C_BPI_GetMapCommon) == 0x000008, "Wrong size on BPI_MapCommon_C_BPI_GetMapCommon");
static_assert(offsetof(BPI_MapCommon_C_BPI_GetMapCommon, Rerutn) == 0x000000, "Member 'BPI_MapCommon_C_BPI_GetMapCommon::Rerutn' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_SpawnEncountActor
// 0x0090 (0x0090 - 0x0000)
struct BPI_MapCommon_C_BPI_SpawnEncountActor final
{
public:
	TArray<int32>                                 EnemyIdList;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         EncountID;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DA6[0xC];                                     // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SpawnTransform;                                    // 0x0020(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class AActor*                                 EncountPawn;                                       // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_SYMBOL_ENCOUNT                          SymbolEncountType;                                 // 0x0058(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ManualWhenNotEscape;                               // 0x0059(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HitMapAttack;                                      // 0x005A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DA7[0x5];                                     // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChainEncountInfo                      ChainEncountInfo;                                  // 0x0060(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Magatsuhi;                                         // 0x0080(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_BPI_SpawnEncountActor) == 0x000010, "Wrong alignment on BPI_MapCommon_C_BPI_SpawnEncountActor");
static_assert(sizeof(BPI_MapCommon_C_BPI_SpawnEncountActor) == 0x000090, "Wrong size on BPI_MapCommon_C_BPI_SpawnEncountActor");
static_assert(offsetof(BPI_MapCommon_C_BPI_SpawnEncountActor, EnemyIdList) == 0x000000, "Member 'BPI_MapCommon_C_BPI_SpawnEncountActor::EnemyIdList' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_SpawnEncountActor, EncountID) == 0x000010, "Member 'BPI_MapCommon_C_BPI_SpawnEncountActor::EncountID' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_SpawnEncountActor, SpawnTransform) == 0x000020, "Member 'BPI_MapCommon_C_BPI_SpawnEncountActor::SpawnTransform' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_SpawnEncountActor, EncountPawn) == 0x000050, "Member 'BPI_MapCommon_C_BPI_SpawnEncountActor::EncountPawn' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_SpawnEncountActor, SymbolEncountType) == 0x000058, "Member 'BPI_MapCommon_C_BPI_SpawnEncountActor::SymbolEncountType' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_SpawnEncountActor, ManualWhenNotEscape) == 0x000059, "Member 'BPI_MapCommon_C_BPI_SpawnEncountActor::ManualWhenNotEscape' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_SpawnEncountActor, HitMapAttack) == 0x00005A, "Member 'BPI_MapCommon_C_BPI_SpawnEncountActor::HitMapAttack' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_SpawnEncountActor, ChainEncountInfo) == 0x000060, "Member 'BPI_MapCommon_C_BPI_SpawnEncountActor::ChainEncountInfo' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_SpawnEncountActor, Magatsuhi) == 0x000080, "Member 'BPI_MapCommon_C_BPI_SpawnEncountActor::Magatsuhi' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_MapPlayerStop
// 0x0002 (0x0002 - 0x0000)
struct BPI_MapCommon_C_BPI_MapPlayerStop final
{
public:
	bool                                          Stop;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Hidden;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_BPI_MapPlayerStop) == 0x000001, "Wrong alignment on BPI_MapCommon_C_BPI_MapPlayerStop");
static_assert(sizeof(BPI_MapCommon_C_BPI_MapPlayerStop) == 0x000002, "Wrong size on BPI_MapCommon_C_BPI_MapPlayerStop");
static_assert(offsetof(BPI_MapCommon_C_BPI_MapPlayerStop, Stop) == 0x000000, "Member 'BPI_MapCommon_C_BPI_MapPlayerStop::Stop' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_MapPlayerStop, Hidden) == 0x000001, "Member 'BPI_MapCommon_C_BPI_MapPlayerStop::Hidden' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_LoadMap
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_BPI_LoadMap final
{
public:
	bool                                          InFadeCancel;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_BPI_LoadMap) == 0x000001, "Wrong alignment on BPI_MapCommon_C_BPI_LoadMap");
static_assert(sizeof(BPI_MapCommon_C_BPI_LoadMap) == 0x000001, "Wrong size on BPI_MapCommon_C_BPI_LoadMap");
static_assert(offsetof(BPI_MapCommon_C_BPI_LoadMap, InFadeCancel) == 0x000000, "Member 'BPI_MapCommon_C_BPI_LoadMap::InFadeCancel' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_IsSpawnSymbol
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_BPI_IsSpawnSymbol final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_BPI_IsSpawnSymbol) == 0x000001, "Wrong alignment on BPI_MapCommon_C_BPI_IsSpawnSymbol");
static_assert(sizeof(BPI_MapCommon_C_BPI_IsSpawnSymbol) == 0x000001, "Wrong size on BPI_MapCommon_C_BPI_IsSpawnSymbol");
static_assert(offsetof(BPI_MapCommon_C_BPI_IsSpawnSymbol, NewParam) == 0x000000, "Member 'BPI_MapCommon_C_BPI_IsSpawnSymbol::NewParam' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_DebugChangeChar
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_BPI_DebugChangeChar final
{
public:
	E_MAP_PLAYER_TYPE                             Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCommon_C_BPI_DebugChangeChar) == 0x000001, "Wrong alignment on BPI_MapCommon_C_BPI_DebugChangeChar");
static_assert(sizeof(BPI_MapCommon_C_BPI_DebugChangeChar) == 0x000001, "Wrong size on BPI_MapCommon_C_BPI_DebugChangeChar");
static_assert(offsetof(BPI_MapCommon_C_BPI_DebugChangeChar, Type) == 0x000000, "Member 'BPI_MapCommon_C_BPI_DebugChangeChar::Type' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_DebugMesWindow
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_BPI_DebugMesWindow final
{
public:
	E_MAP_DEBUG_MES_TYPE                          MesType;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCommon_C_BPI_DebugMesWindow) == 0x000001, "Wrong alignment on BPI_MapCommon_C_BPI_DebugMesWindow");
static_assert(sizeof(BPI_MapCommon_C_BPI_DebugMesWindow) == 0x000001, "Wrong size on BPI_MapCommon_C_BPI_DebugMesWindow");
static_assert(offsetof(BPI_MapCommon_C_BPI_DebugMesWindow, MesType) == 0x000000, "Member 'BPI_MapCommon_C_BPI_DebugMesWindow::MesType' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_MapPause
// 0x0008 (0x0008 - 0x0000)
struct BPI_MapCommon_C_BPI_MapPause final
{
public:
	bool                                          PlayerMoveEnable;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PlayerCameraEnable;                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PlayerVisible;                                     // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          MoonTimeEnable;                                    // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SymbolEnable;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AllMapStop;                                        // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AllObjectHidden;                                   // 0x0006(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TopCamera;                                         // 0x0007(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_BPI_MapPause) == 0x000001, "Wrong alignment on BPI_MapCommon_C_BPI_MapPause");
static_assert(sizeof(BPI_MapCommon_C_BPI_MapPause) == 0x000008, "Wrong size on BPI_MapCommon_C_BPI_MapPause");
static_assert(offsetof(BPI_MapCommon_C_BPI_MapPause, PlayerMoveEnable) == 0x000000, "Member 'BPI_MapCommon_C_BPI_MapPause::PlayerMoveEnable' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_MapPause, PlayerCameraEnable) == 0x000001, "Member 'BPI_MapCommon_C_BPI_MapPause::PlayerCameraEnable' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_MapPause, PlayerVisible) == 0x000002, "Member 'BPI_MapCommon_C_BPI_MapPause::PlayerVisible' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_MapPause, MoonTimeEnable) == 0x000003, "Member 'BPI_MapCommon_C_BPI_MapPause::MoonTimeEnable' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_MapPause, SymbolEnable) == 0x000004, "Member 'BPI_MapCommon_C_BPI_MapPause::SymbolEnable' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_MapPause, AllMapStop) == 0x000005, "Member 'BPI_MapCommon_C_BPI_MapPause::AllMapStop' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_MapPause, AllObjectHidden) == 0x000006, "Member 'BPI_MapCommon_C_BPI_MapPause::AllObjectHidden' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_MapPause, TopCamera) == 0x000007, "Member 'BPI_MapCommon_C_BPI_MapPause::TopCamera' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_MapStart
// 0x0004 (0x0004 - 0x0000)
struct BPI_MapCommon_C_BPI_MapStart final
{
public:
	bool                                          MissionCheckDisable;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          StartSymbolAIDisable;                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnPlayerPosition;                              // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UI_Immediate;                                      // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_BPI_MapStart) == 0x000001, "Wrong alignment on BPI_MapCommon_C_BPI_MapStart");
static_assert(sizeof(BPI_MapCommon_C_BPI_MapStart) == 0x000004, "Wrong size on BPI_MapCommon_C_BPI_MapStart");
static_assert(offsetof(BPI_MapCommon_C_BPI_MapStart, MissionCheckDisable) == 0x000000, "Member 'BPI_MapCommon_C_BPI_MapStart::MissionCheckDisable' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_MapStart, StartSymbolAIDisable) == 0x000001, "Member 'BPI_MapCommon_C_BPI_MapStart::StartSymbolAIDisable' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_MapStart, ReturnPlayerPosition) == 0x000002, "Member 'BPI_MapCommon_C_BPI_MapStart::ReturnPlayerPosition' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_MapStart, UI_Immediate) == 0x000003, "Member 'BPI_MapCommon_C_BPI_MapStart::UI_Immediate' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_CallEventEncount
// 0x0050 (0x0050 - 0x0000)
struct BPI_MapCommon_C_BPI_CallEventEncount final
{
public:
	int32                                         EventEncountId;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DA8[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SpawnTransform;                                    // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	int32                                         NextEventID;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NowEventID;                                        // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Manual;                                            // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_BPI_CallEventEncount) == 0x000010, "Wrong alignment on BPI_MapCommon_C_BPI_CallEventEncount");
static_assert(sizeof(BPI_MapCommon_C_BPI_CallEventEncount) == 0x000050, "Wrong size on BPI_MapCommon_C_BPI_CallEventEncount");
static_assert(offsetof(BPI_MapCommon_C_BPI_CallEventEncount, EventEncountId) == 0x000000, "Member 'BPI_MapCommon_C_BPI_CallEventEncount::EventEncountId' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_CallEventEncount, SpawnTransform) == 0x000010, "Member 'BPI_MapCommon_C_BPI_CallEventEncount::SpawnTransform' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_CallEventEncount, NextEventID) == 0x000040, "Member 'BPI_MapCommon_C_BPI_CallEventEncount::NextEventID' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_CallEventEncount, NowEventID) == 0x000044, "Member 'BPI_MapCommon_C_BPI_CallEventEncount::NowEventID' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_CallEventEncount, Manual) == 0x000048, "Member 'BPI_MapCommon_C_BPI_CallEventEncount::Manual' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_CallKokubouEvent
// 0x0018 (0x0018 - 0x0000)
struct BPI_MapCommon_C_BPI_CallKokubouEvent final
{
public:
	int32                                         EventId;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DA9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 RestarPoint;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 BattlePoint;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCommon_C_BPI_CallKokubouEvent) == 0x000008, "Wrong alignment on BPI_MapCommon_C_BPI_CallKokubouEvent");
static_assert(sizeof(BPI_MapCommon_C_BPI_CallKokubouEvent) == 0x000018, "Wrong size on BPI_MapCommon_C_BPI_CallKokubouEvent");
static_assert(offsetof(BPI_MapCommon_C_BPI_CallKokubouEvent, EventId) == 0x000000, "Member 'BPI_MapCommon_C_BPI_CallKokubouEvent::EventId' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_CallKokubouEvent, RestarPoint) == 0x000008, "Member 'BPI_MapCommon_C_BPI_CallKokubouEvent::RestarPoint' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_CallKokubouEvent, BattlePoint) == 0x000010, "Member 'BPI_MapCommon_C_BPI_CallKokubouEvent::BattlePoint' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_MapAttackEnd
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_BPI_MapAttackEnd final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_BPI_MapAttackEnd) == 0x000001, "Wrong alignment on BPI_MapCommon_C_BPI_MapAttackEnd");
static_assert(sizeof(BPI_MapCommon_C_BPI_MapAttackEnd) == 0x000001, "Wrong size on BPI_MapCommon_C_BPI_MapAttackEnd");
static_assert(offsetof(BPI_MapCommon_C_BPI_MapAttackEnd, Enable) == 0x000000, "Member 'BPI_MapCommon_C_BPI_MapAttackEnd::Enable' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_ForceSafeEncount
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_BPI_ForceSafeEncount final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_BPI_ForceSafeEncount) == 0x000001, "Wrong alignment on BPI_MapCommon_C_BPI_ForceSafeEncount");
static_assert(sizeof(BPI_MapCommon_C_BPI_ForceSafeEncount) == 0x000001, "Wrong size on BPI_MapCommon_C_BPI_ForceSafeEncount");
static_assert(offsetof(BPI_MapCommon_C_BPI_ForceSafeEncount, Enable) == 0x000000, "Member 'BPI_MapCommon_C_BPI_ForceSafeEncount::Enable' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.GetIsBattle
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_GetIsBattle final
{
public:
	bool                                          IsBattle;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_GetIsBattle) == 0x000001, "Wrong alignment on BPI_MapCommon_C_GetIsBattle");
static_assert(sizeof(BPI_MapCommon_C_GetIsBattle) == 0x000001, "Wrong size on BPI_MapCommon_C_GetIsBattle");
static_assert(offsetof(BPI_MapCommon_C_GetIsBattle, IsBattle) == 0x000000, "Member 'BPI_MapCommon_C_GetIsBattle::IsBattle' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.GetcurrentLevelCustom
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_GetcurrentLevelCustom final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_GetcurrentLevelCustom) == 0x000001, "Wrong alignment on BPI_MapCommon_C_GetcurrentLevelCustom");
static_assert(sizeof(BPI_MapCommon_C_GetcurrentLevelCustom) == 0x000001, "Wrong size on BPI_MapCommon_C_GetcurrentLevelCustom");
static_assert(offsetof(BPI_MapCommon_C_GetcurrentLevelCustom, Enable) == 0x000000, "Member 'BPI_MapCommon_C_GetcurrentLevelCustom::Enable' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.IsEventHitOff
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_IsEventHitOff final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_IsEventHitOff) == 0x000001, "Wrong alignment on BPI_MapCommon_C_IsEventHitOff");
static_assert(sizeof(BPI_MapCommon_C_IsEventHitOff) == 0x000001, "Wrong size on BPI_MapCommon_C_IsEventHitOff");
static_assert(offsetof(BPI_MapCommon_C_IsEventHitOff, Enable) == 0x000000, "Member 'BPI_MapCommon_C_IsEventHitOff::Enable' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.GetSavingWidget
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_GetSavingWidget final
{
public:
	bool                                          Widget;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_GetSavingWidget) == 0x000001, "Wrong alignment on BPI_MapCommon_C_GetSavingWidget");
static_assert(sizeof(BPI_MapCommon_C_GetSavingWidget) == 0x000001, "Wrong size on BPI_MapCommon_C_GetSavingWidget");
static_assert(offsetof(BPI_MapCommon_C_GetSavingWidget, Widget) == 0x000000, "Member 'BPI_MapCommon_C_GetSavingWidget::Widget' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_CheckMapPause
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_BPI_CheckMapPause final
{
public:
	bool                                          IsPause;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_BPI_CheckMapPause) == 0x000001, "Wrong alignment on BPI_MapCommon_C_BPI_CheckMapPause");
static_assert(sizeof(BPI_MapCommon_C_BPI_CheckMapPause) == 0x000001, "Wrong size on BPI_MapCommon_C_BPI_CheckMapPause");
static_assert(offsetof(BPI_MapCommon_C_BPI_CheckMapPause, IsPause) == 0x000000, "Member 'BPI_MapCommon_C_BPI_CheckMapPause::IsPause' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_GetBuddyPawn
// 0x0008 (0x0008 - 0x0000)
struct BPI_MapCommon_C_BPI_GetBuddyPawn final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCommon_C_BPI_GetBuddyPawn) == 0x000008, "Wrong alignment on BPI_MapCommon_C_BPI_GetBuddyPawn");
static_assert(sizeof(BPI_MapCommon_C_BPI_GetBuddyPawn) == 0x000008, "Wrong size on BPI_MapCommon_C_BPI_GetBuddyPawn");
static_assert(offsetof(BPI_MapCommon_C_BPI_GetBuddyPawn, Pawn) == 0x000000, "Member 'BPI_MapCommon_C_BPI_GetBuddyPawn::Pawn' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BI_CheckEncountOn
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_BI_CheckEncountOn final
{
public:
	bool                                          EncountOn;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_BI_CheckEncountOn) == 0x000001, "Wrong alignment on BPI_MapCommon_C_BI_CheckEncountOn");
static_assert(sizeof(BPI_MapCommon_C_BI_CheckEncountOn) == 0x000001, "Wrong size on BPI_MapCommon_C_BI_CheckEncountOn");
static_assert(offsetof(BPI_MapCommon_C_BI_CheckEncountOn, EncountOn) == 0x000000, "Member 'BPI_MapCommon_C_BI_CheckEncountOn::EncountOn' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_SetEventReserv
// 0x0004 (0x0004 - 0x0000)
struct BPI_MapCommon_C_BPI_SetEventReserv final
{
public:
	int32                                         MapEventID;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCommon_C_BPI_SetEventReserv) == 0x000004, "Wrong alignment on BPI_MapCommon_C_BPI_SetEventReserv");
static_assert(sizeof(BPI_MapCommon_C_BPI_SetEventReserv) == 0x000004, "Wrong size on BPI_MapCommon_C_BPI_SetEventReserv");
static_assert(offsetof(BPI_MapCommon_C_BPI_SetEventReserv, MapEventID) == 0x000000, "Member 'BPI_MapCommon_C_BPI_SetEventReserv::MapEventID' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_GetEventReserv
// 0x0004 (0x0004 - 0x0000)
struct BPI_MapCommon_C_BPI_GetEventReserv final
{
public:
	int32                                         MapEventID;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCommon_C_BPI_GetEventReserv) == 0x000004, "Wrong alignment on BPI_MapCommon_C_BPI_GetEventReserv");
static_assert(sizeof(BPI_MapCommon_C_BPI_GetEventReserv) == 0x000004, "Wrong size on BPI_MapCommon_C_BPI_GetEventReserv");
static_assert(offsetof(BPI_MapCommon_C_BPI_GetEventReserv, MapEventID) == 0x000000, "Member 'BPI_MapCommon_C_BPI_GetEventReserv::MapEventID' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_HeroChange
// 0x0002 (0x0002 - 0x0000)
struct BPI_MapCommon_C_BPI_HeroChange final
{
public:
	bool                                          IsFade;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_MAP_PLAYER_TYPE                             Hero;                                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCommon_C_BPI_HeroChange) == 0x000001, "Wrong alignment on BPI_MapCommon_C_BPI_HeroChange");
static_assert(sizeof(BPI_MapCommon_C_BPI_HeroChange) == 0x000002, "Wrong size on BPI_MapCommon_C_BPI_HeroChange");
static_assert(offsetof(BPI_MapCommon_C_BPI_HeroChange, IsFade) == 0x000000, "Member 'BPI_MapCommon_C_BPI_HeroChange::IsFade' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_HeroChange, Hero) == 0x000001, "Member 'BPI_MapCommon_C_BPI_HeroChange::Hero' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_IsEventPlay
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_BPI_IsEventPlay final
{
public:
	bool                                          IsPlay;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_BPI_IsEventPlay) == 0x000001, "Wrong alignment on BPI_MapCommon_C_BPI_IsEventPlay");
static_assert(sizeof(BPI_MapCommon_C_BPI_IsEventPlay) == 0x000001, "Wrong size on BPI_MapCommon_C_BPI_IsEventPlay");
static_assert(offsetof(BPI_MapCommon_C_BPI_IsEventPlay, IsPlay) == 0x000000, "Member 'BPI_MapCommon_C_BPI_IsEventPlay::IsPlay' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.SetNextMapAssetList
// 0x0028 (0x0028 - 0x0000)
struct BPI_MapCommon_C_SetNextMapAssetList final
{
public:
	TArray<struct FPrimaryAssetId>                LevelList;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class FName>                           NameList;                                          // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         MapId;                                             // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AreaId;                                            // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCommon_C_SetNextMapAssetList) == 0x000008, "Wrong alignment on BPI_MapCommon_C_SetNextMapAssetList");
static_assert(sizeof(BPI_MapCommon_C_SetNextMapAssetList) == 0x000028, "Wrong size on BPI_MapCommon_C_SetNextMapAssetList");
static_assert(offsetof(BPI_MapCommon_C_SetNextMapAssetList, LevelList) == 0x000000, "Member 'BPI_MapCommon_C_SetNextMapAssetList::LevelList' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_SetNextMapAssetList, NameList) == 0x000010, "Member 'BPI_MapCommon_C_SetNextMapAssetList::NameList' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_SetNextMapAssetList, MapId) == 0x000020, "Member 'BPI_MapCommon_C_SetNextMapAssetList::MapId' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_SetNextMapAssetList, AreaId) == 0x000024, "Member 'BPI_MapCommon_C_SetNextMapAssetList::AreaId' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.GetNextMapAssetList
// 0x0010 (0x0010 - 0x0000)
struct BPI_MapCommon_C_GetNextMapAssetList final
{
public:
	TArray<struct FLoadOnlyResident_ST>           LevelList;                                         // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(BPI_MapCommon_C_GetNextMapAssetList) == 0x000008, "Wrong alignment on BPI_MapCommon_C_GetNextMapAssetList");
static_assert(sizeof(BPI_MapCommon_C_GetNextMapAssetList) == 0x000010, "Wrong size on BPI_MapCommon_C_GetNextMapAssetList");
static_assert(offsetof(BPI_MapCommon_C_GetNextMapAssetList, LevelList) == 0x000000, "Member 'BPI_MapCommon_C_GetNextMapAssetList::LevelList' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.SetNextMapLoadStart
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_SetNextMapLoadStart final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_SetNextMapLoadStart) == 0x000001, "Wrong alignment on BPI_MapCommon_C_SetNextMapLoadStart");
static_assert(sizeof(BPI_MapCommon_C_SetNextMapLoadStart) == 0x000001, "Wrong size on BPI_MapCommon_C_SetNextMapLoadStart");
static_assert(offsetof(BPI_MapCommon_C_SetNextMapLoadStart, Enable) == 0x000000, "Member 'BPI_MapCommon_C_SetNextMapLoadStart::Enable' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.IsNextMapLoadStart
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_IsNextMapLoadStart final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_IsNextMapLoadStart) == 0x000001, "Wrong alignment on BPI_MapCommon_C_IsNextMapLoadStart");
static_assert(sizeof(BPI_MapCommon_C_IsNextMapLoadStart) == 0x000001, "Wrong size on BPI_MapCommon_C_IsNextMapLoadStart");
static_assert(offsetof(BPI_MapCommon_C_IsNextMapLoadStart, Return) == 0x000000, "Member 'BPI_MapCommon_C_IsNextMapLoadStart::Return' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.SetNextMapLoadEnd
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_SetNextMapLoadEnd final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_SetNextMapLoadEnd) == 0x000001, "Wrong alignment on BPI_MapCommon_C_SetNextMapLoadEnd");
static_assert(sizeof(BPI_MapCommon_C_SetNextMapLoadEnd) == 0x000001, "Wrong size on BPI_MapCommon_C_SetNextMapLoadEnd");
static_assert(offsetof(BPI_MapCommon_C_SetNextMapLoadEnd, Enable) == 0x000000, "Member 'BPI_MapCommon_C_SetNextMapLoadEnd::Enable' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.IsNextMapLoadEnd
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_IsNextMapLoadEnd final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_IsNextMapLoadEnd) == 0x000001, "Wrong alignment on BPI_MapCommon_C_IsNextMapLoadEnd");
static_assert(sizeof(BPI_MapCommon_C_IsNextMapLoadEnd) == 0x000001, "Wrong size on BPI_MapCommon_C_IsNextMapLoadEnd");
static_assert(offsetof(BPI_MapCommon_C_IsNextMapLoadEnd, Return) == 0x000000, "Member 'BPI_MapCommon_C_IsNextMapLoadEnd::Return' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.SetNextMapStartList
// 0x0028 (0x0028 - 0x0000)
struct BPI_MapCommon_C_SetNextMapStartList final
{
public:
	TArray<struct FPrimaryAssetId>                LevelList;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class FName>                           LevelNameList;                                     // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         MapId;                                             // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AreaId;                                            // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCommon_C_SetNextMapStartList) == 0x000008, "Wrong alignment on BPI_MapCommon_C_SetNextMapStartList");
static_assert(sizeof(BPI_MapCommon_C_SetNextMapStartList) == 0x000028, "Wrong size on BPI_MapCommon_C_SetNextMapStartList");
static_assert(offsetof(BPI_MapCommon_C_SetNextMapStartList, LevelList) == 0x000000, "Member 'BPI_MapCommon_C_SetNextMapStartList::LevelList' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_SetNextMapStartList, LevelNameList) == 0x000010, "Member 'BPI_MapCommon_C_SetNextMapStartList::LevelNameList' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_SetNextMapStartList, MapId) == 0x000020, "Member 'BPI_MapCommon_C_SetNextMapStartList::MapId' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_SetNextMapStartList, AreaId) == 0x000024, "Member 'BPI_MapCommon_C_SetNextMapStartList::AreaId' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.GetNextMapStartList
// 0x0030 (0x0030 - 0x0000)
struct BPI_MapCommon_C_GetNextMapStartList final
{
public:
	struct FLoadOnlyResident_ST                   Return;                                            // 0x0000(0x0030)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCommon_C_GetNextMapStartList) == 0x000008, "Wrong alignment on BPI_MapCommon_C_GetNextMapStartList");
static_assert(sizeof(BPI_MapCommon_C_GetNextMapStartList) == 0x000030, "Wrong size on BPI_MapCommon_C_GetNextMapStartList");
static_assert(offsetof(BPI_MapCommon_C_GetNextMapStartList, Return) == 0x000000, "Member 'BPI_MapCommon_C_GetNextMapStartList::Return' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.SetMapStartLoadFlag
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_SetMapStartLoadFlag final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_SetMapStartLoadFlag) == 0x000001, "Wrong alignment on BPI_MapCommon_C_SetMapStartLoadFlag");
static_assert(sizeof(BPI_MapCommon_C_SetMapStartLoadFlag) == 0x000001, "Wrong size on BPI_MapCommon_C_SetMapStartLoadFlag");
static_assert(offsetof(BPI_MapCommon_C_SetMapStartLoadFlag, Enable) == 0x000000, "Member 'BPI_MapCommon_C_SetMapStartLoadFlag::Enable' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.GetMapStartLoadFlag
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_GetMapStartLoadFlag final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_GetMapStartLoadFlag) == 0x000001, "Wrong alignment on BPI_MapCommon_C_GetMapStartLoadFlag");
static_assert(sizeof(BPI_MapCommon_C_GetMapStartLoadFlag) == 0x000001, "Wrong size on BPI_MapCommon_C_GetMapStartLoadFlag");
static_assert(offsetof(BPI_MapCommon_C_GetMapStartLoadFlag, Enable) == 0x000000, "Member 'BPI_MapCommon_C_GetMapStartLoadFlag::Enable' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.SetLoadLevelGame
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_SetLoadLevelGame final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_SetLoadLevelGame) == 0x000001, "Wrong alignment on BPI_MapCommon_C_SetLoadLevelGame");
static_assert(sizeof(BPI_MapCommon_C_SetLoadLevelGame) == 0x000001, "Wrong size on BPI_MapCommon_C_SetLoadLevelGame");
static_assert(offsetof(BPI_MapCommon_C_SetLoadLevelGame, Enable) == 0x000000, "Member 'BPI_MapCommon_C_SetLoadLevelGame::Enable' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.IsLoadLevelGame
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_IsLoadLevelGame final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_IsLoadLevelGame) == 0x000001, "Wrong alignment on BPI_MapCommon_C_IsLoadLevelGame");
static_assert(sizeof(BPI_MapCommon_C_IsLoadLevelGame) == 0x000001, "Wrong size on BPI_MapCommon_C_IsLoadLevelGame");
static_assert(offsetof(BPI_MapCommon_C_IsLoadLevelGame, Enable) == 0x000000, "Member 'BPI_MapCommon_C_IsLoadLevelGame::Enable' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.SetEventBattleActor
// 0x0040 (0x0040 - 0x0000)
struct BPI_MapCommon_C_SetEventBattleActor final
{
public:
	TArray<struct FEventBattleListStruct>         BTLActor;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FTransform                             PlayerPos;                                         // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_SetEventBattleActor) == 0x000010, "Wrong alignment on BPI_MapCommon_C_SetEventBattleActor");
static_assert(sizeof(BPI_MapCommon_C_SetEventBattleActor) == 0x000040, "Wrong size on BPI_MapCommon_C_SetEventBattleActor");
static_assert(offsetof(BPI_MapCommon_C_SetEventBattleActor, BTLActor) == 0x000000, "Member 'BPI_MapCommon_C_SetEventBattleActor::BTLActor' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_SetEventBattleActor, PlayerPos) == 0x000010, "Member 'BPI_MapCommon_C_SetEventBattleActor::PlayerPos' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.GetEventBattleActor
// 0x0010 (0x0010 - 0x0000)
struct BPI_MapCommon_C_GetEventBattleActor final
{
public:
	TArray<class AActor*>                         List;                                              // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(BPI_MapCommon_C_GetEventBattleActor) == 0x000008, "Wrong alignment on BPI_MapCommon_C_GetEventBattleActor");
static_assert(sizeof(BPI_MapCommon_C_GetEventBattleActor) == 0x000010, "Wrong size on BPI_MapCommon_C_GetEventBattleActor");
static_assert(offsetof(BPI_MapCommon_C_GetEventBattleActor, List) == 0x000000, "Member 'BPI_MapCommon_C_GetEventBattleActor::List' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_SetEncountActor
// 0x0008 (0x0008 - 0x0000)
struct BPI_MapCommon_C_BPI_SetEncountActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCommon_C_BPI_SetEncountActor) == 0x000008, "Wrong alignment on BPI_MapCommon_C_BPI_SetEncountActor");
static_assert(sizeof(BPI_MapCommon_C_BPI_SetEncountActor) == 0x000008, "Wrong size on BPI_MapCommon_C_BPI_SetEncountActor");
static_assert(offsetof(BPI_MapCommon_C_BPI_SetEncountActor, Actor) == 0x000000, "Member 'BPI_MapCommon_C_BPI_SetEncountActor::Actor' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_MakeUpLessEvent
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_BPI_MakeUpLessEvent final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_BPI_MakeUpLessEvent) == 0x000001, "Wrong alignment on BPI_MapCommon_C_BPI_MakeUpLessEvent");
static_assert(sizeof(BPI_MapCommon_C_BPI_MakeUpLessEvent) == 0x000001, "Wrong size on BPI_MapCommon_C_BPI_MakeUpLessEvent");
static_assert(offsetof(BPI_MapCommon_C_BPI_MakeUpLessEvent, RetValue) == 0x000000, "Member 'BPI_MapCommon_C_BPI_MakeUpLessEvent::RetValue' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.StartDebugGameTrace
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_StartDebugGameTrace final
{
public:
	bool                                          IsEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_StartDebugGameTrace) == 0x000001, "Wrong alignment on BPI_MapCommon_C_StartDebugGameTrace");
static_assert(sizeof(BPI_MapCommon_C_StartDebugGameTrace) == 0x000001, "Wrong size on BPI_MapCommon_C_StartDebugGameTrace");
static_assert(offsetof(BPI_MapCommon_C_StartDebugGameTrace, IsEnable) == 0x000000, "Member 'BPI_MapCommon_C_StartDebugGameTrace::IsEnable' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.GetDebugGameTrace
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCommon_C_GetDebugGameTrace final
{
public:
	bool                                          IsEnable;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_GetDebugGameTrace) == 0x000001, "Wrong alignment on BPI_MapCommon_C_GetDebugGameTrace");
static_assert(sizeof(BPI_MapCommon_C_GetDebugGameTrace) == 0x000001, "Wrong size on BPI_MapCommon_C_GetDebugGameTrace");
static_assert(offsetof(BPI_MapCommon_C_GetDebugGameTrace, IsEnable) == 0x000000, "Member 'BPI_MapCommon_C_GetDebugGameTrace::IsEnable' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.SetJsonData
// 0x0008 (0x0008 - 0x0000)
struct BPI_MapCommon_C_SetJsonData final
{
public:
	class UJsonDataCtrl*                          Json;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCommon_C_SetJsonData) == 0x000008, "Wrong alignment on BPI_MapCommon_C_SetJsonData");
static_assert(sizeof(BPI_MapCommon_C_SetJsonData) == 0x000008, "Wrong size on BPI_MapCommon_C_SetJsonData");
static_assert(offsetof(BPI_MapCommon_C_SetJsonData, Json) == 0x000000, "Member 'BPI_MapCommon_C_SetJsonData::Json' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.GetJsonData
// 0x0008 (0x0008 - 0x0000)
struct BPI_MapCommon_C_GetJsonData final
{
public:
	class UJsonDataCtrl*                          Json;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCommon_C_GetJsonData) == 0x000008, "Wrong alignment on BPI_MapCommon_C_GetJsonData");
static_assert(sizeof(BPI_MapCommon_C_GetJsonData) == 0x000008, "Wrong size on BPI_MapCommon_C_GetJsonData");
static_assert(offsetof(BPI_MapCommon_C_GetJsonData, Json) == 0x000000, "Member 'BPI_MapCommon_C_GetJsonData::Json' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.GetJsonFileName
// 0x0010 (0x0010 - 0x0000)
struct BPI_MapCommon_C_GetJsonFileName final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCommon_C_GetJsonFileName) == 0x000008, "Wrong alignment on BPI_MapCommon_C_GetJsonFileName");
static_assert(sizeof(BPI_MapCommon_C_GetJsonFileName) == 0x000010, "Wrong size on BPI_MapCommon_C_GetJsonFileName");
static_assert(offsetof(BPI_MapCommon_C_GetJsonFileName, Filename) == 0x000000, "Member 'BPI_MapCommon_C_GetJsonFileName::Filename' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.SetJsonFile
// 0x0010 (0x0010 - 0x0000)
struct BPI_MapCommon_C_SetJsonFile final
{
public:
	class FString                                 Json;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCommon_C_SetJsonFile) == 0x000008, "Wrong alignment on BPI_MapCommon_C_SetJsonFile");
static_assert(sizeof(BPI_MapCommon_C_SetJsonFile) == 0x000010, "Wrong size on BPI_MapCommon_C_SetJsonFile");
static_assert(offsetof(BPI_MapCommon_C_SetJsonFile, Json) == 0x000000, "Member 'BPI_MapCommon_C_SetJsonFile::Json' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_CallMapEvent
// 0x0020 (0x0020 - 0x0000)
struct BPI_MapCommon_C_BPI_CallMapEvent final
{
public:
	int32                                         MapEventID_;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DAA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReStartPoint;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 BattlePoint;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InitFade;                                          // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          WaitEvent;                                         // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_BPI_CallMapEvent) == 0x000008, "Wrong alignment on BPI_MapCommon_C_BPI_CallMapEvent");
static_assert(sizeof(BPI_MapCommon_C_BPI_CallMapEvent) == 0x000020, "Wrong size on BPI_MapCommon_C_BPI_CallMapEvent");
static_assert(offsetof(BPI_MapCommon_C_BPI_CallMapEvent, MapEventID_) == 0x000000, "Member 'BPI_MapCommon_C_BPI_CallMapEvent::MapEventID_' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_CallMapEvent, ReStartPoint) == 0x000008, "Member 'BPI_MapCommon_C_BPI_CallMapEvent::ReStartPoint' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_CallMapEvent, BattlePoint) == 0x000010, "Member 'BPI_MapCommon_C_BPI_CallMapEvent::BattlePoint' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_CallMapEvent, InitFade) == 0x000018, "Member 'BPI_MapCommon_C_BPI_CallMapEvent::InitFade' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_CallMapEvent, WaitEvent) == 0x000019, "Member 'BPI_MapCommon_C_BPI_CallMapEvent::WaitEvent' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_CallEncountForMagatsuka
// 0x0020 (0x0020 - 0x0000)
struct BPI_MapCommon_C_BPI_CallEncountForMagatsuka final
{
public:
	int32                                         EncountID;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DAB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 EnemyList;                                         // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         SafeZoneID;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ManualSafeZone;                                    // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BTL_SYMBOL_ENCOUNT                          EncountType;                                       // 0x001D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HitMapAttack;                                      // 0x001E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_BPI_CallEncountForMagatsuka) == 0x000008, "Wrong alignment on BPI_MapCommon_C_BPI_CallEncountForMagatsuka");
static_assert(sizeof(BPI_MapCommon_C_BPI_CallEncountForMagatsuka) == 0x000020, "Wrong size on BPI_MapCommon_C_BPI_CallEncountForMagatsuka");
static_assert(offsetof(BPI_MapCommon_C_BPI_CallEncountForMagatsuka, EncountID) == 0x000000, "Member 'BPI_MapCommon_C_BPI_CallEncountForMagatsuka::EncountID' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_CallEncountForMagatsuka, EnemyList) == 0x000008, "Member 'BPI_MapCommon_C_BPI_CallEncountForMagatsuka::EnemyList' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_CallEncountForMagatsuka, SafeZoneID) == 0x000018, "Member 'BPI_MapCommon_C_BPI_CallEncountForMagatsuka::SafeZoneID' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_CallEncountForMagatsuka, ManualSafeZone) == 0x00001C, "Member 'BPI_MapCommon_C_BPI_CallEncountForMagatsuka::ManualSafeZone' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_CallEncountForMagatsuka, EncountType) == 0x00001D, "Member 'BPI_MapCommon_C_BPI_CallEncountForMagatsuka::EncountType' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_CallEncountForMagatsuka, HitMapAttack) == 0x00001E, "Member 'BPI_MapCommon_C_BPI_CallEncountForMagatsuka::HitMapAttack' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_GetMapGimmickTrigger
// 0x0008 (0x0008 - 0x0000)
struct BPI_MapCommon_C_BPI_GetMapGimmickTrigger final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCommon_C_BPI_GetMapGimmickTrigger) == 0x000008, "Wrong alignment on BPI_MapCommon_C_BPI_GetMapGimmickTrigger");
static_assert(sizeof(BPI_MapCommon_C_BPI_GetMapGimmickTrigger) == 0x000008, "Wrong size on BPI_MapCommon_C_BPI_GetMapGimmickTrigger");
static_assert(offsetof(BPI_MapCommon_C_BPI_GetMapGimmickTrigger, Actor) == 0x000000, "Member 'BPI_MapCommon_C_BPI_GetMapGimmickTrigger::Actor' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BPI_ReturnMapFromOutside
// 0x0003 (0x0003 - 0x0000)
struct BPI_MapCommon_C_BPI_ReturnMapFromOutside final
{
public:
	bool                                          AutoSave;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnPlayerPosition;                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UI_Immediate;                                      // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCommon_C_BPI_ReturnMapFromOutside) == 0x000001, "Wrong alignment on BPI_MapCommon_C_BPI_ReturnMapFromOutside");
static_assert(sizeof(BPI_MapCommon_C_BPI_ReturnMapFromOutside) == 0x000003, "Wrong size on BPI_MapCommon_C_BPI_ReturnMapFromOutside");
static_assert(offsetof(BPI_MapCommon_C_BPI_ReturnMapFromOutside, AutoSave) == 0x000000, "Member 'BPI_MapCommon_C_BPI_ReturnMapFromOutside::AutoSave' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_ReturnMapFromOutside, ReturnPlayerPosition) == 0x000001, "Member 'BPI_MapCommon_C_BPI_ReturnMapFromOutside::ReturnPlayerPosition' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_BPI_ReturnMapFromOutside, UI_Immediate) == 0x000002, "Member 'BPI_MapCommon_C_BPI_ReturnMapFromOutside::UI_Immediate' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.JsonCounterAdd
// 0x0008 (0x0008 - 0x0000)
struct BPI_MapCommon_C_JsonCounterAdd final
{
public:
	int32                                         EncountAdd;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MagatukaNum;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCommon_C_JsonCounterAdd) == 0x000004, "Wrong alignment on BPI_MapCommon_C_JsonCounterAdd");
static_assert(sizeof(BPI_MapCommon_C_JsonCounterAdd) == 0x000008, "Wrong size on BPI_MapCommon_C_JsonCounterAdd");
static_assert(offsetof(BPI_MapCommon_C_JsonCounterAdd, EncountAdd) == 0x000000, "Member 'BPI_MapCommon_C_JsonCounterAdd::EncountAdd' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_JsonCounterAdd, MagatukaNum) == 0x000004, "Member 'BPI_MapCommon_C_JsonCounterAdd::MagatukaNum' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.JsonCounterGet
// 0x0008 (0x0008 - 0x0000)
struct BPI_MapCommon_C_JsonCounterGet final
{
public:
	int32                                         EncountNum;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MagatukaNum;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCommon_C_JsonCounterGet) == 0x000004, "Wrong alignment on BPI_MapCommon_C_JsonCounterGet");
static_assert(sizeof(BPI_MapCommon_C_JsonCounterGet) == 0x000008, "Wrong size on BPI_MapCommon_C_JsonCounterGet");
static_assert(offsetof(BPI_MapCommon_C_JsonCounterGet, EncountNum) == 0x000000, "Member 'BPI_MapCommon_C_JsonCounterGet::EncountNum' has a wrong offset!");
static_assert(offsetof(BPI_MapCommon_C_JsonCounterGet, MagatukaNum) == 0x000004, "Member 'BPI_MapCommon_C_JsonCounterGet::MagatukaNum' has a wrong offset!");

// Function BPI_MapCommon.BPI_MapCommon_C.BI_SetMapChange
// 0x0010 (0x0010 - 0x0000)
struct BPI_MapCommon_C_BI_SetMapChange final
{
public:
	bool                                          IsMapChange;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DAC[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WarpPoint;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FromEvent;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherMapReturn;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCommon_C_BI_SetMapChange) == 0x000004, "Wrong alignment on BPI_MapCommon_C_BI_SetMapChange");
