#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_TitleMovieCtrl

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_TitleMovieCtrl.BPI_TitleMovieCtrl_C.IsEndTitleMovieCtrl
// 0x0001 (0x0001 - 0x0000)
struct BPI_TitleMovieCtrl_C_IsEndTitleMovieCtrl final
{
public:
	bool                                          IsEnd;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_TitleMovieCtrl_C_IsEndTitleMovieCtrl) == 0x000001, "Wrong alignment on BPI_TitleMovieCtrl_C_IsEndTitleMovieCtrl");
static_assert(sizeof(BPI_TitleMovieCtrl_C_IsEndTitleMovieCtrl) == 0x000001, "Wrong size on BPI_TitleMovieCtrl_C_IsEndTitleMovieCtrl");
static_assert(offsetof(BPI_TitleMovieCtrl_C_IsEndTitleMovieCtrl, IsEnd) == 0x000000, "Member 'BPI_TitleMovieCtrl_C_IsEndTitleMovieCtrl::IsEnd' has a wrong offset!");

// Function BPI_TitleMovieCtrl.BPI_TitleMovieCtrl_C.StartTitleMovieCtrl
// 0x0001 (0x0001 - 0x0000)
struct BPI_TitleMovieCtrl_C_StartTitleMovieCtrl final
{
public:
	bool                                          IsFirstMovie;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_TitleMovieCtrl_C_StartTitleMovieCtrl) == 0x000001, "Wrong alignment on BPI_TitleMovieCtrl_C_StartTitleMovieCtrl");
static_assert(sizeof(BPI_TitleMovieCtrl_C_StartTitleMovieCtrl) == 0x000001, "Wrong size on BPI_TitleMovieCtrl_C_StartTitleMovieCtrl");
static_assert(offsetof(BPI_TitleMovieCtrl_C_StartTitleMovieCtrl, IsFirstMovie) == 0x000000, "Member 'BPI_TitleMovieCtrl_C_StartTitleMovieCtrl::IsFirstMovie' has a wrong offset!");

}

