#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_SystemMenu

#include "Basic.hpp"

#include "E_SYSMENU_STEP_structs.hpp"


namespace SDK::Params
{

// Function BPI_SystemMenu.BPI_SystemMenu_C.SetSaveSlot
// 0x0008 (0x0008 - 0x0000)
struct BPI_SystemMenu_C_SetSaveSlot final
{
public:
	int32                                         Slot;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ret;                                               // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_SystemMenu_C_SetSaveSlot) == 0x000004, "Wrong alignment on BPI_SystemMenu_C_SetSaveSlot");
static_assert(sizeof(BPI_SystemMenu_C_SetSaveSlot) == 0x000008, "Wrong size on BPI_SystemMenu_C_SetSaveSlot");
static_assert(offsetof(BPI_SystemMenu_C_SetSaveSlot, Slot) == 0x000000, "Member 'BPI_SystemMenu_C_SetSaveSlot::Slot' has a wrong offset!");
static_assert(offsetof(BPI_SystemMenu_C_SetSaveSlot, Ret) == 0x000004, "Member 'BPI_SystemMenu_C_SetSaveSlot::Ret' has a wrong offset!");

// Function BPI_SystemMenu.BPI_SystemMenu_C.SetLoadSlot
// 0x0008 (0x0008 - 0x0000)
struct BPI_SystemMenu_C_SetLoadSlot final
{
public:
	int32                                         Slot;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ret;                                               // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_SystemMenu_C_SetLoadSlot) == 0x000004, "Wrong alignment on BPI_SystemMenu_C_SetLoadSlot");
static_assert(sizeof(BPI_SystemMenu_C_SetLoadSlot) == 0x000008, "Wrong size on BPI_SystemMenu_C_SetLoadSlot");
static_assert(offsetof(BPI_SystemMenu_C_SetLoadSlot, Slot) == 0x000000, "Member 'BPI_SystemMenu_C_SetLoadSlot::Slot' has a wrong offset!");
static_assert(offsetof(BPI_SystemMenu_C_SetLoadSlot, Ret) == 0x000004, "Member 'BPI_SystemMenu_C_SetLoadSlot::Ret' has a wrong offset!");

// Function BPI_SystemMenu.BPI_SystemMenu_C.ChangeMenuStep
// 0x0002 (0x0002 - 0x0000)
struct BPI_SystemMenu_C_ChangeMenuStep final
{
public:
	E_SYSMENU_STEP                                NextStep;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ret;                                               // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_SystemMenu_C_ChangeMenuStep) == 0x000001, "Wrong alignment on BPI_SystemMenu_C_ChangeMenuStep");
static_assert(sizeof(BPI_SystemMenu_C_ChangeMenuStep) == 0x000002, "Wrong size on BPI_SystemMenu_C_ChangeMenuStep");
static_assert(offsetof(BPI_SystemMenu_C_ChangeMenuStep, NextStep) == 0x000000, "Member 'BPI_SystemMenu_C_ChangeMenuStep::NextStep' has a wrong offset!");
static_assert(offsetof(BPI_SystemMenu_C_ChangeMenuStep, Ret) == 0x000001, "Member 'BPI_SystemMenu_C_ChangeMenuStep::Ret' has a wrong offset!");

}

