#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_CampItemCtrl

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BPI_CampItemCtrl.BPI_CampItemCtrl_C.ICampItemAllOn
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampItemCtrl_C_ICampItemAllOn final
{
public:
	bool                                          OutValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampItemCtrl_C_ICampItemAllOn) == 0x000001, "Wrong alignment on BPI_CampItemCtrl_C_ICampItemAllOn");
static_assert(sizeof(BPI_CampItemCtrl_C_ICampItemAllOn) == 0x000001, "Wrong size on BPI_CampItemCtrl_C_ICampItemAllOn");
static_assert(offsetof(BPI_CampItemCtrl_C_ICampItemAllOn, OutValue) == 0x000000, "Member 'BPI_CampItemCtrl_C_ICampItemAllOn::OutValue' has a wrong offset!");

// Function BPI_CampItemCtrl.BPI_CampItemCtrl_C.ICampItemALLOff
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampItemCtrl_C_ICampItemALLOff final
{
public:
	bool                                          OutValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampItemCtrl_C_ICampItemALLOff) == 0x000001, "Wrong alignment on BPI_CampItemCtrl_C_ICampItemALLOff");
static_assert(sizeof(BPI_CampItemCtrl_C_ICampItemALLOff) == 0x000001, "Wrong size on BPI_CampItemCtrl_C_ICampItemALLOff");
static_assert(offsetof(BPI_CampItemCtrl_C_ICampItemALLOff, OutValue) == 0x000000, "Member 'BPI_CampItemCtrl_C_ICampItemALLOff::OutValue' has a wrong offset!");

// Function BPI_CampItemCtrl.BPI_CampItemCtrl_C.ICampItemIsInSortMenu
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampItemCtrl_C_ICampItemIsInSortMenu final
{
public:
	bool                                          OutSort;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampItemCtrl_C_ICampItemIsInSortMenu) == 0x000001, "Wrong alignment on BPI_CampItemCtrl_C_ICampItemIsInSortMenu");
static_assert(sizeof(BPI_CampItemCtrl_C_ICampItemIsInSortMenu) == 0x000001, "Wrong size on BPI_CampItemCtrl_C_ICampItemIsInSortMenu");
static_assert(offsetof(BPI_CampItemCtrl_C_ICampItemIsInSortMenu, OutSort) == 0x000000, "Member 'BPI_CampItemCtrl_C_ICampItemIsInSortMenu::OutSort' has a wrong offset!");

// Function BPI_CampItemCtrl.BPI_CampItemCtrl_C.ICampItemCalcReselectItem
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampItemCtrl_C_ICampItemCalcReselectItem final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampItemCtrl_C_ICampItemCalcReselectItem) == 0x000001, "Wrong alignment on BPI_CampItemCtrl_C_ICampItemCalcReselectItem");
static_assert(sizeof(BPI_CampItemCtrl_C_ICampItemCalcReselectItem) == 0x000001, "Wrong size on BPI_CampItemCtrl_C_ICampItemCalcReselectItem");
static_assert(offsetof(BPI_CampItemCtrl_C_ICampItemCalcReselectItem, OutFinished) == 0x000000, "Member 'BPI_CampItemCtrl_C_ICampItemCalcReselectItem::OutFinished' has a wrong offset!");

// Function BPI_CampItemCtrl.BPI_CampItemCtrl_C.ICampItemSetItemSelectButtonHelp
// 0x0008 (0x0008 - 0x0000)
struct BPI_CampItemCtrl_C_ICampItemSetItemSelectButtonHelp final
{
public:
	int32                                         InPartyNumber;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InInitialize;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OutParam;                                          // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampItemCtrl_C_ICampItemSetItemSelectButtonHelp) == 0x000004, "Wrong alignment on BPI_CampItemCtrl_C_ICampItemSetItemSelectButtonHelp");
static_assert(sizeof(BPI_CampItemCtrl_C_ICampItemSetItemSelectButtonHelp) == 0x000008, "Wrong size on BPI_CampItemCtrl_C_ICampItemSetItemSelectButtonHelp");
static_assert(offsetof(BPI_CampItemCtrl_C_ICampItemSetItemSelectButtonHelp, InPartyNumber) == 0x000000, "Member 'BPI_CampItemCtrl_C_ICampItemSetItemSelectButtonHelp::InPartyNumber' has a wrong offset!");
static_assert(offsetof(BPI_CampItemCtrl_C_ICampItemSetItemSelectButtonHelp, InInitialize) == 0x000004, "Member 'BPI_CampItemCtrl_C_ICampItemSetItemSelectButtonHelp::InInitialize' has a wrong offset!");
static_assert(offsetof(BPI_CampItemCtrl_C_ICampItemSetItemSelectButtonHelp, OutParam) == 0x000005, "Member 'BPI_CampItemCtrl_C_ICampItemSetItemSelectButtonHelp::OutParam' has a wrong offset!");

// Function BPI_CampItemCtrl.BPI_CampItemCtrl_C.ICampItemSetPartyNumber
// 0x0008 (0x0008 - 0x0000)
struct BPI_CampItemCtrl_C_ICampItemSetPartyNumber final
{
public:
	int32                                         InNumber;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutParam;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampItemCtrl_C_ICampItemSetPartyNumber) == 0x000004, "Wrong alignment on BPI_CampItemCtrl_C_ICampItemSetPartyNumber");
static_assert(sizeof(BPI_CampItemCtrl_C_ICampItemSetPartyNumber) == 0x000008, "Wrong size on BPI_CampItemCtrl_C_ICampItemSetPartyNumber");
static_assert(offsetof(BPI_CampItemCtrl_C_ICampItemSetPartyNumber, InNumber) == 0x000000, "Member 'BPI_CampItemCtrl_C_ICampItemSetPartyNumber::InNumber' has a wrong offset!");
static_assert(offsetof(BPI_CampItemCtrl_C_ICampItemSetPartyNumber, OutParam) == 0x000004, "Member 'BPI_CampItemCtrl_C_ICampItemSetPartyNumber::OutParam' has a wrong offset!");

// Function BPI_CampItemCtrl.BPI_CampItemCtrl_C.ICampItemSetItemHelp
// 0x0002 (0x0002 - 0x0000)
struct BPI_CampItemCtrl_C_ICampItemSetItemHelp final
{
public:
	bool                                          InChangeAnimation;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OutParam;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampItemCtrl_C_ICampItemSetItemHelp) == 0x000001, "Wrong alignment on BPI_CampItemCtrl_C_ICampItemSetItemHelp");
static_assert(sizeof(BPI_CampItemCtrl_C_ICampItemSetItemHelp) == 0x000002, "Wrong size on BPI_CampItemCtrl_C_ICampItemSetItemHelp");
static_assert(offsetof(BPI_CampItemCtrl_C_ICampItemSetItemHelp, InChangeAnimation) == 0x000000, "Member 'BPI_CampItemCtrl_C_ICampItemSetItemHelp::InChangeAnimation' has a wrong offset!");
static_assert(offsetof(BPI_CampItemCtrl_C_ICampItemSetItemHelp, OutParam) == 0x000001, "Member 'BPI_CampItemCtrl_C_ICampItemSetItemHelp::OutParam' has a wrong offset!");

// Function BPI_CampItemCtrl.BPI_CampItemCtrl_C.ICampItemGetListFadeOut
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampItemCtrl_C_ICampItemGetListFadeOut final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampItemCtrl_C_ICampItemGetListFadeOut) == 0x000001, "Wrong alignment on BPI_CampItemCtrl_C_ICampItemGetListFadeOut");
static_assert(sizeof(BPI_CampItemCtrl_C_ICampItemGetListFadeOut) == 0x000001, "Wrong size on BPI_CampItemCtrl_C_ICampItemGetListFadeOut");
static_assert(offsetof(BPI_CampItemCtrl_C_ICampItemGetListFadeOut, OutFlag) == 0x000000, "Member 'BPI_CampItemCtrl_C_ICampItemGetListFadeOut::OutFlag' has a wrong offset!");

// Function BPI_CampItemCtrl.BPI_CampItemCtrl_C.ICampItemGetItemNumber
// 0x0004 (0x0004 - 0x0000)
struct BPI_CampItemCtrl_C_ICampItemGetItemNumber final
{
public:
	int32                                         OutNumber;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampItemCtrl_C_ICampItemGetItemNumber) == 0x000004, "Wrong alignment on BPI_CampItemCtrl_C_ICampItemGetItemNumber");
static_assert(sizeof(BPI_CampItemCtrl_C_ICampItemGetItemNumber) == 0x000004, "Wrong size on BPI_CampItemCtrl_C_ICampItemGetItemNumber");
static_assert(offsetof(BPI_CampItemCtrl_C_ICampItemGetItemNumber, OutNumber) == 0x000000, "Member 'BPI_CampItemCtrl_C_ICampItemGetItemNumber::OutNumber' has a wrong offset!");

// Function BPI_CampItemCtrl.BPI_CampItemCtrl_C.ICampItemGetReasonForCansel
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampItemCtrl_C_ICampItemGetReasonForCansel final
{
public:
	E_CAMPITEMLIST_CANSELTYPE                     OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampItemCtrl_C_ICampItemGetReasonForCansel) == 0x000001, "Wrong alignment on BPI_CampItemCtrl_C_ICampItemGetReasonForCansel");
static_assert(sizeof(BPI_CampItemCtrl_C_ICampItemGetReasonForCansel) == 0x000001, "Wrong size on BPI_CampItemCtrl_C_ICampItemGetReasonForCansel");
static_assert(offsetof(BPI_CampItemCtrl_C_ICampItemGetReasonForCansel, OutParam) == 0x000000, "Member 'BPI_CampItemCtrl_C_ICampItemGetReasonForCansel::OutParam' has a wrong offset!");

// Function BPI_CampItemCtrl.BPI_CampItemCtrl_C.ICampItemReselectItem
// 0x0008 (0x0008 - 0x0000)
struct BPI_CampItemCtrl_C_ICampItemReselectItem final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutFinished;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampItemCtrl_C_ICampItemReselectItem) == 0x000004, "Wrong alignment on BPI_CampItemCtrl_C_ICampItemReselectItem");
static_assert(sizeof(BPI_CampItemCtrl_C_ICampItemReselectItem) == 0x000008, "Wrong size on BPI_CampItemCtrl_C_ICampItemReselectItem");
static_assert(offsetof(BPI_CampItemCtrl_C_ICampItemReselectItem, InType) == 0x000000, "Member 'BPI_CampItemCtrl_C_ICampItemReselectItem::InType' has a wrong offset!");
static_assert(offsetof(BPI_CampItemCtrl_C_ICampItemReselectItem, OutFinished) == 0x000004, "Member 'BPI_CampItemCtrl_C_ICampItemReselectItem::OutFinished' has a wrong offset!");

// Function BPI_CampItemCtrl.BPI_CampItemCtrl_C.IIsCampItemUseItemProc
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampItemCtrl_C_IIsCampItemUseItemProc final
{
public:
	bool                                          OutUsed;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampItemCtrl_C_IIsCampItemUseItemProc) == 0x000001, "Wrong alignment on BPI_CampItemCtrl_C_IIsCampItemUseItemProc");
static_assert(sizeof(BPI_CampItemCtrl_C_IIsCampItemUseItemProc) == 0x000001, "Wrong size on BPI_CampItemCtrl_C_IIsCampItemUseItemProc");
static_assert(offsetof(BPI_CampItemCtrl_C_IIsCampItemUseItemProc, OutUsed) == 0x000000, "Member 'BPI_CampItemCtrl_C_IIsCampItemUseItemProc::OutUsed' has a wrong offset!");

// Function BPI_CampItemCtrl.BPI_CampItemCtrl_C.ICampItemGetSelectedItemId
// 0x0004 (0x0004 - 0x0000)
struct BPI_CampItemCtrl_C_ICampItemGetSelectedItemId final
{
public:
	int32                                         OutItemID;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampItemCtrl_C_ICampItemGetSelectedItemId) == 0x000004, "Wrong alignment on BPI_CampItemCtrl_C_ICampItemGetSelectedItemId");
static_assert(sizeof(BPI_CampItemCtrl_C_ICampItemGetSelectedItemId) == 0x000004, "Wrong size on BPI_CampItemCtrl_C_ICampItemGetSelectedItemId");
static_assert(offsetof(BPI_CampItemCtrl_C_ICampItemGetSelectedItemId, OutItemID) == 0x000000, "Member 'BPI_CampItemCtrl_C_ICampItemGetSelectedItemId::OutItemID' has a wrong offset!");

// Function BPI_CampItemCtrl.BPI_CampItemCtrl_C.ICampItemProc
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampItemCtrl_C_ICampItemProc final
{
public:
	bool                                          OutIsCanseled;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampItemCtrl_C_ICampItemProc) == 0x000001, "Wrong alignment on BPI_CampItemCtrl_C_ICampItemProc");
static_assert(sizeof(BPI_CampItemCtrl_C_ICampItemProc) == 0x000001, "Wrong size on BPI_CampItemCtrl_C_ICampItemProc");
static_assert(offsetof(BPI_CampItemCtrl_C_ICampItemProc, OutIsCanseled) == 0x000000, "Member 'BPI_CampItemCtrl_C_ICampItemProc::OutIsCanseled' has a wrong offset!");

// Function BPI_CampItemCtrl.BPI_CampItemCtrl_C.ICampItemIsFinished
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampItemCtrl_C_ICampItemIsFinished final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampItemCtrl_C_ICampItemIsFinished) == 0x000001, "Wrong alignment on BPI_CampItemCtrl_C_ICampItemIsFinished");
static_assert(sizeof(BPI_CampItemCtrl_C_ICampItemIsFinished) == 0x000001, "Wrong size on BPI_CampItemCtrl_C_ICampItemIsFinished");
static_assert(offsetof(BPI_CampItemCtrl_C_ICampItemIsFinished, OutFinished) == 0x000000, "Member 'BPI_CampItemCtrl_C_ICampItemIsFinished::OutFinished' has a wrong offset!");

// Function BPI_CampItemCtrl.BPI_CampItemCtrl_C.ICampItemCreate
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampItemCtrl_C_ICampItemCreate final
{
public:
	E_WIDGET_PRIO                                 InPriority;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampItemCtrl_C_ICampItemCreate) == 0x000001, "Wrong alignment on BPI_CampItemCtrl_C_ICampItemCreate");
static_assert(sizeof(BPI_CampItemCtrl_C_ICampItemCreate) == 0x000001, "Wrong size on BPI_CampItemCtrl_C_ICampItemCreate");
static_assert(offsetof(BPI_CampItemCtrl_C_ICampItemCreate, InPriority) == 0x000000, "Member 'BPI_CampItemCtrl_C_ICampItemCreate::InPriority' has a wrong offset!");

}

