#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_DevilAssetTable

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_DevilAssetTable.BPI_DevilAssetTable_C.BI_SetDevilAssetTable
// 0x0008 (0x0008 - 0x0000)
struct BPI_DevilAssetTable_C_BI_SetDevilAssetTable final
{
public:
	class UObject*                                CharaTable;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_DevilAssetTable_C_BI_SetDevilAssetTable) == 0x000008, "Wrong alignment on BPI_DevilAssetTable_C_BI_SetDevilAssetTable");
static_assert(sizeof(BPI_DevilAssetTable_C_BI_SetDevilAssetTable) == 0x000008, "Wrong size on BPI_DevilAssetTable_C_BI_SetDevilAssetTable");
static_assert(offsetof(BPI_DevilAssetTable_C_BI_SetDevilAssetTable, CharaTable) == 0x000000, "Member 'BPI_DevilAssetTable_C_BI_SetDevilAssetTable::CharaTable' has a wrong offset!");

// Function BPI_DevilAssetTable.BPI_DevilAssetTable_C.BI_GetDevilAssetTable
// 0x0008 (0x0008 - 0x0000)
struct BPI_DevilAssetTable_C_BI_GetDevilAssetTable final
{
public:
	class UObject*                                Instance;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_DevilAssetTable_C_BI_GetDevilAssetTable) == 0x000008, "Wrong alignment on BPI_DevilAssetTable_C_BI_GetDevilAssetTable");
static_assert(sizeof(BPI_DevilAssetTable_C_BI_GetDevilAssetTable) == 0x000008, "Wrong size on BPI_DevilAssetTable_C_BI_GetDevilAssetTable");
static_assert(offsetof(BPI_DevilAssetTable_C_BI_GetDevilAssetTable, Instance) == 0x000000, "Member 'BPI_DevilAssetTable_C_BI_GetDevilAssetTable::Instance' has a wrong offset!");

}

