#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_HealCharaPanelCtrl

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BPI_HealCharaPanelCtrl.BPI_HealCharaPanelCtrl_C.IHealCharaPanelCreate
// 0x0001 (0x0001 - 0x0000)
struct BPI_HealCharaPanelCtrl_C_IHealCharaPanelCreate final
{
public:
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_HealCharaPanelCtrl_C_IHealCharaPanelCreate) == 0x000001, "Wrong alignment on BPI_HealCharaPanelCtrl_C_IHealCharaPanelCreate");
static_assert(sizeof(BPI_HealCharaPanelCtrl_C_IHealCharaPanelCreate) == 0x000001, "Wrong size on BPI_HealCharaPanelCtrl_C_IHealCharaPanelCreate");
static_assert(offsetof(BPI_HealCharaPanelCtrl_C_IHealCharaPanelCreate, InPrio) == 0x000000, "Member 'BPI_HealCharaPanelCtrl_C_IHealCharaPanelCreate::InPrio' has a wrong offset!");

// Function BPI_HealCharaPanelCtrl.BPI_HealCharaPanelCtrl_C.IHealCharaPanelHealUseProc
// 0x0001 (0x0001 - 0x0000)
struct BPI_HealCharaPanelCtrl_C_IHealCharaPanelHealUseProc final
{
public:
	bool                                          IsCanseled;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_HealCharaPanelCtrl_C_IHealCharaPanelHealUseProc) == 0x000001, "Wrong alignment on BPI_HealCharaPanelCtrl_C_IHealCharaPanelHealUseProc");
static_assert(sizeof(BPI_HealCharaPanelCtrl_C_IHealCharaPanelHealUseProc) == 0x000001, "Wrong size on BPI_HealCharaPanelCtrl_C_IHealCharaPanelHealUseProc");
static_assert(offsetof(BPI_HealCharaPanelCtrl_C_IHealCharaPanelHealUseProc, IsCanseled) == 0x000000, "Member 'BPI_HealCharaPanelCtrl_C_IHealCharaPanelHealUseProc::IsCanseled' has a wrong offset!");

// Function BPI_HealCharaPanelCtrl.BPI_HealCharaPanelCtrl_C.IHealCharaPanelIsFinished
// 0x0001 (0x0001 - 0x0000)
struct BPI_HealCharaPanelCtrl_C_IHealCharaPanelIsFinished final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_HealCharaPanelCtrl_C_IHealCharaPanelIsFinished) == 0x000001, "Wrong alignment on BPI_HealCharaPanelCtrl_C_IHealCharaPanelIsFinished");
static_assert(sizeof(BPI_HealCharaPanelCtrl_C_IHealCharaPanelIsFinished) == 0x000001, "Wrong size on BPI_HealCharaPanelCtrl_C_IHealCharaPanelIsFinished");
static_assert(offsetof(BPI_HealCharaPanelCtrl_C_IHealCharaPanelIsFinished, OutFinished) == 0x000000, "Member 'BPI_HealCharaPanelCtrl_C_IHealCharaPanelIsFinished::OutFinished' has a wrong offset!");

}

