#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_CampHelpCtrl

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BPI_CampHelpCtrl.BPI_CampHelpCtrl_C.ICampHelpGetListFadeOut
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampHelpCtrl_C_ICampHelpGetListFadeOut final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampHelpCtrl_C_ICampHelpGetListFadeOut) == 0x000001, "Wrong alignment on BPI_CampHelpCtrl_C_ICampHelpGetListFadeOut");
static_assert(sizeof(BPI_CampHelpCtrl_C_ICampHelpGetListFadeOut) == 0x000001, "Wrong size on BPI_CampHelpCtrl_C_ICampHelpGetListFadeOut");
static_assert(offsetof(BPI_CampHelpCtrl_C_ICampHelpGetListFadeOut, OutFlag) == 0x000000, "Member 'BPI_CampHelpCtrl_C_ICampHelpGetListFadeOut::OutFlag' has a wrong offset!");

// Function BPI_CampHelpCtrl.BPI_CampHelpCtrl_C.ICampHelpProc
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampHelpCtrl_C_ICampHelpProc final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampHelpCtrl_C_ICampHelpProc) == 0x000001, "Wrong alignment on BPI_CampHelpCtrl_C_ICampHelpProc");
static_assert(sizeof(BPI_CampHelpCtrl_C_ICampHelpProc) == 0x000001, "Wrong size on BPI_CampHelpCtrl_C_ICampHelpProc");
static_assert(offsetof(BPI_CampHelpCtrl_C_ICampHelpProc, OutFinished) == 0x000000, "Member 'BPI_CampHelpCtrl_C_ICampHelpProc::OutFinished' has a wrong offset!");

// Function BPI_CampHelpCtrl.BPI_CampHelpCtrl_C.ICampHelpCreate
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampHelpCtrl_C_ICampHelpCreate final
{
public:
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampHelpCtrl_C_ICampHelpCreate) == 0x000001, "Wrong alignment on BPI_CampHelpCtrl_C_ICampHelpCreate");
static_assert(sizeof(BPI_CampHelpCtrl_C_ICampHelpCreate) == 0x000001, "Wrong size on BPI_CampHelpCtrl_C_ICampHelpCreate");
static_assert(offsetof(BPI_CampHelpCtrl_C_ICampHelpCreate, InPrio) == 0x000000, "Member 'BPI_CampHelpCtrl_C_ICampHelpCreate::InPrio' has a wrong offset!");

}

