#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_BattleTaskFactory

#include "Basic.hpp"

#include "MaterialAnimSetting_T_structs.hpp"
#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BTL_ADD_SKILL_LIGHT_TASK_DATA_structs.hpp"


namespace SDK::Params
{

// Function BPI_BattleTaskFactory.BPI_BattleTaskFactory_C.BI_GetParentNameTaskCnt
// 0x0018 (0x0018 - 0x0000)
struct BPI_BattleTaskFactory_C_BI_GetParentNameTaskCnt final
{
public:
	class FString                                 ParentName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         RetCnt;                                            // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleTaskFactory_C_BI_GetParentNameTaskCnt) == 0x000008, "Wrong alignment on BPI_BattleTaskFactory_C_BI_GetParentNameTaskCnt");
static_assert(sizeof(BPI_BattleTaskFactory_C_BI_GetParentNameTaskCnt) == 0x000018, "Wrong size on BPI_BattleTaskFactory_C_BI_GetParentNameTaskCnt");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_GetParentNameTaskCnt, ParentName) == 0x000000, "Member 'BPI_BattleTaskFactory_C_BI_GetParentNameTaskCnt::ParentName' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_GetParentNameTaskCnt, RetCnt) == 0x000010, "Member 'BPI_BattleTaskFactory_C_BI_GetParentNameTaskCnt::RetCnt' has a wrong offset!");

// Function BPI_BattleTaskFactory.BPI_BattleTaskFactory_C.BI_AddSetUnitMotion
// 0x0038 (0x0038 - 0x0000)
struct BPI_BattleTaskFactory_C_BI_AddSetUnitMotion final
{
public:
	TArray<int32>                                 WaitTaskList;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 ParentName;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	E_CHARA_MOTION_ID                             MotionID;                                          // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PartyIndex;                                        // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WaitMotionFinish;                                  // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartPosition;                                     // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayOneScale;                                    // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RetValue;                                          // 0x0034(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleTaskFactory_C_BI_AddSetUnitMotion) == 0x000008, "Wrong alignment on BPI_BattleTaskFactory_C_BI_AddSetUnitMotion");
static_assert(sizeof(BPI_BattleTaskFactory_C_BI_AddSetUnitMotion) == 0x000038, "Wrong size on BPI_BattleTaskFactory_C_BI_AddSetUnitMotion");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddSetUnitMotion, WaitTaskList) == 0x000000, "Member 'BPI_BattleTaskFactory_C_BI_AddSetUnitMotion::WaitTaskList' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddSetUnitMotion, ParentName) == 0x000010, "Member 'BPI_BattleTaskFactory_C_BI_AddSetUnitMotion::ParentName' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddSetUnitMotion, MotionID) == 0x000020, "Member 'BPI_BattleTaskFactory_C_BI_AddSetUnitMotion::MotionID' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddSetUnitMotion, PartyIndex) == 0x000024, "Member 'BPI_BattleTaskFactory_C_BI_AddSetUnitMotion::PartyIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddSetUnitMotion, WaitMotionFinish) == 0x000028, "Member 'BPI_BattleTaskFactory_C_BI_AddSetUnitMotion::WaitMotionFinish' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddSetUnitMotion, StartPosition) == 0x00002C, "Member 'BPI_BattleTaskFactory_C_BI_AddSetUnitMotion::StartPosition' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddSetUnitMotion, IsPlayOneScale) == 0x000030, "Member 'BPI_BattleTaskFactory_C_BI_AddSetUnitMotion::IsPlayOneScale' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddSetUnitMotion, RetValue) == 0x000034, "Member 'BPI_BattleTaskFactory_C_BI_AddSetUnitMotion::RetValue' has a wrong offset!");

// Function BPI_BattleTaskFactory.BPI_BattleTaskFactory_C.BI_AddCamRailSkillTask
// 0x0050 (0x0050 - 0x0000)
struct BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask final
{
public:
	TArray<int32>                                 WaitTaskList;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 ParentName;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ActorIndex;                                        // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TargetIndex;                                       // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_SKILL_CAM_TYPE                          Type;                                              // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Param_Name;                                        // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsHokan;                                           // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsConsiderActor;                                   // 0x0041(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsOverrideHokanSpeed;                              // 0x0042(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsHokanSpeedMax;                                   // 0x0043(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DoNotResetUnitAveLocation;                         // 0x0044(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RetValue;                                          // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask) == 0x000008, "Wrong alignment on BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask");
static_assert(sizeof(BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask) == 0x000050, "Wrong size on BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask, WaitTaskList) == 0x000000, "Member 'BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask::WaitTaskList' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask, ParentName) == 0x000010, "Member 'BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask::ParentName' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask, ActorIndex) == 0x000020, "Member 'BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask::ActorIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask, TargetIndex) == 0x000024, "Member 'BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask::TargetIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask, Type) == 0x000028, "Member 'BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask::Type' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask, Param_Name) == 0x000030, "Member 'BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask::Param_Name' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask, IsHokan) == 0x000040, "Member 'BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask::IsHokan' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask, IsConsiderActor) == 0x000041, "Member 'BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask::IsConsiderActor' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask, IsOverrideHokanSpeed) == 0x000042, "Member 'BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask::IsOverrideHokanSpeed' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask, IsHokanSpeedMax) == 0x000043, "Member 'BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask::IsHokanSpeedMax' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask, DoNotResetUnitAveLocation) == 0x000044, "Member 'BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask::DoNotResetUnitAveLocation' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask, RetValue) == 0x000048, "Member 'BPI_BattleTaskFactory_C_BI_AddCamRailSkillTask::RetValue' has a wrong offset!");

// Function BPI_BattleTaskFactory.BPI_BattleTaskFactory_C.BI_AddPlayEffectTask
// 0x00F0 (0x00F0 - 0x0000)
struct BPI_BattleTaskFactory_C_BI_AddPlayEffectTask final
{
public:
	TArray<int32>                                 WaitTaskList;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 ParentName;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UParticleSystem*                        ParticleData;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActorIndex;                                        // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TargetIndex;                                       // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlTaskData                           TaskData;                                          // 0x0030(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FBtlTaskData                           TaskData2;                                         // 0x0060(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FTransform                             Transform;                                         // 0x0090(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class USkeletalMesh*                          ModSkeletalMesh;                                   // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ModAnim;                                           // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ModAttachSocketName;                               // 0x00D0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPairTargetOverride;                              // 0x00D8(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PairTargetLocation;                                // 0x00DC(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsIgnoreSideScale;                                 // 0x00E8(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RetValue;                                          // 0x00EC(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleTaskFactory_C_BI_AddPlayEffectTask) == 0x000010, "Wrong alignment on BPI_BattleTaskFactory_C_BI_AddPlayEffectTask");
static_assert(sizeof(BPI_BattleTaskFactory_C_BI_AddPlayEffectTask) == 0x0000F0, "Wrong size on BPI_BattleTaskFactory_C_BI_AddPlayEffectTask");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPlayEffectTask, WaitTaskList) == 0x000000, "Member 'BPI_BattleTaskFactory_C_BI_AddPlayEffectTask::WaitTaskList' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPlayEffectTask, ParentName) == 0x000010, "Member 'BPI_BattleTaskFactory_C_BI_AddPlayEffectTask::ParentName' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPlayEffectTask, ParticleData) == 0x000020, "Member 'BPI_BattleTaskFactory_C_BI_AddPlayEffectTask::ParticleData' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPlayEffectTask, ActorIndex) == 0x000028, "Member 'BPI_BattleTaskFactory_C_BI_AddPlayEffectTask::ActorIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPlayEffectTask, TargetIndex) == 0x00002C, "Member 'BPI_BattleTaskFactory_C_BI_AddPlayEffectTask::TargetIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPlayEffectTask, TaskData) == 0x000030, "Member 'BPI_BattleTaskFactory_C_BI_AddPlayEffectTask::TaskData' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPlayEffectTask, TaskData2) == 0x000060, "Member 'BPI_BattleTaskFactory_C_BI_AddPlayEffectTask::TaskData2' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPlayEffectTask, Transform) == 0x000090, "Member 'BPI_BattleTaskFactory_C_BI_AddPlayEffectTask::Transform' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPlayEffectTask, ModSkeletalMesh) == 0x0000C0, "Member 'BPI_BattleTaskFactory_C_BI_AddPlayEffectTask::ModSkeletalMesh' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPlayEffectTask, ModAnim) == 0x0000C8, "Member 'BPI_BattleTaskFactory_C_BI_AddPlayEffectTask::ModAnim' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPlayEffectTask, ModAttachSocketName) == 0x0000D0, "Member 'BPI_BattleTaskFactory_C_BI_AddPlayEffectTask::ModAttachSocketName' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPlayEffectTask, IsPairTargetOverride) == 0x0000D8, "Member 'BPI_BattleTaskFactory_C_BI_AddPlayEffectTask::IsPairTargetOverride' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPlayEffectTask, PairTargetLocation) == 0x0000DC, "Member 'BPI_BattleTaskFactory_C_BI_AddPlayEffectTask::PairTargetLocation' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPlayEffectTask, IsIgnoreSideScale) == 0x0000E8, "Member 'BPI_BattleTaskFactory_C_BI_AddPlayEffectTask::IsIgnoreSideScale' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPlayEffectTask, RetValue) == 0x0000EC, "Member 'BPI_BattleTaskFactory_C_BI_AddPlayEffectTask::RetValue' has a wrong offset!");

// Function BPI_BattleTaskFactory.BPI_BattleTaskFactory_C.BI_AddDeltaWaitTask
// 0x0028 (0x0028 - 0x0000)
struct BPI_BattleTaskFactory_C_BI_AddDeltaWaitTask final
{
public:
	TArray<int32>                                 WaitTaskList;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 ParentName;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	float                                         DeltaTime;                                         // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetValue;                                          // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleTaskFactory_C_BI_AddDeltaWaitTask) == 0x000008, "Wrong alignment on BPI_BattleTaskFactory_C_BI_AddDeltaWaitTask");
static_assert(sizeof(BPI_BattleTaskFactory_C_BI_AddDeltaWaitTask) == 0x000028, "Wrong size on BPI_BattleTaskFactory_C_BI_AddDeltaWaitTask");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddDeltaWaitTask, WaitTaskList) == 0x000000, "Member 'BPI_BattleTaskFactory_C_BI_AddDeltaWaitTask::WaitTaskList' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddDeltaWaitTask, ParentName) == 0x000010, "Member 'BPI_BattleTaskFactory_C_BI_AddDeltaWaitTask::ParentName' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddDeltaWaitTask, DeltaTime) == 0x000020, "Member 'BPI_BattleTaskFactory_C_BI_AddDeltaWaitTask::DeltaTime' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddDeltaWaitTask, RetValue) == 0x000024, "Member 'BPI_BattleTaskFactory_C_BI_AddDeltaWaitTask::RetValue' has a wrong offset!");

// Function BPI_BattleTaskFactory.BPI_BattleTaskFactory_C.BI_AddPlayCamShake
// 0x0048 (0x0048 - 0x0000)
struct BPI_BattleTaskFactory_C_BI_AddPlayCamShake final
{
public:
	TArray<int32>                                 WaitTaskList;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 ParentName;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         PlayID;                                            // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RowName;                                           // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 ShakeClass;                                        // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scale;                                             // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetValue;                                          // 0x0044(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleTaskFactory_C_BI_AddPlayCamShake) == 0x000008, "Wrong alignment on BPI_BattleTaskFactory_C_BI_AddPlayCamShake");
static_assert(sizeof(BPI_BattleTaskFactory_C_BI_AddPlayCamShake) == 0x000048, "Wrong size on BPI_BattleTaskFactory_C_BI_AddPlayCamShake");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPlayCamShake, WaitTaskList) == 0x000000, "Member 'BPI_BattleTaskFactory_C_BI_AddPlayCamShake::WaitTaskList' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPlayCamShake, ParentName) == 0x000010, "Member 'BPI_BattleTaskFactory_C_BI_AddPlayCamShake::ParentName' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPlayCamShake, PlayID) == 0x000020, "Member 'BPI_BattleTaskFactory_C_BI_AddPlayCamShake::PlayID' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPlayCamShake, RowName) == 0x000028, "Member 'BPI_BattleTaskFactory_C_BI_AddPlayCamShake::RowName' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPlayCamShake, ShakeClass) == 0x000038, "Member 'BPI_BattleTaskFactory_C_BI_AddPlayCamShake::ShakeClass' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPlayCamShake, Scale) == 0x000040, "Member 'BPI_BattleTaskFactory_C_BI_AddPlayCamShake::Scale' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPlayCamShake, RetValue) == 0x000044, "Member 'BPI_BattleTaskFactory_C_BI_AddPlayCamShake::RetValue' has a wrong offset!");

// Function BPI_BattleTaskFactory.BPI_BattleTaskFactory_C.BI_AddRadialBlurTask
// 0x0078 (0x0078 - 0x0000)
struct BPI_BattleTaskFactory_C_BI_AddRadialBlurTask final
{
public:
	TArray<int32>                                 WaitTaskList;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 ParentName;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         TargetIndex;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SocketName;                                        // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Sw;                                                // 0x003C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Damage;                                            // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartAmount;                                       // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndAmount;                                         // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartKeepSec;                                      // 0x004C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LerpSec;                                           // 0x0050(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Origin;                                            // 0x0054(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset;                                            // 0x0060(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseOrigin;                                         // 0x006C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RetValue;                                          // 0x0070(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleTaskFactory_C_BI_AddRadialBlurTask) == 0x000008, "Wrong alignment on BPI_BattleTaskFactory_C_BI_AddRadialBlurTask");
static_assert(sizeof(BPI_BattleTaskFactory_C_BI_AddRadialBlurTask) == 0x000078, "Wrong size on BPI_BattleTaskFactory_C_BI_AddRadialBlurTask");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddRadialBlurTask, WaitTaskList) == 0x000000, "Member 'BPI_BattleTaskFactory_C_BI_AddRadialBlurTask::WaitTaskList' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddRadialBlurTask, ParentName) == 0x000010, "Member 'BPI_BattleTaskFactory_C_BI_AddRadialBlurTask::ParentName' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddRadialBlurTask, TargetIndex) == 0x000020, "Member 'BPI_BattleTaskFactory_C_BI_AddRadialBlurTask::TargetIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddRadialBlurTask, SocketName) == 0x000028, "Member 'BPI_BattleTaskFactory_C_BI_AddRadialBlurTask::SocketName' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddRadialBlurTask, Value) == 0x000038, "Member 'BPI_BattleTaskFactory_C_BI_AddRadialBlurTask::Value' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddRadialBlurTask, Sw) == 0x00003C, "Member 'BPI_BattleTaskFactory_C_BI_AddRadialBlurTask::Sw' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddRadialBlurTask, Damage) == 0x000040, "Member 'BPI_BattleTaskFactory_C_BI_AddRadialBlurTask::Damage' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddRadialBlurTask, StartAmount) == 0x000044, "Member 'BPI_BattleTaskFactory_C_BI_AddRadialBlurTask::StartAmount' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddRadialBlurTask, EndAmount) == 0x000048, "Member 'BPI_BattleTaskFactory_C_BI_AddRadialBlurTask::EndAmount' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddRadialBlurTask, StartKeepSec) == 0x00004C, "Member 'BPI_BattleTaskFactory_C_BI_AddRadialBlurTask::StartKeepSec' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddRadialBlurTask, LerpSec) == 0x000050, "Member 'BPI_BattleTaskFactory_C_BI_AddRadialBlurTask::LerpSec' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddRadialBlurTask, Origin) == 0x000054, "Member 'BPI_BattleTaskFactory_C_BI_AddRadialBlurTask::Origin' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddRadialBlurTask, Offset) == 0x000060, "Member 'BPI_BattleTaskFactory_C_BI_AddRadialBlurTask::Offset' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddRadialBlurTask, UseOrigin) == 0x00006C, "Member 'BPI_BattleTaskFactory_C_BI_AddRadialBlurTask::UseOrigin' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddRadialBlurTask, RetValue) == 0x000070, "Member 'BPI_BattleTaskFactory_C_BI_AddRadialBlurTask::RetValue' has a wrong offset!");

// Function BPI_BattleTaskFactory.BPI_BattleTaskFactory_C.BI_MakeDeadTask
// 0x0030 (0x0030 - 0x0000)
struct BPI_BattleTaskFactory_C_BI_MakeDeadTask final
{
public:
	TArray<int32>                                 NewParam;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 ParentName;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         PartyIndex;                                        // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTime;                                         // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_DEAD_EFFECT                             DeadType;                                          // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Immediately;                                       // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IgnoreEnemyKilled;                                 // 0x002A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RetValue;                                          // 0x002C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleTaskFactory_C_BI_MakeDeadTask) == 0x000008, "Wrong alignment on BPI_BattleTaskFactory_C_BI_MakeDeadTask");
static_assert(sizeof(BPI_BattleTaskFactory_C_BI_MakeDeadTask) == 0x000030, "Wrong size on BPI_BattleTaskFactory_C_BI_MakeDeadTask");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_MakeDeadTask, NewParam) == 0x000000, "Member 'BPI_BattleTaskFactory_C_BI_MakeDeadTask::NewParam' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_MakeDeadTask, ParentName) == 0x000010, "Member 'BPI_BattleTaskFactory_C_BI_MakeDeadTask::ParentName' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_MakeDeadTask, PartyIndex) == 0x000020, "Member 'BPI_BattleTaskFactory_C_BI_MakeDeadTask::PartyIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_MakeDeadTask, DeltaTime) == 0x000024, "Member 'BPI_BattleTaskFactory_C_BI_MakeDeadTask::DeltaTime' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_MakeDeadTask, DeadType) == 0x000028, "Member 'BPI_BattleTaskFactory_C_BI_MakeDeadTask::DeadType' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_MakeDeadTask, Immediately) == 0x000029, "Member 'BPI_BattleTaskFactory_C_BI_MakeDeadTask::Immediately' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_MakeDeadTask, IgnoreEnemyKilled) == 0x00002A, "Member 'BPI_BattleTaskFactory_C_BI_MakeDeadTask::IgnoreEnemyKilled' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_MakeDeadTask, RetValue) == 0x00002C, "Member 'BPI_BattleTaskFactory_C_BI_MakeDeadTask::RetValue' has a wrong offset!");

// Function BPI_BattleTaskFactory.BPI_BattleTaskFactory_C.BI_AddUnitAttackMoveTask
// 0x0058 (0x0058 - 0x0000)
struct BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask final
{
public:
	TArray<int32>                                 NewParam;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 ParentName;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         SrcIndex;                                          // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DstIndex;                                          // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WaitEnd;                                           // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Speed;                                             // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RevDeg;                                            // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLocationMove;                                    // 0x0034(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MoveLocation;                                      // 0x0038(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LookLocation;                                      // 0x0044(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CHARA_MOTION_ID                             AttackMotion;                                      // 0x0050(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RetValue;                                          // 0x0054(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask) == 0x000008, "Wrong alignment on BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask");
static_assert(sizeof(BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask) == 0x000058, "Wrong size on BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask, NewParam) == 0x000000, "Member 'BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask::NewParam' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask, ParentName) == 0x000010, "Member 'BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask::ParentName' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask, SrcIndex) == 0x000020, "Member 'BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask::SrcIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask, DstIndex) == 0x000024, "Member 'BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask::DstIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask, WaitEnd) == 0x000028, "Member 'BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask::WaitEnd' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask, Speed) == 0x00002C, "Member 'BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask::Speed' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask, RevDeg) == 0x000030, "Member 'BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask::RevDeg' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask, IsLocationMove) == 0x000034, "Member 'BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask::IsLocationMove' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask, MoveLocation) == 0x000038, "Member 'BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask::MoveLocation' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask, LookLocation) == 0x000044, "Member 'BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask::LookLocation' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask, AttackMotion) == 0x000050, "Member 'BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask::AttackMotion' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask, RetValue) == 0x000054, "Member 'BPI_BattleTaskFactory_C_BI_AddUnitAttackMoveTask::RetValue' has a wrong offset!");

// Function BPI_BattleTaskFactory.BPI_BattleTaskFactory_C.BI_AddMessageTask
// 0x0060 (0x0060 - 0x0000)
struct BPI_BattleTaskFactory_C_BI_AddMessageTask final
{
public:
	TArray<int32>                                 WaitTaskList;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 ParentName;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         MessageID;                                         // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Program_no;                                        // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 AddString;                                         // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Sw;                                                // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayRate;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Elementnumber;                                     // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShowPosition;                                      // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSkillOrItemName;                                 // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SkillId;                                           // 0x004C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillAptitude;                                     // 0x0050(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemId;                                            // 0x0054(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetValue;                                          // 0x0058(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleTaskFactory_C_BI_AddMessageTask) == 0x000008, "Wrong alignment on BPI_BattleTaskFactory_C_BI_AddMessageTask");
static_assert(sizeof(BPI_BattleTaskFactory_C_BI_AddMessageTask) == 0x000060, "Wrong size on BPI_BattleTaskFactory_C_BI_AddMessageTask");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddMessageTask, WaitTaskList) == 0x000000, "Member 'BPI_BattleTaskFactory_C_BI_AddMessageTask::WaitTaskList' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddMessageTask, ParentName) == 0x000010, "Member 'BPI_BattleTaskFactory_C_BI_AddMessageTask::ParentName' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddMessageTask, MessageID) == 0x000020, "Member 'BPI_BattleTaskFactory_C_BI_AddMessageTask::MessageID' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddMessageTask, Program_no) == 0x000024, "Member 'BPI_BattleTaskFactory_C_BI_AddMessageTask::Program_no' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddMessageTask, AddString) == 0x000028, "Member 'BPI_BattleTaskFactory_C_BI_AddMessageTask::AddString' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddMessageTask, Sw) == 0x000038, "Member 'BPI_BattleTaskFactory_C_BI_AddMessageTask::Sw' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddMessageTask, PlayRate) == 0x00003C, "Member 'BPI_BattleTaskFactory_C_BI_AddMessageTask::PlayRate' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddMessageTask, Elementnumber) == 0x000040, "Member 'BPI_BattleTaskFactory_C_BI_AddMessageTask::Elementnumber' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddMessageTask, ShowPosition) == 0x000044, "Member 'BPI_BattleTaskFactory_C_BI_AddMessageTask::ShowPosition' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddMessageTask, IsSkillOrItemName) == 0x000048, "Member 'BPI_BattleTaskFactory_C_BI_AddMessageTask::IsSkillOrItemName' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddMessageTask, SkillId) == 0x00004C, "Member 'BPI_BattleTaskFactory_C_BI_AddMessageTask::SkillId' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddMessageTask, SkillAptitude) == 0x000050, "Member 'BPI_BattleTaskFactory_C_BI_AddMessageTask::SkillAptitude' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddMessageTask, ItemId) == 0x000054, "Member 'BPI_BattleTaskFactory_C_BI_AddMessageTask::ItemId' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddMessageTask, RetValue) == 0x000058, "Member 'BPI_BattleTaskFactory_C_BI_AddMessageTask::RetValue' has a wrong offset!");

// Function BPI_BattleTaskFactory.BPI_BattleTaskFactory_C.BI_AddNumEffectTask
// 0x0058 (0x0058 - 0x0000)
struct BPI_BattleTaskFactory_C_BI_AddNumEffectTask final
{
public:
	TArray<int32>                                 WaitTaskList;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 ParentName;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         PartyIndex;                                        // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HPNum;                                             // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MPNum;                                             // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_NUMEFF                                  Type;                                              // 0x002C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_UTIL_ICON_TYPE                          HitType;                                           // 0x002D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CriticalLevel;                                     // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandArea;                                          // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlayRate;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsResist;                                          // 0x003C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PositionOffset;                                    // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDead;                                            // 0x004C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_KUISHIBARI_LEVEL                            Kuishibari;                                        // 0x004D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSkipping;                                        // 0x004E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CheckTargetInCamera;                               // 0x004F(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         RetValue;                                          // 0x0050(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleTaskFactory_C_BI_AddNumEffectTask) == 0x000008, "Wrong alignment on BPI_BattleTaskFactory_C_BI_AddNumEffectTask");
static_assert(sizeof(BPI_BattleTaskFactory_C_BI_AddNumEffectTask) == 0x000058, "Wrong size on BPI_BattleTaskFactory_C_BI_AddNumEffectTask");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddNumEffectTask, WaitTaskList) == 0x000000, "Member 'BPI_BattleTaskFactory_C_BI_AddNumEffectTask::WaitTaskList' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddNumEffectTask, ParentName) == 0x000010, "Member 'BPI_BattleTaskFactory_C_BI_AddNumEffectTask::ParentName' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddNumEffectTask, PartyIndex) == 0x000020, "Member 'BPI_BattleTaskFactory_C_BI_AddNumEffectTask::PartyIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddNumEffectTask, HPNum) == 0x000024, "Member 'BPI_BattleTaskFactory_C_BI_AddNumEffectTask::HPNum' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddNumEffectTask, MPNum) == 0x000028, "Member 'BPI_BattleTaskFactory_C_BI_AddNumEffectTask::MPNum' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddNumEffectTask, Type) == 0x00002C, "Member 'BPI_BattleTaskFactory_C_BI_AddNumEffectTask::Type' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddNumEffectTask, HitType) == 0x00002D, "Member 'BPI_BattleTaskFactory_C_BI_AddNumEffectTask::HitType' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddNumEffectTask, CriticalLevel) == 0x000030, "Member 'BPI_BattleTaskFactory_C_BI_AddNumEffectTask::CriticalLevel' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddNumEffectTask, RandArea) == 0x000034, "Member 'BPI_BattleTaskFactory_C_BI_AddNumEffectTask::RandArea' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddNumEffectTask, PlayRate) == 0x000038, "Member 'BPI_BattleTaskFactory_C_BI_AddNumEffectTask::PlayRate' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddNumEffectTask, IsResist) == 0x00003C, "Member 'BPI_BattleTaskFactory_C_BI_AddNumEffectTask::IsResist' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddNumEffectTask, PositionOffset) == 0x000040, "Member 'BPI_BattleTaskFactory_C_BI_AddNumEffectTask::PositionOffset' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddNumEffectTask, IsDead) == 0x00004C, "Member 'BPI_BattleTaskFactory_C_BI_AddNumEffectTask::IsDead' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddNumEffectTask, Kuishibari) == 0x00004D, "Member 'BPI_BattleTaskFactory_C_BI_AddNumEffectTask::Kuishibari' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddNumEffectTask, IsSkipping) == 0x00004E, "Member 'BPI_BattleTaskFactory_C_BI_AddNumEffectTask::IsSkipping' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddNumEffectTask, CheckTargetInCamera) == 0x00004F, "Member 'BPI_BattleTaskFactory_C_BI_AddNumEffectTask::CheckTargetInCamera' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddNumEffectTask, RetValue) == 0x000050, "Member 'BPI_BattleTaskFactory_C_BI_AddNumEffectTask::RetValue' has a wrong offset!");

// Function BPI_BattleTaskFactory.BPI_BattleTaskFactory_C.BI_AddPartyPanelCtrlTask
// 0x0030 (0x0030 - 0x0000)
struct BPI_BattleTaskFactory_C_BI_AddPartyPanelCtrlTask final
{
public:
	TArray<int32>                                 WaitTaskList;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 ParentName;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         PartyIndex;                                        // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_PANEL_CTRL                              Ctrl;                                              // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Sw;                                                // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RetValue;                                          // 0x002C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleTaskFactory_C_BI_AddPartyPanelCtrlTask) == 0x000008, "Wrong alignment on BPI_BattleTaskFactory_C_BI_AddPartyPanelCtrlTask");
static_assert(sizeof(BPI_BattleTaskFactory_C_BI_AddPartyPanelCtrlTask) == 0x000030, "Wrong size on BPI_BattleTaskFactory_C_BI_AddPartyPanelCtrlTask");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPartyPanelCtrlTask, WaitTaskList) == 0x000000, "Member 'BPI_BattleTaskFactory_C_BI_AddPartyPanelCtrlTask::WaitTaskList' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPartyPanelCtrlTask, ParentName) == 0x000010, "Member 'BPI_BattleTaskFactory_C_BI_AddPartyPanelCtrlTask::ParentName' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPartyPanelCtrlTask, PartyIndex) == 0x000020, "Member 'BPI_BattleTaskFactory_C_BI_AddPartyPanelCtrlTask::PartyIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPartyPanelCtrlTask, Value) == 0x000024, "Member 'BPI_BattleTaskFactory_C_BI_AddPartyPanelCtrlTask::Value' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPartyPanelCtrlTask, Ctrl) == 0x000028, "Member 'BPI_BattleTaskFactory_C_BI_AddPartyPanelCtrlTask::Ctrl' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPartyPanelCtrlTask, Sw) == 0x000029, "Member 'BPI_BattleTaskFactory_C_BI_AddPartyPanelCtrlTask::Sw' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddPartyPanelCtrlTask, RetValue) == 0x00002C, "Member 'BPI_BattleTaskFactory_C_BI_AddPartyPanelCtrlTask::RetValue' has a wrong offset!");

// Function BPI_BattleTaskFactory.BPI_BattleTaskFactory_C.BI_AddUnitBackStepTask
// 0x0030 (0x0030 - 0x0000)
struct BPI_BattleTaskFactory_C_BI_AddUnitBackStepTask final
{
public:
	TArray<int32>                                 WaitTaskList;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 ParentName;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         TargetIndex;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WaitEnd;                                           // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_AVOID_DIRECTION                             Direction;                                         // 0x0025(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RetValue;                                          // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleTaskFactory_C_BI_AddUnitBackStepTask) == 0x000008, "Wrong alignment on BPI_BattleTaskFactory_C_BI_AddUnitBackStepTask");
static_assert(sizeof(BPI_BattleTaskFactory_C_BI_AddUnitBackStepTask) == 0x000030, "Wrong size on BPI_BattleTaskFactory_C_BI_AddUnitBackStepTask");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddUnitBackStepTask, WaitTaskList) == 0x000000, "Member 'BPI_BattleTaskFactory_C_BI_AddUnitBackStepTask::WaitTaskList' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddUnitBackStepTask, ParentName) == 0x000010, "Member 'BPI_BattleTaskFactory_C_BI_AddUnitBackStepTask::ParentName' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddUnitBackStepTask, TargetIndex) == 0x000020, "Member 'BPI_BattleTaskFactory_C_BI_AddUnitBackStepTask::TargetIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddUnitBackStepTask, WaitEnd) == 0x000024, "Member 'BPI_BattleTaskFactory_C_BI_AddUnitBackStepTask::WaitEnd' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddUnitBackStepTask, Direction) == 0x000025, "Member 'BPI_BattleTaskFactory_C_BI_AddUnitBackStepTask::Direction' has a wrong offset!");
static_assert(offsetof(BPI_BattleTaskFactory_C_BI_AddUnitBackStepTask, RetValue) == 0x000028, "Member 'BPI_BattleTaskFactory_C_BI_AddUnitBackStepTask::RetValue' has a wrong offset!");

