#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_DG_TimeStopEffect

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_DG_TimeStopEffect.BPI_DG_TimeStopEffect_C.ToStopEffect
// 0x0004 (0x0004 - 0x0000)
struct BPI_DG_TimeStopEffect_C_ToStopEffect final
{
public:
	float                                         EffectDuration;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_DG_TimeStopEffect_C_ToStopEffect) == 0x000004, "Wrong alignment on BPI_DG_TimeStopEffect_C_ToStopEffect");
static_assert(sizeof(BPI_DG_TimeStopEffect_C_ToStopEffect) == 0x000004, "Wrong size on BPI_DG_TimeStopEffect_C_ToStopEffect");
static_assert(offsetof(BPI_DG_TimeStopEffect_C_ToStopEffect, EffectDuration) == 0x000000, "Member 'BPI_DG_TimeStopEffect_C_ToStopEffect::EffectDuration' has a wrong offset!");

// Function BPI_DG_TimeStopEffect.BPI_DG_TimeStopEffect_C.ToMoveEffect
// 0x0004 (0x0004 - 0x0000)
struct BPI_DG_TimeStopEffect_C_ToMoveEffect final
{
public:
	float                                         EffectDuration;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_DG_TimeStopEffect_C_ToMoveEffect) == 0x000004, "Wrong alignment on BPI_DG_TimeStopEffect_C_ToMoveEffect");
static_assert(sizeof(BPI_DG_TimeStopEffect_C_ToMoveEffect) == 0x000004, "Wrong size on BPI_DG_TimeStopEffect_C_ToMoveEffect");
static_assert(offsetof(BPI_DG_TimeStopEffect_C_ToMoveEffect, EffectDuration) == 0x000000, "Member 'BPI_DG_TimeStopEffect_C_ToMoveEffect::EffectDuration' has a wrong offset!");

}

