#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_CharaBaseAccessor

#include "Basic.hpp"

#include "E_IK_TYPE_LIST_structs.hpp"
#include "Project_structs.hpp"
#include "Engine_structs.hpp"
#include "E_CHARA_MATERIAL_ANIMATION_SLOT_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MaterialAnimSetting_T_structs.hpp"


namespace SDK::Params
{

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_GetMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_GetMeshComponent final
{
public:
	class UMeshComponent*                         MeshComp;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_GetMeshComponent) == 0x000008, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_GetMeshComponent");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_GetMeshComponent) == 0x000008, "Wrong size on BPI_CharaBaseAccessor_C_BI_GetMeshComponent");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_GetMeshComponent, MeshComp) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_GetMeshComponent::MeshComp' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_GetPlayRate
// 0x0004 (0x0004 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_GetPlayRate final
{
public:
	float                                         PlayRate;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_GetPlayRate) == 0x000004, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_GetPlayRate");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_GetPlayRate) == 0x000004, "Wrong size on BPI_CharaBaseAccessor_C_BI_GetPlayRate");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_GetPlayRate, PlayRate) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_GetPlayRate::PlayRate' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_GetEffectScale
// 0x0004 (0x0004 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_GetEffectScale final
{
public:
	float                                         EffectScale;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_GetEffectScale) == 0x000004, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_GetEffectScale");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_GetEffectScale) == 0x000004, "Wrong size on BPI_CharaBaseAccessor_C_BI_GetEffectScale");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_GetEffectScale, EffectScale) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_GetEffectScale::EffectScale' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_GetCharaParamComponent
// 0x0008 (0x0008 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_GetCharaParamComponent final
{
public:
	class UCharaParamComponent*                   Comp;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_GetCharaParamComponent) == 0x000008, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_GetCharaParamComponent");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_GetCharaParamComponent) == 0x000008, "Wrong size on BPI_CharaBaseAccessor_C_BI_GetCharaParamComponent");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_GetCharaParamComponent, Comp) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_GetCharaParamComponent::Comp' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_GetCapsuleComponent
// 0x0008 (0x0008 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_GetCapsuleComponent final
{
public:
	class UCapsuleComponent*                      Param;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_GetCapsuleComponent) == 0x000008, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_GetCapsuleComponent");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_GetCapsuleComponent) == 0x000008, "Wrong size on BPI_CharaBaseAccessor_C_BI_GetCapsuleComponent");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_GetCapsuleComponent, Param) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_GetCapsuleComponent::Param' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_GetActorRotation
// 0x000C (0x000C - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_GetActorRotation final
{
public:
	struct FRotator                               Rotation;                                          // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_GetActorRotation) == 0x000004, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_GetActorRotation");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_GetActorRotation) == 0x00000C, "Wrong size on BPI_CharaBaseAccessor_C_BI_GetActorRotation");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_GetActorRotation, Rotation) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_GetActorRotation::Rotation' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_ResetScalarParam
// 0x0018 (0x0018 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_ResetScalarParam final
{
public:
	TArray<class FName>                           ParamNames;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          NoUs;                                              // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_ResetScalarParam) == 0x000008, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_ResetScalarParam");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_ResetScalarParam) == 0x000018, "Wrong size on BPI_CharaBaseAccessor_C_BI_ResetScalarParam");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_ResetScalarParam, ParamNames) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_ResetScalarParam::ParamNames' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_ResetScalarParam, NoUs) == 0x000010, "Member 'BPI_CharaBaseAccessor_C_BI_ResetScalarParam::NoUs' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_BadStatusMaterialOn
// 0x0018 (0x0018 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_BadStatusMaterialOn final
{
public:
	TArray<E_BAD_STATUS>                          OnBadStatus;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          NoUse;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_BadStatusMaterialOn) == 0x000008, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_BadStatusMaterialOn");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_BadStatusMaterialOn) == 0x000018, "Wrong size on BPI_CharaBaseAccessor_C_BI_BadStatusMaterialOn");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_BadStatusMaterialOn, OnBadStatus) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_BadStatusMaterialOn::OnBadStatus' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_BadStatusMaterialOn, NoUse) == 0x000010, "Member 'BPI_CharaBaseAccessor_C_BI_BadStatusMaterialOn::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_BadStatusMaterialOff
// 0x0018 (0x0018 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_BadStatusMaterialOff final
{
public:
	TArray<E_BAD_STATUS>                          OffBadStatus;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          NoUse;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_BadStatusMaterialOff) == 0x000008, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_BadStatusMaterialOff");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_BadStatusMaterialOff) == 0x000018, "Wrong size on BPI_CharaBaseAccessor_C_BI_BadStatusMaterialOff");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_BadStatusMaterialOff, OffBadStatus) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_BadStatusMaterialOff::OffBadStatus' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_BadStatusMaterialOff, NoUse) == 0x000010, "Member 'BPI_CharaBaseAccessor_C_BI_BadStatusMaterialOff::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_EvtResetEffect
// 0x0001 (0x0001 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_EvtResetEffect final
{
public:
	bool                                          NoUse;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_EvtResetEffect) == 0x000001, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_EvtResetEffect");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_EvtResetEffect) == 0x000001, "Wrong size on BPI_CharaBaseAccessor_C_BI_EvtResetEffect");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_EvtResetEffect, NoUse) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_EvtResetEffect::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_EvtResetBadStatusMaterial
// 0x0001 (0x0001 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_EvtResetBadStatusMaterial final
{
public:
	bool                                          NoUse;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_EvtResetBadStatusMaterial) == 0x000001, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_EvtResetBadStatusMaterial");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_EvtResetBadStatusMaterial) == 0x000001, "Wrong size on BPI_CharaBaseAccessor_C_BI_EvtResetBadStatusMaterial");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_EvtResetBadStatusMaterial, NoUse) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_EvtResetBadStatusMaterial::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_SetActionState
// 0x0003 (0x0003 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_SetActionState final
{
public:
	E_CHARA_ACTION_TYPE                           InAction;                                          // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         State;                                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoUse;                                             // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_SetActionState) == 0x000001, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_SetActionState");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_SetActionState) == 0x000003, "Wrong size on BPI_CharaBaseAccessor_C_BI_SetActionState");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetActionState, InAction) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_SetActionState::InAction' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetActionState, State) == 0x000001, "Member 'BPI_CharaBaseAccessor_C_BI_SetActionState::State' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetActionState, NoUse) == 0x000002, "Member 'BPI_CharaBaseAccessor_C_BI_SetActionState::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_CreateBadStatusPSComp
// 0x0008 (0x0008 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_CreateBadStatusPSComp final
{
public:
	class UParticleSystemComponent*               PSComp;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_CreateBadStatusPSComp) == 0x000008, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_CreateBadStatusPSComp");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_CreateBadStatusPSComp) == 0x000008, "Wrong size on BPI_CharaBaseAccessor_C_BI_CreateBadStatusPSComp");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_CreateBadStatusPSComp, PSComp) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_CreateBadStatusPSComp::PSComp' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_ResetState
// 0x0008 (0x0008 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_ResetState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoUse;                                             // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_ResetState) == 0x000004, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_ResetState");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_ResetState) == 0x000008, "Wrong size on BPI_CharaBaseAccessor_C_BI_ResetState");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_ResetState, State) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_ResetState::State' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_ResetState, NoUse) == 0x000004, "Member 'BPI_CharaBaseAccessor_C_BI_ResetState::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_SetNotifyApplyHit
// 0x0003 (0x0003 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_SetNotifyApplyHit final
{
public:
	bool                                          IsNotified;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_ANIM_NOTIFY_APPLY_HIT_TYPE                  NotifyType;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoUse;                                             // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_SetNotifyApplyHit) == 0x000001, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_SetNotifyApplyHit");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_SetNotifyApplyHit) == 0x000003, "Wrong size on BPI_CharaBaseAccessor_C_BI_SetNotifyApplyHit");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetNotifyApplyHit, IsNotified) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_SetNotifyApplyHit::IsNotified' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetNotifyApplyHit, NotifyType) == 0x000001, "Member 'BPI_CharaBaseAccessor_C_BI_SetNotifyApplyHit::NotifyType' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetNotifyApplyHit, NoUse) == 0x000002, "Member 'BPI_CharaBaseAccessor_C_BI_SetNotifyApplyHit::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_InvalidIKEnd
// 0x0010 (0x0010 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_InvalidIKEnd final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoUse;                                             // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_InvalidIKEnd) == 0x000004, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_InvalidIKEnd");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_InvalidIKEnd) == 0x000010, "Wrong size on BPI_CharaBaseAccessor_C_BI_InvalidIKEnd");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_InvalidIKEnd, Param_Name) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_InvalidIKEnd::Param_Name' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_InvalidIKEnd, Param_Index) == 0x000008, "Member 'BPI_CharaBaseAccessor_C_BI_InvalidIKEnd::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_InvalidIKEnd, NoUse) == 0x00000C, "Member 'BPI_CharaBaseAccessor_C_BI_InvalidIKEnd::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_SpawnMaterialAnimDecalAttached
// 0x0058 (0x0058 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached final
{
public:
	const class UMaterialInstance*                DecalMaterial;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMaterialAnimSetting_T>         MaterialAnimSettings;                              // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                DecalSize;                                         // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OffsetLocation;                                    // 0x0024(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttachPointName;                                   // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OverrideLifeSec;                                   // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         LocationType;                                      // 0x003C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E54[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Rotation;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E55[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialAnimDecalComponent_C*          Comp;                                              // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached) == 0x000008, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached) == 0x000058, "Wrong size on BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached, DecalMaterial) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached::DecalMaterial' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached, MaterialAnimSettings) == 0x000008, "Member 'BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached::MaterialAnimSettings' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached, DecalSize) == 0x000018, "Member 'BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached::DecalSize' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached, OffsetLocation) == 0x000024, "Member 'BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached::OffsetLocation' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached, AttachPointName) == 0x000030, "Member 'BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached::AttachPointName' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached, OverrideLifeSec) == 0x000038, "Member 'BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached::OverrideLifeSec' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached, LocationType) == 0x00003C, "Member 'BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached::LocationType' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached, Rotation) == 0x000040, "Member 'BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached::Rotation' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached, Comp) == 0x000050, "Member 'BPI_CharaBaseAccessor_C_BI_SpawnMaterialAnimDecalAttached::Comp' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_GetAlreadyChangeEnableDecal
// 0x000C (0x000C - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_GetAlreadyChangeEnableDecal final
{
public:
	class FName                                   Key;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsChanged;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_GetAlreadyChangeEnableDecal) == 0x000004, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_GetAlreadyChangeEnableDecal");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_GetAlreadyChangeEnableDecal) == 0x00000C, "Wrong size on BPI_CharaBaseAccessor_C_BI_GetAlreadyChangeEnableDecal");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_GetAlreadyChangeEnableDecal, Key) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_GetAlreadyChangeEnableDecal::Key' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_GetAlreadyChangeEnableDecal, IsChanged) == 0x000008, "Member 'BPI_CharaBaseAccessor_C_BI_GetAlreadyChangeEnableDecal::IsChanged' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_SetAlreadyChangeEnableDecal
// 0x000C (0x000C - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_SetAlreadyChangeEnableDecal final
{
public:
	class FName                                   Key;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoUse;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_SetAlreadyChangeEnableDecal) == 0x000004, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_SetAlreadyChangeEnableDecal");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_SetAlreadyChangeEnableDecal) == 0x00000C, "Wrong size on BPI_CharaBaseAccessor_C_BI_SetAlreadyChangeEnableDecal");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetAlreadyChangeEnableDecal, Key) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_SetAlreadyChangeEnableDecal::Key' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetAlreadyChangeEnableDecal, NoUse) == 0x000008, "Member 'BPI_CharaBaseAccessor_C_BI_SetAlreadyChangeEnableDecal::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_GetAlreadyChangeEnableEffect
// 0x000C (0x000C - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_GetAlreadyChangeEnableEffect final
{
public:
	class FName                                   Key;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsChanged;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_GetAlreadyChangeEnableEffect) == 0x000004, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_GetAlreadyChangeEnableEffect");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_GetAlreadyChangeEnableEffect) == 0x00000C, "Wrong size on BPI_CharaBaseAccessor_C_BI_GetAlreadyChangeEnableEffect");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_GetAlreadyChangeEnableEffect, Key) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_GetAlreadyChangeEnableEffect::Key' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_GetAlreadyChangeEnableEffect, IsChanged) == 0x000008, "Member 'BPI_CharaBaseAccessor_C_BI_GetAlreadyChangeEnableEffect::IsChanged' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_SetAlreadyChangeEnableEffect
// 0x000C (0x000C - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_SetAlreadyChangeEnableEffect final
{
public:
	class FName                                   Key;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoUse;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_SetAlreadyChangeEnableEffect) == 0x000004, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_SetAlreadyChangeEnableEffect");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_SetAlreadyChangeEnableEffect) == 0x00000C, "Wrong size on BPI_CharaBaseAccessor_C_BI_SetAlreadyChangeEnableEffect");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetAlreadyChangeEnableEffect, Key) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_SetAlreadyChangeEnableEffect::Key' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetAlreadyChangeEnableEffect, NoUse) == 0x000008, "Member 'BPI_CharaBaseAccessor_C_BI_SetAlreadyChangeEnableEffect::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_PlayMotion
// 0x0018 (0x0018 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_PlayMotion final
{
public:
	E_CHARA_MOTION_ID                             MotionID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUseDuration;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E56[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Duration;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUseBlendTimeOverride;                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E57[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendTimeOverride;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartOffsetTime;                                   // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoUse;                                             // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_PlayMotion) == 0x000004, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_PlayMotion");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_PlayMotion) == 0x000018, "Wrong size on BPI_CharaBaseAccessor_C_BI_PlayMotion");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_PlayMotion, MotionID) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_PlayMotion::MotionID' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_PlayMotion, IsUseDuration) == 0x000001, "Member 'BPI_CharaBaseAccessor_C_BI_PlayMotion::IsUseDuration' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_PlayMotion, Duration) == 0x000004, "Member 'BPI_CharaBaseAccessor_C_BI_PlayMotion::Duration' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_PlayMotion, IsUseBlendTimeOverride) == 0x000008, "Member 'BPI_CharaBaseAccessor_C_BI_PlayMotion::IsUseBlendTimeOverride' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_PlayMotion, BlendTimeOverride) == 0x00000C, "Member 'BPI_CharaBaseAccessor_C_BI_PlayMotion::BlendTimeOverride' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_PlayMotion, StartOffsetTime) == 0x000010, "Member 'BPI_CharaBaseAccessor_C_BI_PlayMotion::StartOffsetTime' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_PlayMotion, NoUse) == 0x000014, "Member 'BPI_CharaBaseAccessor_C_BI_PlayMotion::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_SetNotifyDeadTiming
// 0x0002 (0x0002 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_SetNotifyDeadTiming final
{
public:
	bool                                          IsNotified;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NoUse;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_SetNotifyDeadTiming) == 0x000001, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_SetNotifyDeadTiming");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_SetNotifyDeadTiming) == 0x000002, "Wrong size on BPI_CharaBaseAccessor_C_BI_SetNotifyDeadTiming");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetNotifyDeadTiming, IsNotified) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_SetNotifyDeadTiming::IsNotified' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetNotifyDeadTiming, NoUse) == 0x000001, "Member 'BPI_CharaBaseAccessor_C_BI_SetNotifyDeadTiming::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_InstantMaterialAnimation
// 0x0030 (0x0030 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_InstantMaterialAnimation final
{
public:
	E_CHARA_MATERIAL_ANIMATION_SLOT               Slot;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E58[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 ElementNo;                                         // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FMaterialAnimSetting_T>         MaterialAnimSettings;                              // 0x0018(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          IsForward;                                         // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsOnlyFirstTime;                                   // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NoUse;                                             // 0x002A(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_InstantMaterialAnimation) == 0x000008, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_InstantMaterialAnimation");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_InstantMaterialAnimation) == 0x000030, "Wrong size on BPI_CharaBaseAccessor_C_BI_InstantMaterialAnimation");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_InstantMaterialAnimation, Slot) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_InstantMaterialAnimation::Slot' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_InstantMaterialAnimation, ElementNo) == 0x000008, "Member 'BPI_CharaBaseAccessor_C_BI_InstantMaterialAnimation::ElementNo' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_InstantMaterialAnimation, MaterialAnimSettings) == 0x000018, "Member 'BPI_CharaBaseAccessor_C_BI_InstantMaterialAnimation::MaterialAnimSettings' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_InstantMaterialAnimation, IsForward) == 0x000028, "Member 'BPI_CharaBaseAccessor_C_BI_InstantMaterialAnimation::IsForward' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_InstantMaterialAnimation, IsOnlyFirstTime) == 0x000029, "Member 'BPI_CharaBaseAccessor_C_BI_InstantMaterialAnimation::IsOnlyFirstTime' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_InstantMaterialAnimation, NoUse) == 0x00002A, "Member 'BPI_CharaBaseAccessor_C_BI_InstantMaterialAnimation::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_AttachClockingParticleSystem
// 0x0038 (0x0038 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem final
{
public:
	const class UParticleSystem*                  EmitterTemplate;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttachPointName;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Scale;                                             // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         LocationType;                                      // 0x0034(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCastShadow;                                      // 0x0035(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AutoDestroy;                                       // 0x0036(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NoUse;                                             // 0x0037(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem) == 0x000008, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem) == 0x000038, "Wrong size on BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem, EmitterTemplate) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem::EmitterTemplate' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem, AttachPointName) == 0x000008, "Member 'BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem::AttachPointName' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem, Location) == 0x000010, "Member 'BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem::Location' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem, Rotation) == 0x00001C, "Member 'BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem::Rotation' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem, Scale) == 0x000028, "Member 'BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem::Scale' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem, LocationType) == 0x000034, "Member 'BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem::LocationType' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem, IsCastShadow) == 0x000035, "Member 'BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem::IsCastShadow' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem, AutoDestroy) == 0x000036, "Member 'BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem::AutoDestroy' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem, NoUse) == 0x000037, "Member 'BPI_CharaBaseAccessor_C_BI_AttachClockingParticleSystem::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_SetNotifySkillFire
// 0x0002 (0x0002 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_SetNotifySkillFire final
{
public:
	bool                                          IsNotified;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NoUse;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_SetNotifySkillFire) == 0x000001, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_SetNotifySkillFire");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_SetNotifySkillFire) == 0x000002, "Wrong size on BPI_CharaBaseAccessor_C_BI_SetNotifySkillFire");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetNotifySkillFire, IsNotified) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_SetNotifySkillFire::IsNotified' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetNotifySkillFire, NoUse) == 0x000001, "Member 'BPI_CharaBaseAccessor_C_BI_SetNotifySkillFire::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_SetNotifyWarpTiming
// 0x0002 (0x0002 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_SetNotifyWarpTiming final
{
public:
	bool                                          IsNotified;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NoUse;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_SetNotifyWarpTiming) == 0x000001, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_SetNotifyWarpTiming");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_SetNotifyWarpTiming) == 0x000002, "Wrong size on BPI_CharaBaseAccessor_C_BI_SetNotifyWarpTiming");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetNotifyWarpTiming, IsNotified) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_SetNotifyWarpTiming::IsNotified' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetNotifyWarpTiming, NoUse) == 0x000001, "Member 'BPI_CharaBaseAccessor_C_BI_SetNotifyWarpTiming::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_PerchEnd
// 0x0001 (0x0001 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_PerchEnd final
{
public:
	bool                                          NoUse;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_PerchEnd) == 0x000001, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_PerchEnd");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_PerchEnd) == 0x000001, "Wrong size on BPI_CharaBaseAccessor_C_BI_PerchEnd");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_PerchEnd, NoUse) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_PerchEnd::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_PerchBegin
// 0x0001 (0x0001 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_PerchBegin final
{
public:
	bool                                          NoUse;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_PerchBegin) == 0x000001, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_PerchBegin");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_PerchBegin) == 0x000001, "Wrong size on BPI_CharaBaseAccessor_C_BI_PerchBegin");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_PerchBegin, NoUse) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_PerchBegin::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_WatchOnesStepEnd
// 0x0001 (0x0001 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_WatchOnesStepEnd final
{
public:
	bool                                          NoUse;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_WatchOnesStepEnd) == 0x000001, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_WatchOnesStepEnd");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_WatchOnesStepEnd) == 0x000001, "Wrong size on BPI_CharaBaseAccessor_C_BI_WatchOnesStepEnd");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_WatchOnesStepEnd, NoUse) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_WatchOnesStepEnd::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_WatchOnesStepBegin
// 0x0001 (0x0001 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_WatchOnesStepBegin final
{
public:
	bool                                          NoUse;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_WatchOnesStepBegin) == 0x000001, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_WatchOnesStepBegin");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_WatchOnesStepBegin) == 0x000001, "Wrong size on BPI_CharaBaseAccessor_C_BI_WatchOnesStepBegin");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_WatchOnesStepBegin, NoUse) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_WatchOnesStepBegin::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_InvalidIKBegin
// 0x0010 (0x0010 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_InvalidIKBegin final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoUse;                                             // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_InvalidIKBegin) == 0x000004, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_InvalidIKBegin");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_InvalidIKBegin) == 0x000010, "Wrong size on BPI_CharaBaseAccessor_C_BI_InvalidIKBegin");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_InvalidIKBegin, Param_Name) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_InvalidIKBegin::Param_Name' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_InvalidIKBegin, Param_Index) == 0x000008, "Member 'BPI_CharaBaseAccessor_C_BI_InvalidIKBegin::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_InvalidIKBegin, NoUse) == 0x00000C, "Member 'BPI_CharaBaseAccessor_C_BI_InvalidIKBegin::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_SetParticleTemplate
// 0x0018 (0x0018 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_SetParticleTemplate final
{
public:
	const class UParticleSystemComponent*         TargetParticleSys;                                 // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Template;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scale;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoUse;                                             // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_SetParticleTemplate) == 0x000008, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_SetParticleTemplate");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_SetParticleTemplate) == 0x000018, "Wrong size on BPI_CharaBaseAccessor_C_BI_SetParticleTemplate");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetParticleTemplate, TargetParticleSys) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_SetParticleTemplate::TargetParticleSys' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetParticleTemplate, Template) == 0x000008, "Member 'BPI_CharaBaseAccessor_C_BI_SetParticleTemplate::Template' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetParticleTemplate, Scale) == 0x000010, "Member 'BPI_CharaBaseAccessor_C_BI_SetParticleTemplate::Scale' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetParticleTemplate, NoUse) == 0x000014, "Member 'BPI_CharaBaseAccessor_C_BI_SetParticleTemplate::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_GetCurrentSurfaceStatusMaterial
// 0x0010 (0x0010 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_GetCurrentSurfaceStatusMaterial final
{
public:
	TArray<E_BAD_STATUS>                          CurrentSurface;                                    // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_GetCurrentSurfaceStatusMaterial) == 0x000008, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_GetCurrentSurfaceStatusMaterial");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_GetCurrentSurfaceStatusMaterial) == 0x000010, "Wrong size on BPI_CharaBaseAccessor_C_BI_GetCurrentSurfaceStatusMaterial");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_GetCurrentSurfaceStatusMaterial, CurrentSurface) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_GetCurrentSurfaceStatusMaterial::CurrentSurface' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_GetActionState
// 0x0002 (0x0002 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_GetActionState final
{
public:
	E_CHARA_ACTION_TYPE                           InAction;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Value;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_GetActionState) == 0x000001, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_GetActionState");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_GetActionState) == 0x000002, "Wrong size on BPI_CharaBaseAccessor_C_BI_GetActionState");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_GetActionState, InAction) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_GetActionState::InAction' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_GetActionState, Value) == 0x000001, "Member 'BPI_CharaBaseAccessor_C_BI_GetActionState::Value' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_EventPlayMotion
// 0x0018 (0x0018 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_EventPlayMotion final
{
public:
	class UAnimSequenceBase*                      Animation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Loop;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E59[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendTime;                                         // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartOffsetTime;                                   // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoUse;                                             // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_EventPlayMotion) == 0x000008, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_EventPlayMotion");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_EventPlayMotion) == 0x000018, "Wrong size on BPI_CharaBaseAccessor_C_BI_EventPlayMotion");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_EventPlayMotion, Animation) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_EventPlayMotion::Animation' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_EventPlayMotion, Loop) == 0x000008, "Member 'BPI_CharaBaseAccessor_C_BI_EventPlayMotion::Loop' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_EventPlayMotion, BlendTime) == 0x00000C, "Member 'BPI_CharaBaseAccessor_C_BI_EventPlayMotion::BlendTime' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_EventPlayMotion, StartOffsetTime) == 0x000010, "Member 'BPI_CharaBaseAccessor_C_BI_EventPlayMotion::StartOffsetTime' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_EventPlayMotion, NoUse) == 0x000014, "Member 'BPI_CharaBaseAccessor_C_BI_EventPlayMotion::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_SetCompletelyDead
// 0x0002 (0x0002 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_SetCompletelyDead final
{
public:
	bool                                          IsDead;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NoUse;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_SetCompletelyDead) == 0x000001, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_SetCompletelyDead");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_SetCompletelyDead) == 0x000002, "Wrong size on BPI_CharaBaseAccessor_C_BI_SetCompletelyDead");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetCompletelyDead, IsDead) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_SetCompletelyDead::IsDead' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetCompletelyDead, NoUse) == 0x000001, "Member 'BPI_CharaBaseAccessor_C_BI_SetCompletelyDead::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_SetAllVisibility
// 0x0002 (0x0002 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_SetAllVisibility final
{
public:
	bool                                          IsVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NoUse;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_SetAllVisibility) == 0x000001, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_SetAllVisibility");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_SetAllVisibility) == 0x000002, "Wrong size on BPI_CharaBaseAccessor_C_BI_SetAllVisibility");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetAllVisibility, IsVisible) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_SetAllVisibility::IsVisible' has a wrong offset!");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_SetAllVisibility, NoUse) == 0x000001, "Member 'BPI_CharaBaseAccessor_C_BI_SetAllVisibility::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_InitializeMaterial
// 0x0001 (0x0001 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_InitializeMaterial final
{
public:
	bool                                          No_Use;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_InitializeMaterial) == 0x000001, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_InitializeMaterial");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_InitializeMaterial) == 0x000001, "Wrong size on BPI_CharaBaseAccessor_C_BI_InitializeMaterial");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_InitializeMaterial, No_Use) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_InitializeMaterial::No_Use' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_CommonEffectOff
// 0x0001 (0x0001 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_CommonEffectOff final
{
public:
	bool                                          NoUse;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_CommonEffectOff) == 0x000001, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_CommonEffectOff");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_CommonEffectOff) == 0x000001, "Wrong size on BPI_CharaBaseAccessor_C_BI_CommonEffectOff");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_CommonEffectOff, NoUse) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_CommonEffectOff::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_PauseMotion
// 0x0001 (0x0001 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_PauseMotion final
{
public:
	bool                                          NoUse;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_PauseMotion) == 0x000001, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_PauseMotion");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_PauseMotion) == 0x000001, "Wrong size on BPI_CharaBaseAccessor_C_BI_PauseMotion");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_PauseMotion, NoUse) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_PauseMotion::NoUse' has a wrong offset!");

// Function BPI_CharaBaseAccessor.BPI_CharaBaseAccessor_C.BI_UpdateSurfaceBadStatus
// 0x0008 (0x0008 - 0x0000)
struct BPI_CharaBaseAccessor_C_BI_UpdateSurfaceBadStatus final
{
public:
	int32                                         CurrentStatus;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoUse;                                             // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaBaseAccessor_C_BI_UpdateSurfaceBadStatus) == 0x000004, "Wrong alignment on BPI_CharaBaseAccessor_C_BI_UpdateSurfaceBadStatus");
static_assert(sizeof(BPI_CharaBaseAccessor_C_BI_UpdateSurfaceBadStatus) == 0x000008, "Wrong size on BPI_CharaBaseAccessor_C_BI_UpdateSurfaceBadStatus");
static_assert(offsetof(BPI_CharaBaseAccessor_C_BI_UpdateSurfaceBadStatus, CurrentStatus) == 0x000000, "Member 'BPI_CharaBaseAccessor_C_BI_UpdateSurfaceBadStatus::CurrentStatus' has a wrong offset!");
