#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_ResultTopCtrl

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_ResultTopCtrl.BPI_ResultTopCtrl_C.IsEndCtrl
// 0x0001 (0x0001 - 0x0000)
struct BPI_ResultTopCtrl_C_IsEndCtrl final
{
public:
	bool                                          IsEnd;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ResultTopCtrl_C_IsEndCtrl) == 0x000001, "Wrong alignment on BPI_ResultTopCtrl_C_IsEndCtrl");
static_assert(sizeof(BPI_ResultTopCtrl_C_IsEndCtrl) == 0x000001, "Wrong size on BPI_ResultTopCtrl_C_IsEndCtrl");
static_assert(offsetof(BPI_ResultTopCtrl_C_IsEndCtrl, IsEnd) == 0x000000, "Member 'BPI_ResultTopCtrl_C_IsEndCtrl::IsEnd' has a wrong offset!");

// Function BPI_ResultTopCtrl.BPI_ResultTopCtrl_C.SetTopDataObj
// 0x0010 (0x0010 - 0x0000)
struct BPI_ResultTopCtrl_C_SetTopDataObj final
{
public:
	class UObject*                                ResultTopDataObj;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ResultTopCtrl_C_SetTopDataObj) == 0x000008, "Wrong alignment on BPI_ResultTopCtrl_C_SetTopDataObj");
static_assert(sizeof(BPI_ResultTopCtrl_C_SetTopDataObj) == 0x000010, "Wrong size on BPI_ResultTopCtrl_C_SetTopDataObj");
static_assert(offsetof(BPI_ResultTopCtrl_C_SetTopDataObj, ResultTopDataObj) == 0x000000, "Member 'BPI_ResultTopCtrl_C_SetTopDataObj::ResultTopDataObj' has a wrong offset!");
static_assert(offsetof(BPI_ResultTopCtrl_C_SetTopDataObj, Success) == 0x000008, "Member 'BPI_ResultTopCtrl_C_SetTopDataObj::Success' has a wrong offset!");

// Function BPI_ResultTopCtrl.BPI_ResultTopCtrl_C.StartCtrl
// 0x0010 (0x0010 - 0x0000)
struct BPI_ResultTopCtrl_C_StartCtrl final
{
public:
	class UObject*                                FuncDispObj;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ResultTopCtrl_C_StartCtrl) == 0x000008, "Wrong alignment on BPI_ResultTopCtrl_C_StartCtrl");
static_assert(sizeof(BPI_ResultTopCtrl_C_StartCtrl) == 0x000010, "Wrong size on BPI_ResultTopCtrl_C_StartCtrl");
static_assert(offsetof(BPI_ResultTopCtrl_C_StartCtrl, FuncDispObj) == 0x000000, "Member 'BPI_ResultTopCtrl_C_StartCtrl::FuncDispObj' has a wrong offset!");
static_assert(offsetof(BPI_ResultTopCtrl_C_StartCtrl, Success) == 0x000008, "Member 'BPI_ResultTopCtrl_C_StartCtrl::Success' has a wrong offset!");

// Function BPI_ResultTopCtrl.BPI_ResultTopCtrl_C.CloseUI
// 0x0002 (0x0002 - 0x0000)
struct BPI_ResultTopCtrl_C_CloseUI final
{
public:
	bool                                          Immediate;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Dummy;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ResultTopCtrl_C_CloseUI) == 0x000001, "Wrong alignment on BPI_ResultTopCtrl_C_CloseUI");
static_assert(sizeof(BPI_ResultTopCtrl_C_CloseUI) == 0x000002, "Wrong size on BPI_ResultTopCtrl_C_CloseUI");
static_assert(offsetof(BPI_ResultTopCtrl_C_CloseUI, Immediate) == 0x000000, "Member 'BPI_ResultTopCtrl_C_CloseUI::Immediate' has a wrong offset!");
static_assert(offsetof(BPI_ResultTopCtrl_C_CloseUI, Dummy) == 0x000001, "Member 'BPI_ResultTopCtrl_C_CloseUI::Dummy' has a wrong offset!");

// Function BPI_ResultTopCtrl.BPI_ResultTopCtrl_C.IsEndCloseUI
// 0x0001 (0x0001 - 0x0000)
struct BPI_ResultTopCtrl_C_IsEndCloseUI final
{
public:
	bool                                          IsEnd;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ResultTopCtrl_C_IsEndCloseUI) == 0x000001, "Wrong alignment on BPI_ResultTopCtrl_C_IsEndCloseUI");
static_assert(sizeof(BPI_ResultTopCtrl_C_IsEndCloseUI) == 0x000001, "Wrong size on BPI_ResultTopCtrl_C_IsEndCloseUI");
static_assert(offsetof(BPI_ResultTopCtrl_C_IsEndCloseUI, IsEnd) == 0x000000, "Member 'BPI_ResultTopCtrl_C_IsEndCloseUI::IsEnd' has a wrong offset!");

// Function BPI_ResultTopCtrl.BPI_ResultTopCtrl_C.IsInitialized
// 0x0001 (0x0001 - 0x0000)
struct BPI_ResultTopCtrl_C_IsInitialized final
{
public:
	bool                                          Comp;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ResultTopCtrl_C_IsInitialized) == 0x000001, "Wrong alignment on BPI_ResultTopCtrl_C_IsInitialized");
static_assert(sizeof(BPI_ResultTopCtrl_C_IsInitialized) == 0x000001, "Wrong size on BPI_ResultTopCtrl_C_IsInitialized");
static_assert(offsetof(BPI_ResultTopCtrl_C_IsInitialized, Comp) == 0x000000, "Member 'BPI_ResultTopCtrl_C_IsInitialized::Comp' has a wrong offset!");

// Function BPI_ResultTopCtrl.BPI_ResultTopCtrl_C.ImmediateInit
// 0x0001 (0x0001 - 0x0000)
struct BPI_ResultTopCtrl_C_ImmediateInit final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ResultTopCtrl_C_ImmediateInit) == 0x000001, "Wrong alignment on BPI_ResultTopCtrl_C_ImmediateInit");
static_assert(sizeof(BPI_ResultTopCtrl_C_ImmediateInit) == 0x000001, "Wrong size on BPI_ResultTopCtrl_C_ImmediateInit");
static_assert(offsetof(BPI_ResultTopCtrl_C_ImmediateInit, Dummy) == 0x000000, "Member 'BPI_ResultTopCtrl_C_ImmediateInit::Dummy' has a wrong offset!");

// Function BPI_ResultTopCtrl.BPI_ResultTopCtrl_C.ModelLoadReq
// 0x0001 (0x0001 - 0x0000)
struct BPI_ResultTopCtrl_C_ModelLoadReq final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ResultTopCtrl_C_ModelLoadReq) == 0x000001, "Wrong alignment on BPI_ResultTopCtrl_C_ModelLoadReq");
static_assert(sizeof(BPI_ResultTopCtrl_C_ModelLoadReq) == 0x000001, "Wrong size on BPI_ResultTopCtrl_C_ModelLoadReq");
static_assert(offsetof(BPI_ResultTopCtrl_C_ModelLoadReq, Return) == 0x000000, "Member 'BPI_ResultTopCtrl_C_ModelLoadReq::Return' has a wrong offset!");

// Function BPI_ResultTopCtrl.BPI_ResultTopCtrl_C.IsEndVIewCover
// 0x0001 (0x0001 - 0x0000)
struct BPI_ResultTopCtrl_C_IsEndVIewCover final
{
public:
	bool                                          IsEnd;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ResultTopCtrl_C_IsEndVIewCover) == 0x000001, "Wrong alignment on BPI_ResultTopCtrl_C_IsEndVIewCover");
static_assert(sizeof(BPI_ResultTopCtrl_C_IsEndVIewCover) == 0x000001, "Wrong size on BPI_ResultTopCtrl_C_IsEndVIewCover");
static_assert(offsetof(BPI_ResultTopCtrl_C_IsEndVIewCover, IsEnd) == 0x000000, "Member 'BPI_ResultTopCtrl_C_IsEndVIewCover::IsEnd' has a wrong offset!");

// Function BPI_ResultTopCtrl.BPI_ResultTopCtrl_C.StartTransitionOut
// 0x0002 (0x0002 - 0x0000)
struct BPI_ResultTopCtrl_C_StartTransitionOut final
{
public:
	bool                                          White;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Dummy;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ResultTopCtrl_C_StartTransitionOut) == 0x000001, "Wrong alignment on BPI_ResultTopCtrl_C_StartTransitionOut");
static_assert(sizeof(BPI_ResultTopCtrl_C_StartTransitionOut) == 0x000002, "Wrong size on BPI_ResultTopCtrl_C_StartTransitionOut");
static_assert(offsetof(BPI_ResultTopCtrl_C_StartTransitionOut, White) == 0x000000, "Member 'BPI_ResultTopCtrl_C_StartTransitionOut::White' has a wrong offset!");
static_assert(offsetof(BPI_ResultTopCtrl_C_StartTransitionOut, Dummy) == 0x000001, "Member 'BPI_ResultTopCtrl_C_StartTransitionOut::Dummy' has a wrong offset!");

// Function BPI_ResultTopCtrl.BPI_ResultTopCtrl_C.IsEndTransitionOut
// 0x0001 (0x0001 - 0x0000)
struct BPI_ResultTopCtrl_C_IsEndTransitionOut final
{
public:
	bool                                          IsEnd;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ResultTopCtrl_C_IsEndTransitionOut) == 0x000001, "Wrong alignment on BPI_ResultTopCtrl_C_IsEndTransitionOut");
static_assert(sizeof(BPI_ResultTopCtrl_C_IsEndTransitionOut) == 0x000001, "Wrong size on BPI_ResultTopCtrl_C_IsEndTransitionOut");
static_assert(offsetof(BPI_ResultTopCtrl_C_IsEndTransitionOut, IsEnd) == 0x000000, "Member 'BPI_ResultTopCtrl_C_IsEndTransitionOut::IsEnd' has a wrong offset!");

// Function BPI_ResultTopCtrl.BPI_ResultTopCtrl_C.ReplaceFillScreen
// 0x0001 (0x0001 - 0x0000)
struct BPI_ResultTopCtrl_C_ReplaceFillScreen final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ResultTopCtrl_C_ReplaceFillScreen) == 0x000001, "Wrong alignment on BPI_ResultTopCtrl_C_ReplaceFillScreen");
static_assert(sizeof(BPI_ResultTopCtrl_C_ReplaceFillScreen) == 0x000001, "Wrong size on BPI_ResultTopCtrl_C_ReplaceFillScreen");
static_assert(offsetof(BPI_ResultTopCtrl_C_ReplaceFillScreen, Success) == 0x000000, "Member 'BPI_ResultTopCtrl_C_ReplaceFillScreen::Success' has a wrong offset!");

// Function BPI_ResultTopCtrl.BPI_ResultTopCtrl_C.SetInitMode
// 0x0003 (0x0003 - 0x0000)
struct BPI_ResultTopCtrl_C_SetInitMode final
{
public:
	bool                                          battle;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Field;                                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Dummy;                                             // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ResultTopCtrl_C_SetInitMode) == 0x000001, "Wrong alignment on BPI_ResultTopCtrl_C_SetInitMode");
static_assert(sizeof(BPI_ResultTopCtrl_C_SetInitMode) == 0x000003, "Wrong size on BPI_ResultTopCtrl_C_SetInitMode");
static_assert(offsetof(BPI_ResultTopCtrl_C_SetInitMode, battle) == 0x000000, "Member 'BPI_ResultTopCtrl_C_SetInitMode::battle' has a wrong offset!");
static_assert(offsetof(BPI_ResultTopCtrl_C_SetInitMode, Field) == 0x000001, "Member 'BPI_ResultTopCtrl_C_SetInitMode::Field' has a wrong offset!");
static_assert(offsetof(BPI_ResultTopCtrl_C_SetInitMode, Dummy) == 0x000002, "Member 'BPI_ResultTopCtrl_C_SetInitMode::Dummy' has a wrong offset!");

}

