#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_DialogCtrl

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BPI_DialogCtrl.BPI_DialogCtrl_C.IIsOpenedDialogWindow
// 0x0001 (0x0001 - 0x0000)
struct BPI_DialogCtrl_C_IIsOpenedDialogWindow final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_DialogCtrl_C_IIsOpenedDialogWindow) == 0x000001, "Wrong alignment on BPI_DialogCtrl_C_IIsOpenedDialogWindow");
static_assert(sizeof(BPI_DialogCtrl_C_IIsOpenedDialogWindow) == 0x000001, "Wrong size on BPI_DialogCtrl_C_IIsOpenedDialogWindow");
static_assert(offsetof(BPI_DialogCtrl_C_IIsOpenedDialogWindow, OutFinished) == 0x000000, "Member 'BPI_DialogCtrl_C_IIsOpenedDialogWindow::OutFinished' has a wrong offset!");

// Function BPI_DialogCtrl.BPI_DialogCtrl_C.IDialogOn
// 0x0001 (0x0001 - 0x0000)
struct BPI_DialogCtrl_C_IDialogOn final
{
public:
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_DialogCtrl_C_IDialogOn) == 0x000001, "Wrong alignment on BPI_DialogCtrl_C_IDialogOn");
static_assert(sizeof(BPI_DialogCtrl_C_IDialogOn) == 0x000001, "Wrong size on BPI_DialogCtrl_C_IDialogOn");
static_assert(offsetof(BPI_DialogCtrl_C_IDialogOn, InPrio) == 0x000000, "Member 'BPI_DialogCtrl_C_IDialogOn::InPrio' has a wrong offset!");

// Function BPI_DialogCtrl.BPI_DialogCtrl_C.ISetDialogText
// 0x0018 (0x0018 - 0x0000)
struct BPI_DialogCtrl_C_ISetDialogText final
{
public:
	class UScriptMessageAsset*                    InScriptMessageAsset;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InLabel;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InBuildText;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_DialogCtrl_C_ISetDialogText) == 0x000008, "Wrong alignment on BPI_DialogCtrl_C_ISetDialogText");
static_assert(sizeof(BPI_DialogCtrl_C_ISetDialogText) == 0x000018, "Wrong size on BPI_DialogCtrl_C_ISetDialogText");
static_assert(offsetof(BPI_DialogCtrl_C_ISetDialogText, InScriptMessageAsset) == 0x000000, "Member 'BPI_DialogCtrl_C_ISetDialogText::InScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(BPI_DialogCtrl_C_ISetDialogText, InLabel) == 0x000008, "Member 'BPI_DialogCtrl_C_ISetDialogText::InLabel' has a wrong offset!");
static_assert(offsetof(BPI_DialogCtrl_C_ISetDialogText, InBuildText) == 0x000010, "Member 'BPI_DialogCtrl_C_ISetDialogText::InBuildText' has a wrong offset!");

// Function BPI_DialogCtrl.BPI_DialogCtrl_C.IIsSetDialogText
// 0x0001 (0x0001 - 0x0000)
struct BPI_DialogCtrl_C_IIsSetDialogText final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_DialogCtrl_C_IIsSetDialogText) == 0x000001, "Wrong alignment on BPI_DialogCtrl_C_IIsSetDialogText");
static_assert(sizeof(BPI_DialogCtrl_C_IIsSetDialogText) == 0x000001, "Wrong size on BPI_DialogCtrl_C_IIsSetDialogText");
static_assert(offsetof(BPI_DialogCtrl_C_IIsSetDialogText, OutFinished) == 0x000000, "Member 'BPI_DialogCtrl_C_IIsSetDialogText::OutFinished' has a wrong offset!");

// Function BPI_DialogCtrl.BPI_DialogCtrl_C.IIsClosedDialogWindow
// 0x0001 (0x0001 - 0x0000)
struct BPI_DialogCtrl_C_IIsClosedDialogWindow final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_DialogCtrl_C_IIsClosedDialogWindow) == 0x000001, "Wrong alignment on BPI_DialogCtrl_C_IIsClosedDialogWindow");
static_assert(sizeof(BPI_DialogCtrl_C_IIsClosedDialogWindow) == 0x000001, "Wrong size on BPI_DialogCtrl_C_IIsClosedDialogWindow");
static_assert(offsetof(BPI_DialogCtrl_C_IIsClosedDialogWindow, OutFinished) == 0x000000, "Member 'BPI_DialogCtrl_C_IIsClosedDialogWindow::OutFinished' has a wrong offset!");

// Function BPI_DialogCtrl.BPI_DialogCtrl_C.IExecutionOpenDialog
// 0x0001 (0x0001 - 0x0000)
struct BPI_DialogCtrl_C_IExecutionOpenDialog final
{
public:
	bool                                          InUseRunningIcon;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_DialogCtrl_C_IExecutionOpenDialog) == 0x000001, "Wrong alignment on BPI_DialogCtrl_C_IExecutionOpenDialog");
static_assert(sizeof(BPI_DialogCtrl_C_IExecutionOpenDialog) == 0x000001, "Wrong size on BPI_DialogCtrl_C_IExecutionOpenDialog");
static_assert(offsetof(BPI_DialogCtrl_C_IExecutionOpenDialog, InUseRunningIcon) == 0x000000, "Member 'BPI_DialogCtrl_C_IExecutionOpenDialog::InUseRunningIcon' has a wrong offset!");

// Function BPI_DialogCtrl.BPI_DialogCtrl_C.ISetDialogSelectText
// 0x0020 (0x0020 - 0x0000)
struct BPI_DialogCtrl_C_ISetDialogSelectText final
{
public:
	int32                                         InMenuNumber;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InInitCursorPosition;                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    InScriptMessageAsset;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           InSelectItemName;                                  // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BPI_DialogCtrl_C_ISetDialogSelectText) == 0x000008, "Wrong alignment on BPI_DialogCtrl_C_ISetDialogSelectText");
static_assert(sizeof(BPI_DialogCtrl_C_ISetDialogSelectText) == 0x000020, "Wrong size on BPI_DialogCtrl_C_ISetDialogSelectText");
static_assert(offsetof(BPI_DialogCtrl_C_ISetDialogSelectText, InMenuNumber) == 0x000000, "Member 'BPI_DialogCtrl_C_ISetDialogSelectText::InMenuNumber' has a wrong offset!");
static_assert(offsetof(BPI_DialogCtrl_C_ISetDialogSelectText, InInitCursorPosition) == 0x000004, "Member 'BPI_DialogCtrl_C_ISetDialogSelectText::InInitCursorPosition' has a wrong offset!");
static_assert(offsetof(BPI_DialogCtrl_C_ISetDialogSelectText, InScriptMessageAsset) == 0x000008, "Member 'BPI_DialogCtrl_C_ISetDialogSelectText::InScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(BPI_DialogCtrl_C_ISetDialogSelectText, InSelectItemName) == 0x000010, "Member 'BPI_DialogCtrl_C_ISetDialogSelectText::InSelectItemName' has a wrong offset!");

// Function BPI_DialogCtrl.BPI_DialogCtrl_C.ISetDialogSelectTextByIndex
// 0x0020 (0x0020 - 0x0000)
struct BPI_DialogCtrl_C_ISetDialogSelectTextByIndex final
{
public:
	int32                                         InMenuNumber;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InInitCursorPosition;                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    InScriptMessageAsset;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 InSelectItemIndex;                                 // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BPI_DialogCtrl_C_ISetDialogSelectTextByIndex) == 0x000008, "Wrong alignment on BPI_DialogCtrl_C_ISetDialogSelectTextByIndex");
static_assert(sizeof(BPI_DialogCtrl_C_ISetDialogSelectTextByIndex) == 0x000020, "Wrong size on BPI_DialogCtrl_C_ISetDialogSelectTextByIndex");
static_assert(offsetof(BPI_DialogCtrl_C_ISetDialogSelectTextByIndex, InMenuNumber) == 0x000000, "Member 'BPI_DialogCtrl_C_ISetDialogSelectTextByIndex::InMenuNumber' has a wrong offset!");
static_assert(offsetof(BPI_DialogCtrl_C_ISetDialogSelectTextByIndex, InInitCursorPosition) == 0x000004, "Member 'BPI_DialogCtrl_C_ISetDialogSelectTextByIndex::InInitCursorPosition' has a wrong offset!");
static_assert(offsetof(BPI_DialogCtrl_C_ISetDialogSelectTextByIndex, InScriptMessageAsset) == 0x000008, "Member 'BPI_DialogCtrl_C_ISetDialogSelectTextByIndex::InScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(BPI_DialogCtrl_C_ISetDialogSelectTextByIndex, InSelectItemIndex) == 0x000010, "Member 'BPI_DialogCtrl_C_ISetDialogSelectTextByIndex::InSelectItemIndex' has a wrong offset!");

// Function BPI_DialogCtrl.BPI_DialogCtrl_C.IMoveDialogSelectCursor
// 0x0004 (0x0004 - 0x0000)
struct BPI_DialogCtrl_C_IMoveDialogSelectCursor final
{
public:
	int32                                         InParam;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_DialogCtrl_C_IMoveDialogSelectCursor) == 0x000004, "Wrong alignment on BPI_DialogCtrl_C_IMoveDialogSelectCursor");
static_assert(sizeof(BPI_DialogCtrl_C_IMoveDialogSelectCursor) == 0x000004, "Wrong size on BPI_DialogCtrl_C_IMoveDialogSelectCursor");
static_assert(offsetof(BPI_DialogCtrl_C_IMoveDialogSelectCursor, InParam) == 0x000000, "Member 'BPI_DialogCtrl_C_IMoveDialogSelectCursor::InParam' has a wrong offset!");

// Function BPI_DialogCtrl.BPI_DialogCtrl_C.IGetDialogSelectedCursorPosition
// 0x0004 (0x0004 - 0x0000)
struct BPI_DialogCtrl_C_IGetDialogSelectedCursorPosition final
{
public:
	int32                                         OutIndex;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_DialogCtrl_C_IGetDialogSelectedCursorPosition) == 0x000004, "Wrong alignment on BPI_DialogCtrl_C_IGetDialogSelectedCursorPosition");
static_assert(sizeof(BPI_DialogCtrl_C_IGetDialogSelectedCursorPosition) == 0x000004, "Wrong size on BPI_DialogCtrl_C_IGetDialogSelectedCursorPosition");
static_assert(offsetof(BPI_DialogCtrl_C_IGetDialogSelectedCursorPosition, OutIndex) == 0x000000, "Member 'BPI_DialogCtrl_C_IGetDialogSelectedCursorPosition::OutIndex' has a wrong offset!");

// Function BPI_DialogCtrl.BPI_DialogCtrl_C.ISetDialogTextFlag
// 0x0002 (0x0002 - 0x0000)
struct BPI_DialogCtrl_C_ISetDialogTextFlag final
{
public:
	bool                                          InExecution;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InBuild;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_DialogCtrl_C_ISetDialogTextFlag) == 0x000001, "Wrong alignment on BPI_DialogCtrl_C_ISetDialogTextFlag");
static_assert(sizeof(BPI_DialogCtrl_C_ISetDialogTextFlag) == 0x000002, "Wrong size on BPI_DialogCtrl_C_ISetDialogTextFlag");
static_assert(offsetof(BPI_DialogCtrl_C_ISetDialogTextFlag, InExecution) == 0x000000, "Member 'BPI_DialogCtrl_C_ISetDialogTextFlag::InExecution' has a wrong offset!");
static_assert(offsetof(BPI_DialogCtrl_C_ISetDialogTextFlag, InBuild) == 0x000001, "Member 'BPI_DialogCtrl_C_ISetDialogTextFlag::InBuild' has a wrong offset!");

// Function BPI_DialogCtrl.BPI_DialogCtrl_C.IDialogRunningIconOn
// 0x0001 (0x0001 - 0x0000)
struct BPI_DialogCtrl_C_IDialogRunningIconOn final
{
public:
	bool                                          InExecutionFlag;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_DialogCtrl_C_IDialogRunningIconOn) == 0x000001, "Wrong alignment on BPI_DialogCtrl_C_IDialogRunningIconOn");
static_assert(sizeof(BPI_DialogCtrl_C_IDialogRunningIconOn) == 0x000001, "Wrong size on BPI_DialogCtrl_C_IDialogRunningIconOn");
static_assert(offsetof(BPI_DialogCtrl_C_IDialogRunningIconOn, InExecutionFlag) == 0x000000, "Member 'BPI_DialogCtrl_C_IDialogRunningIconOn::InExecutionFlag' has a wrong offset!");

// Function BPI_DialogCtrl.BPI_DialogCtrl_C.IDialogRunningIconOff
// 0x0001 (0x0001 - 0x0000)
struct BPI_DialogCtrl_C_IDialogRunningIconOff final
{
public:
	bool                                          InExecutionFlag;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_DialogCtrl_C_IDialogRunningIconOff) == 0x000001, "Wrong alignment on BPI_DialogCtrl_C_IDialogRunningIconOff");
static_assert(sizeof(BPI_DialogCtrl_C_IDialogRunningIconOff) == 0x000001, "Wrong size on BPI_DialogCtrl_C_IDialogRunningIconOff");
static_assert(offsetof(BPI_DialogCtrl_C_IDialogRunningIconOff, InExecutionFlag) == 0x000000, "Member 'BPI_DialogCtrl_C_IDialogRunningIconOff::InExecutionFlag' has a wrong offset!");

// Function BPI_DialogCtrl.BPI_DialogCtrl_C.IDialogSetValueParam
// 0x0008 (0x0008 - 0x0000)
struct BPI_DialogCtrl_C_IDialogSetValueParam final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InValueParam;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_DialogCtrl_C_IDialogSetValueParam) == 0x000004, "Wrong alignment on BPI_DialogCtrl_C_IDialogSetValueParam");
static_assert(sizeof(BPI_DialogCtrl_C_IDialogSetValueParam) == 0x000008, "Wrong size on BPI_DialogCtrl_C_IDialogSetValueParam");
static_assert(offsetof(BPI_DialogCtrl_C_IDialogSetValueParam, InIndex) == 0x000000, "Member 'BPI_DialogCtrl_C_IDialogSetValueParam::InIndex' has a wrong offset!");
static_assert(offsetof(BPI_DialogCtrl_C_IDialogSetValueParam, InValueParam) == 0x000004, "Member 'BPI_DialogCtrl_C_IDialogSetValueParam::InValueParam' has a wrong offset!");

// Function BPI_DialogCtrl.BPI_DialogCtrl_C.IDialogSetProgramValue
// 0x0018 (0x0018 - 0x0000)
struct BPI_DialogCtrl_C_IDialogSetProgramValue final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D48[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InString;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_DialogCtrl_C_IDialogSetProgramValue) == 0x000008, "Wrong alignment on BPI_DialogCtrl_C_IDialogSetProgramValue");
static_assert(sizeof(BPI_DialogCtrl_C_IDialogSetProgramValue) == 0x000018, "Wrong size on BPI_DialogCtrl_C_IDialogSetProgramValue");
static_assert(offsetof(BPI_DialogCtrl_C_IDialogSetProgramValue, InIndex) == 0x000000, "Member 'BPI_DialogCtrl_C_IDialogSetProgramValue::InIndex' has a wrong offset!");
static_assert(offsetof(BPI_DialogCtrl_C_IDialogSetProgramValue, InString) == 0x000008, "Member 'BPI_DialogCtrl_C_IDialogSetProgramValue::InString' has a wrong offset!");

// Function BPI_DialogCtrl.BPI_DialogCtrl_C.IWasConfirmedByMouse
// 0x0008 (0x0008 - 0x0000)
struct BPI_DialogCtrl_C_IWasConfirmedByMouse final
{
public:
	bool                                          bReset;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bConfirmed;                                        // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D49[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ItemIndex;                                         // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_DialogCtrl_C_IWasConfirmedByMouse) == 0x000004, "Wrong alignment on BPI_DialogCtrl_C_IWasConfirmedByMouse");
static_assert(sizeof(BPI_DialogCtrl_C_IWasConfirmedByMouse) == 0x000008, "Wrong size on BPI_DialogCtrl_C_IWasConfirmedByMouse");
static_assert(offsetof(BPI_DialogCtrl_C_IWasConfirmedByMouse, bReset) == 0x000000, "Member 'BPI_DialogCtrl_C_IWasConfirmedByMouse::bReset' has a wrong offset!");
static_assert(offsetof(BPI_DialogCtrl_C_IWasConfirmedByMouse, bConfirmed) == 0x000001, "Member 'BPI_DialogCtrl_C_IWasConfirmedByMouse::bConfirmed' has a wrong offset!");
static_assert(offsetof(BPI_DialogCtrl_C_IWasConfirmedByMouse, ItemIndex) == 0x000004, "Member 'BPI_DialogCtrl_C_IWasConfirmedByMouse::ItemIndex' has a wrong offset!");

}

