#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_BattleParty

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPI_BattleParty.BPI_BattleParty_C.BI_GetEnemyLeaderPartyData
// 0x0320 (0x0320 - 0x0000)
struct BPI_BattleParty_C_BI_GetEnemyLeaderPartyData final
{
public:
	struct FBtlParty                              RetValue;                                          // 0x0000(0x0320)(Parm, OutParm)
};
static_assert(alignof(BPI_BattleParty_C_BI_GetEnemyLeaderPartyData) == 0x000010, "Wrong alignment on BPI_BattleParty_C_BI_GetEnemyLeaderPartyData");
static_assert(sizeof(BPI_BattleParty_C_BI_GetEnemyLeaderPartyData) == 0x000320, "Wrong size on BPI_BattleParty_C_BI_GetEnemyLeaderPartyData");
static_assert(offsetof(BPI_BattleParty_C_BI_GetEnemyLeaderPartyData, RetValue) == 0x000000, "Member 'BPI_BattleParty_C_BI_GetEnemyLeaderPartyData::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_DestroyUnitToMap
// 0x0001 (0x0001 - 0x0000)
struct BPI_BattleParty_C_BI_DestroyUnitToMap final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleParty_C_BI_DestroyUnitToMap) == 0x000001, "Wrong alignment on BPI_BattleParty_C_BI_DestroyUnitToMap");
static_assert(sizeof(BPI_BattleParty_C_BI_DestroyUnitToMap) == 0x000001, "Wrong size on BPI_BattleParty_C_BI_DestroyUnitToMap");
static_assert(offsetof(BPI_BattleParty_C_BI_DestroyUnitToMap, RetValue) == 0x000000, "Member 'BPI_BattleParty_C_BI_DestroyUnitToMap::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_const_GetPartyStart
// 0x0004 (0x0004 - 0x0000)
struct BPI_BattleParty_C_BI_const_GetPartyStart final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_const_GetPartyStart) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_const_GetPartyStart");
static_assert(sizeof(BPI_BattleParty_C_BI_const_GetPartyStart) == 0x000004, "Wrong size on BPI_BattleParty_C_BI_const_GetPartyStart");
static_assert(offsetof(BPI_BattleParty_C_BI_const_GetPartyStart, RetValue) == 0x000000, "Member 'BPI_BattleParty_C_BI_const_GetPartyStart::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_const_GetPartyLoopMax
// 0x0004 (0x0004 - 0x0000)
struct BPI_BattleParty_C_BI_const_GetPartyLoopMax final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_const_GetPartyLoopMax) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_const_GetPartyLoopMax");
static_assert(sizeof(BPI_BattleParty_C_BI_const_GetPartyLoopMax) == 0x000004, "Wrong size on BPI_BattleParty_C_BI_const_GetPartyLoopMax");
static_assert(offsetof(BPI_BattleParty_C_BI_const_GetPartyLoopMax, RetValue) == 0x000000, "Member 'BPI_BattleParty_C_BI_const_GetPartyLoopMax::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_const_GetEnemyStart
// 0x0004 (0x0004 - 0x0000)
struct BPI_BattleParty_C_BI_const_GetEnemyStart final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_const_GetEnemyStart) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_const_GetEnemyStart");
static_assert(sizeof(BPI_BattleParty_C_BI_const_GetEnemyStart) == 0x000004, "Wrong size on BPI_BattleParty_C_BI_const_GetEnemyStart");
static_assert(offsetof(BPI_BattleParty_C_BI_const_GetEnemyStart, RetValue) == 0x000000, "Member 'BPI_BattleParty_C_BI_const_GetEnemyStart::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_const_GetEnemyNum
// 0x0004 (0x0004 - 0x0000)
struct BPI_BattleParty_C_BI_const_GetEnemyNum final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_const_GetEnemyNum) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_const_GetEnemyNum");
static_assert(sizeof(BPI_BattleParty_C_BI_const_GetEnemyNum) == 0x000004, "Wrong size on BPI_BattleParty_C_BI_const_GetEnemyNum");
static_assert(offsetof(BPI_BattleParty_C_BI_const_GetEnemyNum, RetValue) == 0x000000, "Member 'BPI_BattleParty_C_BI_const_GetEnemyNum::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_const_GetNPCStart
// 0x0004 (0x0004 - 0x0000)
struct BPI_BattleParty_C_BI_const_GetNPCStart final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_const_GetNPCStart) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_const_GetNPCStart");
static_assert(sizeof(BPI_BattleParty_C_BI_const_GetNPCStart) == 0x000004, "Wrong size on BPI_BattleParty_C_BI_const_GetNPCStart");
static_assert(offsetof(BPI_BattleParty_C_BI_const_GetNPCStart, RetValue) == 0x000000, "Member 'BPI_BattleParty_C_BI_const_GetNPCStart::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_const_GetNPCNum
// 0x0004 (0x0004 - 0x0000)
struct BPI_BattleParty_C_BI_const_GetNPCNum final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_const_GetNPCNum) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_const_GetNPCNum");
static_assert(sizeof(BPI_BattleParty_C_BI_const_GetNPCNum) == 0x000004, "Wrong size on BPI_BattleParty_C_BI_const_GetNPCNum");
static_assert(offsetof(BPI_BattleParty_C_BI_const_GetNPCNum, RetValue) == 0x000000, "Member 'BPI_BattleParty_C_BI_const_GetNPCNum::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_const_GetPlayerLoopMax
// 0x0004 (0x0004 - 0x0000)
struct BPI_BattleParty_C_BI_const_GetPlayerLoopMax final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_const_GetPlayerLoopMax) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_const_GetPlayerLoopMax");
static_assert(sizeof(BPI_BattleParty_C_BI_const_GetPlayerLoopMax) == 0x000004, "Wrong size on BPI_BattleParty_C_BI_const_GetPlayerLoopMax");
static_assert(offsetof(BPI_BattleParty_C_BI_const_GetPlayerLoopMax, RetValue) == 0x000000, "Member 'BPI_BattleParty_C_BI_const_GetPlayerLoopMax::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_const_GetStockStart
// 0x0004 (0x0004 - 0x0000)
struct BPI_BattleParty_C_BI_const_GetStockStart final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_const_GetStockStart) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_const_GetStockStart");
static_assert(sizeof(BPI_BattleParty_C_BI_const_GetStockStart) == 0x000004, "Wrong size on BPI_BattleParty_C_BI_const_GetStockStart");
static_assert(offsetof(BPI_BattleParty_C_BI_const_GetStockStart, RetValue) == 0x000000, "Member 'BPI_BattleParty_C_BI_const_GetStockStart::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_const_GetStockLoopMax
// 0x0004 (0x0004 - 0x0000)
struct BPI_BattleParty_C_BI_const_GetStockLoopMax final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_const_GetStockLoopMax) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_const_GetStockLoopMax");
static_assert(sizeof(BPI_BattleParty_C_BI_const_GetStockLoopMax) == 0x000004, "Wrong size on BPI_BattleParty_C_BI_const_GetStockLoopMax");
static_assert(offsetof(BPI_BattleParty_C_BI_const_GetStockLoopMax, RetValue) == 0x000000, "Member 'BPI_BattleParty_C_BI_const_GetStockLoopMax::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_const_GetOnBattleNumMax
// 0x0004 (0x0004 - 0x0000)
struct BPI_BattleParty_C_BI_const_GetOnBattleNumMax final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_const_GetOnBattleNumMax) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_const_GetOnBattleNumMax");
static_assert(sizeof(BPI_BattleParty_C_BI_const_GetOnBattleNumMax) == 0x000004, "Wrong size on BPI_BattleParty_C_BI_const_GetOnBattleNumMax");
static_assert(offsetof(BPI_BattleParty_C_BI_const_GetOnBattleNumMax, RetValue) == 0x000000, "Member 'BPI_BattleParty_C_BI_const_GetOnBattleNumMax::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_const_GetPartnerStart
// 0x0004 (0x0004 - 0x0000)
struct BPI_BattleParty_C_BI_const_GetPartnerStart final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_const_GetPartnerStart) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_const_GetPartnerStart");
static_assert(sizeof(BPI_BattleParty_C_BI_const_GetPartnerStart) == 0x000004, "Wrong size on BPI_BattleParty_C_BI_const_GetPartnerStart");
static_assert(offsetof(BPI_BattleParty_C_BI_const_GetPartnerStart, RetValue) == 0x000000, "Member 'BPI_BattleParty_C_BI_const_GetPartnerStart::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_const_GetPartnerNum
// 0x0004 (0x0004 - 0x0000)
struct BPI_BattleParty_C_BI_const_GetPartnerNum final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_const_GetPartnerNum) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_const_GetPartnerNum");
static_assert(sizeof(BPI_BattleParty_C_BI_const_GetPartnerNum) == 0x000004, "Wrong size on BPI_BattleParty_C_BI_const_GetPartnerNum");
static_assert(offsetof(BPI_BattleParty_C_BI_const_GetPartnerNum, RetValue) == 0x000000, "Member 'BPI_BattleParty_C_BI_const_GetPartnerNum::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_const_GetPartnerLoopMax
// 0x0004 (0x0004 - 0x0000)
struct BPI_BattleParty_C_BI_const_GetPartnerLoopMax final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_const_GetPartnerLoopMax) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_const_GetPartnerLoopMax");
static_assert(sizeof(BPI_BattleParty_C_BI_const_GetPartnerLoopMax) == 0x000004, "Wrong size on BPI_BattleParty_C_BI_const_GetPartnerLoopMax");
static_assert(offsetof(BPI_BattleParty_C_BI_const_GetPartnerLoopMax, RetValue) == 0x000000, "Member 'BPI_BattleParty_C_BI_const_GetPartnerLoopMax::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_AddFlag
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleParty_C_BI_AddFlag final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_PARTY_STAT                              InFlag;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleParty_C_BI_AddFlag) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_AddFlag");
static_assert(sizeof(BPI_BattleParty_C_BI_AddFlag) == 0x000008, "Wrong size on BPI_BattleParty_C_BI_AddFlag");
static_assert(offsetof(BPI_BattleParty_C_BI_AddFlag, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_AddFlag::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_AddFlag, InFlag) == 0x000004, "Member 'BPI_BattleParty_C_BI_AddFlag::InFlag' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_AddFlag, RetValue) == 0x000005, "Member 'BPI_BattleParty_C_BI_AddFlag::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_DelFlag
// 0x000C (0x000C - 0x0000)
struct BPI_BattleParty_C_BI_DelFlag final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_PARTY_STAT                              Flag;                                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2974[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NoUse;                                             // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_DelFlag) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_DelFlag");
static_assert(sizeof(BPI_BattleParty_C_BI_DelFlag) == 0x00000C, "Wrong size on BPI_BattleParty_C_BI_DelFlag");
static_assert(offsetof(BPI_BattleParty_C_BI_DelFlag, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_DelFlag::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_DelFlag, Flag) == 0x000004, "Member 'BPI_BattleParty_C_BI_DelFlag::Flag' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_DelFlag, NoUse) == 0x000008, "Member 'BPI_BattleParty_C_BI_DelFlag::NoUse' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_CheckFlag
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleParty_C_BI_CheckFlag final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_PARTY_STAT                              Flag;                                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleParty_C_BI_CheckFlag) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_CheckFlag");
static_assert(sizeof(BPI_BattleParty_C_BI_CheckFlag) == 0x000008, "Wrong size on BPI_BattleParty_C_BI_CheckFlag");
static_assert(offsetof(BPI_BattleParty_C_BI_CheckFlag, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_CheckFlag::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_CheckFlag, Flag) == 0x000004, "Member 'BPI_BattleParty_C_BI_CheckFlag::Flag' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_CheckFlag, RetValue) == 0x000005, "Member 'BPI_BattleParty_C_BI_CheckFlag::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_AddFlag2
// 0x000C (0x000C - 0x0000)
struct BPI_BattleParty_C_BI_AddFlag2 final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_PARTY_STAT2                             Flag;                                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2975[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Ret;                                               // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_AddFlag2) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_AddFlag2");
static_assert(sizeof(BPI_BattleParty_C_BI_AddFlag2) == 0x00000C, "Wrong size on BPI_BattleParty_C_BI_AddFlag2");
static_assert(offsetof(BPI_BattleParty_C_BI_AddFlag2, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_AddFlag2::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_AddFlag2, Flag) == 0x000004, "Member 'BPI_BattleParty_C_BI_AddFlag2::Flag' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_AddFlag2, Ret) == 0x000008, "Member 'BPI_BattleParty_C_BI_AddFlag2::Ret' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_DelFlag2
// 0x000C (0x000C - 0x0000)
struct BPI_BattleParty_C_BI_DelFlag2 final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_PARTY_STAT2                             Flag;                                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2976[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Ret;                                               // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_DelFlag2) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_DelFlag2");
static_assert(sizeof(BPI_BattleParty_C_BI_DelFlag2) == 0x00000C, "Wrong size on BPI_BattleParty_C_BI_DelFlag2");
static_assert(offsetof(BPI_BattleParty_C_BI_DelFlag2, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_DelFlag2::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_DelFlag2, Flag) == 0x000004, "Member 'BPI_BattleParty_C_BI_DelFlag2::Flag' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_DelFlag2, Ret) == 0x000008, "Member 'BPI_BattleParty_C_BI_DelFlag2::Ret' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_CheckFlag2
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleParty_C_BI_CheckFlag2 final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_PARTY_STAT2                             Flag;                                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleParty_C_BI_CheckFlag2) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_CheckFlag2");
static_assert(sizeof(BPI_BattleParty_C_BI_CheckFlag2) == 0x000008, "Wrong size on BPI_BattleParty_C_BI_CheckFlag2");
static_assert(offsetof(BPI_BattleParty_C_BI_CheckFlag2, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_CheckFlag2::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_CheckFlag2, Flag) == 0x000004, "Member 'BPI_BattleParty_C_BI_CheckFlag2::Flag' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_CheckFlag2, RetValue) == 0x000005, "Member 'BPI_BattleParty_C_BI_CheckFlag2::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_SetBadStatusOne
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleParty_C_BI_SetBadStatusOne final
{
public:
	int32                                         PartyIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BAD_STATUS                                  InBst;                                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Sw;                                                // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RetValue;                                          // 0x0006(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleParty_C_BI_SetBadStatusOne) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_SetBadStatusOne");
static_assert(sizeof(BPI_BattleParty_C_BI_SetBadStatusOne) == 0x000008, "Wrong size on BPI_BattleParty_C_BI_SetBadStatusOne");
static_assert(offsetof(BPI_BattleParty_C_BI_SetBadStatusOne, PartyIndex) == 0x000000, "Member 'BPI_BattleParty_C_BI_SetBadStatusOne::PartyIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_SetBadStatusOne, InBst) == 0x000004, "Member 'BPI_BattleParty_C_BI_SetBadStatusOne::InBst' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_SetBadStatusOne, Sw) == 0x000005, "Member 'BPI_BattleParty_C_BI_SetBadStatusOne::Sw' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_SetBadStatusOne, RetValue) == 0x000006, "Member 'BPI_BattleParty_C_BI_SetBadStatusOne::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_GetPartyUnit
// 0x0018 (0x0018 - 0x0000)
struct BPI_BattleParty_C_BI_GetPartyUnit final
{
public:
	int32                                         PartyIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2977[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> RetValue;                                          // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleParty_C_BI_GetPartyUnit) == 0x000008, "Wrong alignment on BPI_BattleParty_C_BI_GetPartyUnit");
static_assert(sizeof(BPI_BattleParty_C_BI_GetPartyUnit) == 0x000018, "Wrong size on BPI_BattleParty_C_BI_GetPartyUnit");
static_assert(offsetof(BPI_BattleParty_C_BI_GetPartyUnit, PartyIndex) == 0x000000, "Member 'BPI_BattleParty_C_BI_GetPartyUnit::PartyIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_GetPartyUnit, RetValue) == 0x000008, "Member 'BPI_BattleParty_C_BI_GetPartyUnit::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_GetCharaID
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleParty_C_BI_GetCharaID final
{
public:
	int32                                         PartyIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetValue;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_GetCharaID) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_GetCharaID");
static_assert(sizeof(BPI_BattleParty_C_BI_GetCharaID) == 0x000008, "Wrong size on BPI_BattleParty_C_BI_GetCharaID");
static_assert(offsetof(BPI_BattleParty_C_BI_GetCharaID, PartyIndex) == 0x000000, "Member 'BPI_BattleParty_C_BI_GetCharaID::PartyIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_GetCharaID, RetValue) == 0x000004, "Member 'BPI_BattleParty_C_BI_GetCharaID::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_GetCharaData
// 0x0150 (0x0150 - 0x0000)
struct BPI_BattleParty_C_BI_GetCharaData final
{
public:
	int32                                         PartyIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2978[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlCharData                           RetValue;                                          // 0x0008(0x0148)(Parm, OutParm)
};
static_assert(alignof(BPI_BattleParty_C_BI_GetCharaData) == 0x000008, "Wrong alignment on BPI_BattleParty_C_BI_GetCharaData");
static_assert(sizeof(BPI_BattleParty_C_BI_GetCharaData) == 0x000150, "Wrong size on BPI_BattleParty_C_BI_GetCharaData");
static_assert(offsetof(BPI_BattleParty_C_BI_GetCharaData, PartyIndex) == 0x000000, "Member 'BPI_BattleParty_C_BI_GetCharaData::PartyIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_GetCharaData, RetValue) == 0x000008, "Member 'BPI_BattleParty_C_BI_GetCharaData::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_GetPartyData
// 0x0330 (0x0330 - 0x0000)
struct BPI_BattleParty_C_BI_GetPartyData final
{
public:
	int32                                         PartyIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2979[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlParty                              RetValue;                                          // 0x0010(0x0320)(Parm, OutParm)
};
static_assert(alignof(BPI_BattleParty_C_BI_GetPartyData) == 0x000010, "Wrong alignment on BPI_BattleParty_C_BI_GetPartyData");
static_assert(sizeof(BPI_BattleParty_C_BI_GetPartyData) == 0x000330, "Wrong size on BPI_BattleParty_C_BI_GetPartyData");
static_assert(offsetof(BPI_BattleParty_C_BI_GetPartyData, PartyIndex) == 0x000000, "Member 'BPI_BattleParty_C_BI_GetPartyData::PartyIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_GetPartyData, RetValue) == 0x000010, "Member 'BPI_BattleParty_C_BI_GetPartyData::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_CheckBadStatus
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleParty_C_BI_CheckBadStatus final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BAD_STATUS                                  bst;                                               // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleParty_C_BI_CheckBadStatus) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_CheckBadStatus");
static_assert(sizeof(BPI_BattleParty_C_BI_CheckBadStatus) == 0x000008, "Wrong size on BPI_BattleParty_C_BI_CheckBadStatus");
static_assert(offsetof(BPI_BattleParty_C_BI_CheckBadStatus, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_CheckBadStatus::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_CheckBadStatus, bst) == 0x000004, "Member 'BPI_BattleParty_C_BI_CheckBadStatus::bst' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_CheckBadStatus, RetValue) == 0x000005, "Member 'BPI_BattleParty_C_BI_CheckBadStatus::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_IsUseableItem
// 0x000C (0x000C - 0x0000)
struct BPI_BattleParty_C_BI_IsUseableItem final
{
public:
	int32                                         PartyIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemId;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleParty_C_BI_IsUseableItem) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_IsUseableItem");
static_assert(sizeof(BPI_BattleParty_C_BI_IsUseableItem) == 0x00000C, "Wrong size on BPI_BattleParty_C_BI_IsUseableItem");
static_assert(offsetof(BPI_BattleParty_C_BI_IsUseableItem, PartyIndex) == 0x000000, "Member 'BPI_BattleParty_C_BI_IsUseableItem::PartyIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_IsUseableItem, ItemId) == 0x000004, "Member 'BPI_BattleParty_C_BI_IsUseableItem::ItemId' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_IsUseableItem, RetValue) == 0x000008, "Member 'BPI_BattleParty_C_BI_IsUseableItem::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_IsInField
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleParty_C_BI_IsInField final
{
public:
	int32                                         PartyIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleParty_C_BI_IsInField) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_IsInField");
static_assert(sizeof(BPI_BattleParty_C_BI_IsInField) == 0x000008, "Wrong size on BPI_BattleParty_C_BI_IsInField");
static_assert(offsetof(BPI_BattleParty_C_BI_IsInField, PartyIndex) == 0x000000, "Member 'BPI_BattleParty_C_BI_IsInField::PartyIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_IsInField, RetValue) == 0x000004, "Member 'BPI_BattleParty_C_BI_IsInField::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_const_GetEnemyLoopMax
// 0x0004 (0x0004 - 0x0000)
struct BPI_BattleParty_C_BI_const_GetEnemyLoopMax final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_const_GetEnemyLoopMax) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_const_GetEnemyLoopMax");
static_assert(sizeof(BPI_BattleParty_C_BI_const_GetEnemyLoopMax) == 0x000004, "Wrong size on BPI_BattleParty_C_BI_const_GetEnemyLoopMax");
static_assert(offsetof(BPI_BattleParty_C_BI_const_GetEnemyLoopMax, RetValue) == 0x000000, "Member 'BPI_BattleParty_C_BI_const_GetEnemyLoopMax::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_DelBadStatusTurnCounter
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleParty_C_BI_DelBadStatusTurnCounter final
{
public:
	int32                                         PartyIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleParty_C_BI_DelBadStatusTurnCounter) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_DelBadStatusTurnCounter");
static_assert(sizeof(BPI_BattleParty_C_BI_DelBadStatusTurnCounter) == 0x000008, "Wrong size on BPI_BattleParty_C_BI_DelBadStatusTurnCounter");
static_assert(offsetof(BPI_BattleParty_C_BI_DelBadStatusTurnCounter, PartyIndex) == 0x000000, "Member 'BPI_BattleParty_C_BI_DelBadStatusTurnCounter::PartyIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_DelBadStatusTurnCounter, RetValue) == 0x000004, "Member 'BPI_BattleParty_C_BI_DelBadStatusTurnCounter::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_AddHPMP
// 0x000C (0x000C - 0x0000)
struct BPI_BattleParty_C_BI_AddHPMP final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InValue;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHP;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RetValue;                                          // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleParty_C_BI_AddHPMP) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_AddHPMP");
static_assert(sizeof(BPI_BattleParty_C_BI_AddHPMP) == 0x00000C, "Wrong size on BPI_BattleParty_C_BI_AddHPMP");
static_assert(offsetof(BPI_BattleParty_C_BI_AddHPMP, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_AddHPMP::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_AddHPMP, InValue) == 0x000004, "Member 'BPI_BattleParty_C_BI_AddHPMP::InValue' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_AddHPMP, IsHP) == 0x000008, "Member 'BPI_BattleParty_C_BI_AddHPMP::IsHP' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_AddHPMP, RetValue) == 0x000009, "Member 'BPI_BattleParty_C_BI_AddHPMP::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_SetDeadParam
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleParty_C_BI_SetDeadParam final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleParty_C_BI_SetDeadParam) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_SetDeadParam");
static_assert(sizeof(BPI_BattleParty_C_BI_SetDeadParam) == 0x000008, "Wrong size on BPI_BattleParty_C_BI_SetDeadParam");
static_assert(offsetof(BPI_BattleParty_C_BI_SetDeadParam, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_SetDeadParam::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_SetDeadParam, RetValue) == 0x000004, "Member 'BPI_BattleParty_C_BI_SetDeadParam::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_GetAuraState
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleParty_C_BI_GetAuraState final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CHARA_AURA_TYPE                             RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_GetAuraState) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_GetAuraState");
static_assert(sizeof(BPI_BattleParty_C_BI_GetAuraState) == 0x000008, "Wrong size on BPI_BattleParty_C_BI_GetAuraState");
static_assert(offsetof(BPI_BattleParty_C_BI_GetAuraState, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_GetAuraState::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_GetAuraState, RetValue) == 0x000004, "Member 'BPI_BattleParty_C_BI_GetAuraState::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_IsNKM
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleParty_C_BI_IsNKM final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleParty_C_BI_IsNKM) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_IsNKM");
static_assert(sizeof(BPI_BattleParty_C_BI_IsNKM) == 0x000008, "Wrong size on BPI_BattleParty_C_BI_IsNKM");
static_assert(offsetof(BPI_BattleParty_C_BI_IsNKM, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_IsNKM::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_IsNKM, RetValue) == 0x000004, "Member 'BPI_BattleParty_C_BI_IsNKM::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_SetNkmStockIn
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleParty_C_BI_SetNkmStockIn final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetValue;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_SetNkmStockIn) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_SetNkmStockIn");
static_assert(sizeof(BPI_BattleParty_C_BI_SetNkmStockIn) == 0x000008, "Wrong size on BPI_BattleParty_C_BI_SetNkmStockIn");
static_assert(offsetof(BPI_BattleParty_C_BI_SetNkmStockIn, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_SetNkmStockIn::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_SetNkmStockIn, RetValue) == 0x000004, "Member 'BPI_BattleParty_C_BI_SetNkmStockIn::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_GetBadStatus
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleParty_C_BI_GetBadStatus final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetValue;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_GetBadStatus) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_GetBadStatus");
static_assert(sizeof(BPI_BattleParty_C_BI_GetBadStatus) == 0x000008, "Wrong size on BPI_BattleParty_C_BI_GetBadStatus");
static_assert(offsetof(BPI_BattleParty_C_BI_GetBadStatus, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_GetBadStatus::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_GetBadStatus, RetValue) == 0x000004, "Member 'BPI_BattleParty_C_BI_GetBadStatus::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_GetUnitStateMotion
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleParty_C_BI_GetUnitStateMotion final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CHARA_MOTION_ID                             RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_GetUnitStateMotion) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_GetUnitStateMotion");
static_assert(sizeof(BPI_BattleParty_C_BI_GetUnitStateMotion) == 0x000008, "Wrong size on BPI_BattleParty_C_BI_GetUnitStateMotion");
static_assert(offsetof(BPI_BattleParty_C_BI_GetUnitStateMotion, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_GetUnitStateMotion::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_GetUnitStateMotion, RetValue) == 0x000004, "Member 'BPI_BattleParty_C_BI_GetUnitStateMotion::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_GetName
// 0x0020 (0x0020 - 0x0000)
struct BPI_BattleParty_C_BI_GetName final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_297A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   RetValue;                                          // 0x0008(0x0018)(Parm, OutParm)
};
static_assert(alignof(BPI_BattleParty_C_BI_GetName) == 0x000008, "Wrong alignment on BPI_BattleParty_C_BI_GetName");
static_assert(sizeof(BPI_BattleParty_C_BI_GetName) == 0x000020, "Wrong size on BPI_BattleParty_C_BI_GetName");
static_assert(offsetof(BPI_BattleParty_C_BI_GetName, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_GetName::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_GetName, RetValue) == 0x000008, "Member 'BPI_BattleParty_C_BI_GetName::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_SetHPMP
// 0x000C (0x000C - 0x0000)
struct BPI_BattleParty_C_BI_SetHPMP final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InValue;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHP;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RetValue;                                          // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleParty_C_BI_SetHPMP) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_SetHPMP");
static_assert(sizeof(BPI_BattleParty_C_BI_SetHPMP) == 0x00000C, "Wrong size on BPI_BattleParty_C_BI_SetHPMP");
static_assert(offsetof(BPI_BattleParty_C_BI_SetHPMP, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_SetHPMP::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_SetHPMP, InValue) == 0x000004, "Member 'BPI_BattleParty_C_BI_SetHPMP::InValue' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_SetHPMP, IsHP) == 0x000008, "Member 'BPI_BattleParty_C_BI_SetHPMP::IsHP' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_SetHPMP, RetValue) == 0x000009, "Member 'BPI_BattleParty_C_BI_SetHPMP::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_DestroyUnit
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleParty_C_BI_DestroyUnit final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDestroyActor;                                    // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RetValue;                                          // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleParty_C_BI_DestroyUnit) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_DestroyUnit");
static_assert(sizeof(BPI_BattleParty_C_BI_DestroyUnit) == 0x000008, "Wrong size on BPI_BattleParty_C_BI_DestroyUnit");
static_assert(offsetof(BPI_BattleParty_C_BI_DestroyUnit, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_DestroyUnit::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_DestroyUnit, IsDestroyActor) == 0x000004, "Member 'BPI_BattleParty_C_BI_DestroyUnit::IsDestroyActor' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_DestroyUnit, RetValue) == 0x000005, "Member 'BPI_BattleParty_C_BI_DestroyUnit::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_SetNewPartyIn
// 0x0010 (0x0010 - 0x0000)
struct BPI_BattleParty_C_BI_SetNewPartyIn final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetValue;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DevilID;                                           // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewEntryIndex;                                     // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleParty_C_BI_SetNewPartyIn) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_SetNewPartyIn");
static_assert(sizeof(BPI_BattleParty_C_BI_SetNewPartyIn) == 0x000010, "Wrong size on BPI_BattleParty_C_BI_SetNewPartyIn");
static_assert(offsetof(BPI_BattleParty_C_BI_SetNewPartyIn, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_SetNewPartyIn::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_SetNewPartyIn, RetValue) == 0x000004, "Member 'BPI_BattleParty_C_BI_SetNewPartyIn::RetValue' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_SetNewPartyIn, DevilID) == 0x000008, "Member 'BPI_BattleParty_C_BI_SetNewPartyIn::DevilID' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_SetNewPartyIn, NewEntryIndex) == 0x00000C, "Member 'BPI_BattleParty_C_BI_SetNewPartyIn::NewEntryIndex' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_SetPartyUnit
// 0x0020 (0x0020 - 0x0000)
struct BPI_BattleParty_C_BI_SetPartyUnit final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_297B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> InUnit;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         DevilID;                                           // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_CHAR_TYPE                               Type;                                              // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsReader;                                          // 0x001D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RetValue;                                          // 0x001E(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleParty_C_BI_SetPartyUnit) == 0x000008, "Wrong alignment on BPI_BattleParty_C_BI_SetPartyUnit");
static_assert(sizeof(BPI_BattleParty_C_BI_SetPartyUnit) == 0x000020, "Wrong size on BPI_BattleParty_C_BI_SetPartyUnit");
static_assert(offsetof(BPI_BattleParty_C_BI_SetPartyUnit, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_SetPartyUnit::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_SetPartyUnit, InUnit) == 0x000008, "Member 'BPI_BattleParty_C_BI_SetPartyUnit::InUnit' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_SetPartyUnit, DevilID) == 0x000018, "Member 'BPI_BattleParty_C_BI_SetPartyUnit::DevilID' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_SetPartyUnit, Type) == 0x00001C, "Member 'BPI_BattleParty_C_BI_SetPartyUnit::Type' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_SetPartyUnit, IsReader) == 0x00001D, "Member 'BPI_BattleParty_C_BI_SetPartyUnit::IsReader' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_SetPartyUnit, RetValue) == 0x00001E, "Member 'BPI_BattleParty_C_BI_SetPartyUnit::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_SetPartyHomeTransform
// 0x0050 (0x0050 - 0x0000)
struct BPI_BattleParty_C_BI_SetPartyHomeTransform final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_297C[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Data;                                              // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	bool                                          RetValue;                                          // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleParty_C_BI_SetPartyHomeTransform) == 0x000010, "Wrong alignment on BPI_BattleParty_C_BI_SetPartyHomeTransform");
static_assert(sizeof(BPI_BattleParty_C_BI_SetPartyHomeTransform) == 0x000050, "Wrong size on BPI_BattleParty_C_BI_SetPartyHomeTransform");
static_assert(offsetof(BPI_BattleParty_C_BI_SetPartyHomeTransform, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_SetPartyHomeTransform::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_SetPartyHomeTransform, Data) == 0x000010, "Member 'BPI_BattleParty_C_BI_SetPartyHomeTransform::Data' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_SetPartyHomeTransform, RetValue) == 0x000040, "Member 'BPI_BattleParty_C_BI_SetPartyHomeTransform::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_UnitSetVisibility
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleParty_C_BI_UnitSetVisibility final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Sw;                                                // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ParticleInterlock;                                 // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DeactivateParticle;                                // 0x0006(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RetValue;                                          // 0x0007(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleParty_C_BI_UnitSetVisibility) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_UnitSetVisibility");
static_assert(sizeof(BPI_BattleParty_C_BI_UnitSetVisibility) == 0x000008, "Wrong size on BPI_BattleParty_C_BI_UnitSetVisibility");
static_assert(offsetof(BPI_BattleParty_C_BI_UnitSetVisibility, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_UnitSetVisibility::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_UnitSetVisibility, Sw) == 0x000004, "Member 'BPI_BattleParty_C_BI_UnitSetVisibility::Sw' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_UnitSetVisibility, ParticleInterlock) == 0x000005, "Member 'BPI_BattleParty_C_BI_UnitSetVisibility::ParticleInterlock' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_UnitSetVisibility, DeactivateParticle) == 0x000006, "Member 'BPI_BattleParty_C_BI_UnitSetVisibility::DeactivateParticle' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_UnitSetVisibility, RetValue) == 0x000007, "Member 'BPI_BattleParty_C_BI_UnitSetVisibility::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_UnitSetVisibilityAll
// 0x0002 (0x0002 - 0x0000)
struct BPI_BattleParty_C_BI_UnitSetVisibilityAll final
{
public:
	bool                                          Sw;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleParty_C_BI_UnitSetVisibilityAll) == 0x000001, "Wrong alignment on BPI_BattleParty_C_BI_UnitSetVisibilityAll");
static_assert(sizeof(BPI_BattleParty_C_BI_UnitSetVisibilityAll) == 0x000002, "Wrong size on BPI_BattleParty_C_BI_UnitSetVisibilityAll");
static_assert(offsetof(BPI_BattleParty_C_BI_UnitSetVisibilityAll, Sw) == 0x000000, "Member 'BPI_BattleParty_C_BI_UnitSetVisibilityAll::Sw' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_UnitSetVisibilityAll, RetValue) == 0x000001, "Member 'BPI_BattleParty_C_BI_UnitSetVisibilityAll::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_IsDead
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleParty_C_BI_IsDead final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleParty_C_BI_IsDead) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_IsDead");
static_assert(sizeof(BPI_BattleParty_C_BI_IsDead) == 0x000008, "Wrong size on BPI_BattleParty_C_BI_IsDead");
static_assert(offsetof(BPI_BattleParty_C_BI_IsDead, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_IsDead::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_IsDead, RetValue) == 0x000004, "Member 'BPI_BattleParty_C_BI_IsDead::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_IsHero
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleParty_C_BI_IsHero final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleParty_C_BI_IsHero) == 0x000004, "Wrong alignment on BPI_BattleParty_C_BI_IsHero");
static_assert(sizeof(BPI_BattleParty_C_BI_IsHero) == 0x000008, "Wrong size on BPI_BattleParty_C_BI_IsHero");
static_assert(offsetof(BPI_BattleParty_C_BI_IsHero, Param_Index) == 0x000000, "Member 'BPI_BattleParty_C_BI_IsHero::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleParty_C_BI_IsHero, RetValue) == 0x000004, "Member 'BPI_BattleParty_C_BI_IsHero::RetValue' has a wrong offset!");

// Function BPI_BattleParty.BPI_BattleParty_C.BI_IsExist
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleParty_C_BI_IsExist final
{
public:
