#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_LoadBossRushField

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPI_LoadBossRushField.BPI_LoadBossRushField_C.BPI_ReadyBossRushField
// 0x0004 (0x0004 - 0x0000)
struct BPI_LoadBossRushField_C_BPI_ReadyBossRushField final
{
public:
	int32                                         BattleFIeldID;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_LoadBossRushField_C_BPI_ReadyBossRushField) == 0x000004, "Wrong alignment on BPI_LoadBossRushField_C_BPI_ReadyBossRushField");
static_assert(sizeof(BPI_LoadBossRushField_C_BPI_ReadyBossRushField) == 0x000004, "Wrong size on BPI_LoadBossRushField_C_BPI_ReadyBossRushField");
static_assert(offsetof(BPI_LoadBossRushField_C_BPI_ReadyBossRushField, BattleFIeldID) == 0x000000, "Member 'BPI_LoadBossRushField_C_BPI_ReadyBossRushField::BattleFIeldID' has a wrong offset!");

// Function BPI_LoadBossRushField.BPI_LoadBossRushField_C.BPI_FinishBossRushFieldAll
// 0x0002 (0x0002 - 0x0000)
struct BPI_LoadBossRushField_C_BPI_FinishBossRushFieldAll final
{
public:
	bool                                          UnloadBossRushLevel;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShowBattleHideLevel;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_LoadBossRushField_C_BPI_FinishBossRushFieldAll) == 0x000001, "Wrong alignment on BPI_LoadBossRushField_C_BPI_FinishBossRushFieldAll");
static_assert(sizeof(BPI_LoadBossRushField_C_BPI_FinishBossRushFieldAll) == 0x000002, "Wrong size on BPI_LoadBossRushField_C_BPI_FinishBossRushFieldAll");
static_assert(offsetof(BPI_LoadBossRushField_C_BPI_FinishBossRushFieldAll, UnloadBossRushLevel) == 0x000000, "Member 'BPI_LoadBossRushField_C_BPI_FinishBossRushFieldAll::UnloadBossRushLevel' has a wrong offset!");
static_assert(offsetof(BPI_LoadBossRushField_C_BPI_FinishBossRushFieldAll, ShowBattleHideLevel) == 0x000001, "Member 'BPI_LoadBossRushField_C_BPI_FinishBossRushFieldAll::ShowBattleHideLevel' has a wrong offset!");

// Function BPI_LoadBossRushField.BPI_LoadBossRushField_C.BPI_Completed_ReadyBossRushField
// 0x0001 (0x0001 - 0x0000)
struct BPI_LoadBossRushField_C_BPI_Completed_ReadyBossRushField final
{
public:
	bool                                          Completed;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_LoadBossRushField_C_BPI_Completed_ReadyBossRushField) == 0x000001, "Wrong alignment on BPI_LoadBossRushField_C_BPI_Completed_ReadyBossRushField");
static_assert(sizeof(BPI_LoadBossRushField_C_BPI_Completed_ReadyBossRushField) == 0x000001, "Wrong size on BPI_LoadBossRushField_C_BPI_Completed_ReadyBossRushField");
static_assert(offsetof(BPI_LoadBossRushField_C_BPI_Completed_ReadyBossRushField, Completed) == 0x000000, "Member 'BPI_LoadBossRushField_C_BPI_Completed_ReadyBossRushField::Completed' has a wrong offset!");

// Function BPI_LoadBossRushField.BPI_LoadBossRushField_C.BPI_GetBattleFieldID
// 0x0004 (0x0004 - 0x0000)
struct BPI_LoadBossRushField_C_BPI_GetBattleFieldID final
{
public:
	int32                                         BattleFIeldID;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_LoadBossRushField_C_BPI_GetBattleFieldID) == 0x000004, "Wrong alignment on BPI_LoadBossRushField_C_BPI_GetBattleFieldID");
static_assert(sizeof(BPI_LoadBossRushField_C_BPI_GetBattleFieldID) == 0x000004, "Wrong size on BPI_LoadBossRushField_C_BPI_GetBattleFieldID");
static_assert(offsetof(BPI_LoadBossRushField_C_BPI_GetBattleFieldID, BattleFIeldID) == 0x000000, "Member 'BPI_LoadBossRushField_C_BPI_GetBattleFieldID::BattleFIeldID' has a wrong offset!");

// Function BPI_LoadBossRushField.BPI_LoadBossRushField_C.BPI_Completed_FinishBossRushField
// 0x0001 (0x0001 - 0x0000)
struct BPI_LoadBossRushField_C_BPI_Completed_FinishBossRushField final
{
public:
	bool                                          Completed;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_LoadBossRushField_C_BPI_Completed_FinishBossRushField) == 0x000001, "Wrong alignment on BPI_LoadBossRushField_C_BPI_Completed_FinishBossRushField");
static_assert(sizeof(BPI_LoadBossRushField_C_BPI_Completed_FinishBossRushField) == 0x000001, "Wrong size on BPI_LoadBossRushField_C_BPI_Completed_FinishBossRushField");
static_assert(offsetof(BPI_LoadBossRushField_C_BPI_Completed_FinishBossRushField, Completed) == 0x000000, "Member 'BPI_LoadBossRushField_C_BPI_Completed_FinishBossRushField::Completed' has a wrong offset!");

// Function BPI_LoadBossRushField.BPI_LoadBossRushField_C.BPI_GetBossRushFieldPos
// 0x0060 (0x0060 - 0x0000)
struct BPI_LoadBossRushField_C_BPI_GetBossRushFieldPos final
{
public:
	struct FTransform                             EncountPos;                                        // 0x0000(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
	struct FTransform                             LevelPos;                                          // 0x0030(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_LoadBossRushField_C_BPI_GetBossRushFieldPos) == 0x000010, "Wrong alignment on BPI_LoadBossRushField_C_BPI_GetBossRushFieldPos");
static_assert(sizeof(BPI_LoadBossRushField_C_BPI_GetBossRushFieldPos) == 0x000060, "Wrong size on BPI_LoadBossRushField_C_BPI_GetBossRushFieldPos");
static_assert(offsetof(BPI_LoadBossRushField_C_BPI_GetBossRushFieldPos, EncountPos) == 0x000000, "Member 'BPI_LoadBossRushField_C_BPI_GetBossRushFieldPos::EncountPos' has a wrong offset!");
static_assert(offsetof(BPI_LoadBossRushField_C_BPI_GetBossRushFieldPos, LevelPos) == 0x000030, "Member 'BPI_LoadBossRushField_C_BPI_GetBossRushFieldPos::LevelPos' has a wrong offset!");

// Function BPI_LoadBossRushField.BPI_LoadBossRushField_C.BPI_LoadSecondBossRushField
// 0x0004 (0x0004 - 0x0000)
struct BPI_LoadBossRushField_C_BPI_LoadSecondBossRushField final
{
public:
	int32                                         BattleFIeldID;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_LoadBossRushField_C_BPI_LoadSecondBossRushField) == 0x000004, "Wrong alignment on BPI_LoadBossRushField_C_BPI_LoadSecondBossRushField");
static_assert(sizeof(BPI_LoadBossRushField_C_BPI_LoadSecondBossRushField) == 0x000004, "Wrong size on BPI_LoadBossRushField_C_BPI_LoadSecondBossRushField");
static_assert(offsetof(BPI_LoadBossRushField_C_BPI_LoadSecondBossRushField, BattleFIeldID) == 0x000000, "Member 'BPI_LoadBossRushField_C_BPI_LoadSecondBossRushField::BattleFIeldID' has a wrong offset!");

// Function BPI_LoadBossRushField.BPI_LoadBossRushField_C.BPI_ChangeBossRushField_FirstOrSecond
// 0x0001 (0x0001 - 0x0000)
struct BPI_LoadBossRushField_C_BPI_ChangeBossRushField_FirstOrSecond final
{
public:
	bool                                          SecondLevel;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_LoadBossRushField_C_BPI_ChangeBossRushField_FirstOrSecond) == 0x000001, "Wrong alignment on BPI_LoadBossRushField_C_BPI_ChangeBossRushField_FirstOrSecond");
static_assert(sizeof(BPI_LoadBossRushField_C_BPI_ChangeBossRushField_FirstOrSecond) == 0x000001, "Wrong size on BPI_LoadBossRushField_C_BPI_ChangeBossRushField_FirstOrSecond");
static_assert(offsetof(BPI_LoadBossRushField_C_BPI_ChangeBossRushField_FirstOrSecond, SecondLevel) == 0x000000, "Member 'BPI_LoadBossRushField_C_BPI_ChangeBossRushField_FirstOrSecond::SecondLevel' has a wrong offset!");

// Function BPI_LoadBossRushField.BPI_LoadBossRushField_C.BPI_CheckLoadedBossRushField
// 0x0002 (0x0002 - 0x0000)
struct BPI_LoadBossRushField_C_BPI_CheckLoadedBossRushField final
{
public:
	bool                                          SecondLevel;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Loaded;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_LoadBossRushField_C_BPI_CheckLoadedBossRushField) == 0x000001, "Wrong alignment on BPI_LoadBossRushField_C_BPI_CheckLoadedBossRushField");
static_assert(sizeof(BPI_LoadBossRushField_C_BPI_CheckLoadedBossRushField) == 0x000002, "Wrong size on BPI_LoadBossRushField_C_BPI_CheckLoadedBossRushField");
static_assert(offsetof(BPI_LoadBossRushField_C_BPI_CheckLoadedBossRushField, SecondLevel) == 0x000000, "Member 'BPI_LoadBossRushField_C_BPI_CheckLoadedBossRushField::SecondLevel' has a wrong offset!");
static_assert(offsetof(BPI_LoadBossRushField_C_BPI_CheckLoadedBossRushField, Loaded) == 0x000001, "Member 'BPI_LoadBossRushField_C_BPI_CheckLoadedBossRushField::Loaded' has a wrong offset!");

// Function BPI_LoadBossRushField.BPI_LoadBossRushField_C.BPI_CheckVisibleBossRushField
// 0x0002 (0x0002 - 0x0000)
struct BPI_LoadBossRushField_C_BPI_CheckVisibleBossRushField final
{
public:
	bool                                          SecondLevel;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Visible;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_LoadBossRushField_C_BPI_CheckVisibleBossRushField) == 0x000001, "Wrong alignment on BPI_LoadBossRushField_C_BPI_CheckVisibleBossRushField");
static_assert(sizeof(BPI_LoadBossRushField_C_BPI_CheckVisibleBossRushField) == 0x000002, "Wrong size on BPI_LoadBossRushField_C_BPI_CheckVisibleBossRushField");
static_assert(offsetof(BPI_LoadBossRushField_C_BPI_CheckVisibleBossRushField, SecondLevel) == 0x000000, "Member 'BPI_LoadBossRushField_C_BPI_CheckVisibleBossRushField::SecondLevel' has a wrong offset!");
static_assert(offsetof(BPI_LoadBossRushField_C_BPI_CheckVisibleBossRushField, Visible) == 0x000001, "Member 'BPI_LoadBossRushField_C_BPI_CheckVisibleBossRushField::Visible' has a wrong offset!");

}

