#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_CharaAnimation

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_CharaAnimation.BPI_CharaAnimation_C.UpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct BPI_CharaAnimation_C_UpdateAnimation final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CharaAnimation_C_UpdateAnimation) == 0x000004, "Wrong alignment on BPI_CharaAnimation_C_UpdateAnimation");
static_assert(sizeof(BPI_CharaAnimation_C_UpdateAnimation) == 0x000004, "Wrong size on BPI_CharaAnimation_C_UpdateAnimation");
static_assert(offsetof(BPI_CharaAnimation_C_UpdateAnimation, DeltaTime) == 0x000000, "Member 'BPI_CharaAnimation_C_UpdateAnimation::DeltaTime' has a wrong offset!");

// Function BPI_CharaAnimation.BPI_CharaAnimation_C.SetIsUpdateAnimation
// 0x0002 (0x0002 - 0x0000)
struct BPI_CharaAnimation_C_SetIsUpdateAnimation final
{
public:
	bool                                          Update;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Ret;                                               // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaAnimation_C_SetIsUpdateAnimation) == 0x000001, "Wrong alignment on BPI_CharaAnimation_C_SetIsUpdateAnimation");
static_assert(sizeof(BPI_CharaAnimation_C_SetIsUpdateAnimation) == 0x000002, "Wrong size on BPI_CharaAnimation_C_SetIsUpdateAnimation");
static_assert(offsetof(BPI_CharaAnimation_C_SetIsUpdateAnimation, Update) == 0x000000, "Member 'BPI_CharaAnimation_C_SetIsUpdateAnimation::Update' has a wrong offset!");
static_assert(offsetof(BPI_CharaAnimation_C_SetIsUpdateAnimation, Ret) == 0x000001, "Member 'BPI_CharaAnimation_C_SetIsUpdateAnimation::Ret' has a wrong offset!");

// Function BPI_CharaAnimation.BPI_CharaAnimation_C.SetAlwaysAutoTransitionAnimationMode
// 0x0002 (0x0002 - 0x0000)
struct BPI_CharaAnimation_C_SetAlwaysAutoTransitionAnimationMode final
{
public:
	bool                                          Check;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NotUse;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaAnimation_C_SetAlwaysAutoTransitionAnimationMode) == 0x000001, "Wrong alignment on BPI_CharaAnimation_C_SetAlwaysAutoTransitionAnimationMode");
static_assert(sizeof(BPI_CharaAnimation_C_SetAlwaysAutoTransitionAnimationMode) == 0x000002, "Wrong size on BPI_CharaAnimation_C_SetAlwaysAutoTransitionAnimationMode");
static_assert(offsetof(BPI_CharaAnimation_C_SetAlwaysAutoTransitionAnimationMode, Check) == 0x000000, "Member 'BPI_CharaAnimation_C_SetAlwaysAutoTransitionAnimationMode::Check' has a wrong offset!");
static_assert(offsetof(BPI_CharaAnimation_C_SetAlwaysAutoTransitionAnimationMode, NotUse) == 0x000001, "Member 'BPI_CharaAnimation_C_SetAlwaysAutoTransitionAnimationMode::NotUse' has a wrong offset!");

// Function BPI_CharaAnimation.BPI_CharaAnimation_C.SetIsUpdateIK
// 0x0002 (0x0002 - 0x0000)
struct BPI_CharaAnimation_C_SetIsUpdateIK final
{
public:
	bool                                          Update;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Ret;                                               // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CharaAnimation_C_SetIsUpdateIK) == 0x000001, "Wrong alignment on BPI_CharaAnimation_C_SetIsUpdateIK");
static_assert(sizeof(BPI_CharaAnimation_C_SetIsUpdateIK) == 0x000002, "Wrong size on BPI_CharaAnimation_C_SetIsUpdateIK");
static_assert(offsetof(BPI_CharaAnimation_C_SetIsUpdateIK, Update) == 0x000000, "Member 'BPI_CharaAnimation_C_SetIsUpdateIK::Update' has a wrong offset!");
static_assert(offsetof(BPI_CharaAnimation_C_SetIsUpdateIK, Ret) == 0x000001, "Member 'BPI_CharaAnimation_C_SetIsUpdateIK::Ret' has a wrong offset!");

}

