#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_BattleMain

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "E_BTL_PTYPNL_TYPE_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BattleResidentEffect_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BPI_BattleMain.BPI_BattleMain_C.BI_GetPartySystem
// 0x0010 (0x0010 - 0x0000)
struct BPI_BattleMain_C_BI_GetPartySystem final
{
public:
	TScriptInterface<class IBPI_BattleParty_C>    Ret;                                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_GetPartySystem) == 0x000008, "Wrong alignment on BPI_BattleMain_C_BI_GetPartySystem");
static_assert(sizeof(BPI_BattleMain_C_BI_GetPartySystem) == 0x000010, "Wrong size on BPI_BattleMain_C_BI_GetPartySystem");
static_assert(offsetof(BPI_BattleMain_C_BI_GetPartySystem, Ret) == 0x000000, "Member 'BPI_BattleMain_C_BI_GetPartySystem::Ret' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_BattleLog
// 0x0018 (0x0018 - 0x0000)
struct BPI_BattleMain_C_BI_BattleLog final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_BattleLog) == 0x000008, "Wrong alignment on BPI_BattleMain_C_BI_BattleLog");
static_assert(sizeof(BPI_BattleMain_C_BI_BattleLog) == 0x000018, "Wrong size on BPI_BattleMain_C_BI_BattleLog");
static_assert(offsetof(BPI_BattleMain_C_BI_BattleLog, String) == 0x000000, "Member 'BPI_BattleMain_C_BI_BattleLog::String' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_BattleLog, RetValue) == 0x000010, "Member 'BPI_BattleMain_C_BI_BattleLog::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_IsBattleLogOn
// 0x0001 (0x0001 - 0x0000)
struct BPI_BattleMain_C_BI_IsBattleLogOn final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_IsBattleLogOn) == 0x000001, "Wrong alignment on BPI_BattleMain_C_BI_IsBattleLogOn");
static_assert(sizeof(BPI_BattleMain_C_BI_IsBattleLogOn) == 0x000001, "Wrong size on BPI_BattleMain_C_BI_IsBattleLogOn");
static_assert(offsetof(BPI_BattleMain_C_BI_IsBattleLogOn, RetValue) == 0x000000, "Member 'BPI_BattleMain_C_BI_IsBattleLogOn::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_GetTurnActValidNum
// 0x0004 (0x0004 - 0x0000)
struct BPI_BattleMain_C_BI_GetTurnActValidNum final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleMain_C_BI_GetTurnActValidNum) == 0x000004, "Wrong alignment on BPI_BattleMain_C_BI_GetTurnActValidNum");
static_assert(sizeof(BPI_BattleMain_C_BI_GetTurnActValidNum) == 0x000004, "Wrong size on BPI_BattleMain_C_BI_GetTurnActValidNum");
static_assert(offsetof(BPI_BattleMain_C_BI_GetTurnActValidNum, RetValue) == 0x000000, "Member 'BPI_BattleMain_C_BI_GetTurnActValidNum::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_SetBattleCamera
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleMain_C_BI_SetBattleCamera final
{
public:
	float                                         BlendTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_SetBattleCamera) == 0x000004, "Wrong alignment on BPI_BattleMain_C_BI_SetBattleCamera");
static_assert(sizeof(BPI_BattleMain_C_BI_SetBattleCamera) == 0x000008, "Wrong size on BPI_BattleMain_C_BI_SetBattleCamera");
static_assert(offsetof(BPI_BattleMain_C_BI_SetBattleCamera, BlendTime) == 0x000000, "Member 'BPI_BattleMain_C_BI_SetBattleCamera::BlendTime' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_SetBattleCamera, RetValue) == 0x000004, "Member 'BPI_BattleMain_C_BI_SetBattleCamera::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_GetBattleCameraTransform
// 0x0030 (0x0030 - 0x0000)
struct BPI_BattleMain_C_BI_GetBattleCameraTransform final
{
public:
	struct FTransform                             RetValue;                                          // 0x0000(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_GetBattleCameraTransform) == 0x000010, "Wrong alignment on BPI_BattleMain_C_BI_GetBattleCameraTransform");
static_assert(sizeof(BPI_BattleMain_C_BI_GetBattleCameraTransform) == 0x000030, "Wrong size on BPI_BattleMain_C_BI_GetBattleCameraTransform");
static_assert(offsetof(BPI_BattleMain_C_BI_GetBattleCameraTransform, RetValue) == 0x000000, "Member 'BPI_BattleMain_C_BI_GetBattleCameraTransform::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_GetBattleCameraFieldOfView
// 0x0004 (0x0004 - 0x0000)
struct BPI_BattleMain_C_BI_GetBattleCameraFieldOfView final
{
public:
	float                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleMain_C_BI_GetBattleCameraFieldOfView) == 0x000004, "Wrong alignment on BPI_BattleMain_C_BI_GetBattleCameraFieldOfView");
static_assert(sizeof(BPI_BattleMain_C_BI_GetBattleCameraFieldOfView) == 0x000004, "Wrong size on BPI_BattleMain_C_BI_GetBattleCameraFieldOfView");
static_assert(offsetof(BPI_BattleMain_C_BI_GetBattleCameraFieldOfView, RetValue) == 0x000000, "Member 'BPI_BattleMain_C_BI_GetBattleCameraFieldOfView::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_TurnDrawWidgetSetVisibility
// 0x0002 (0x0002 - 0x0000)
struct BPI_BattleMain_C_BI_TurnDrawWidgetSetVisibility final
{
public:
	ESlateVisibility                              Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_TurnDrawWidgetSetVisibility) == 0x000001, "Wrong alignment on BPI_BattleMain_C_BI_TurnDrawWidgetSetVisibility");
static_assert(sizeof(BPI_BattleMain_C_BI_TurnDrawWidgetSetVisibility) == 0x000002, "Wrong size on BPI_BattleMain_C_BI_TurnDrawWidgetSetVisibility");
static_assert(offsetof(BPI_BattleMain_C_BI_TurnDrawWidgetSetVisibility, Value) == 0x000000, "Member 'BPI_BattleMain_C_BI_TurnDrawWidgetSetVisibility::Value' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_TurnDrawWidgetSetVisibility, RetValue) == 0x000001, "Member 'BPI_BattleMain_C_BI_TurnDrawWidgetSetVisibility::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_PartyPanelSetVisibility
// 0x0002 (0x0002 - 0x0000)
struct BPI_BattleMain_C_BI_PartyPanelSetVisibility final
{
public:
	ESlateVisibility                              Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_PartyPanelSetVisibility) == 0x000001, "Wrong alignment on BPI_BattleMain_C_BI_PartyPanelSetVisibility");
static_assert(sizeof(BPI_BattleMain_C_BI_PartyPanelSetVisibility) == 0x000002, "Wrong size on BPI_BattleMain_C_BI_PartyPanelSetVisibility");
static_assert(offsetof(BPI_BattleMain_C_BI_PartyPanelSetVisibility, Value) == 0x000000, "Member 'BPI_BattleMain_C_BI_PartyPanelSetVisibility::Value' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_PartyPanelSetVisibility, RetValue) == 0x000001, "Member 'BPI_BattleMain_C_BI_PartyPanelSetVisibility::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_UICommandStartSeq
// 0x0030 (0x0030 - 0x0000)
struct BPI_BattleMain_C_BI_UICommandStartSeq final
{
public:
	int32                                         PartyIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCounterActor;                                    // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BTL_UI_COMM_STEP                            Step;                                              // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallIndex;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TopIndex;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_WIDGET_PRIO                                 Prio;                                              // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCameraNoMove;                                    // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSkillCriticalValueOne>         SettleCriticalInfo;                                // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          RetValue;                                          // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_UICommandStartSeq) == 0x000008, "Wrong alignment on BPI_BattleMain_C_BI_UICommandStartSeq");
static_assert(sizeof(BPI_BattleMain_C_BI_UICommandStartSeq) == 0x000030, "Wrong size on BPI_BattleMain_C_BI_UICommandStartSeq");
static_assert(offsetof(BPI_BattleMain_C_BI_UICommandStartSeq, PartyIndex) == 0x000000, "Member 'BPI_BattleMain_C_BI_UICommandStartSeq::PartyIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_UICommandStartSeq, IsCounterActor) == 0x000004, "Member 'BPI_BattleMain_C_BI_UICommandStartSeq::IsCounterActor' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_UICommandStartSeq, Step) == 0x000005, "Member 'BPI_BattleMain_C_BI_UICommandStartSeq::Step' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_UICommandStartSeq, CallIndex) == 0x000008, "Member 'BPI_BattleMain_C_BI_UICommandStartSeq::CallIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_UICommandStartSeq, TopIndex) == 0x00000C, "Member 'BPI_BattleMain_C_BI_UICommandStartSeq::TopIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_UICommandStartSeq, Prio) == 0x000010, "Member 'BPI_BattleMain_C_BI_UICommandStartSeq::Prio' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_UICommandStartSeq, IsCameraNoMove) == 0x000011, "Member 'BPI_BattleMain_C_BI_UICommandStartSeq::IsCameraNoMove' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_UICommandStartSeq, SettleCriticalInfo) == 0x000018, "Member 'BPI_BattleMain_C_BI_UICommandStartSeq::SettleCriticalInfo' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_UICommandStartSeq, RetValue) == 0x000028, "Member 'BPI_BattleMain_C_BI_UICommandStartSeq::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_UICommandIsFinished
// 0x0001 (0x0001 - 0x0000)
struct BPI_BattleMain_C_BI_UICommandIsFinished final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_UICommandIsFinished) == 0x000001, "Wrong alignment on BPI_BattleMain_C_BI_UICommandIsFinished");
static_assert(sizeof(BPI_BattleMain_C_BI_UICommandIsFinished) == 0x000001, "Wrong size on BPI_BattleMain_C_BI_UICommandIsFinished");
static_assert(offsetof(BPI_BattleMain_C_BI_UICommandIsFinished, RetValue) == 0x000000, "Member 'BPI_BattleMain_C_BI_UICommandIsFinished::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_UICommandGetResult
// 0x0010 (0x0010 - 0x0000)
struct BPI_BattleMain_C_BI_UICommandGetResult final
{
public:
	struct FBtlCommand                            RetValue;                                          // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(BPI_BattleMain_C_BI_UICommandGetResult) == 0x000004, "Wrong alignment on BPI_BattleMain_C_BI_UICommandGetResult");
static_assert(sizeof(BPI_BattleMain_C_BI_UICommandGetResult) == 0x000010, "Wrong size on BPI_BattleMain_C_BI_UICommandGetResult");
static_assert(offsetof(BPI_BattleMain_C_BI_UICommandGetResult, RetValue) == 0x000000, "Member 'BPI_BattleMain_C_BI_UICommandGetResult::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_UICommandEndSeq
// 0x0001 (0x0001 - 0x0000)
struct BPI_BattleMain_C_BI_UICommandEndSeq final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_UICommandEndSeq) == 0x000001, "Wrong alignment on BPI_BattleMain_C_BI_UICommandEndSeq");
static_assert(sizeof(BPI_BattleMain_C_BI_UICommandEndSeq) == 0x000001, "Wrong size on BPI_BattleMain_C_BI_UICommandEndSeq");
static_assert(offsetof(BPI_BattleMain_C_BI_UICommandEndSeq, RetValue) == 0x000000, "Member 'BPI_BattleMain_C_BI_UICommandEndSeq::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_UICommandRemove
// 0x0001 (0x0001 - 0x0000)
struct BPI_BattleMain_C_BI_UICommandRemove final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_UICommandRemove) == 0x000001, "Wrong alignment on BPI_BattleMain_C_BI_UICommandRemove");
static_assert(sizeof(BPI_BattleMain_C_BI_UICommandRemove) == 0x000001, "Wrong size on BPI_BattleMain_C_BI_UICommandRemove");
static_assert(offsetof(BPI_BattleMain_C_BI_UICommandRemove, RetValue) == 0x000000, "Member 'BPI_BattleMain_C_BI_UICommandRemove::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_UICommandGetSkillMenuCursor
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleMain_C_BI_UICommandGetSkillMenuCursor final
{
public:
	int32                                         CursorIndex;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TopIndex;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleMain_C_BI_UICommandGetSkillMenuCursor) == 0x000004, "Wrong alignment on BPI_BattleMain_C_BI_UICommandGetSkillMenuCursor");
static_assert(sizeof(BPI_BattleMain_C_BI_UICommandGetSkillMenuCursor) == 0x000008, "Wrong size on BPI_BattleMain_C_BI_UICommandGetSkillMenuCursor");
static_assert(offsetof(BPI_BattleMain_C_BI_UICommandGetSkillMenuCursor, CursorIndex) == 0x000000, "Member 'BPI_BattleMain_C_BI_UICommandGetSkillMenuCursor::CursorIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_UICommandGetSkillMenuCursor, TopIndex) == 0x000004, "Member 'BPI_BattleMain_C_BI_UICommandGetSkillMenuCursor::TopIndex' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_UICommandGetItemMenuCursor
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleMain_C_BI_UICommandGetItemMenuCursor final
{
public:
	int32                                         CursorIndex;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TopIndex;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleMain_C_BI_UICommandGetItemMenuCursor) == 0x000004, "Wrong alignment on BPI_BattleMain_C_BI_UICommandGetItemMenuCursor");
static_assert(sizeof(BPI_BattleMain_C_BI_UICommandGetItemMenuCursor) == 0x000008, "Wrong size on BPI_BattleMain_C_BI_UICommandGetItemMenuCursor");
static_assert(offsetof(BPI_BattleMain_C_BI_UICommandGetItemMenuCursor, CursorIndex) == 0x000000, "Member 'BPI_BattleMain_C_BI_UICommandGetItemMenuCursor::CursorIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_UICommandGetItemMenuCursor, TopIndex) == 0x000004, "Member 'BPI_BattleMain_C_BI_UICommandGetItemMenuCursor::TopIndex' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_GetCalcMakeBstArray
// 0x0018 (0x0018 - 0x0000)
struct BPI_BattleMain_C_BI_GetCalcMakeBstArray final
{
public:
	int32                                         InBst;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_BAD_STATUS>                          RetValue;                                          // 0x0008(0x0010)(Parm, OutParm)
};
static_assert(alignof(BPI_BattleMain_C_BI_GetCalcMakeBstArray) == 0x000008, "Wrong alignment on BPI_BattleMain_C_BI_GetCalcMakeBstArray");
static_assert(sizeof(BPI_BattleMain_C_BI_GetCalcMakeBstArray) == 0x000018, "Wrong size on BPI_BattleMain_C_BI_GetCalcMakeBstArray");
static_assert(offsetof(BPI_BattleMain_C_BI_GetCalcMakeBstArray, InBst) == 0x000000, "Member 'BPI_BattleMain_C_BI_GetCalcMakeBstArray::InBst' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_GetCalcMakeBstArray, RetValue) == 0x000008, "Member 'BPI_BattleMain_C_BI_GetCalcMakeBstArray::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_SetBattleCameraHome
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleMain_C_BI_SetBattleCameraHome final
{
public:
	float                                         BlendTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_SetBattleCameraHome) == 0x000004, "Wrong alignment on BPI_BattleMain_C_BI_SetBattleCameraHome");
static_assert(sizeof(BPI_BattleMain_C_BI_SetBattleCameraHome) == 0x000008, "Wrong size on BPI_BattleMain_C_BI_SetBattleCameraHome");
static_assert(offsetof(BPI_BattleMain_C_BI_SetBattleCameraHome, BlendTime) == 0x000000, "Member 'BPI_BattleMain_C_BI_SetBattleCameraHome::BlendTime' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_SetBattleCameraHome, RetValue) == 0x000004, "Member 'BPI_BattleMain_C_BI_SetBattleCameraHome::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_SetBattleCameraSkillCam
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleMain_C_BI_SetBattleCameraSkillCam final
{
public:
	float                                         BlendTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_SetBattleCameraSkillCam) == 0x000004, "Wrong alignment on BPI_BattleMain_C_BI_SetBattleCameraSkillCam");
static_assert(sizeof(BPI_BattleMain_C_BI_SetBattleCameraSkillCam) == 0x000008, "Wrong size on BPI_BattleMain_C_BI_SetBattleCameraSkillCam");
static_assert(offsetof(BPI_BattleMain_C_BI_SetBattleCameraSkillCam, BlendTime) == 0x000000, "Member 'BPI_BattleMain_C_BI_SetBattleCameraSkillCam::BlendTime' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_SetBattleCameraSkillCam, RetValue) == 0x000004, "Member 'BPI_BattleMain_C_BI_SetBattleCameraSkillCam::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_SetPartyPanelEmpty
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleMain_C_BI_SetPartyPanelEmpty final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_SetPartyPanelEmpty) == 0x000004, "Wrong alignment on BPI_BattleMain_C_BI_SetPartyPanelEmpty");
static_assert(sizeof(BPI_BattleMain_C_BI_SetPartyPanelEmpty) == 0x000008, "Wrong size on BPI_BattleMain_C_BI_SetPartyPanelEmpty");
static_assert(offsetof(BPI_BattleMain_C_BI_SetPartyPanelEmpty, Param_Index) == 0x000000, "Member 'BPI_BattleMain_C_BI_SetPartyPanelEmpty::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_SetPartyPanelEmpty, RetValue) == 0x000004, "Member 'BPI_BattleMain_C_BI_SetPartyPanelEmpty::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_UIInfomationShow
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleMain_C_BI_UIInfomationShow final
{
public:
	int32                                         SkillId;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_UIInfomationShow) == 0x000004, "Wrong alignment on BPI_BattleMain_C_BI_UIInfomationShow");
static_assert(sizeof(BPI_BattleMain_C_BI_UIInfomationShow) == 0x000008, "Wrong size on BPI_BattleMain_C_BI_UIInfomationShow");
static_assert(offsetof(BPI_BattleMain_C_BI_UIInfomationShow, SkillId) == 0x000000, "Member 'BPI_BattleMain_C_BI_UIInfomationShow::SkillId' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_UIInfomationShow, RetValue) == 0x000004, "Member 'BPI_BattleMain_C_BI_UIInfomationShow::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_UIInfomationHide
// 0x0001 (0x0001 - 0x0000)
struct BPI_BattleMain_C_BI_UIInfomationHide final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_UIInfomationHide) == 0x000001, "Wrong alignment on BPI_BattleMain_C_BI_UIInfomationHide");
static_assert(sizeof(BPI_BattleMain_C_BI_UIInfomationHide) == 0x000001, "Wrong size on BPI_BattleMain_C_BI_UIInfomationHide");
static_assert(offsetof(BPI_BattleMain_C_BI_UIInfomationHide, RetValue) == 0x000000, "Member 'BPI_BattleMain_C_BI_UIInfomationHide::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_UIInfomationEndSeq
// 0x0001 (0x0001 - 0x0000)
struct BPI_BattleMain_C_BI_UIInfomationEndSeq final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_UIInfomationEndSeq) == 0x000001, "Wrong alignment on BPI_BattleMain_C_BI_UIInfomationEndSeq");
static_assert(sizeof(BPI_BattleMain_C_BI_UIInfomationEndSeq) == 0x000001, "Wrong size on BPI_BattleMain_C_BI_UIInfomationEndSeq");
static_assert(offsetof(BPI_BattleMain_C_BI_UIInfomationEndSeq, RetValue) == 0x000000, "Member 'BPI_BattleMain_C_BI_UIInfomationEndSeq::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_UIInfomationIsAnimationExcuting
// 0x0001 (0x0001 - 0x0000)
struct BPI_BattleMain_C_BI_UIInfomationIsAnimationExcuting final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_UIInfomationIsAnimationExcuting) == 0x000001, "Wrong alignment on BPI_BattleMain_C_BI_UIInfomationIsAnimationExcuting");
static_assert(sizeof(BPI_BattleMain_C_BI_UIInfomationIsAnimationExcuting) == 0x000001, "Wrong size on BPI_BattleMain_C_BI_UIInfomationIsAnimationExcuting");
static_assert(offsetof(BPI_BattleMain_C_BI_UIInfomationIsAnimationExcuting, RetValue) == 0x000000, "Member 'BPI_BattleMain_C_BI_UIInfomationIsAnimationExcuting::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_CamFactorySpawnRailActor
// 0x0010 (0x0010 - 0x0000)
struct BPI_BattleMain_C_BI_CamFactorySpawnRailActor final
{
public:
	E_BTL_CAM_TYPE                                CamType;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PartyIndex;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RailActor_C*                        RetValue;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleMain_C_BI_CamFactorySpawnRailActor) == 0x000008, "Wrong alignment on BPI_BattleMain_C_BI_CamFactorySpawnRailActor");
static_assert(sizeof(BPI_BattleMain_C_BI_CamFactorySpawnRailActor) == 0x000010, "Wrong size on BPI_BattleMain_C_BI_CamFactorySpawnRailActor");
static_assert(offsetof(BPI_BattleMain_C_BI_CamFactorySpawnRailActor, CamType) == 0x000000, "Member 'BPI_BattleMain_C_BI_CamFactorySpawnRailActor::CamType' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_CamFactorySpawnRailActor, PartyIndex) == 0x000004, "Member 'BPI_BattleMain_C_BI_CamFactorySpawnRailActor::PartyIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_CamFactorySpawnRailActor, RetValue) == 0x000008, "Member 'BPI_BattleMain_C_BI_CamFactorySpawnRailActor::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_IsBattleCameraInterp
// 0x0001 (0x0001 - 0x0000)
struct BPI_BattleMain_C_BI_IsBattleCameraInterp final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_IsBattleCameraInterp) == 0x000001, "Wrong alignment on BPI_BattleMain_C_BI_IsBattleCameraInterp");
static_assert(sizeof(BPI_BattleMain_C_BI_IsBattleCameraInterp) == 0x000001, "Wrong size on BPI_BattleMain_C_BI_IsBattleCameraInterp");
static_assert(offsetof(BPI_BattleMain_C_BI_IsBattleCameraInterp, RetValue) == 0x000000, "Member 'BPI_BattleMain_C_BI_IsBattleCameraInterp::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_IsBattleCameraRailArrived
// 0x0001 (0x0001 - 0x0000)
struct BPI_BattleMain_C_BI_IsBattleCameraRailArrived final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_IsBattleCameraRailArrived) == 0x000001, "Wrong alignment on BPI_BattleMain_C_BI_IsBattleCameraRailArrived");
static_assert(sizeof(BPI_BattleMain_C_BI_IsBattleCameraRailArrived) == 0x000001, "Wrong size on BPI_BattleMain_C_BI_IsBattleCameraRailArrived");
static_assert(offsetof(BPI_BattleMain_C_BI_IsBattleCameraRailArrived, RetValue) == 0x000000, "Member 'BPI_BattleMain_C_BI_IsBattleCameraRailArrived::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_SetBattleCameraTarget
// 0x0014 (0x0014 - 0x0000)
struct BPI_BattleMain_C_BI_SetBattleCameraTarget final
{
public:
	struct FVector                                Target;                                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         blendSpeed;                                        // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_SetBattleCameraTarget) == 0x000004, "Wrong alignment on BPI_BattleMain_C_BI_SetBattleCameraTarget");
static_assert(sizeof(BPI_BattleMain_C_BI_SetBattleCameraTarget) == 0x000014, "Wrong size on BPI_BattleMain_C_BI_SetBattleCameraTarget");
static_assert(offsetof(BPI_BattleMain_C_BI_SetBattleCameraTarget, Target) == 0x000000, "Member 'BPI_BattleMain_C_BI_SetBattleCameraTarget::Target' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_SetBattleCameraTarget, blendSpeed) == 0x00000C, "Member 'BPI_BattleMain_C_BI_SetBattleCameraTarget::blendSpeed' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_SetBattleCameraTarget, RetValue) == 0x000010, "Member 'BPI_BattleMain_C_BI_SetBattleCameraTarget::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_UITurnDrawIsFinished
// 0x0001 (0x0001 - 0x0000)
struct BPI_BattleMain_C_BI_UITurnDrawIsFinished final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_UITurnDrawIsFinished) == 0x000001, "Wrong alignment on BPI_BattleMain_C_BI_UITurnDrawIsFinished");
static_assert(sizeof(BPI_BattleMain_C_BI_UITurnDrawIsFinished) == 0x000001, "Wrong size on BPI_BattleMain_C_BI_UITurnDrawIsFinished");
static_assert(offsetof(BPI_BattleMain_C_BI_UITurnDrawIsFinished, RetValue) == 0x000000, "Member 'BPI_BattleMain_C_BI_UITurnDrawIsFinished::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_SetBattleCameraFovy
// 0x000C (0x000C - 0x0000)
struct BPI_BattleMain_C_BI_SetBattleCameraFovy final
{
public:
	float                                         Fovy;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Blend;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_SetBattleCameraFovy) == 0x000004, "Wrong alignment on BPI_BattleMain_C_BI_SetBattleCameraFovy");
static_assert(sizeof(BPI_BattleMain_C_BI_SetBattleCameraFovy) == 0x00000C, "Wrong size on BPI_BattleMain_C_BI_SetBattleCameraFovy");
static_assert(offsetof(BPI_BattleMain_C_BI_SetBattleCameraFovy, Fovy) == 0x000000, "Member 'BPI_BattleMain_C_BI_SetBattleCameraFovy::Fovy' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_SetBattleCameraFovy, Blend) == 0x000004, "Member 'BPI_BattleMain_C_BI_SetBattleCameraFovy::Blend' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_SetBattleCameraFovy, RetValue) == 0x000008, "Member 'BPI_BattleMain_C_BI_SetBattleCameraFovy::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_CamFactorySpawnRailActorSkill
// 0x0028 (0x0028 - 0x0000)
struct BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill final
{
public:
	int32                                         TargetPartyIndex;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_SKILL_CAM_TYPE                          Type;                                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Param_Name;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ActorIndex;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsConsiderActorLocation;                           // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsOverrideHokanSpeed;                              // 0x001D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsHokanSpeedMax;                                   // 0x001E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DoNotResetUnitAveLocation;                         // 0x001F(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsSuccess;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill) == 0x000008, "Wrong alignment on BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill");
static_assert(sizeof(BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill) == 0x000028, "Wrong size on BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill");
static_assert(offsetof(BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill, TargetPartyIndex) == 0x000000, "Member 'BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill::TargetPartyIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill, Type) == 0x000004, "Member 'BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill::Type' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill, Param_Name) == 0x000008, "Member 'BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill::Param_Name' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill, ActorIndex) == 0x000018, "Member 'BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill::ActorIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill, IsConsiderActorLocation) == 0x00001C, "Member 'BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill::IsConsiderActorLocation' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill, IsOverrideHokanSpeed) == 0x00001D, "Member 'BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill::IsOverrideHokanSpeed' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill, IsHokanSpeedMax) == 0x00001E, "Member 'BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill::IsHokanSpeedMax' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill, DoNotResetUnitAveLocation) == 0x00001F, "Member 'BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill::DoNotResetUnitAveLocation' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill, IsSuccess) == 0x000020, "Member 'BPI_BattleMain_C_BI_CamFactorySpawnRailActorSkill::IsSuccess' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_SetBattleCameraShake
// 0x0018 (0x0018 - 0x0000)
struct BPI_BattleMain_C_BI_SetBattleCameraShake final
{
public:
	class UClass*                                 InShakeClass;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Sw;                                                // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Scale;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_SetBattleCameraShake) == 0x000008, "Wrong alignment on BPI_BattleMain_C_BI_SetBattleCameraShake");
static_assert(sizeof(BPI_BattleMain_C_BI_SetBattleCameraShake) == 0x000018, "Wrong size on BPI_BattleMain_C_BI_SetBattleCameraShake");
static_assert(offsetof(BPI_BattleMain_C_BI_SetBattleCameraShake, InShakeClass) == 0x000000, "Member 'BPI_BattleMain_C_BI_SetBattleCameraShake::InShakeClass' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_SetBattleCameraShake, Sw) == 0x000008, "Member 'BPI_BattleMain_C_BI_SetBattleCameraShake::Sw' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_SetBattleCameraShake, Scale) == 0x00000C, "Member 'BPI_BattleMain_C_BI_SetBattleCameraShake::Scale' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_SetBattleCameraShake, RetValue) == 0x000010, "Member 'BPI_BattleMain_C_BI_SetBattleCameraShake::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_PartyPanelCtrl
// 0x0010 (0x0010 - 0x0000)
struct BPI_BattleMain_C_BI_PartyPanelCtrl final
{
public:
	int32                                         PartyIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_PANEL_CTRL                              Ctrl;                                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Value2;                                            // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RetValue;                                          // 0x000D(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_PartyPanelCtrl) == 0x000004, "Wrong alignment on BPI_BattleMain_C_BI_PartyPanelCtrl");
static_assert(sizeof(BPI_BattleMain_C_BI_PartyPanelCtrl) == 0x000010, "Wrong size on BPI_BattleMain_C_BI_PartyPanelCtrl");
static_assert(offsetof(BPI_BattleMain_C_BI_PartyPanelCtrl, PartyIndex) == 0x000000, "Member 'BPI_BattleMain_C_BI_PartyPanelCtrl::PartyIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_PartyPanelCtrl, Ctrl) == 0x000004, "Member 'BPI_BattleMain_C_BI_PartyPanelCtrl::Ctrl' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_PartyPanelCtrl, Value) == 0x000008, "Member 'BPI_BattleMain_C_BI_PartyPanelCtrl::Value' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_PartyPanelCtrl, Value2) == 0x00000C, "Member 'BPI_BattleMain_C_BI_PartyPanelCtrl::Value2' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_PartyPanelCtrl, RetValue) == 0x00000D, "Member 'BPI_BattleMain_C_BI_PartyPanelCtrl::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_InfoMessShowBySkill
// 0x0038 (0x0038 - 0x0000)
struct BPI_BattleMain_C_BI_InfoMessShowBySkill final
{
public:
	int32                                         SkillId;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SrcActorName;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DstActorName;                                      // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsMaster;                                          // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OverwriteID;                                       // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_InfoMessShowBySkill) == 0x000008, "Wrong alignment on BPI_BattleMain_C_BI_InfoMessShowBySkill");
static_assert(sizeof(BPI_BattleMain_C_BI_InfoMessShowBySkill) == 0x000038, "Wrong size on BPI_BattleMain_C_BI_InfoMessShowBySkill");
static_assert(offsetof(BPI_BattleMain_C_BI_InfoMessShowBySkill, SkillId) == 0x000000, "Member 'BPI_BattleMain_C_BI_InfoMessShowBySkill::SkillId' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_InfoMessShowBySkill, SrcActorName) == 0x000008, "Member 'BPI_BattleMain_C_BI_InfoMessShowBySkill::SrcActorName' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_InfoMessShowBySkill, DstActorName) == 0x000018, "Member 'BPI_BattleMain_C_BI_InfoMessShowBySkill::DstActorName' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_InfoMessShowBySkill, IsMaster) == 0x000028, "Member 'BPI_BattleMain_C_BI_InfoMessShowBySkill::IsMaster' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_InfoMessShowBySkill, OverwriteID) == 0x00002C, "Member 'BPI_BattleMain_C_BI_InfoMessShowBySkill::OverwriteID' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_InfoMessShowBySkill, RetValue) == 0x000030, "Member 'BPI_BattleMain_C_BI_InfoMessShowBySkill::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_InfoMessExtAct
// 0x0020 (0x0020 - 0x0000)
struct BPI_BattleMain_C_BI_InfoMessExtAct final
{
public:
	E_BTL_EXTRA_ACTION                            MessageIndex;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ProgramStr;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          RetValue;                                          // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_InfoMessExtAct) == 0x000008, "Wrong alignment on BPI_BattleMain_C_BI_InfoMessExtAct");
static_assert(sizeof(BPI_BattleMain_C_BI_InfoMessExtAct) == 0x000020, "Wrong size on BPI_BattleMain_C_BI_InfoMessExtAct");
static_assert(offsetof(BPI_BattleMain_C_BI_InfoMessExtAct, MessageIndex) == 0x000000, "Member 'BPI_BattleMain_C_BI_InfoMessExtAct::MessageIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_InfoMessExtAct, ProgramStr) == 0x000008, "Member 'BPI_BattleMain_C_BI_InfoMessExtAct::ProgramStr' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_InfoMessExtAct, RetValue) == 0x000018, "Member 'BPI_BattleMain_C_BI_InfoMessExtAct::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_InfoMessHide
// 0x0001 (0x0001 - 0x0000)
struct BPI_BattleMain_C_BI_InfoMessHide final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_InfoMessHide) == 0x000001, "Wrong alignment on BPI_BattleMain_C_BI_InfoMessHide");
static_assert(sizeof(BPI_BattleMain_C_BI_InfoMessHide) == 0x000001, "Wrong size on BPI_BattleMain_C_BI_InfoMessHide");
static_assert(offsetof(BPI_BattleMain_C_BI_InfoMessHide, RetValue) == 0x000000, "Member 'BPI_BattleMain_C_BI_InfoMessHide::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_PartyPanelUpDataChara_BtlPartyData
// 0x0330 (0x0330 - 0x0000)
struct BPI_BattleMain_C_BI_PartyPanelUpDataChara_BtlPartyData final
{
public:
	struct FBtlParty                              PartyData;                                         // 0x0000(0x0320)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          InOptionCheck;                                     // 0x0320(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RetValue;                                          // 0x0321(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_PartyPanelUpDataChara_BtlPartyData) == 0x000010, "Wrong alignment on BPI_BattleMain_C_BI_PartyPanelUpDataChara_BtlPartyData");
static_assert(sizeof(BPI_BattleMain_C_BI_PartyPanelUpDataChara_BtlPartyData) == 0x000330, "Wrong size on BPI_BattleMain_C_BI_PartyPanelUpDataChara_BtlPartyData");
static_assert(offsetof(BPI_BattleMain_C_BI_PartyPanelUpDataChara_BtlPartyData, PartyData) == 0x000000, "Member 'BPI_BattleMain_C_BI_PartyPanelUpDataChara_BtlPartyData::PartyData' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_PartyPanelUpDataChara_BtlPartyData, InOptionCheck) == 0x000320, "Member 'BPI_BattleMain_C_BI_PartyPanelUpDataChara_BtlPartyData::InOptionCheck' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_PartyPanelUpDataChara_BtlPartyData, RetValue) == 0x000321, "Member 'BPI_BattleMain_C_BI_PartyPanelUpDataChara_BtlPartyData::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_GetOriginTransform
// 0x0030 (0x0030 - 0x0000)
struct BPI_BattleMain_C_BI_GetOriginTransform final
{
public:
	struct FTransform                             RetValue;                                          // 0x0000(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_GetOriginTransform) == 0x000010, "Wrong alignment on BPI_BattleMain_C_BI_GetOriginTransform");
static_assert(sizeof(BPI_BattleMain_C_BI_GetOriginTransform) == 0x000030, "Wrong size on BPI_BattleMain_C_BI_GetOriginTransform");
static_assert(offsetof(BPI_BattleMain_C_BI_GetOriginTransform, RetValue) == 0x000000, "Member 'BPI_BattleMain_C_BI_GetOriginTransform::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_TaskFactoryMakeTalkPartyInTask
// 0x0028 (0x0028 - 0x0000)
struct BPI_BattleMain_C_BI_TaskFactoryMakeTalkPartyInTask final
{
public:
	TArray<int32>                                 WaitTaskList;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 ParentName;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         PartyIndex;                                        // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetValue;                                          // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleMain_C_BI_TaskFactoryMakeTalkPartyInTask) == 0x000008, "Wrong alignment on BPI_BattleMain_C_BI_TaskFactoryMakeTalkPartyInTask");
static_assert(sizeof(BPI_BattleMain_C_BI_TaskFactoryMakeTalkPartyInTask) == 0x000028, "Wrong size on BPI_BattleMain_C_BI_TaskFactoryMakeTalkPartyInTask");
static_assert(offsetof(BPI_BattleMain_C_BI_TaskFactoryMakeTalkPartyInTask, WaitTaskList) == 0x000000, "Member 'BPI_BattleMain_C_BI_TaskFactoryMakeTalkPartyInTask::WaitTaskList' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_TaskFactoryMakeTalkPartyInTask, ParentName) == 0x000010, "Member 'BPI_BattleMain_C_BI_TaskFactoryMakeTalkPartyInTask::ParentName' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_TaskFactoryMakeTalkPartyInTask, PartyIndex) == 0x000020, "Member 'BPI_BattleMain_C_BI_TaskFactoryMakeTalkPartyInTask::PartyIndex' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_TaskFactoryMakeTalkPartyInTask, RetValue) == 0x000024, "Member 'BPI_BattleMain_C_BI_TaskFactoryMakeTalkPartyInTask::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_GetTaskFactoryParentNameTaskCnt
// 0x0018 (0x0018 - 0x0000)
struct BPI_BattleMain_C_BI_GetTaskFactoryParentNameTaskCnt final
{
public:
	class FString                                 ParentName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         RetValue;                                          // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleMain_C_BI_GetTaskFactoryParentNameTaskCnt) == 0x000008, "Wrong alignment on BPI_BattleMain_C_BI_GetTaskFactoryParentNameTaskCnt");
static_assert(sizeof(BPI_BattleMain_C_BI_GetTaskFactoryParentNameTaskCnt) == 0x000018, "Wrong size on BPI_BattleMain_C_BI_GetTaskFactoryParentNameTaskCnt");
static_assert(offsetof(BPI_BattleMain_C_BI_GetTaskFactoryParentNameTaskCnt, ParentName) == 0x000000, "Member 'BPI_BattleMain_C_BI_GetTaskFactoryParentNameTaskCnt::ParentName' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_GetTaskFactoryParentNameTaskCnt, RetValue) == 0x000010, "Member 'BPI_BattleMain_C_BI_GetTaskFactoryParentNameTaskCnt::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_StockSelectSeqStart
// 0x0002 (0x0002 - 0x0000)
struct BPI_BattleMain_C_BI_StockSelectSeqStart final
{
public:
	E_BTL_PTYPNL_TYPE                             Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_StockSelectSeqStart) == 0x000001, "Wrong alignment on BPI_BattleMain_C_BI_StockSelectSeqStart");
static_assert(sizeof(BPI_BattleMain_C_BI_StockSelectSeqStart) == 0x000002, "Wrong size on BPI_BattleMain_C_BI_StockSelectSeqStart");
static_assert(offsetof(BPI_BattleMain_C_BI_StockSelectSeqStart, Type) == 0x000000, "Member 'BPI_BattleMain_C_BI_StockSelectSeqStart::Type' has a wrong offset!");
static_assert(offsetof(BPI_BattleMain_C_BI_StockSelectSeqStart, RetValue) == 0x000001, "Member 'BPI_BattleMain_C_BI_StockSelectSeqStart::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_StockSelectIsFinished
// 0x0001 (0x0001 - 0x0000)
struct BPI_BattleMain_C_BI_StockSelectIsFinished final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_StockSelectIsFinished) == 0x000001, "Wrong alignment on BPI_BattleMain_C_BI_StockSelectIsFinished");
static_assert(sizeof(BPI_BattleMain_C_BI_StockSelectIsFinished) == 0x000001, "Wrong size on BPI_BattleMain_C_BI_StockSelectIsFinished");
static_assert(offsetof(BPI_BattleMain_C_BI_StockSelectIsFinished, RetValue) == 0x000000, "Member 'BPI_BattleMain_C_BI_StockSelectIsFinished::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_StockSelectIsCancel
// 0x0001 (0x0001 - 0x0000)
struct BPI_BattleMain_C_BI_StockSelectIsCancel final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_StockSelectIsCancel) == 0x000001, "Wrong alignment on BPI_BattleMain_C_BI_StockSelectIsCancel");
static_assert(sizeof(BPI_BattleMain_C_BI_StockSelectIsCancel) == 0x000001, "Wrong size on BPI_BattleMain_C_BI_StockSelectIsCancel");
static_assert(offsetof(BPI_BattleMain_C_BI_StockSelectIsCancel, RetValue) == 0x000000, "Member 'BPI_BattleMain_C_BI_StockSelectIsCancel::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_StockSelectGetResult
// 0x0004 (0x0004 - 0x0000)
struct BPI_BattleMain_C_BI_StockSelectGetResult final
{
public:
	int32                                         RetValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleMain_C_BI_StockSelectGetResult) == 0x000004, "Wrong alignment on BPI_BattleMain_C_BI_StockSelectGetResult");
static_assert(sizeof(BPI_BattleMain_C_BI_StockSelectGetResult) == 0x000004, "Wrong size on BPI_BattleMain_C_BI_StockSelectGetResult");
static_assert(offsetof(BPI_BattleMain_C_BI_StockSelectGetResult, RetValue) == 0x000000, "Member 'BPI_BattleMain_C_BI_StockSelectGetResult::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_GetPaticleManager
// 0x0010 (0x0010 - 0x0000)
struct BPI_BattleMain_C_BI_GetPaticleManager final
{
public:
	TScriptInterface<class IBPI_BattleParticleManager_C> RetValue;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_GetPaticleManager) == 0x000008, "Wrong alignment on BPI_BattleMain_C_BI_GetPaticleManager");
static_assert(sizeof(BPI_BattleMain_C_BI_GetPaticleManager) == 0x000010, "Wrong size on BPI_BattleMain_C_BI_GetPaticleManager");
static_assert(offsetof(BPI_BattleMain_C_BI_GetPaticleManager, RetValue) == 0x000000, "Member 'BPI_BattleMain_C_BI_GetPaticleManager::RetValue' has a wrong offset!");

// Function BPI_BattleMain.BPI_BattleMain_C.BI_TaskUnitModelAdd
// 0x0020 (0x0020 - 0x0000)
struct BPI_BattleMain_C_BI_TaskUnitModelAdd final
{
public:
	int32                                         TaskIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> InUnit;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RetValue;                                          // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleMain_C_BI_TaskUnitModelAdd) == 0x000008, "Wrong alignment on BPI_BattleMain_C_BI_TaskUnitModelAdd");
