#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_CampSkillCtrl

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillIsInSortMenu
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillIsInSortMenu final
{
public:
	bool                                          OutSort;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillIsInSortMenu) == 0x000001, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillIsInSortMenu");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillIsInSortMenu) == 0x000001, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillIsInSortMenu");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillIsInSortMenu, OutSort) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillIsInSortMenu::OutSort' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillSetSkillSelectButtonHelp
// 0x0008 (0x0008 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillSetSkillSelectButtonHelp final
{
public:
	int32                                         InNumber;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InInitialize;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OutParam;                                          // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillSetSkillSelectButtonHelp) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillSetSkillSelectButtonHelp");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillSetSkillSelectButtonHelp) == 0x000008, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillSetSkillSelectButtonHelp");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillSetSkillSelectButtonHelp, InNumber) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillSetSkillSelectButtonHelp::InNumber' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillSetSkillSelectButtonHelp, InInitialize) == 0x000004, "Member 'BPI_CampSkillCtrl_C_ICampSkillSetSkillSelectButtonHelp::InInitialize' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillSetSkillSelectButtonHelp, OutParam) == 0x000005, "Member 'BPI_CampSkillCtrl_C_ICampSkillSetSkillSelectButtonHelp::OutParam' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillSetPartyNumber
// 0x0008 (0x0008 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillSetPartyNumber final
{
public:
	int32                                         InPartyNumber;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutParam;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillSetPartyNumber) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillSetPartyNumber");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillSetPartyNumber) == 0x000008, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillSetPartyNumber");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillSetPartyNumber, InPartyNumber) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillSetPartyNumber::InPartyNumber' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillSetPartyNumber, OutParam) == 0x000004, "Member 'BPI_CampSkillCtrl_C_ICampSkillSetPartyNumber::OutParam' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillIsClosedSortWindow
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillIsClosedSortWindow final
{
public:
	bool                                          OutClosed;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillIsClosedSortWindow) == 0x000001, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillIsClosedSortWindow");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillIsClosedSortWindow) == 0x000001, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillIsClosedSortWindow");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillIsClosedSortWindow, OutClosed) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillIsClosedSortWindow::OutClosed' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillUpdateFusionResultMagatsuhiSkillList
// 0x000C (0x000C - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillUpdateFusionResultMagatsuhiSkillList final
{
public:
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DA6[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InDevilId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInUnknown;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillUpdateFusionResultMagatsuhiSkillList) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillUpdateFusionResultMagatsuhiSkillList");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillUpdateFusionResultMagatsuhiSkillList) == 0x00000C, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillUpdateFusionResultMagatsuhiSkillList");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdateFusionResultMagatsuhiSkillList, InPrio) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdateFusionResultMagatsuhiSkillList::InPrio' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdateFusionResultMagatsuhiSkillList, InDevilId) == 0x000004, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdateFusionResultMagatsuhiSkillList::InDevilId' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdateFusionResultMagatsuhiSkillList, bInUnknown) == 0x000008, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdateFusionResultMagatsuhiSkillList::bInUnknown' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillCreateFusionResultMagatsuhiSkillList
// 0x000C (0x000C - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillCreateFusionResultMagatsuhiSkillList final
{
public:
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DA7[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InDevilId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInUnknown;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillCreateFusionResultMagatsuhiSkillList) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillCreateFusionResultMagatsuhiSkillList");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillCreateFusionResultMagatsuhiSkillList) == 0x00000C, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillCreateFusionResultMagatsuhiSkillList");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreateFusionResultMagatsuhiSkillList, InPrio) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreateFusionResultMagatsuhiSkillList::InPrio' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreateFusionResultMagatsuhiSkillList, InDevilId) == 0x000004, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreateFusionResultMagatsuhiSkillList::InDevilId' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreateFusionResultMagatsuhiSkillList, bInUnknown) == 0x000008, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreateFusionResultMagatsuhiSkillList::bInUnknown' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillUpdateFusionResultSkillList
// 0x000C (0x000C - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillUpdateFusionResultSkillList final
{
public:
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DA8[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InDevilId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInUnknown;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillUpdateFusionResultSkillList) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillUpdateFusionResultSkillList");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillUpdateFusionResultSkillList) == 0x00000C, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillUpdateFusionResultSkillList");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdateFusionResultSkillList, InPrio) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdateFusionResultSkillList::InPrio' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdateFusionResultSkillList, InDevilId) == 0x000004, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdateFusionResultSkillList::InDevilId' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdateFusionResultSkillList, bInUnknown) == 0x000008, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdateFusionResultSkillList::bInUnknown' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillUpdateDevilBookMagatsuhiSkillList
// 0x000C (0x000C - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillUpdateDevilBookMagatsuhiSkillList final
{
public:
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DA9[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InDevilId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InDevilBookType;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillUpdateDevilBookMagatsuhiSkillList) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillUpdateDevilBookMagatsuhiSkillList");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillUpdateDevilBookMagatsuhiSkillList) == 0x00000C, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillUpdateDevilBookMagatsuhiSkillList");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdateDevilBookMagatsuhiSkillList, InPrio) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdateDevilBookMagatsuhiSkillList::InPrio' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdateDevilBookMagatsuhiSkillList, InDevilId) == 0x000004, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdateDevilBookMagatsuhiSkillList::InDevilId' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdateDevilBookMagatsuhiSkillList, InDevilBookType) == 0x000008, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdateDevilBookMagatsuhiSkillList::InDevilBookType' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillCreateDevilBookMagatsuhiSkillList
// 0x000C (0x000C - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillCreateDevilBookMagatsuhiSkillList final
{
public:
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DAA[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InDevilId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InDevilBookType;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillCreateDevilBookMagatsuhiSkillList) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillCreateDevilBookMagatsuhiSkillList");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillCreateDevilBookMagatsuhiSkillList) == 0x00000C, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillCreateDevilBookMagatsuhiSkillList");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreateDevilBookMagatsuhiSkillList, InPrio) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreateDevilBookMagatsuhiSkillList::InPrio' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreateDevilBookMagatsuhiSkillList, InDevilId) == 0x000004, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreateDevilBookMagatsuhiSkillList::InDevilId' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreateDevilBookMagatsuhiSkillList, InDevilBookType) == 0x000008, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreateDevilBookMagatsuhiSkillList::InDevilBookType' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillUpdateDevilBookSkillList
// 0x000C (0x000C - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillUpdateDevilBookSkillList final
{
public:
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DAB[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InDevilId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InDevilBookType;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillUpdateDevilBookSkillList) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillUpdateDevilBookSkillList");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillUpdateDevilBookSkillList) == 0x00000C, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillUpdateDevilBookSkillList");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdateDevilBookSkillList, InPrio) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdateDevilBookSkillList::InPrio' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdateDevilBookSkillList, InDevilId) == 0x000004, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdateDevilBookSkillList::InDevilId' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdateDevilBookSkillList, InDevilBookType) == 0x000008, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdateDevilBookSkillList::InDevilBookType' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillUpdateAnalyzeMagatsuhiSkillList
// 0x0008 (0x0008 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillUpdateAnalyzeMagatsuhiSkillList final
{
public:
	E_WIDGET_PRIO                                 InPriority;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DAC[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InDevilId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillUpdateAnalyzeMagatsuhiSkillList) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillUpdateAnalyzeMagatsuhiSkillList");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillUpdateAnalyzeMagatsuhiSkillList) == 0x000008, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillUpdateAnalyzeMagatsuhiSkillList");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdateAnalyzeMagatsuhiSkillList, InPriority) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdateAnalyzeMagatsuhiSkillList::InPriority' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdateAnalyzeMagatsuhiSkillList, InDevilId) == 0x000004, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdateAnalyzeMagatsuhiSkillList::InDevilId' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillCreateAnalyzeMagatsuhiSkillList
// 0x000C (0x000C - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillCreateAnalyzeMagatsuhiSkillList final
{
public:
	E_WIDGET_PRIO                                 InPriority;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DAD[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InDevilId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InInitialize;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillCreateAnalyzeMagatsuhiSkillList) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillCreateAnalyzeMagatsuhiSkillList");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillCreateAnalyzeMagatsuhiSkillList) == 0x00000C, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillCreateAnalyzeMagatsuhiSkillList");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreateAnalyzeMagatsuhiSkillList, InPriority) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreateAnalyzeMagatsuhiSkillList::InPriority' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreateAnalyzeMagatsuhiSkillList, InDevilId) == 0x000004, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreateAnalyzeMagatsuhiSkillList::InDevilId' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreateAnalyzeMagatsuhiSkillList, InInitialize) == 0x000008, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreateAnalyzeMagatsuhiSkillList::InInitialize' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillUpdatePartyMagatsuhiSkillList
// 0x0008 (0x0008 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillUpdatePartyMagatsuhiSkillList final
{
public:
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DAE[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InNkmIndex;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillUpdatePartyMagatsuhiSkillList) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillUpdatePartyMagatsuhiSkillList");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillUpdatePartyMagatsuhiSkillList) == 0x000008, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillUpdatePartyMagatsuhiSkillList");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdatePartyMagatsuhiSkillList, InPrio) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdatePartyMagatsuhiSkillList::InPrio' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdatePartyMagatsuhiSkillList, InNkmIndex) == 0x000004, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdatePartyMagatsuhiSkillList::InNkmIndex' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillCreatePartyMagatsuhiSkillList
// 0x0008 (0x0008 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillCreatePartyMagatsuhiSkillList final
{
public:
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DAF[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InNkmIndex;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillCreatePartyMagatsuhiSkillList) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillCreatePartyMagatsuhiSkillList");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillCreatePartyMagatsuhiSkillList) == 0x000008, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillCreatePartyMagatsuhiSkillList");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreatePartyMagatsuhiSkillList, InPrio) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreatePartyMagatsuhiSkillList::InPrio' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreatePartyMagatsuhiSkillList, InNkmIndex) == 0x000004, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreatePartyMagatsuhiSkillList::InNkmIndex' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillIsOpenStatus
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillIsOpenStatus final
{
public:
	bool                                          CallStatusOpen;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillIsOpenStatus) == 0x000001, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillIsOpenStatus");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillIsOpenStatus) == 0x000001, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillIsOpenStatus");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillIsOpenStatus, CallStatusOpen) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillIsOpenStatus::CallStatusOpen' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillUpdateUtsusemiSkillListForCampOnly
// 0x0008 (0x0008 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillUpdateUtsusemiSkillListForCampOnly final
{
public:
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DB0[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InDevilId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillUpdateUtsusemiSkillListForCampOnly) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillUpdateUtsusemiSkillListForCampOnly");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillUpdateUtsusemiSkillListForCampOnly) == 0x000008, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillUpdateUtsusemiSkillListForCampOnly");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdateUtsusemiSkillListForCampOnly, InPrio) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdateUtsusemiSkillListForCampOnly::InPrio' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdateUtsusemiSkillListForCampOnly, InDevilId) == 0x000004, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdateUtsusemiSkillListForCampOnly::InDevilId' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillCreateUtsusemiSkillListForCampOnly
// 0x0008 (0x0008 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillCreateUtsusemiSkillListForCampOnly final
{
public:
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DB1[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InDevilId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillCreateUtsusemiSkillListForCampOnly) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillCreateUtsusemiSkillListForCampOnly");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillCreateUtsusemiSkillListForCampOnly) == 0x000008, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillCreateUtsusemiSkillListForCampOnly");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreateUtsusemiSkillListForCampOnly, InPrio) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreateUtsusemiSkillListForCampOnly::InPrio' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreateUtsusemiSkillListForCampOnly, InDevilId) == 0x000004, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreateUtsusemiSkillListForCampOnly::InDevilId' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillIsListAnimation
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillIsListAnimation final
{
public:
	bool                                          OutIsAnimation;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillIsListAnimation) == 0x000001, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillIsListAnimation");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillIsListAnimation) == 0x000001, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillIsListAnimation");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillIsListAnimation, OutIsAnimation) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillIsListAnimation::OutIsAnimation' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillIsWaitPartyEnd
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillIsWaitPartyEnd final
{
public:
	bool                                          OutEnd;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillIsWaitPartyEnd) == 0x000001, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillIsWaitPartyEnd");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillIsWaitPartyEnd) == 0x000001, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillIsWaitPartyEnd");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillIsWaitPartyEnd, OutEnd) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillIsWaitPartyEnd::OutEnd' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillGetListFadeOut
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillGetListFadeOut final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillGetListFadeOut) == 0x000001, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillGetListFadeOut");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillGetListFadeOut) == 0x000001, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillGetListFadeOut");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillGetListFadeOut, OutFlag) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillGetListFadeOut::OutFlag' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillUpdateAnalyzeSkillList
// 0x0008 (0x0008 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillUpdateAnalyzeSkillList final
{
public:
	E_WIDGET_PRIO                                 InPriorty;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DB2[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InDevilId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillUpdateAnalyzeSkillList) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillUpdateAnalyzeSkillList");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillUpdateAnalyzeSkillList) == 0x000008, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillUpdateAnalyzeSkillList");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdateAnalyzeSkillList, InPriorty) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdateAnalyzeSkillList::InPriorty' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdateAnalyzeSkillList, InDevilId) == 0x000004, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdateAnalyzeSkillList::InDevilId' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillUpdateUtsusemiSkillList
// 0x0008 (0x0008 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillUpdateUtsusemiSkillList final
{
public:
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DB3[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InDevilId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillUpdateUtsusemiSkillList) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillUpdateUtsusemiSkillList");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillUpdateUtsusemiSkillList) == 0x000008, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillUpdateUtsusemiSkillList");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdateUtsusemiSkillList, InPrio) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdateUtsusemiSkillList::InPrio' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdateUtsusemiSkillList, InDevilId) == 0x000004, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdateUtsusemiSkillList::InDevilId' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillUpdatePartySkillList
// 0x0008 (0x0008 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillUpdatePartySkillList final
{
public:
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DB4[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InNkmIndex;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillUpdatePartySkillList) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillUpdatePartySkillList");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillUpdatePartySkillList) == 0x000008, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillUpdatePartySkillList");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdatePartySkillList, InPrio) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdatePartySkillList::InPrio' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUpdatePartySkillList, InNkmIndex) == 0x000004, "Member 'BPI_CampSkillCtrl_C_ICampSkillUpdatePartySkillList::InNkmIndex' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillCreateFusionResultSkillList
// 0x000C (0x000C - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillCreateFusionResultSkillList final
{
public:
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DB5[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InDevilId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInUnknown;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillCreateFusionResultSkillList) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillCreateFusionResultSkillList");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillCreateFusionResultSkillList) == 0x00000C, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillCreateFusionResultSkillList");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreateFusionResultSkillList, InPrio) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreateFusionResultSkillList::InPrio' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreateFusionResultSkillList, InDevilId) == 0x000004, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreateFusionResultSkillList::InDevilId' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreateFusionResultSkillList, bInUnknown) == 0x000008, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreateFusionResultSkillList::bInUnknown' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillCreateDevilBookSkillList
// 0x000C (0x000C - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillCreateDevilBookSkillList final
{
public:
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DB6[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InDevilId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InDevilBookType;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillCreateDevilBookSkillList) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillCreateDevilBookSkillList");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillCreateDevilBookSkillList) == 0x00000C, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillCreateDevilBookSkillList");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreateDevilBookSkillList, InPrio) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreateDevilBookSkillList::InPrio' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreateDevilBookSkillList, InDevilId) == 0x000004, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreateDevilBookSkillList::InDevilId' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreateDevilBookSkillList, InDevilBookType) == 0x000008, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreateDevilBookSkillList::InDevilBookType' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillUtsusemiProc
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillUtsusemiProc final
{
public:
	bool                                          OutIsCanseled;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillUtsusemiProc) == 0x000001, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillUtsusemiProc");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillUtsusemiProc) == 0x000001, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillUtsusemiProc");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillUtsusemiProc, OutIsCanseled) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillUtsusemiProc::OutIsCanseled' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillCreateUtsusemiSkillList
// 0x0008 (0x0008 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillCreateUtsusemiSkillList final
{
public:
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DB7[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InDevilId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillCreateUtsusemiSkillList) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillCreateUtsusemiSkillList");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillCreateUtsusemiSkillList) == 0x000008, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillCreateUtsusemiSkillList");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreateUtsusemiSkillList, InPrio) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreateUtsusemiSkillList::InPrio' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreateUtsusemiSkillList, InDevilId) == 0x000004, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreateUtsusemiSkillList::InDevilId' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillCreatePartySkillList
// 0x0008 (0x0008 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillCreatePartySkillList final
{
public:
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DB8[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InNkmIndex;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillCreatePartySkillList) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillCreatePartySkillList");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillCreatePartySkillList) == 0x000008, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillCreatePartySkillList");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreatePartySkillList, InPrio) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreatePartySkillList::InPrio' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreatePartySkillList, InNkmIndex) == 0x000004, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreatePartySkillList::InNkmIndex' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillCreateAnalyzeSkillList
// 0x000C (0x000C - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillCreateAnalyzeSkillList final
{
public:
	E_WIDGET_PRIO                                 InPriorty;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DB9[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InDevilId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InInitialize;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillCreateAnalyzeSkillList) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillCreateAnalyzeSkillList");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillCreateAnalyzeSkillList) == 0x00000C, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillCreateAnalyzeSkillList");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreateAnalyzeSkillList, InPriorty) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreateAnalyzeSkillList::InPriorty' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreateAnalyzeSkillList, InDevilId) == 0x000004, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreateAnalyzeSkillList::InDevilId' has a wrong offset!");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreateAnalyzeSkillList, InInitialize) == 0x000008, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreateAnalyzeSkillList::InInitialize' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.IIsCampSkillMoveCursor
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampSkillCtrl_C_IIsCampSkillMoveCursor final
{
public:
	bool                                          OutMoved;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampSkillCtrl_C_IIsCampSkillMoveCursor) == 0x000001, "Wrong alignment on BPI_CampSkillCtrl_C_IIsCampSkillMoveCursor");
static_assert(sizeof(BPI_CampSkillCtrl_C_IIsCampSkillMoveCursor) == 0x000001, "Wrong size on BPI_CampSkillCtrl_C_IIsCampSkillMoveCursor");
static_assert(offsetof(BPI_CampSkillCtrl_C_IIsCampSkillMoveCursor, OutMoved) == 0x000000, "Member 'BPI_CampSkillCtrl_C_IIsCampSkillMoveCursor::OutMoved' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillGetSelectedNkmIndex
// 0x0004 (0x0004 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillGetSelectedNkmIndex final
{
public:
	int32                                         OutNkmIndex;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillGetSelectedNkmIndex) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillGetSelectedNkmIndex");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillGetSelectedNkmIndex) == 0x000004, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillGetSelectedNkmIndex");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillGetSelectedNkmIndex, OutNkmIndex) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillGetSelectedNkmIndex::OutNkmIndex' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillGetReasonForCansel
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillGetReasonForCansel final
{
public:
	E_CAMPSKILLLIST_CANSELTYPE                    OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillGetReasonForCansel) == 0x000001, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillGetReasonForCansel");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillGetReasonForCansel) == 0x000001, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillGetReasonForCansel");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillGetReasonForCansel, OutParam) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillGetReasonForCansel::OutParam' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillReselectSkill
// 0x0004 (0x0004 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillReselectSkill final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillReselectSkill) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillReselectSkill");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillReselectSkill) == 0x000004, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillReselectSkill");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillReselectSkill, InType) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillReselectSkill::InType' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.IIsCampSkillUseSkillProc
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampSkillCtrl_C_IIsCampSkillUseSkillProc final
{
public:
	bool                                          OutUsed;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampSkillCtrl_C_IIsCampSkillUseSkillProc) == 0x000001, "Wrong alignment on BPI_CampSkillCtrl_C_IIsCampSkillUseSkillProc");
static_assert(sizeof(BPI_CampSkillCtrl_C_IIsCampSkillUseSkillProc) == 0x000001, "Wrong size on BPI_CampSkillCtrl_C_IIsCampSkillUseSkillProc");
static_assert(offsetof(BPI_CampSkillCtrl_C_IIsCampSkillUseSkillProc, OutUsed) == 0x000000, "Member 'BPI_CampSkillCtrl_C_IIsCampSkillUseSkillProc::OutUsed' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillGetSelectedSkillId
// 0x0004 (0x0004 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillGetSelectedSkillId final
{
public:
	int32                                         OutSkillId;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillGetSelectedSkillId) == 0x000004, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillGetSelectedSkillId");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillGetSelectedSkillId) == 0x000004, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillGetSelectedSkillId");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillGetSelectedSkillId, OutSkillId) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillGetSelectedSkillId::OutSkillId' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillProc
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillProc final
{
public:
	bool                                          OutIsCanseled;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillProc) == 0x000001, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillProc");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillProc) == 0x000001, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillProc");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillProc, OutIsCanseled) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillProc::OutIsCanseled' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillIsFinished
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillIsFinished final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillIsFinished) == 0x000001, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillIsFinished");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillIsFinished) == 0x000001, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillIsFinished");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillIsFinished, OutFinished) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillIsFinished::OutFinished' has a wrong offset!");

// Function BPI_CampSkillCtrl.BPI_CampSkillCtrl_C.ICampSkillCreate
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampSkillCtrl_C_ICampSkillCreate final
{
public:
	E_WIDGET_PRIO                                 InPriority;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampSkillCtrl_C_ICampSkillCreate) == 0x000001, "Wrong alignment on BPI_CampSkillCtrl_C_ICampSkillCreate");
static_assert(sizeof(BPI_CampSkillCtrl_C_ICampSkillCreate) == 0x000001, "Wrong size on BPI_CampSkillCtrl_C_ICampSkillCreate");
static_assert(offsetof(BPI_CampSkillCtrl_C_ICampSkillCreate, InPriority) == 0x000000, "Member 'BPI_CampSkillCtrl_C_ICampSkillCreate::InPriority' has a wrong offset!");

}

