#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_CampCharaPanelCtrl

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelSetItemNumPosition
// 0x0014 (0x0014 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetItemNumPosition final
{
public:
	struct FVector2D                              InMainPosition;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              InStockPosition;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutParam;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetItemNumPosition) == 0x000004, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetItemNumPosition");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetItemNumPosition) == 0x000014, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetItemNumPosition");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetItemNumPosition, InMainPosition) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetItemNumPosition::InMainPosition' has a wrong offset!");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetItemNumPosition, InStockPosition) == 0x000008, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetItemNumPosition::InStockPosition' has a wrong offset!");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetItemNumPosition, OutParam) == 0x000010, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetItemNumPosition::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelGetMaxNumberOfItem
// 0x0004 (0x0004 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetMaxNumberOfItem final
{
public:
	int32                                         OutLevel;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetMaxNumberOfItem) == 0x000004, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetMaxNumberOfItem");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetMaxNumberOfItem) == 0x000004, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetMaxNumberOfItem");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetMaxNumberOfItem, OutLevel) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetMaxNumberOfItem::OutLevel' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelIsChangeParameter
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsChangeParameter final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsChangeParameter) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsChangeParameter");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsChangeParameter) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsChangeParameter");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsChangeParameter, OutFlag) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsChangeParameter::OutFlag' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelLevelUpVisibleOff
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelLevelUpVisibleOff final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelLevelUpVisibleOff) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelLevelUpVisibleOff");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelLevelUpVisibleOff) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelLevelUpVisibleOff");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelLevelUpVisibleOff, OutFlag) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelLevelUpVisibleOff::OutFlag' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelRestartLevelUpVisible
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible, OutFlag) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUpVisible::OutFlag' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelRestartLevelUp
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUp final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUp) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUp");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUp) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUp");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUp, OutFlag) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelRestartLevelUp::OutFlag' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelIsLevelUp
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsLevelUp final
{
public:
	bool                                          OutLevelUp;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsLevelUp) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsLevelUp");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsLevelUp) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsLevelUp");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsLevelUp, OutLevelUp) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsLevelUp::OutLevelUp' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelResetPartyMouseFlag
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFlag final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFlag) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFlag");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFlag) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFlag");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFlag, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFlag::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelResetPartyMouseFocus
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFocus final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFocus) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFocus");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFocus) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFocus");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFocus, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetPartyMouseFocus::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelSetPartyMouseFocus
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyMouseFocus final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyMouseFocus) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyMouseFocus");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyMouseFocus) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyMouseFocus");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyMouseFocus, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyMouseFocus::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelInitializeProc
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelInitializeProc final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelInitializeProc) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelInitializeProc");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelInitializeProc) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelInitializeProc");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelInitializeProc, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelInitializeProc::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelIsInitialized
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsInitialized final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsInitialized) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsInitialized");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsInitialized) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsInitialized");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsInitialized, OutFinished) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsInitialized::OutFinished' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelResetUnselectablePanel
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetUnselectablePanel final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetUnselectablePanel) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetUnselectablePanel");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetUnselectablePanel) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetUnselectablePanel");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetUnselectablePanel, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetUnselectablePanel::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelResetAllActorPanel
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetAllActorPanel final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetAllActorPanel) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetAllActorPanel");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetAllActorPanel) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetAllActorPanel");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetAllActorPanel, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetAllActorPanel::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelGetPanelDispNumber
// 0x0004 (0x0004 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetPanelDispNumber final
{
public:
	int32                                         OutNumber;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetPanelDispNumber) == 0x000004, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetPanelDispNumber");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetPanelDispNumber) == 0x000004, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetPanelDispNumber");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetPanelDispNumber, OutNumber) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetPanelDispNumber::OutNumber' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelCalcCharaPanelMove
// 0x0008 (0x0008 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelCalcCharaPanelMove final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutParam;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelCalcCharaPanelMove) == 0x000004, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelCalcCharaPanelMove");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelCalcCharaPanelMove) == 0x000008, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelCalcCharaPanelMove");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelCalcCharaPanelMove, InType) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelCalcCharaPanelMove::InType' has a wrong offset!");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelCalcCharaPanelMove, OutParam) == 0x000004, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelCalcCharaPanelMove::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelResetStateItemHelp
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetStateItemHelp final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetStateItemHelp) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetStateItemHelp");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetStateItemHelp) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetStateItemHelp");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetStateItemHelp, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetStateItemHelp::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelIsStateItemHelp
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsStateItemHelp final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsStateItemHelp) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsStateItemHelp");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsStateItemHelp) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsStateItemHelp");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsStateItemHelp, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsStateItemHelp::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelSetAnalyzeButtoneHelp
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetAnalyzeButtoneHelp final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetAnalyzeButtoneHelp) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetAnalyzeButtoneHelp");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetAnalyzeButtoneHelp) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetAnalyzeButtoneHelp");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetAnalyzeButtoneHelp, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetAnalyzeButtoneHelp::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelUpdate
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelUpdate final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelUpdate) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelUpdate");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelUpdate) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelUpdate");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelUpdate, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelUpdate::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelSetPartyOffsetByNkmIndex
// 0x0008 (0x0008 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex final
{
public:
	int32                                         InNkmIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutParam;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex) == 0x000004, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex) == 0x000008, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex, InNkmIndex) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex::InNkmIndex' has a wrong offset!");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex, OutParam) == 0x000004, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetPartyOffsetByNkmIndex::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelResetAllNewIcon
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetAllNewIcon final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetAllNewIcon) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetAllNewIcon");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetAllNewIcon) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetAllNewIcon");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetAllNewIcon, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetAllNewIcon::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelIsFinishedCharaPanel
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsFinishedCharaPanel final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsFinishedCharaPanel) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsFinishedCharaPanel");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsFinishedCharaPanel) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsFinishedCharaPanel");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsFinishedCharaPanel, OutFinished) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsFinishedCharaPanel::OutFinished' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelSetSkillReserveHPMPParam
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetSkillReserveHPMPParam final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetSkillReserveHPMPParam) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetSkillReserveHPMPParam");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetSkillReserveHPMPParam) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetSkillReserveHPMPParam");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetSkillReserveHPMPParam, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetSkillReserveHPMPParam::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelResetMenuBGOffFlag
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOffFlag final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOffFlag) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOffFlag");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOffFlag) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOffFlag");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOffFlag, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOffFlag::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelResetMenuBGOnFlag
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOnFlag final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOnFlag) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOnFlag");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOnFlag) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOnFlag");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOnFlag, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetMenuBGOnFlag::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelIsMenuBGOff
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOff final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOff) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOff");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOff) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOff");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOff, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOff::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelIsMenuBGOn
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOn final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOn) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOn");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOn) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOn");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOn, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMenuBGOn::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelIsRestartSkillList
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartSkillList final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartSkillList) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartSkillList");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartSkillList) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartSkillList");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartSkillList, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartSkillList::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelSetSStatusButtonHelp
// 0x0004 (0x0004 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetSStatusButtonHelp final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetSStatusButtonHelp) == 0x000004, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetSStatusButtonHelp");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetSStatusButtonHelp) == 0x000004, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetSStatusButtonHelp");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetSStatusButtonHelp, InType) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetSStatusButtonHelp::InType' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelIsRestartItemList
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartItemList final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartItemList) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartItemList");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartItemList) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartItemList");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartItemList, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsRestartItemList::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelIsDeleteStatusItemList
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteStatusItemList final
{
public:
	bool                                          OutDelete;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteStatusItemList) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteStatusItemList");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteStatusItemList) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteStatusItemList");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteStatusItemList, OutDelete) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteStatusItemList::OutDelete' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelResetTitleOnFlag
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOnFlag final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOnFlag) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOnFlag");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOnFlag) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOnFlag");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOnFlag, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOnFlag::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelIsMainTitleOn
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOn final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOn) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOn");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOn) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOn");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOn, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOn::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelResetTitleOffFlag
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOffFlag final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOffFlag) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOffFlag");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOffFlag) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOffFlag");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOffFlag, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetTitleOffFlag::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelIsMainTitleOff
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOff final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOff) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOff");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOff) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOff");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOff, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsMainTitleOff::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelSetUStatusButtonHelp
// 0x0004 (0x0004 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetUStatusButtonHelp final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetUStatusButtonHelp) == 0x000004, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetUStatusButtonHelp");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetUStatusButtonHelp) == 0x000004, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetUStatusButtonHelp");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetUStatusButtonHelp, InType) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetUStatusButtonHelp::InType' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelSetAStatusButtonHelp
// 0x0004 (0x0004 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetAStatusButtonHelp final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetAStatusButtonHelp) == 0x000004, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetAStatusButtonHelp");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetAStatusButtonHelp) == 0x000004, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetAStatusButtonHelp");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetAStatusButtonHelp, InType) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetAStatusButtonHelp::InType' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelSkillUserStatusCtrInit
// 0x0008 (0x0008 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit final
{
public:
	int32                                         NkmIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsParty;                                           // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Dummy;                                             // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit) == 0x000004, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit) == 0x000008, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit, NkmIndex) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit::NkmIndex' has a wrong offset!");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit, IsParty) == 0x000004, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit::IsParty' has a wrong offset!");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit, Dummy) == 0x000005, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrInit::Dummy' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelSkillUserStatusCtrlStart
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrlStart final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrlStart) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrlStart");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrlStart) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrlStart");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrlStart, Dummy) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrlStart::Dummy' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelSkillUserStatusCtrl
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrl final
{
public:
	bool                                          IsEnd;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrl) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrl");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrl) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrl");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrl, IsEnd) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelSkillUserStatusCtrl::IsEnd' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelIsDeleteSStatusSkillList
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteSStatusSkillList final
{
public:
	bool                                          OutDelete;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteSStatusSkillList) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteSStatusSkillList");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteSStatusSkillList) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteSStatusSkillList");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteSStatusSkillList, OutDelete) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsDeleteSStatusSkillList::OutDelete' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelSetSStatusStep
// 0x0004 (0x0004 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetSStatusStep final
{
public:
	int32                                         InStep;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetSStatusStep) == 0x000004, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetSStatusStep");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetSStatusStep) == 0x000004, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetSStatusStep");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetSStatusStep, InStep) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetSStatusStep::InStep' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelGetSStatusStep
// 0x0004 (0x0004 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusStep final
{
public:
	int32                                         OutStep;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusStep) == 0x000004, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusStep");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusStep) == 0x000004, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusStep");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusStep, OutStep) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusStep::OutStep' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelGetSStatusType
// 0x0004 (0x0004 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusType final
{
public:
	int32                                         OutType;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusType) == 0x000004, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusType");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusType) == 0x000004, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusType");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusType, OutType) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetSStatusType::OutType' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelGetUtsusemiCount
// 0x0004 (0x0004 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiCount final
{
public:
	int32                                         OutNumber;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiCount) == 0x000004, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiCount");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiCount) == 0x000004, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiCount");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiCount, OutNumber) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiCount::OutNumber' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelGetAnalyzeCount
// 0x0004 (0x0004 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetAnalyzeCount final
{
public:
	int32                                         OutNumber;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetAnalyzeCount) == 0x000004, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetAnalyzeCount");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetAnalyzeCount) == 0x000004, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetAnalyzeCount");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetAnalyzeCount, OutNumber) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetAnalyzeCount::OutNumber' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelResetReserveMPCost
// 0x0004 (0x0004 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetReserveMPCost final
{
public:
	int32                                         InNkmIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetReserveMPCost) == 0x000004, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetReserveMPCost");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetReserveMPCost) == 0x000004, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetReserveMPCost");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetReserveMPCost, InNkmIndex) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelResetReserveMPCost::InNkmIndex' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelSetReserveMPCost
// 0x0008 (0x0008 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetReserveMPCost final
{
public:
	int32                                         InSkillId;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InNkmIndex;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetReserveMPCost) == 0x000004, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetReserveMPCost");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetReserveMPCost) == 0x000008, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetReserveMPCost");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetReserveMPCost, InSkillId) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetReserveMPCost::InSkillId' has a wrong offset!");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetReserveMPCost, InNkmIndex) == 0x000004, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetReserveMPCost::InNkmIndex' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelIsNewIconOfAllUtsusemiOff
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsNewIconOfAllUtsusemiOff final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsNewIconOfAllUtsusemiOff) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsNewIconOfAllUtsusemiOff");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsNewIconOfAllUtsusemiOff) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsNewIconOfAllUtsusemiOff");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsNewIconOfAllUtsusemiOff, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsNewIconOfAllUtsusemiOff::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelIsNewIconOfAllAnalyzesOff
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsNewIconOfAllAnalyzesOff final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsNewIconOfAllAnalyzesOff) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsNewIconOfAllAnalyzesOff");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsNewIconOfAllAnalyzesOff) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsNewIconOfAllAnalyzesOff");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsNewIconOfAllAnalyzesOff, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelIsNewIconOfAllAnalyzesOff::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelSetFadeOut
// 0x0004 (0x0004 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetFadeOut final
{
public:
	int32                                         InMenuType;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetFadeOut) == 0x000004, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetFadeOut");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetFadeOut) == 0x000004, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetFadeOut");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetFadeOut, InMenuType) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelSetFadeOut::InMenuType' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.IIsCampCharaPanelSelectedUtsusemiSkillList
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_IIsCampCharaPanelSelectedUtsusemiSkillList final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_IIsCampCharaPanelSelectedUtsusemiSkillList) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_IIsCampCharaPanelSelectedUtsusemiSkillList");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_IIsCampCharaPanelSelectedUtsusemiSkillList) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_IIsCampCharaPanelSelectedUtsusemiSkillList");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_IIsCampCharaPanelSelectedUtsusemiSkillList, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_IIsCampCharaPanelSelectedUtsusemiSkillList::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelGetUtsusemiDevilId
// 0x0004 (0x0004 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiDevilId final
{
public:
	int32                                         OutDevilId;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiDevilId) == 0x000004, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiDevilId");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiDevilId) == 0x000004, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiDevilId");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiDevilId, OutDevilId) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetUtsusemiDevilId::OutDevilId' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.IIsCampCharaPanelSetUtsusemiSkillList
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_IIsCampCharaPanelSetUtsusemiSkillList final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_IIsCampCharaPanelSetUtsusemiSkillList) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_IIsCampCharaPanelSetUtsusemiSkillList");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_IIsCampCharaPanelSetUtsusemiSkillList) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_IIsCampCharaPanelSetUtsusemiSkillList");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_IIsCampCharaPanelSetUtsusemiSkillList, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_IIsCampCharaPanelSetUtsusemiSkillList::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelUtsusemiProc
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelUtsusemiProc final
{
public:
	bool                                          IsCanseled;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelUtsusemiProc) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelUtsusemiProc");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelUtsusemiProc) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelUtsusemiProc");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelUtsusemiProc, IsCanseled) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelUtsusemiProc::IsCanseled' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelCreateUtsusemiPanel
// 0x000C (0x000C - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelCreateUtsusemiPanel final
{
public:
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DBA[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              InMainPosition;                                    // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelCreateUtsusemiPanel) == 0x000004, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelCreateUtsusemiPanel");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelCreateUtsusemiPanel) == 0x00000C, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelCreateUtsusemiPanel");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelCreateUtsusemiPanel, InPrio) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelCreateUtsusemiPanel::InPrio' has a wrong offset!");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelCreateUtsusemiPanel, InMainPosition) == 0x000004, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelCreateUtsusemiPanel::InMainPosition' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelGetPartyNkmIndex
// 0x0004 (0x0004 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetPartyNkmIndex final
{
public:
	int32                                         OutNkmIndex;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetPartyNkmIndex) == 0x000004, "Wrong alignment on BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetPartyNkmIndex");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetPartyNkmIndex) == 0x000004, "Wrong size on BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetPartyNkmIndex");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetPartyNkmIndex, OutNkmIndex) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_ICampCharaPanelGetPartyNkmIndex::OutNkmIndex' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.IIsCampCharaPanelSetPartySkillList
// 0x0001 (0x0001 - 0x0000)
struct BPI_CampCharaPanelCtrl_C_IIsCampCharaPanelSetPartySkillList final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_CampCharaPanelCtrl_C_IIsCampCharaPanelSetPartySkillList) == 0x000001, "Wrong alignment on BPI_CampCharaPanelCtrl_C_IIsCampCharaPanelSetPartySkillList");
static_assert(sizeof(BPI_CampCharaPanelCtrl_C_IIsCampCharaPanelSetPartySkillList) == 0x000001, "Wrong size on BPI_CampCharaPanelCtrl_C_IIsCampCharaPanelSetPartySkillList");
static_assert(offsetof(BPI_CampCharaPanelCtrl_C_IIsCampCharaPanelSetPartySkillList, OutParam) == 0x000000, "Member 'BPI_CampCharaPanelCtrl_C_IIsCampCharaPanelSetPartySkillList::OutParam' has a wrong offset!");

// Function BPI_CampCharaPanelCtrl.BPI_CampCharaPanelCtrl_C.ICampCharaPanelGetAnalyzeDevilId
