#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_EventBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_EventBase.BPI_EventBase_C.BI_EB_PlayStart
// 0x0001 (0x0001 - 0x0000)
struct BPI_EventBase_C_BI_EB_PlayStart final
{
public:
	bool                                          NoUse;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_EventBase_C_BI_EB_PlayStart) == 0x000001, "Wrong alignment on BPI_EventBase_C_BI_EB_PlayStart");
static_assert(sizeof(BPI_EventBase_C_BI_EB_PlayStart) == 0x000001, "Wrong size on BPI_EventBase_C_BI_EB_PlayStart");
static_assert(offsetof(BPI_EventBase_C_BI_EB_PlayStart, NoUse) == 0x000000, "Member 'BPI_EventBase_C_BI_EB_PlayStart::NoUse' has a wrong offset!");

// Function BPI_EventBase.BPI_EventBase_C.BI_EB_IsFinish
// 0x0001 (0x0001 - 0x0000)
struct BPI_EventBase_C_BI_EB_IsFinish final
{
public:
	bool                                          Finish;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_EventBase_C_BI_EB_IsFinish) == 0x000001, "Wrong alignment on BPI_EventBase_C_BI_EB_IsFinish");
static_assert(sizeof(BPI_EventBase_C_BI_EB_IsFinish) == 0x000001, "Wrong size on BPI_EventBase_C_BI_EB_IsFinish");
static_assert(offsetof(BPI_EventBase_C_BI_EB_IsFinish, Finish) == 0x000000, "Member 'BPI_EventBase_C_BI_EB_IsFinish::Finish' has a wrong offset!");

}

