#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_ConvertSaveData

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_ConvertSaveData.BPI_ConvertSaveData_C.IsEnd
// 0x0001 (0x0001 - 0x0000)
struct BPI_ConvertSaveData_C_IsEnd final
{
public:
	bool                                          Param_IsEnd;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ConvertSaveData_C_IsEnd) == 0x000001, "Wrong alignment on BPI_ConvertSaveData_C_IsEnd");
static_assert(sizeof(BPI_ConvertSaveData_C_IsEnd) == 0x000001, "Wrong size on BPI_ConvertSaveData_C_IsEnd");
static_assert(offsetof(BPI_ConvertSaveData_C_IsEnd, Param_IsEnd) == 0x000000, "Member 'BPI_ConvertSaveData_C_IsEnd::Param_IsEnd' has a wrong offset!");

// Function BPI_ConvertSaveData.BPI_ConvertSaveData_C.GetResult
// 0x0001 (0x0001 - 0x0000)
struct BPI_ConvertSaveData_C_GetResult final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ConvertSaveData_C_GetResult) == 0x000001, "Wrong alignment on BPI_ConvertSaveData_C_GetResult");
static_assert(sizeof(BPI_ConvertSaveData_C_GetResult) == 0x000001, "Wrong size on BPI_ConvertSaveData_C_GetResult");
static_assert(offsetof(BPI_ConvertSaveData_C_GetResult, Success) == 0x000000, "Member 'BPI_ConvertSaveData_C_GetResult::Success' has a wrong offset!");

}

