#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_PlayerInputReceiver

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_PlayerInputReceiver.BPI_PlayerInputReceiver_C.IsAutoRunning
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInputReceiver_C_IsAutoRunning final
{
public:
	bool                                          bAutoRunning;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInputReceiver_C_IsAutoRunning) == 0x000001, "Wrong alignment on BPI_PlayerInputReceiver_C_IsAutoRunning");
static_assert(sizeof(BPI_PlayerInputReceiver_C_IsAutoRunning) == 0x000001, "Wrong size on BPI_PlayerInputReceiver_C_IsAutoRunning");
static_assert(offsetof(BPI_PlayerInputReceiver_C_IsAutoRunning, bAutoRunning) == 0x000000, "Member 'BPI_PlayerInputReceiver_C_IsAutoRunning::bAutoRunning' has a wrong offset!");

// Function BPI_PlayerInputReceiver.BPI_PlayerInputReceiver_C.IsDashing
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInputReceiver_C_IsDashing final
{
public:
	bool                                          bDashing;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInputReceiver_C_IsDashing) == 0x000001, "Wrong alignment on BPI_PlayerInputReceiver_C_IsDashing");
static_assert(sizeof(BPI_PlayerInputReceiver_C_IsDashing) == 0x000001, "Wrong size on BPI_PlayerInputReceiver_C_IsDashing");
static_assert(offsetof(BPI_PlayerInputReceiver_C_IsDashing, bDashing) == 0x000000, "Member 'BPI_PlayerInputReceiver_C_IsDashing::bDashing' has a wrong offset!");

}

