#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_BattleNumberActor

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_BattleNumberActor.BPI_BattleNumberActor_C.BI_IsFinished
// 0x0001 (0x0001 - 0x0000)
struct BPI_BattleNumberActor_C_BI_IsFinished final
{
public:
	bool                                          IsFinished;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleNumberActor_C_BI_IsFinished) == 0x000001, "Wrong alignment on BPI_BattleNumberActor_C_BI_IsFinished");
static_assert(sizeof(BPI_BattleNumberActor_C_BI_IsFinished) == 0x000001, "Wrong size on BPI_BattleNumberActor_C_BI_IsFinished");
static_assert(offsetof(BPI_BattleNumberActor_C_BI_IsFinished, IsFinished) == 0x000000, "Member 'BPI_BattleNumberActor_C_BI_IsFinished::IsFinished' has a wrong offset!");

// Function BPI_BattleNumberActor.BPI_BattleNumberActor_C.BI_Update
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleNumberActor_C_BI_Update final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoUse;                                             // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleNumberActor_C_BI_Update) == 0x000004, "Wrong alignment on BPI_BattleNumberActor_C_BI_Update");
static_assert(sizeof(BPI_BattleNumberActor_C_BI_Update) == 0x000008, "Wrong size on BPI_BattleNumberActor_C_BI_Update");
static_assert(offsetof(BPI_BattleNumberActor_C_BI_Update, Delta) == 0x000000, "Member 'BPI_BattleNumberActor_C_BI_Update::Delta' has a wrong offset!");
static_assert(offsetof(BPI_BattleNumberActor_C_BI_Update, NoUse) == 0x000004, "Member 'BPI_BattleNumberActor_C_BI_Update::NoUse' has a wrong offset!");

// Function BPI_BattleNumberActor.BPI_BattleNumberActor_C.BI_Hide
// 0x0001 (0x0001 - 0x0000)
struct BPI_BattleNumberActor_C_BI_Hide final
{
public:
	bool                                          NoUse;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BattleNumberActor_C_BI_Hide) == 0x000001, "Wrong alignment on BPI_BattleNumberActor_C_BI_Hide");
static_assert(sizeof(BPI_BattleNumberActor_C_BI_Hide) == 0x000001, "Wrong size on BPI_BattleNumberActor_C_BI_Hide");
static_assert(offsetof(BPI_BattleNumberActor_C_BI_Hide, NoUse) == 0x000000, "Member 'BPI_BattleNumberActor_C_BI_Hide::NoUse' has a wrong offset!");

}

