#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_EventInstance

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_EventInstance.BPI_EventInstance_C.BPI_GetEventBase
// 0x0008 (0x0008 - 0x0000)
struct BPI_EventInstance_C_BPI_GetEventBase final
{
public:
	class AEventBase*                             Return;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_EventInstance_C_BPI_GetEventBase) == 0x000008, "Wrong alignment on BPI_EventInstance_C_BPI_GetEventBase");
static_assert(sizeof(BPI_EventInstance_C_BPI_GetEventBase) == 0x000008, "Wrong size on BPI_EventInstance_C_BPI_GetEventBase");
static_assert(offsetof(BPI_EventInstance_C_BPI_GetEventBase, Return) == 0x000000, "Member 'BPI_EventInstance_C_BPI_GetEventBase::Return' has a wrong offset!");

// Function BPI_EventInstance.BPI_EventInstance_C.BPI_SetEventBase
// 0x0010 (0x0010 - 0x0000)
struct BPI_EventInstance_C_BPI_SetEventBase final
{
public:
	class AEventBase*                             Base;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoUse;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_EventInstance_C_BPI_SetEventBase) == 0x000008, "Wrong alignment on BPI_EventInstance_C_BPI_SetEventBase");
static_assert(sizeof(BPI_EventInstance_C_BPI_SetEventBase) == 0x000010, "Wrong size on BPI_EventInstance_C_BPI_SetEventBase");
static_assert(offsetof(BPI_EventInstance_C_BPI_SetEventBase, Base) == 0x000000, "Member 'BPI_EventInstance_C_BPI_SetEventBase::Base' has a wrong offset!");
static_assert(offsetof(BPI_EventInstance_C_BPI_SetEventBase, NoUse) == 0x000008, "Member 'BPI_EventInstance_C_BPI_SetEventBase::NoUse' has a wrong offset!");

}

