#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_AICommand

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BPI_AICommand.BPI_AICommand_C.BI_ActSkill
// 0x0008 (0x0008 - 0x0000)
struct BPI_AICommand_C_BI_ActSkill final
{
public:
	int32                                         SkillId;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ActSkill) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_ActSkill");
static_assert(sizeof(BPI_AICommand_C_BI_ActSkill) == 0x000008, "Wrong size on BPI_AICommand_C_BI_ActSkill");
static_assert(offsetof(BPI_AICommand_C_BI_ActSkill, SkillId) == 0x000000, "Member 'BPI_AICommand_C_BI_ActSkill::SkillId' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ActSkill, RetValue) == 0x000004, "Member 'BPI_AICommand_C_BI_ActSkill::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ActAttack
// 0x0001 (0x0001 - 0x0000)
struct BPI_AICommand_C_BI_ActAttack final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ActAttack) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_ActAttack");
static_assert(sizeof(BPI_AICommand_C_BI_ActAttack) == 0x000001, "Wrong size on BPI_AICommand_C_BI_ActAttack");
static_assert(offsetof(BPI_AICommand_C_BI_ActAttack, RetValue) == 0x000000, "Member 'BPI_AICommand_C_BI_ActAttack::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TarAI
// 0x0001 (0x0001 - 0x0000)
struct BPI_AICommand_C_BI_TarAI final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TarAI) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_TarAI");
static_assert(sizeof(BPI_AICommand_C_BI_TarAI) == 0x000001, "Wrong size on BPI_AICommand_C_BI_TarAI");
static_assert(offsetof(BPI_AICommand_C_BI_TarAI, RetValue) == 0x000000, "Member 'BPI_AICommand_C_BI_TarAI::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TarAishouNotPlus
// 0x0002 (0x0002 - 0x0000)
struct BPI_AICommand_C_BI_TarAishouNotPlus final
{
public:
	E_ATTRIBUTE_TYPE                              InValue;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TarAishouNotPlus) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_TarAishouNotPlus");
static_assert(sizeof(BPI_AICommand_C_BI_TarAishouNotPlus) == 0x000002, "Wrong size on BPI_AICommand_C_BI_TarAishouNotPlus");
static_assert(offsetof(BPI_AICommand_C_BI_TarAishouNotPlus, InValue) == 0x000000, "Member 'BPI_AICommand_C_BI_TarAishouNotPlus::InValue' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_TarAishouNotPlus, RetValue) == 0x000001, "Member 'BPI_AICommand_C_BI_TarAishouNotPlus::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TarRandom
// 0x0001 (0x0001 - 0x0000)
struct BPI_AICommand_C_BI_TarRandom final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TarRandom) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_TarRandom");
static_assert(sizeof(BPI_AICommand_C_BI_TarRandom) == 0x000001, "Wrong size on BPI_AICommand_C_BI_TarRandom");
static_assert(offsetof(BPI_AICommand_C_BI_TarRandom, RetValue) == 0x000000, "Member 'BPI_AICommand_C_BI_TarRandom::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkMyHPPerc
// 0x0008 (0x0008 - 0x0000)
struct BPI_AICommand_C_BI_ChkMyHPPerc final
{
public:
	int32                                         Perc;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkMyHPPerc) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_ChkMyHPPerc");
static_assert(sizeof(BPI_AICommand_C_BI_ChkMyHPPerc) == 0x000008, "Wrong size on BPI_AICommand_C_BI_ChkMyHPPerc");
static_assert(offsetof(BPI_AICommand_C_BI_ChkMyHPPerc, Perc) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkMyHPPerc::Perc' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkMyHPPerc, RetValue) == 0x000004, "Member 'BPI_AICommand_C_BI_ChkMyHPPerc::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TempFlagOn
// 0x0002 (0x0002 - 0x0000)
struct BPI_AICommand_C_BI_TempFlagOn final
{
public:
	uint8                                         InValue;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TempFlagOn) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_TempFlagOn");
static_assert(sizeof(BPI_AICommand_C_BI_TempFlagOn) == 0x000002, "Wrong size on BPI_AICommand_C_BI_TempFlagOn");
static_assert(offsetof(BPI_AICommand_C_BI_TempFlagOn, InValue) == 0x000000, "Member 'BPI_AICommand_C_BI_TempFlagOn::InValue' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_TempFlagOn, RetValue) == 0x000001, "Member 'BPI_AICommand_C_BI_TempFlagOn::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TempFlagOff
// 0x0002 (0x0002 - 0x0000)
struct BPI_AICommand_C_BI_TempFlagOff final
{
public:
	uint8                                         InValue;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TempFlagOff) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_TempFlagOff");
static_assert(sizeof(BPI_AICommand_C_BI_TempFlagOff) == 0x000002, "Wrong size on BPI_AICommand_C_BI_TempFlagOff");
static_assert(offsetof(BPI_AICommand_C_BI_TempFlagOff, InValue) == 0x000000, "Member 'BPI_AICommand_C_BI_TempFlagOff::InValue' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_TempFlagOff, RetValue) == 0x000001, "Member 'BPI_AICommand_C_BI_TempFlagOff::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TempFlagCheck
// 0x0002 (0x0002 - 0x0000)
struct BPI_AICommand_C_BI_TempFlagCheck final
{
public:
	uint8                                         InValue;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TempFlagCheck) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_TempFlagCheck");
static_assert(sizeof(BPI_AICommand_C_BI_TempFlagCheck) == 0x000002, "Wrong size on BPI_AICommand_C_BI_TempFlagCheck");
static_assert(offsetof(BPI_AICommand_C_BI_TempFlagCheck, InValue) == 0x000000, "Member 'BPI_AICommand_C_BI_TempFlagCheck::InValue' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_TempFlagCheck, RetValue) == 0x000001, "Member 'BPI_AICommand_C_BI_TempFlagCheck::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TempFlagClear
// 0x0001 (0x0001 - 0x0000)
struct BPI_AICommand_C_BI_TempFlagClear final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TempFlagClear) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_TempFlagClear");
static_assert(sizeof(BPI_AICommand_C_BI_TempFlagClear) == 0x000001, "Wrong size on BPI_AICommand_C_BI_TempFlagClear");
static_assert(offsetof(BPI_AICommand_C_BI_TempFlagClear, RetValue) == 0x000000, "Member 'BPI_AICommand_C_BI_TempFlagClear::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkPLHPPerc
// 0x0008 (0x0008 - 0x0000)
struct BPI_AICommand_C_BI_ChkPLHPPerc final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkPLHPPerc) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_ChkPLHPPerc");
static_assert(sizeof(BPI_AICommand_C_BI_ChkPLHPPerc) == 0x000008, "Wrong size on BPI_AICommand_C_BI_ChkPLHPPerc");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLHPPerc, InValue) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkPLHPPerc::InValue' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLHPPerc, RetValue) == 0x000004, "Member 'BPI_AICommand_C_BI_ChkPLHPPerc::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkPLHPPercOver
// 0x0008 (0x0008 - 0x0000)
struct BPI_AICommand_C_BI_ChkPLHPPercOver final
{
public:
	int32                                         Perc;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkPLHPPercOver) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_ChkPLHPPercOver");
static_assert(sizeof(BPI_AICommand_C_BI_ChkPLHPPercOver) == 0x000008, "Wrong size on BPI_AICommand_C_BI_ChkPLHPPercOver");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLHPPercOver, Perc) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkPLHPPercOver::Perc' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLHPPercOver, RetValue) == 0x000004, "Member 'BPI_AICommand_C_BI_ChkPLHPPercOver::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TarHPMin
// 0x0001 (0x0001 - 0x0000)
struct BPI_AICommand_C_BI_TarHPMin final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TarHPMin) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_TarHPMin");
static_assert(sizeof(BPI_AICommand_C_BI_TarHPMin) == 0x000001, "Wrong size on BPI_AICommand_C_BI_TarHPMin");
static_assert(offsetof(BPI_AICommand_C_BI_TarHPMin, RetValue) == 0x000000, "Member 'BPI_AICommand_C_BI_TarHPMin::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TarHPMax
// 0x0001 (0x0001 - 0x0000)
struct BPI_AICommand_C_BI_TarHPMax final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TarHPMax) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_TarHPMax");
static_assert(sizeof(BPI_AICommand_C_BI_TarHPMax) == 0x000001, "Wrong size on BPI_AICommand_C_BI_TarHPMax");
static_assert(offsetof(BPI_AICommand_C_BI_TarHPMax, RetValue) == 0x000000, "Member 'BPI_AICommand_C_BI_TarHPMax::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkENBstOver
// 0x000C (0x000C - 0x0000)
struct BPI_AICommand_C_BI_ChkENBstOver final
{
public:
	E_BAD_STATUS                                  bst;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29AC[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InValue;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkENBstOver) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_ChkENBstOver");
static_assert(sizeof(BPI_AICommand_C_BI_ChkENBstOver) == 0x00000C, "Wrong size on BPI_AICommand_C_BI_ChkENBstOver");
static_assert(offsetof(BPI_AICommand_C_BI_ChkENBstOver, bst) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkENBstOver::bst' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkENBstOver, InValue) == 0x000004, "Member 'BPI_AICommand_C_BI_ChkENBstOver::InValue' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkENBstOver, RetValue) == 0x000008, "Member 'BPI_AICommand_C_BI_ChkENBstOver::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkPLBstOver
// 0x000C (0x000C - 0x0000)
struct BPI_AICommand_C_BI_ChkPLBstOver final
{
public:
	E_BAD_STATUS                                  bst;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29AD[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InValue;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkPLBstOver) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_ChkPLBstOver");
static_assert(sizeof(BPI_AICommand_C_BI_ChkPLBstOver) == 0x00000C, "Wrong size on BPI_AICommand_C_BI_ChkPLBstOver");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLBstOver, bst) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkPLBstOver::bst' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLBstOver, InValue) == 0x000004, "Member 'BPI_AICommand_C_BI_ChkPLBstOver::InValue' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLBstOver, RetValue) == 0x000008, "Member 'BPI_AICommand_C_BI_ChkPLBstOver::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TarNotBst
// 0x0002 (0x0002 - 0x0000)
struct BPI_AICommand_C_BI_TarNotBst final
{
public:
	E_BAD_STATUS                                  bst;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TarNotBst) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_TarNotBst");
static_assert(sizeof(BPI_AICommand_C_BI_TarNotBst) == 0x000002, "Wrong size on BPI_AICommand_C_BI_TarNotBst");
static_assert(offsetof(BPI_AICommand_C_BI_TarNotBst, bst) == 0x000000, "Member 'BPI_AICommand_C_BI_TarNotBst::bst' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_TarNotBst, RetValue) == 0x000001, "Member 'BPI_AICommand_C_BI_TarNotBst::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TarBst
// 0x0002 (0x0002 - 0x0000)
struct BPI_AICommand_C_BI_TarBst final
{
public:
	E_BAD_STATUS                                  bst;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TarBst) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_TarBst");
static_assert(sizeof(BPI_AICommand_C_BI_TarBst) == 0x000002, "Wrong size on BPI_AICommand_C_BI_TarBst");
static_assert(offsetof(BPI_AICommand_C_BI_TarBst, bst) == 0x000000, "Member 'BPI_AICommand_C_BI_TarBst::bst' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_TarBst, RetValue) == 0x000001, "Member 'BPI_AICommand_C_BI_TarBst::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_OptNextCritical
// 0x0001 (0x0001 - 0x0000)
struct BPI_AICommand_C_BI_OptNextCritical final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_OptNextCritical) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_OptNextCritical");
static_assert(sizeof(BPI_AICommand_C_BI_OptNextCritical) == 0x000001, "Wrong size on BPI_AICommand_C_BI_OptNextCritical");
static_assert(offsetof(BPI_AICommand_C_BI_OptNextCritical, RetValue) == 0x000000, "Member 'BPI_AICommand_C_BI_OptNextCritical::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_OptNextMiss
// 0x0001 (0x0001 - 0x0000)
struct BPI_AICommand_C_BI_OptNextMiss final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_OptNextMiss) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_OptNextMiss");
static_assert(sizeof(BPI_AICommand_C_BI_OptNextMiss) == 0x000001, "Wrong size on BPI_AICommand_C_BI_OptNextMiss");
static_assert(offsetof(BPI_AICommand_C_BI_OptNextMiss, RetValue) == 0x000000, "Member 'BPI_AICommand_C_BI_OptNextMiss::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_GetMySkillID
// 0x0008 (0x0008 - 0x0000)
struct BPI_AICommand_C_BI_GetMySkillID final
{
public:
	int32                                         Slot;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetValue;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_AICommand_C_BI_GetMySkillID) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_GetMySkillID");
static_assert(sizeof(BPI_AICommand_C_BI_GetMySkillID) == 0x000008, "Wrong size on BPI_AICommand_C_BI_GetMySkillID");
static_assert(offsetof(BPI_AICommand_C_BI_GetMySkillID, Slot) == 0x000000, "Member 'BPI_AICommand_C_BI_GetMySkillID::Slot' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_GetMySkillID, RetValue) == 0x000004, "Member 'BPI_AICommand_C_BI_GetMySkillID::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_GetMySkillIDAttr
// 0x0008 (0x0008 - 0x0000)
struct BPI_AICommand_C_BI_GetMySkillIDAttr final
{
public:
	int32                                         Slot;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ATTRIBUTE_TYPE                              RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_AICommand_C_BI_GetMySkillIDAttr) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_GetMySkillIDAttr");
static_assert(sizeof(BPI_AICommand_C_BI_GetMySkillIDAttr) == 0x000008, "Wrong size on BPI_AICommand_C_BI_GetMySkillIDAttr");
static_assert(offsetof(BPI_AICommand_C_BI_GetMySkillIDAttr, Slot) == 0x000000, "Member 'BPI_AICommand_C_BI_GetMySkillIDAttr::Slot' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_GetMySkillIDAttr, RetValue) == 0x000004, "Member 'BPI_AICommand_C_BI_GetMySkillIDAttr::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkPLAishouPlus
// 0x0002 (0x0002 - 0x0000)
struct BPI_AICommand_C_BI_ChkPLAishouPlus final
{
public:
	E_ATTRIBUTE_TYPE                              Attr;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkPLAishouPlus) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_ChkPLAishouPlus");
static_assert(sizeof(BPI_AICommand_C_BI_ChkPLAishouPlus) == 0x000002, "Wrong size on BPI_AICommand_C_BI_ChkPLAishouPlus");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLAishouPlus, Attr) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkPLAishouPlus::Attr' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLAishouPlus, RetValue) == 0x000001, "Member 'BPI_AICommand_C_BI_ChkPLAishouPlus::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkPLAishouFlat
// 0x0002 (0x0002 - 0x0000)
struct BPI_AICommand_C_BI_ChkPLAishouFlat final
{
public:
	E_ATTRIBUTE_TYPE                              Attr;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkPLAishouFlat) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_ChkPLAishouFlat");
static_assert(sizeof(BPI_AICommand_C_BI_ChkPLAishouFlat) == 0x000002, "Wrong size on BPI_AICommand_C_BI_ChkPLAishouFlat");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLAishouFlat, Attr) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkPLAishouFlat::Attr' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLAishouFlat, RetValue) == 0x000001, "Member 'BPI_AICommand_C_BI_ChkPLAishouFlat::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkPLAishouMinus
// 0x0002 (0x0002 - 0x0000)
struct BPI_AICommand_C_BI_ChkPLAishouMinus final
{
public:
	E_ATTRIBUTE_TYPE                              Attr;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkPLAishouMinus) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_ChkPLAishouMinus");
static_assert(sizeof(BPI_AICommand_C_BI_ChkPLAishouMinus) == 0x000002, "Wrong size on BPI_AICommand_C_BI_ChkPLAishouMinus");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLAishouMinus, Attr) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkPLAishouMinus::Attr' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLAishouMinus, RetValue) == 0x000001, "Member 'BPI_AICommand_C_BI_ChkPLAishouMinus::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TarAishouMinus
// 0x0002 (0x0002 - 0x0000)
struct BPI_AICommand_C_BI_TarAishouMinus final
{
public:
	E_ATTRIBUTE_TYPE                              Attr;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TarAishouMinus) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_TarAishouMinus");
static_assert(sizeof(BPI_AICommand_C_BI_TarAishouMinus) == 0x000002, "Wrong size on BPI_AICommand_C_BI_TarAishouMinus");
static_assert(offsetof(BPI_AICommand_C_BI_TarAishouMinus, Attr) == 0x000000, "Member 'BPI_AICommand_C_BI_TarAishouMinus::Attr' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_TarAishouMinus, RetValue) == 0x000001, "Member 'BPI_AICommand_C_BI_TarAishouMinus::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TarAishouNotMinus
// 0x0002 (0x0002 - 0x0000)
struct BPI_AICommand_C_BI_TarAishouNotMinus final
{
public:
	E_ATTRIBUTE_TYPE                              Attr;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TarAishouNotMinus) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_TarAishouNotMinus");
static_assert(sizeof(BPI_AICommand_C_BI_TarAishouNotMinus) == 0x000002, "Wrong size on BPI_AICommand_C_BI_TarAishouNotMinus");
static_assert(offsetof(BPI_AICommand_C_BI_TarAishouNotMinus, Attr) == 0x000000, "Member 'BPI_AICommand_C_BI_TarAishouNotMinus::Attr' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_TarAishouNotMinus, RetValue) == 0x000001, "Member 'BPI_AICommand_C_BI_TarAishouNotMinus::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TarHPPerc
// 0x0008 (0x0008 - 0x0000)
struct BPI_AICommand_C_BI_TarHPPerc final
{
public:
	int32                                         InHp;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TarHPPerc) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_TarHPPerc");
static_assert(sizeof(BPI_AICommand_C_BI_TarHPPerc) == 0x000008, "Wrong size on BPI_AICommand_C_BI_TarHPPerc");
static_assert(offsetof(BPI_AICommand_C_BI_TarHPPerc, InHp) == 0x000000, "Member 'BPI_AICommand_C_BI_TarHPPerc::InHp' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_TarHPPerc, RetValue) == 0x000004, "Member 'BPI_AICommand_C_BI_TarHPPerc::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TarID
// 0x0008 (0x0008 - 0x0000)
struct BPI_AICommand_C_BI_TarID final
{
public:
	int32                                         InID;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TarID) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_TarID");
static_assert(sizeof(BPI_AICommand_C_BI_TarID) == 0x000008, "Wrong size on BPI_AICommand_C_BI_TarID");
static_assert(offsetof(BPI_AICommand_C_BI_TarID, InID) == 0x000000, "Member 'BPI_AICommand_C_BI_TarID::InID' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_TarID, RetValue) == 0x000004, "Member 'BPI_AICommand_C_BI_TarID::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TarPartyIndex
// 0x0008 (0x0008 - 0x0000)
struct BPI_AICommand_C_BI_TarPartyIndex final
{
public:
	int32                                         InPartyIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TarPartyIndex) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_TarPartyIndex");
static_assert(sizeof(BPI_AICommand_C_BI_TarPartyIndex) == 0x000008, "Wrong size on BPI_AICommand_C_BI_TarPartyIndex");
static_assert(offsetof(BPI_AICommand_C_BI_TarPartyIndex, InPartyIndex) == 0x000000, "Member 'BPI_AICommand_C_BI_TarPartyIndex::InPartyIndex' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_TarPartyIndex, RetValue) == 0x000004, "Member 'BPI_AICommand_C_BI_TarPartyIndex::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TarHero
// 0x0001 (0x0001 - 0x0000)
struct BPI_AICommand_C_BI_TarHero final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TarHero) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_TarHero");
static_assert(sizeof(BPI_AICommand_C_BI_TarHero) == 0x000001, "Wrong size on BPI_AICommand_C_BI_TarHero");
static_assert(offsetof(BPI_AICommand_C_BI_TarHero, RetValue) == 0x000000, "Member 'BPI_AICommand_C_BI_TarHero::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TarNotHero
// 0x0001 (0x0001 - 0x0000)
struct BPI_AICommand_C_BI_TarNotHero final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TarNotHero) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_TarNotHero");
static_assert(sizeof(BPI_AICommand_C_BI_TarNotHero) == 0x000001, "Wrong size on BPI_AICommand_C_BI_TarNotHero");
static_assert(offsetof(BPI_AICommand_C_BI_TarNotHero, RetValue) == 0x000000, "Member 'BPI_AICommand_C_BI_TarNotHero::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TarNotID
// 0x0008 (0x0008 - 0x0000)
struct BPI_AICommand_C_BI_TarNotID final
{
public:
	int32                                         InID;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TarNotID) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_TarNotID");
static_assert(sizeof(BPI_AICommand_C_BI_TarNotID) == 0x000008, "Wrong size on BPI_AICommand_C_BI_TarNotID");
static_assert(offsetof(BPI_AICommand_C_BI_TarNotID, InID) == 0x000000, "Member 'BPI_AICommand_C_BI_TarNotID::InID' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_TarNotID, RetValue) == 0x000004, "Member 'BPI_AICommand_C_BI_TarNotID::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TarSelf
// 0x0001 (0x0001 - 0x0000)
struct BPI_AICommand_C_BI_TarSelf final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TarSelf) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_TarSelf");
static_assert(sizeof(BPI_AICommand_C_BI_TarSelf) == 0x000001, "Wrong size on BPI_AICommand_C_BI_TarSelf");
static_assert(offsetof(BPI_AICommand_C_BI_TarSelf, RetValue) == 0x000000, "Member 'BPI_AICommand_C_BI_TarSelf::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TarAishouFlat
// 0x0002 (0x0002 - 0x0000)
struct BPI_AICommand_C_BI_TarAishouFlat final
{
public:
	E_ATTRIBUTE_TYPE                              InAishou;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TarAishouFlat) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_TarAishouFlat");
static_assert(sizeof(BPI_AICommand_C_BI_TarAishouFlat) == 0x000002, "Wrong size on BPI_AICommand_C_BI_TarAishouFlat");
static_assert(offsetof(BPI_AICommand_C_BI_TarAishouFlat, InAishou) == 0x000000, "Member 'BPI_AICommand_C_BI_TarAishouFlat::InAishou' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_TarAishouFlat, RetValue) == 0x000001, "Member 'BPI_AICommand_C_BI_TarAishouFlat::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TarAishouNotFlat
// 0x0002 (0x0002 - 0x0000)
struct BPI_AICommand_C_BI_TarAishouNotFlat final
{
public:
	E_ATTRIBUTE_TYPE                              InAishou;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TarAishouNotFlat) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_TarAishouNotFlat");
static_assert(sizeof(BPI_AICommand_C_BI_TarAishouNotFlat) == 0x000002, "Wrong size on BPI_AICommand_C_BI_TarAishouNotFlat");
static_assert(offsetof(BPI_AICommand_C_BI_TarAishouNotFlat, InAishou) == 0x000000, "Member 'BPI_AICommand_C_BI_TarAishouNotFlat::InAishou' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_TarAishouNotFlat, RetValue) == 0x000001, "Member 'BPI_AICommand_C_BI_TarAishouNotFlat::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_TarSelfSideOther
// 0x0001 (0x0001 - 0x0000)
struct BPI_AICommand_C_BI_TarSelfSideOther final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_TarSelfSideOther) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_TarSelfSideOther");
static_assert(sizeof(BPI_AICommand_C_BI_TarSelfSideOther) == 0x000001, "Wrong size on BPI_AICommand_C_BI_TarSelfSideOther");
static_assert(offsetof(BPI_AICommand_C_BI_TarSelfSideOther, RetValue) == 0x000000, "Member 'BPI_AICommand_C_BI_TarSelfSideOther::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkENHPPerc
// 0x0008 (0x0008 - 0x0000)
struct BPI_AICommand_C_BI_ChkENHPPerc final
{
public:
	int32                                         Perc;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkENHPPerc) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_ChkENHPPerc");
static_assert(sizeof(BPI_AICommand_C_BI_ChkENHPPerc) == 0x000008, "Wrong size on BPI_AICommand_C_BI_ChkENHPPerc");
static_assert(offsetof(BPI_AICommand_C_BI_ChkENHPPerc, Perc) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkENHPPerc::Perc' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkENHPPerc, RetValue) == 0x000004, "Member 'BPI_AICommand_C_BI_ChkENHPPerc::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkENHPPercOver
// 0x0008 (0x0008 - 0x0000)
struct BPI_AICommand_C_BI_ChkENHPPercOver final
{
public:
	int32                                         Perc;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkENHPPercOver) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_ChkENHPPercOver");
static_assert(sizeof(BPI_AICommand_C_BI_ChkENHPPercOver) == 0x000008, "Wrong size on BPI_AICommand_C_BI_ChkENHPPercOver");
static_assert(offsetof(BPI_AICommand_C_BI_ChkENHPPercOver, Perc) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkENHPPercOver::Perc' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkENHPPercOver, RetValue) == 0x000004, "Member 'BPI_AICommand_C_BI_ChkENHPPercOver::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkMyLvOver
// 0x0008 (0x0008 - 0x0000)
struct BPI_AICommand_C_BI_ChkMyLvOver final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkMyLvOver) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_ChkMyLvOver");
static_assert(sizeof(BPI_AICommand_C_BI_ChkMyLvOver) == 0x000008, "Wrong size on BPI_AICommand_C_BI_ChkMyLvOver");
static_assert(offsetof(BPI_AICommand_C_BI_ChkMyLvOver, Level) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkMyLvOver::Level' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkMyLvOver, RetValue) == 0x000004, "Member 'BPI_AICommand_C_BI_ChkMyLvOver::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkPLLvOver
// 0x0008 (0x0008 - 0x0000)
struct BPI_AICommand_C_BI_ChkPLLvOver final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkPLLvOver) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_ChkPLLvOver");
static_assert(sizeof(BPI_AICommand_C_BI_ChkPLLvOver) == 0x000008, "Wrong size on BPI_AICommand_C_BI_ChkPLLvOver");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLLvOver, Level) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkPLLvOver::Level' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLLvOver, RetValue) == 0x000004, "Member 'BPI_AICommand_C_BI_ChkPLLvOver::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkENLvOver
// 0x0008 (0x0008 - 0x0000)
struct BPI_AICommand_C_BI_ChkENLvOver final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkENLvOver) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_ChkENLvOver");
static_assert(sizeof(BPI_AICommand_C_BI_ChkENLvOver) == 0x000008, "Wrong size on BPI_AICommand_C_BI_ChkENLvOver");
static_assert(offsetof(BPI_AICommand_C_BI_ChkENLvOver, Level) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkENLvOver::Level' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkENLvOver, RetValue) == 0x000004, "Member 'BPI_AICommand_C_BI_ChkENLvOver::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkENCnt
// 0x0008 (0x0008 - 0x0000)
struct BPI_AICommand_C_BI_ChkENCnt final
{
public:
	int32                                         Num;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkENCnt) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_ChkENCnt");
static_assert(sizeof(BPI_AICommand_C_BI_ChkENCnt) == 0x000008, "Wrong size on BPI_AICommand_C_BI_ChkENCnt");
static_assert(offsetof(BPI_AICommand_C_BI_ChkENCnt, Num) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkENCnt::Num' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkENCnt, RetValue) == 0x000004, "Member 'BPI_AICommand_C_BI_ChkENCnt::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkMyBst
// 0x0002 (0x0002 - 0x0000)
struct BPI_AICommand_C_BI_ChkMyBst final
{
public:
	E_BAD_STATUS                                  bst;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkMyBst) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_ChkMyBst");
static_assert(sizeof(BPI_AICommand_C_BI_ChkMyBst) == 0x000002, "Wrong size on BPI_AICommand_C_BI_ChkMyBst");
static_assert(offsetof(BPI_AICommand_C_BI_ChkMyBst, bst) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkMyBst::bst' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkMyBst, RetValue) == 0x000001, "Member 'BPI_AICommand_C_BI_ChkMyBst::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkPLBst
// 0x0002 (0x0002 - 0x0000)
struct BPI_AICommand_C_BI_ChkPLBst final
{
public:
	E_BAD_STATUS                                  bst;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkPLBst) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_ChkPLBst");
static_assert(sizeof(BPI_AICommand_C_BI_ChkPLBst) == 0x000002, "Wrong size on BPI_AICommand_C_BI_ChkPLBst");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLBst, bst) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkPLBst::bst' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLBst, RetValue) == 0x000001, "Member 'BPI_AICommand_C_BI_ChkPLBst::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkENBst
// 0x0002 (0x0002 - 0x0000)
struct BPI_AICommand_C_BI_ChkENBst final
{
public:
	E_BAD_STATUS                                  bst;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkENBst) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_ChkENBst");
static_assert(sizeof(BPI_AICommand_C_BI_ChkENBst) == 0x000002, "Wrong size on BPI_AICommand_C_BI_ChkENBst");
static_assert(offsetof(BPI_AICommand_C_BI_ChkENBst, bst) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkENBst::bst' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkENBst, RetValue) == 0x000001, "Member 'BPI_AICommand_C_BI_ChkENBst::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkPLID
// 0x0008 (0x0008 - 0x0000)
struct BPI_AICommand_C_BI_ChkPLID final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkPLID) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_ChkPLID");
static_assert(sizeof(BPI_AICommand_C_BI_ChkPLID) == 0x000008, "Wrong size on BPI_AICommand_C_BI_ChkPLID");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLID, ID) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkPLID::ID' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLID, RetValue) == 0x000004, "Member 'BPI_AICommand_C_BI_ChkPLID::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkENID
// 0x0008 (0x0008 - 0x0000)
struct BPI_AICommand_C_BI_ChkENID final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkENID) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_ChkENID");
static_assert(sizeof(BPI_AICommand_C_BI_ChkENID) == 0x000008, "Wrong size on BPI_AICommand_C_BI_ChkENID");
static_assert(offsetof(BPI_AICommand_C_BI_ChkENID, ID) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkENID::ID' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkENID, RetValue) == 0x000004, "Member 'BPI_AICommand_C_BI_ChkENID::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkENHojoPlusNum
// 0x000C (0x000C - 0x0000)
struct BPI_AICommand_C_BI_ChkENHojoPlusNum final
{
public:
	E_AI_SERCH_AID                                InHojo;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29AE[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InValue;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkENHojoPlusNum) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_ChkENHojoPlusNum");
static_assert(sizeof(BPI_AICommand_C_BI_ChkENHojoPlusNum) == 0x00000C, "Wrong size on BPI_AICommand_C_BI_ChkENHojoPlusNum");
static_assert(offsetof(BPI_AICommand_C_BI_ChkENHojoPlusNum, InHojo) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkENHojoPlusNum::InHojo' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkENHojoPlusNum, InValue) == 0x000004, "Member 'BPI_AICommand_C_BI_ChkENHojoPlusNum::InValue' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkENHojoPlusNum, RetValue) == 0x000008, "Member 'BPI_AICommand_C_BI_ChkENHojoPlusNum::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkPLHojoPlusNum
// 0x000C (0x000C - 0x0000)
struct BPI_AICommand_C_BI_ChkPLHojoPlusNum final
{
public:
	E_AI_SERCH_AID                                InHojo;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29AF[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InValue;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkPLHojoPlusNum) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_ChkPLHojoPlusNum");
static_assert(sizeof(BPI_AICommand_C_BI_ChkPLHojoPlusNum) == 0x00000C, "Wrong size on BPI_AICommand_C_BI_ChkPLHojoPlusNum");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLHojoPlusNum, InHojo) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkPLHojoPlusNum::InHojo' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLHojoPlusNum, InValue) == 0x000004, "Member 'BPI_AICommand_C_BI_ChkPLHojoPlusNum::InValue' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLHojoPlusNum, RetValue) == 0x000008, "Member 'BPI_AICommand_C_BI_ChkPLHojoPlusNum::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkENHojoMinusNum
// 0x000C (0x000C - 0x0000)
struct BPI_AICommand_C_BI_ChkENHojoMinusNum final
{
public:
	E_AI_SERCH_AID                                InHojo;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29B0[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InValue;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkENHojoMinusNum) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_ChkENHojoMinusNum");
static_assert(sizeof(BPI_AICommand_C_BI_ChkENHojoMinusNum) == 0x00000C, "Wrong size on BPI_AICommand_C_BI_ChkENHojoMinusNum");
static_assert(offsetof(BPI_AICommand_C_BI_ChkENHojoMinusNum, InHojo) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkENHojoMinusNum::InHojo' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkENHojoMinusNum, InValue) == 0x000004, "Member 'BPI_AICommand_C_BI_ChkENHojoMinusNum::InValue' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkENHojoMinusNum, RetValue) == 0x000008, "Member 'BPI_AICommand_C_BI_ChkENHojoMinusNum::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkPLHojoMinusNum
// 0x000C (0x000C - 0x0000)
struct BPI_AICommand_C_BI_ChkPLHojoMinusNum final
{
public:
	E_AI_SERCH_AID                                InHojo;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29B1[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InValue;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkPLHojoMinusNum) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_ChkPLHojoMinusNum");
static_assert(sizeof(BPI_AICommand_C_BI_ChkPLHojoMinusNum) == 0x00000C, "Wrong size on BPI_AICommand_C_BI_ChkPLHojoMinusNum");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLHojoMinusNum, InHojo) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkPLHojoMinusNum::InHojo' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLHojoMinusNum, InValue) == 0x000004, "Member 'BPI_AICommand_C_BI_ChkPLHojoMinusNum::InValue' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkPLHojoMinusNum, RetValue) == 0x000008, "Member 'BPI_AICommand_C_BI_ChkPLHojoMinusNum::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkMyUsedAttr
// 0x0002 (0x0002 - 0x0000)
struct BPI_AICommand_C_BI_ChkMyUsedAttr final
{
public:
	E_ATTRIBUTE_TYPE                              InAttr;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkMyUsedAttr) == 0x000001, "Wrong alignment on BPI_AICommand_C_BI_ChkMyUsedAttr");
static_assert(sizeof(BPI_AICommand_C_BI_ChkMyUsedAttr) == 0x000002, "Wrong size on BPI_AICommand_C_BI_ChkMyUsedAttr");
static_assert(offsetof(BPI_AICommand_C_BI_ChkMyUsedAttr, InAttr) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkMyUsedAttr::InAttr' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkMyUsedAttr, RetValue) == 0x000001, "Member 'BPI_AICommand_C_BI_ChkMyUsedAttr::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkMyUsedSkillID
// 0x0008 (0x0008 - 0x0000)
struct BPI_AICommand_C_BI_ChkMyUsedSkillID final
{
public:
	int32                                         InSkillId;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkMyUsedSkillID) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_ChkMyUsedSkillID");
static_assert(sizeof(BPI_AICommand_C_BI_ChkMyUsedSkillID) == 0x000008, "Wrong size on BPI_AICommand_C_BI_ChkMyUsedSkillID");
static_assert(offsetof(BPI_AICommand_C_BI_ChkMyUsedSkillID, InSkillId) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkMyUsedSkillID::InSkillId' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkMyUsedSkillID, RetValue) == 0x000004, "Member 'BPI_AICommand_C_BI_ChkMyUsedSkillID::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkMyUsedSkillIDTurn
// 0x000C (0x000C - 0x0000)
struct BPI_AICommand_C_BI_ChkMyUsedSkillIDTurn final
{
public:
	int32                                         InSkillId;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InTurn;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetValue;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_AICommand_C_BI_ChkMyUsedSkillIDTurn) == 0x000004, "Wrong alignment on BPI_AICommand_C_BI_ChkMyUsedSkillIDTurn");
static_assert(sizeof(BPI_AICommand_C_BI_ChkMyUsedSkillIDTurn) == 0x00000C, "Wrong size on BPI_AICommand_C_BI_ChkMyUsedSkillIDTurn");
static_assert(offsetof(BPI_AICommand_C_BI_ChkMyUsedSkillIDTurn, InSkillId) == 0x000000, "Member 'BPI_AICommand_C_BI_ChkMyUsedSkillIDTurn::InSkillId' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkMyUsedSkillIDTurn, InTurn) == 0x000004, "Member 'BPI_AICommand_C_BI_ChkMyUsedSkillIDTurn::InTurn' has a wrong offset!");
static_assert(offsetof(BPI_AICommand_C_BI_ChkMyUsedSkillIDTurn, RetValue) == 0x000008, "Member 'BPI_AICommand_C_BI_ChkMyUsedSkillIDTurn::RetValue' has a wrong offset!");

// Function BPI_AICommand.BPI_AICommand_C.BI_ChkMyUsedSkillIDAct
// 0x000C (0x000C - 0x0000)
struct BPI_AICommand_C_BI_ChkMyUsedSkillIDAct final
{
public:
	int32                                         InSkillId;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InActNum;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
