#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_ProjectPlayerController

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPI_ProjectPlayerController.BPI_ProjectPlayerController_C.GetInitRotation
// 0x000C (0x000C - 0x0000)
struct BPI_ProjectPlayerController_C_GetInitRotation final
{
public:
	struct FRotator                               InitRotation;                                      // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ProjectPlayerController_C_GetInitRotation) == 0x000004, "Wrong alignment on BPI_ProjectPlayerController_C_GetInitRotation");
static_assert(sizeof(BPI_ProjectPlayerController_C_GetInitRotation) == 0x00000C, "Wrong size on BPI_ProjectPlayerController_C_GetInitRotation");
static_assert(offsetof(BPI_ProjectPlayerController_C_GetInitRotation, InitRotation) == 0x000000, "Member 'BPI_ProjectPlayerController_C_GetInitRotation::InitRotation' has a wrong offset!");

// Function BPI_ProjectPlayerController.BPI_ProjectPlayerController_C.CalcCameraSpeed
// 0x0010 (0x0010 - 0x0000)
struct BPI_ProjectPlayerController_C_CalcCameraSpeed final
{
public:
	E_AXIS_MAPPING_TYPE                           CameraAxis;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B59[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InputSpeed;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMouseInput;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B5A[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CameraSpeed;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_ProjectPlayerController_C_CalcCameraSpeed) == 0x000004, "Wrong alignment on BPI_ProjectPlayerController_C_CalcCameraSpeed");
static_assert(sizeof(BPI_ProjectPlayerController_C_CalcCameraSpeed) == 0x000010, "Wrong size on BPI_ProjectPlayerController_C_CalcCameraSpeed");
static_assert(offsetof(BPI_ProjectPlayerController_C_CalcCameraSpeed, CameraAxis) == 0x000000, "Member 'BPI_ProjectPlayerController_C_CalcCameraSpeed::CameraAxis' has a wrong offset!");
static_assert(offsetof(BPI_ProjectPlayerController_C_CalcCameraSpeed, InputSpeed) == 0x000004, "Member 'BPI_ProjectPlayerController_C_CalcCameraSpeed::InputSpeed' has a wrong offset!");
static_assert(offsetof(BPI_ProjectPlayerController_C_CalcCameraSpeed, IsMouseInput) == 0x000008, "Member 'BPI_ProjectPlayerController_C_CalcCameraSpeed::IsMouseInput' has a wrong offset!");
static_assert(offsetof(BPI_ProjectPlayerController_C_CalcCameraSpeed, CameraSpeed) == 0x00000C, "Member 'BPI_ProjectPlayerController_C_CalcCameraSpeed::CameraSpeed' has a wrong offset!");

}

