#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_MapCharaPanelCtrl

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BPI_MapCharaPanelCtrl.BPI_MapCharaPanelCtrl_C.IMapCharaPanelOn
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapCharaPanelCtrl_C_IMapCharaPanelOn final
{
public:
	bool                                          Immediate;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCharaPanelCtrl_C_IMapCharaPanelOn) == 0x000001, "Wrong alignment on BPI_MapCharaPanelCtrl_C_IMapCharaPanelOn");
static_assert(sizeof(BPI_MapCharaPanelCtrl_C_IMapCharaPanelOn) == 0x000001, "Wrong size on BPI_MapCharaPanelCtrl_C_IMapCharaPanelOn");
static_assert(offsetof(BPI_MapCharaPanelCtrl_C_IMapCharaPanelOn, Immediate) == 0x000000, "Member 'BPI_MapCharaPanelCtrl_C_IMapCharaPanelOn::Immediate' has a wrong offset!");

// Function BPI_MapCharaPanelCtrl.BPI_MapCharaPanelCtrl_C.IMapCharaPanelSetHealHpMp
// 0x0014 (0x0014 - 0x0000)
struct BPI_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp final
{
public:
	int32                                         InNkmIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InStartTime;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InHealHp;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InHealMp;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_WIDGET_PRIO                                 InPrio;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp) == 0x000004, "Wrong alignment on BPI_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp");
static_assert(sizeof(BPI_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp) == 0x000014, "Wrong size on BPI_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp");
static_assert(offsetof(BPI_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp, InNkmIndex) == 0x000000, "Member 'BPI_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp::InNkmIndex' has a wrong offset!");
static_assert(offsetof(BPI_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp, InStartTime) == 0x000004, "Member 'BPI_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp::InStartTime' has a wrong offset!");
static_assert(offsetof(BPI_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp, InHealHp) == 0x000008, "Member 'BPI_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp::InHealHp' has a wrong offset!");
static_assert(offsetof(BPI_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp, InHealMp) == 0x00000C, "Member 'BPI_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp::InHealMp' has a wrong offset!");
static_assert(offsetof(BPI_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp, InPrio) == 0x000010, "Member 'BPI_MapCharaPanelCtrl_C_IMapCharaPanelSetHealHpMp::InPrio' has a wrong offset!");

// Function BPI_MapCharaPanelCtrl.BPI_MapCharaPanelCtrl_C.IMapCharaPanelResetRecoveryAnimation
// 0x0004 (0x0004 - 0x0000)
struct BPI_MapCharaPanelCtrl_C_IMapCharaPanelResetRecoveryAnimation final
{
public:
	int32                                         InNkmIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapCharaPanelCtrl_C_IMapCharaPanelResetRecoveryAnimation) == 0x000004, "Wrong alignment on BPI_MapCharaPanelCtrl_C_IMapCharaPanelResetRecoveryAnimation");
static_assert(sizeof(BPI_MapCharaPanelCtrl_C_IMapCharaPanelResetRecoveryAnimation) == 0x000004, "Wrong size on BPI_MapCharaPanelCtrl_C_IMapCharaPanelResetRecoveryAnimation");
static_assert(offsetof(BPI_MapCharaPanelCtrl_C_IMapCharaPanelResetRecoveryAnimation, InNkmIndex) == 0x000000, "Member 'BPI_MapCharaPanelCtrl_C_IMapCharaPanelResetRecoveryAnimation::InNkmIndex' has a wrong offset!");

// Function BPI_MapCharaPanelCtrl.BPI_MapCharaPanelCtrl_C.IMapCharaPanelUpdateDevilTalkIcon
// 0x000C (0x000C - 0x0000)
struct BPI_MapCharaPanelCtrl_C_IMapCharaPanelUpdateDevilTalkIcon final
{
public:
	bool                                          InAllUpdate;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D42[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InNkmIndex;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutParam;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapCharaPanelCtrl_C_IMapCharaPanelUpdateDevilTalkIcon) == 0x000004, "Wrong alignment on BPI_MapCharaPanelCtrl_C_IMapCharaPanelUpdateDevilTalkIcon");
static_assert(sizeof(BPI_MapCharaPanelCtrl_C_IMapCharaPanelUpdateDevilTalkIcon) == 0x00000C, "Wrong size on BPI_MapCharaPanelCtrl_C_IMapCharaPanelUpdateDevilTalkIcon");
static_assert(offsetof(BPI_MapCharaPanelCtrl_C_IMapCharaPanelUpdateDevilTalkIcon, InAllUpdate) == 0x000000, "Member 'BPI_MapCharaPanelCtrl_C_IMapCharaPanelUpdateDevilTalkIcon::InAllUpdate' has a wrong offset!");
static_assert(offsetof(BPI_MapCharaPanelCtrl_C_IMapCharaPanelUpdateDevilTalkIcon, InNkmIndex) == 0x000004, "Member 'BPI_MapCharaPanelCtrl_C_IMapCharaPanelUpdateDevilTalkIcon::InNkmIndex' has a wrong offset!");
static_assert(offsetof(BPI_MapCharaPanelCtrl_C_IMapCharaPanelUpdateDevilTalkIcon, OutParam) == 0x000008, "Member 'BPI_MapCharaPanelCtrl_C_IMapCharaPanelUpdateDevilTalkIcon::OutParam' has a wrong offset!");

}

