#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_PlayerTrace

#include "Basic.hpp"

#include "E_DEBUG_TRACE_MAP_TYPE_structs.hpp"
#include "E_DEBUG_TRACE_NKM_structs.hpp"
#include "Project_structs.hpp"
#include "E_DEBUG_TRACE_BTL_END_TYPE_structs.hpp"


namespace SDK::Params
{

// Function BPL_PlayerTrace.BPL_PlayerTrace_C.Json_SkillPost
// 0x0238 (0x0238 - 0x0000)
struct BPL_PlayerTrace_C_Json_SkillPost final
{
public:
	int32                                         SkillId;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         From_CharaID;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 Target_CharaID;                                    // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          PlayerSide_;                                       // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Turn;                                              // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         Text;                                              // 0x0038(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 TargetList;                                        // 0x0048(0x0010)(Edit, BlueprintVisible)
	bool                                          Playerside;                                        // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         C_Id;                                              // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         S_Id;                                              // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue_1;                     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Json_CounterGet_Trace_Counter_Encount_Num; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Json_CounterGet_Trace_Counter_Magatukanum; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue_2;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetJsonFileName_FileName;                 // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_1;             // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDebugGameTrace_IsEnable;               // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue_3;                     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0120(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJsonEditor_ReturnValue;                 // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_SetString_ReturnValue;                    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMapID_ReturnValue;                     // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_4;           // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_5;           // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_SetString_ReturnValue_1;                  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJsonDataCtrl*                          CallFunc_SetString_ReturnValue_2;                  // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_SetString_ReturnValue_3;                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJsonDataCtrl*>                  K2Node_MakeArray_Array_1;                          // 0x01E8(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJsonDataCtrl*                          CallFunc_SetObjectArray_ReturnValue;               // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJsonDataCtrl*>                  K2Node_MakeArray_Array_2;                          // 0x0208(0x0010)(ConstParm, ReferenceParm)
	class UJsonDataCtrl*                          CallFunc_SetObjectArray_ReturnValue_1;             // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJsonDataCtrl*>                  K2Node_MakeArray_Array_3;                          // 0x0220(0x0010)(ConstParm, ReferenceParm)
	class UJsonDataCtrl*                          CallFunc_SetObjectArray_ReturnValue_2;             // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_PlayerTrace_C_Json_SkillPost) == 0x000008, "Wrong alignment on BPL_PlayerTrace_C_Json_SkillPost");
static_assert(sizeof(BPL_PlayerTrace_C_Json_SkillPost) == 0x000238, "Wrong size on BPL_PlayerTrace_C_Json_SkillPost");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, SkillId) == 0x000000, "Member 'BPL_PlayerTrace_C_Json_SkillPost::SkillId' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, From_CharaID) == 0x000004, "Member 'BPL_PlayerTrace_C_Json_SkillPost::From_CharaID' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, Target_CharaID) == 0x000008, "Member 'BPL_PlayerTrace_C_Json_SkillPost::Target_CharaID' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, PlayerSide_) == 0x000018, "Member 'BPL_PlayerTrace_C_Json_SkillPost::PlayerSide_' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, __WorldContext) == 0x000020, "Member 'BPL_PlayerTrace_C_Json_SkillPost::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, Turn) == 0x000028, "Member 'BPL_PlayerTrace_C_Json_SkillPost::Turn' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, Text) == 0x000038, "Member 'BPL_PlayerTrace_C_Json_SkillPost::Text' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, TargetList) == 0x000048, "Member 'BPL_PlayerTrace_C_Json_SkillPost::TargetList' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, Playerside) == 0x000058, "Member 'BPL_PlayerTrace_C_Json_SkillPost::Playerside' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, C_Id) == 0x00005C, "Member 'BPL_PlayerTrace_C_Json_SkillPost::C_Id' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, S_Id) == 0x000060, "Member 'BPL_PlayerTrace_C_Json_SkillPost::S_Id' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, Temp_string_Variable) == 0x000068, "Member 'BPL_PlayerTrace_C_Json_SkillPost::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_Create_ReturnValue) == 0x000078, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_Create_ReturnValue_1) == 0x000080, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_Json_CounterGet_Trace_Counter_Encount_Num) == 0x000088, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_Json_CounterGet_Trace_Counter_Encount_Num' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_Json_CounterGet_Trace_Counter_Magatukanum) == 0x00008C, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_Json_CounterGet_Trace_Counter_Magatukanum' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_Create_ReturnValue_2) == 0x000090, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_Conv_IntToString_ReturnValue) == 0x000098, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_GetGameInstance_ReturnValue) == 0x0000A8, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_Concat_StrStr_ReturnValue) == 0x0000B0, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, K2Node_DynamicCast_AsBPI_Map_Common) == 0x0000C0, "Member 'BPL_PlayerTrace_C_Json_SkillPost::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'BPL_PlayerTrace_C_Json_SkillPost::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_GetGameInstance_ReturnValue_1) == 0x0000D8, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_GetJsonFileName_FileName) == 0x0000E0, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_GetJsonFileName_FileName' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, K2Node_DynamicCast_AsBPI_Map_Common_1) == 0x0000F0, "Member 'BPL_PlayerTrace_C_Json_SkillPost::K2Node_DynamicCast_AsBPI_Map_Common_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, K2Node_DynamicCast_bSuccess_1) == 0x000100, "Member 'BPL_PlayerTrace_C_Json_SkillPost::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_GetDebugGameTrace_IsEnable) == 0x000101, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_GetDebugGameTrace_IsEnable' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_Create_ReturnValue_3) == 0x000108, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, Temp_string_Variable_1) == 0x000110, "Member 'BPL_PlayerTrace_C_Json_SkillPost::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, K2Node_MakeArray_Array) == 0x000120, "Member 'BPL_PlayerTrace_C_Json_SkillPost::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, Temp_int_Array_Index_Variable) == 0x000130, "Member 'BPL_PlayerTrace_C_Json_SkillPost::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_IsJsonEditor_ReturnValue) == 0x000134, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_IsJsonEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000138, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000148, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, Temp_bool_Variable) == 0x000158, "Member 'BPL_PlayerTrace_C_Json_SkillPost::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_Array_Get_Item) == 0x00015C, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, K2Node_Select_Default) == 0x000160, "Member 'BPL_PlayerTrace_C_Json_SkillPost::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000170, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_SetString_ReturnValue) == 0x000180, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_SetString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_Array_Length_ReturnValue) == 0x000188, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_GetMapID_ReturnValue) == 0x00018C, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_GetMapID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_Conv_IntToString_ReturnValue_3) == 0x000190, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_Conv_IntToString_ReturnValue_4) == 0x0001A0, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_Conv_IntToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, Temp_int_Loop_Counter_Variable) == 0x0001B0, "Member 'BPL_PlayerTrace_C_Json_SkillPost::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_Conv_IntToString_ReturnValue_5) == 0x0001B8, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_Conv_IntToString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_SetString_ReturnValue_1) == 0x0001C8, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_SetString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_Less_IntInt_ReturnValue) == 0x0001D0, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_SetString_ReturnValue_2) == 0x0001D8, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_SetString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_SetString_ReturnValue_3) == 0x0001E0, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_SetString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, K2Node_MakeArray_Array_1) == 0x0001E8, "Member 'BPL_PlayerTrace_C_Json_SkillPost::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_Add_IntInt_ReturnValue) == 0x0001F8, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_SetObjectArray_ReturnValue) == 0x000200, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_SetObjectArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, K2Node_MakeArray_Array_2) == 0x000208, "Member 'BPL_PlayerTrace_C_Json_SkillPost::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_SetObjectArray_ReturnValue_1) == 0x000218, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_SetObjectArray_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, K2Node_MakeArray_Array_3) == 0x000220, "Member 'BPL_PlayerTrace_C_Json_SkillPost::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_SkillPost, CallFunc_SetObjectArray_ReturnValue_2) == 0x000230, "Member 'BPL_PlayerTrace_C_Json_SkillPost::CallFunc_SetObjectArray_ReturnValue_2' has a wrong offset!");

// Function BPL_PlayerTrace.BPL_PlayerTrace_C.Json_CriticalPost
// 0x0138 (0x0138 - 0x0000)
struct BPL_PlayerTrace_C_Json_CriticalPost final
{
public:
	int32                                         CharaID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Chara;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_SetString_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_SetString_ReturnValue_1;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJsonDataCtrl*>                  K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_GetDebugGameTrace_IsEnable;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue_1;                     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Json_CounterGet_Trace_Counter_Encount_Num; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Json_CounterGet_Trace_Counter_Magatukanum; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue_2;                     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_1;             // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJsonDataCtrl*                          CallFunc_SetObjectArray_ReturnValue;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetJsonFileName_FileName;                 // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UJsonDataCtrl*>                  K2Node_MakeArray_Array_1;                          // 0x00E8(0x0010)(ConstParm, ReferenceParm)
	class UJsonDataCtrl*                          CallFunc_SetObjectArray_ReturnValue_1;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue_3;                     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJsonDataCtrl*>                  K2Node_MakeArray_Array_2;                          // 0x0108(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_GetMapID_ReturnValue;                     // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJsonEditor_ReturnValue;                 // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_SetObjectArray_ReturnValue_2;             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_PlayerTrace_C_Json_CriticalPost) == 0x000008, "Wrong alignment on BPL_PlayerTrace_C_Json_CriticalPost");
static_assert(sizeof(BPL_PlayerTrace_C_Json_CriticalPost) == 0x000138, "Wrong size on BPL_PlayerTrace_C_Json_CriticalPost");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, CharaID) == 0x000000, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::CharaID' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, __WorldContext) == 0x000008, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, Chara) == 0x000010, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::Chara' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, CallFunc_Create_ReturnValue) == 0x000018, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, CallFunc_SetString_ReturnValue) == 0x000030, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::CallFunc_SetString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, CallFunc_GetGameInstance_ReturnValue) == 0x000038, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, CallFunc_SetString_ReturnValue_1) == 0x000040, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::CallFunc_SetString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, K2Node_DynamicCast_AsBPI_Map_Common) == 0x000048, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, K2Node_MakeArray_Array) == 0x000060, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, CallFunc_GetDebugGameTrace_IsEnable) == 0x000070, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::CallFunc_GetDebugGameTrace_IsEnable' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, CallFunc_Create_ReturnValue_1) == 0x000078, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, CallFunc_Json_CounterGet_Trace_Counter_Encount_Num) == 0x000080, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::CallFunc_Json_CounterGet_Trace_Counter_Encount_Num' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, CallFunc_Json_CounterGet_Trace_Counter_Magatukanum) == 0x000084, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::CallFunc_Json_CounterGet_Trace_Counter_Magatukanum' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, CallFunc_Create_ReturnValue_2) == 0x000088, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000090, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, CallFunc_GetGameInstance_ReturnValue_1) == 0x0000A0, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, CallFunc_Concat_StrStr_ReturnValue) == 0x0000A8, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, K2Node_DynamicCast_AsBPI_Map_Common_1) == 0x0000B8, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::K2Node_DynamicCast_AsBPI_Map_Common_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, CallFunc_SetObjectArray_ReturnValue) == 0x0000D0, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::CallFunc_SetObjectArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, CallFunc_GetJsonFileName_FileName) == 0x0000D8, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::CallFunc_GetJsonFileName_FileName' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, K2Node_MakeArray_Array_1) == 0x0000E8, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, CallFunc_SetObjectArray_ReturnValue_1) == 0x0000F8, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::CallFunc_SetObjectArray_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, CallFunc_Create_ReturnValue_3) == 0x000100, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, K2Node_MakeArray_Array_2) == 0x000108, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, CallFunc_GetMapID_ReturnValue) == 0x000118, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::CallFunc_GetMapID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, CallFunc_IsJsonEditor_ReturnValue) == 0x00011C, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::CallFunc_IsJsonEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000120, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CriticalPost, CallFunc_SetObjectArray_ReturnValue_2) == 0x000130, "Member 'BPL_PlayerTrace_C_Json_CriticalPost::CallFunc_SetObjectArray_ReturnValue_2' has a wrong offset!");

// Function BPL_PlayerTrace.BPL_PlayerTrace_C.Json_CounterPost
// 0x0138 (0x0138 - 0x0000)
struct BPL_PlayerTrace_C_Json_CounterPost final
{
public:
	int32                                         CharaID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Chara;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_SetString_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_SetString_ReturnValue_1;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJsonDataCtrl*>                  K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_GetDebugGameTrace_IsEnable;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue_1;                     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Json_CounterGet_Trace_Counter_Encount_Num; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Json_CounterGet_Trace_Counter_Magatukanum; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue_2;                     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_1;             // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJsonDataCtrl*                          CallFunc_SetObjectArray_ReturnValue;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetJsonFileName_FileName;                 // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UJsonDataCtrl*>                  K2Node_MakeArray_Array_1;                          // 0x00E8(0x0010)(ConstParm, ReferenceParm)
	class UJsonDataCtrl*                          CallFunc_SetObjectArray_ReturnValue_1;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue_3;                     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJsonDataCtrl*>                  K2Node_MakeArray_Array_2;                          // 0x0108(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_GetMapID_ReturnValue;                     // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJsonEditor_ReturnValue;                 // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_SetObjectArray_ReturnValue_2;             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_PlayerTrace_C_Json_CounterPost) == 0x000008, "Wrong alignment on BPL_PlayerTrace_C_Json_CounterPost");
static_assert(sizeof(BPL_PlayerTrace_C_Json_CounterPost) == 0x000138, "Wrong size on BPL_PlayerTrace_C_Json_CounterPost");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, CharaID) == 0x000000, "Member 'BPL_PlayerTrace_C_Json_CounterPost::CharaID' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, __WorldContext) == 0x000008, "Member 'BPL_PlayerTrace_C_Json_CounterPost::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, Chara) == 0x000010, "Member 'BPL_PlayerTrace_C_Json_CounterPost::Chara' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, CallFunc_Create_ReturnValue) == 0x000018, "Member 'BPL_PlayerTrace_C_Json_CounterPost::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'BPL_PlayerTrace_C_Json_CounterPost::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, CallFunc_SetString_ReturnValue) == 0x000030, "Member 'BPL_PlayerTrace_C_Json_CounterPost::CallFunc_SetString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, CallFunc_GetGameInstance_ReturnValue) == 0x000038, "Member 'BPL_PlayerTrace_C_Json_CounterPost::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, CallFunc_SetString_ReturnValue_1) == 0x000040, "Member 'BPL_PlayerTrace_C_Json_CounterPost::CallFunc_SetString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, K2Node_DynamicCast_AsBPI_Map_Common) == 0x000048, "Member 'BPL_PlayerTrace_C_Json_CounterPost::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BPL_PlayerTrace_C_Json_CounterPost::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, K2Node_MakeArray_Array) == 0x000060, "Member 'BPL_PlayerTrace_C_Json_CounterPost::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, CallFunc_GetDebugGameTrace_IsEnable) == 0x000070, "Member 'BPL_PlayerTrace_C_Json_CounterPost::CallFunc_GetDebugGameTrace_IsEnable' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, CallFunc_Create_ReturnValue_1) == 0x000078, "Member 'BPL_PlayerTrace_C_Json_CounterPost::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, CallFunc_Json_CounterGet_Trace_Counter_Encount_Num) == 0x000080, "Member 'BPL_PlayerTrace_C_Json_CounterPost::CallFunc_Json_CounterGet_Trace_Counter_Encount_Num' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, CallFunc_Json_CounterGet_Trace_Counter_Magatukanum) == 0x000084, "Member 'BPL_PlayerTrace_C_Json_CounterPost::CallFunc_Json_CounterGet_Trace_Counter_Magatukanum' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, CallFunc_Create_ReturnValue_2) == 0x000088, "Member 'BPL_PlayerTrace_C_Json_CounterPost::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000090, "Member 'BPL_PlayerTrace_C_Json_CounterPost::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, CallFunc_GetGameInstance_ReturnValue_1) == 0x0000A0, "Member 'BPL_PlayerTrace_C_Json_CounterPost::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, CallFunc_Concat_StrStr_ReturnValue) == 0x0000A8, "Member 'BPL_PlayerTrace_C_Json_CounterPost::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, K2Node_DynamicCast_AsBPI_Map_Common_1) == 0x0000B8, "Member 'BPL_PlayerTrace_C_Json_CounterPost::K2Node_DynamicCast_AsBPI_Map_Common_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'BPL_PlayerTrace_C_Json_CounterPost::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, CallFunc_SetObjectArray_ReturnValue) == 0x0000D0, "Member 'BPL_PlayerTrace_C_Json_CounterPost::CallFunc_SetObjectArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, CallFunc_GetJsonFileName_FileName) == 0x0000D8, "Member 'BPL_PlayerTrace_C_Json_CounterPost::CallFunc_GetJsonFileName_FileName' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, K2Node_MakeArray_Array_1) == 0x0000E8, "Member 'BPL_PlayerTrace_C_Json_CounterPost::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, CallFunc_SetObjectArray_ReturnValue_1) == 0x0000F8, "Member 'BPL_PlayerTrace_C_Json_CounterPost::CallFunc_SetObjectArray_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, CallFunc_Create_ReturnValue_3) == 0x000100, "Member 'BPL_PlayerTrace_C_Json_CounterPost::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, K2Node_MakeArray_Array_2) == 0x000108, "Member 'BPL_PlayerTrace_C_Json_CounterPost::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, CallFunc_GetMapID_ReturnValue) == 0x000118, "Member 'BPL_PlayerTrace_C_Json_CounterPost::CallFunc_GetMapID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, CallFunc_IsJsonEditor_ReturnValue) == 0x00011C, "Member 'BPL_PlayerTrace_C_Json_CounterPost::CallFunc_IsJsonEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000120, "Member 'BPL_PlayerTrace_C_Json_CounterPost::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_PlayerTrace_C_Json_CounterPost, CallFunc_SetObjectArray_ReturnValue_2) == 0x000130, "Member 'BPL_PlayerTrace_C_Json_CounterPost::CallFunc_SetObjectArray_ReturnValue_2' has a wrong offset!");

// Function BPL_PlayerTrace.BPL_PlayerTrace_C.Json_BattleStart
// 0x08E8 (0x08E8 - 0x0000)
struct BPL_PlayerTrace_C_Json_BattleStart final
{
public:
	int32                                         EncountID;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EncID;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJsonDataCtrl*>                  NkmList;                                           // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<class UJsonDataCtrl*>                  List;                                              // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         SkillList;                                         // 0x0038(0x0010)(Edit, BlueprintVisible)
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue_1;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue_2;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue_3;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue_4;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue_5;                     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue_6;                     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue_7;                     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue_8;                     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue_9;                     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Json_CounterGet_Trace_Counter_Encount_Num; // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Json_CounterGet_Trace_Counter_Magatukanum; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDebugGameTrace_IsEnable;               // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue_10;                    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_Create_ReturnValue_11;                    // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_SetString_ReturnValue;                    // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_1;             // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetJsonFileName_FileName;                 // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCharData                              CallFunc_GetPlayerData_ReturnValue;                // 0x0150(0x0130)(ConstParm)
	struct FLearnSkill                            CallFunc_Array_Get_Item;                           // 0x0280(0x0008)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_4;           // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_SetString_ReturnValue_1;                  // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJsonDataCtrl*                          CallFunc_SetString_ReturnValue_2;                  // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJsonDataCtrl*                          CallFunc_SetString_ReturnValue_3;                  // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
