#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_AchievementDebug

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BPL_AchievementDebug.BPL_AchievementDebug_C.AddDebugMenuAchievementDebug
// 0x01F8 (0x01F8 - 0x0000)
struct BPL_AchievementDebug_C_AddDebugMenuAchievementDebug final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40E3[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_1;           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue;  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_2;           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_3;           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_2; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_4;           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_5;           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_3; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_4; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_6;           // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_7;           // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_5; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue;    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_8;           // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_9;           // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1;  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2; // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_10;          // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_11;          // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_6; // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_12;          // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_13;          // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_4; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_5; // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_7; // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40E4[0x2];                                     // 0x012E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40E5[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuNameChangeObj                K2Node_MakeStruct_DebugMenuNameChangeObj;          // 0x0148(0x0028)()
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_8; // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeNameChange_ReturnValue; // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDebugMenuNameChangeObj                K2Node_MakeStruct_DebugMenuNameChangeObj_1;        // 0x0178(0x0028)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40E6[0x6];                                     // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40E7[0x4];                                     // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuNameChangeObj                K2Node_MakeStruct_DebugMenuNameChangeObj_2;        // 0x01C0(0x0028)()
	int32                                         CallFunc_AddDebugMenuItemTypeNameChange_ReturnValue_1; // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeNameChange_ReturnValue_2; // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue; // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_6; // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug) == 0x000008, "Wrong alignment on BPL_AchievementDebug_C_AddDebugMenuAchievementDebug");
static_assert(sizeof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug) == 0x0001F8, "Wrong size on BPL_AchievementDebug_C_AddDebugMenuAchievementDebug");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, __WorldContext) == 0x000000, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x000008, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_DebugMenu_DispName_L10N_Text) == 0x000010, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_DebugMenu_DispName_L10N_Text' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_DebugMenu_DispName_L10N_Text_1) == 0x000020, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_DebugMenu_DispName_L10N_Text_1' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue) == 0x000030, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1) == 0x000034, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_DebugMenu_DispName_L10N_Text_2) == 0x000038, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_DebugMenu_DispName_L10N_Text_2' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_DebugMenu_DispName_L10N_Text_3) == 0x000048, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_DebugMenu_DispName_L10N_Text_3' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1) == 0x000058, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_2) == 0x00005C, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_DebugMenu_DispName_L10N_Text_4) == 0x000060, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_DebugMenu_DispName_L10N_Text_4' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_DebugMenu_DispName_L10N_Text_5) == 0x000070, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_DebugMenu_DispName_L10N_Text_5' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_3) == 0x000080, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_4) == 0x000084, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_DebugMenu_DispName_L10N_Text_6) == 0x000088, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_DebugMenu_DispName_L10N_Text_6' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_DebugMenu_DispName_L10N_Text_7) == 0x000098, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_DebugMenu_DispName_L10N_Text_7' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_5) == 0x0000A8, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_AddDebugMenuItemTypeParam_ReturnValue) == 0x0000AC, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_AddDebugMenuItemTypeParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_DebugMenu_DispName_L10N_Text_8) == 0x0000B0, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_DebugMenu_DispName_L10N_Text_8' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_DebugMenu_DispName_L10N_Text_9) == 0x0000C0, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_DebugMenu_DispName_L10N_Text_9' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1) == 0x0000D0, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2) == 0x0000D4, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_DebugMenu_DispName_L10N_Text_10) == 0x0000D8, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_DebugMenu_DispName_L10N_Text_10' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_DebugMenu_DispName_L10N_Text_11) == 0x0000E8, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_DebugMenu_DispName_L10N_Text_11' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_6) == 0x0000F8, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3) == 0x0000FC, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_DebugMenu_DispName_L10N_Text_12) == 0x000100, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_DebugMenu_DispName_L10N_Text_12' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_DebugMenu_DispName_L10N_Text_13) == 0x000110, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_DebugMenu_DispName_L10N_Text_13' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_4) == 0x000120, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_5) == 0x000124, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_7) == 0x000128, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_MakeLiteralByte_ReturnValue) == 0x00012C, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00012D, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000130, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000140, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, K2Node_MakeStruct_DebugMenuNameChangeObj) == 0x000148, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::K2Node_MakeStruct_DebugMenuNameChangeObj' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_8) == 0x000170, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_AddDebugMenuItemTypeNameChange_ReturnValue) == 0x000174, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_AddDebugMenuItemTypeNameChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, K2Node_MakeStruct_DebugMenuNameChangeObj_1) == 0x000178, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::K2Node_MakeStruct_DebugMenuNameChangeObj_1' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x0001A0, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x0001A1, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x0001A8, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x0001B8, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, K2Node_MakeStruct_DebugMenuNameChangeObj_2) == 0x0001C0, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::K2Node_MakeStruct_DebugMenuNameChangeObj_2' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_AddDebugMenuItemTypeNameChange_ReturnValue_1) == 0x0001E8, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_AddDebugMenuItemTypeNameChange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_AddDebugMenuItemTypeNameChange_ReturnValue_2) == 0x0001EC, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_AddDebugMenuItemTypeNameChange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue) == 0x0001F0, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_AddDebugMenuAchievementDebug, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_6) == 0x0001F4, "Member 'BPL_AchievementDebug_C_AddDebugMenuAchievementDebug::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_6' has a wrong offset!");

// Function BPL_AchievementDebug.BPL_AchievementDebug_C.IsUtsusemiUnionIgnore
// 0x00E8 (0x00E8 - 0x0000)
struct BPL_AchievementDebug_C_IsUtsusemiUnionIgnore final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ignore;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40E8[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x0010(0x00D0)()
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_AchievementDebug_C_IsUtsusemiUnionIgnore) == 0x000008, "Wrong alignment on BPL_AchievementDebug_C_IsUtsusemiUnionIgnore");
static_assert(sizeof(BPL_AchievementDebug_C_IsUtsusemiUnionIgnore) == 0x0000E8, "Wrong size on BPL_AchievementDebug_C_IsUtsusemiUnionIgnore");
static_assert(offsetof(BPL_AchievementDebug_C_IsUtsusemiUnionIgnore, __WorldContext) == 0x000000, "Member 'BPL_AchievementDebug_C_IsUtsusemiUnionIgnore::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsUtsusemiUnionIgnore, Ignore) == 0x000008, "Member 'BPL_AchievementDebug_C_IsUtsusemiUnionIgnore::Ignore' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsUtsusemiUnionIgnore, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue) == 0x000010, "Member 'BPL_AchievementDebug_C_IsUtsusemiUnionIgnore::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsUtsusemiUnionIgnore, CallFunc_Conv_IntToBool_ReturnValue) == 0x0000E0, "Member 'BPL_AchievementDebug_C_IsUtsusemiUnionIgnore::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");

// Function BPL_AchievementDebug.BPL_AchievementDebug_C.IsGodParameterIgnore
// 0x00E8 (0x00E8 - 0x0000)
struct BPL_AchievementDebug_C_IsGodParameterIgnore final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ignore;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40E9[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x0010(0x00D0)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_AchievementDebug_C_IsGodParameterIgnore) == 0x000008, "Wrong alignment on BPL_AchievementDebug_C_IsGodParameterIgnore");
static_assert(sizeof(BPL_AchievementDebug_C_IsGodParameterIgnore) == 0x0000E8, "Wrong size on BPL_AchievementDebug_C_IsGodParameterIgnore");
static_assert(offsetof(BPL_AchievementDebug_C_IsGodParameterIgnore, __WorldContext) == 0x000000, "Member 'BPL_AchievementDebug_C_IsGodParameterIgnore::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsGodParameterIgnore, Ignore) == 0x000008, "Member 'BPL_AchievementDebug_C_IsGodParameterIgnore::Ignore' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsGodParameterIgnore, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue) == 0x000010, "Member 'BPL_AchievementDebug_C_IsGodParameterIgnore::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsGodParameterIgnore, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'BPL_AchievementDebug_C_IsGodParameterIgnore::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BPL_AchievementDebug.BPL_AchievementDebug_C.IsFoundMiman100Ignore
// 0x00E8 (0x00E8 - 0x0000)
struct BPL_AchievementDebug_C_IsFoundMiman100Ignore final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ignore;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40EA[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x0010(0x00D0)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_AchievementDebug_C_IsFoundMiman100Ignore) == 0x000008, "Wrong alignment on BPL_AchievementDebug_C_IsFoundMiman100Ignore");
static_assert(sizeof(BPL_AchievementDebug_C_IsFoundMiman100Ignore) == 0x0000E8, "Wrong size on BPL_AchievementDebug_C_IsFoundMiman100Ignore");
static_assert(offsetof(BPL_AchievementDebug_C_IsFoundMiman100Ignore, __WorldContext) == 0x000000, "Member 'BPL_AchievementDebug_C_IsFoundMiman100Ignore::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsFoundMiman100Ignore, Ignore) == 0x000008, "Member 'BPL_AchievementDebug_C_IsFoundMiman100Ignore::Ignore' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsFoundMiman100Ignore, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue) == 0x000010, "Member 'BPL_AchievementDebug_C_IsFoundMiman100Ignore::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsFoundMiman100Ignore, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'BPL_AchievementDebug_C_IsFoundMiman100Ignore::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BPL_AchievementDebug.BPL_AchievementDebug_C.IsFoundMiman200Ignore
// 0x00E8 (0x00E8 - 0x0000)
struct BPL_AchievementDebug_C_IsFoundMiman200Ignore final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ignore;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40EB[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x0010(0x00D0)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_AchievementDebug_C_IsFoundMiman200Ignore) == 0x000008, "Wrong alignment on BPL_AchievementDebug_C_IsFoundMiman200Ignore");
static_assert(sizeof(BPL_AchievementDebug_C_IsFoundMiman200Ignore) == 0x0000E8, "Wrong size on BPL_AchievementDebug_C_IsFoundMiman200Ignore");
static_assert(offsetof(BPL_AchievementDebug_C_IsFoundMiman200Ignore, __WorldContext) == 0x000000, "Member 'BPL_AchievementDebug_C_IsFoundMiman200Ignore::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsFoundMiman200Ignore, Ignore) == 0x000008, "Member 'BPL_AchievementDebug_C_IsFoundMiman200Ignore::Ignore' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsFoundMiman200Ignore, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue) == 0x000010, "Member 'BPL_AchievementDebug_C_IsFoundMiman200Ignore::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsFoundMiman200Ignore, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'BPL_AchievementDebug_C_IsFoundMiman200Ignore::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BPL_AchievementDebug.BPL_AchievementDebug_C.IsAogamiDebrisIgnore
// 0x00E8 (0x00E8 - 0x0000)
struct BPL_AchievementDebug_C_IsAogamiDebrisIgnore final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ignore;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40EC[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x0010(0x00D0)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_AchievementDebug_C_IsAogamiDebrisIgnore) == 0x000008, "Wrong alignment on BPL_AchievementDebug_C_IsAogamiDebrisIgnore");
static_assert(sizeof(BPL_AchievementDebug_C_IsAogamiDebrisIgnore) == 0x0000E8, "Wrong size on BPL_AchievementDebug_C_IsAogamiDebrisIgnore");
static_assert(offsetof(BPL_AchievementDebug_C_IsAogamiDebrisIgnore, __WorldContext) == 0x000000, "Member 'BPL_AchievementDebug_C_IsAogamiDebrisIgnore::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsAogamiDebrisIgnore, Ignore) == 0x000008, "Member 'BPL_AchievementDebug_C_IsAogamiDebrisIgnore::Ignore' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsAogamiDebrisIgnore, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue) == 0x000010, "Member 'BPL_AchievementDebug_C_IsAogamiDebrisIgnore::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsAogamiDebrisIgnore, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'BPL_AchievementDebug_C_IsAogamiDebrisIgnore::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BPL_AchievementDebug.BPL_AchievementDebug_C.IsGetRelicIgnore
// 0x00E8 (0x00E8 - 0x0000)
struct BPL_AchievementDebug_C_IsGetRelicIgnore final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ignore;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40ED[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x0010(0x00D0)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_AchievementDebug_C_IsGetRelicIgnore) == 0x000008, "Wrong alignment on BPL_AchievementDebug_C_IsGetRelicIgnore");
static_assert(sizeof(BPL_AchievementDebug_C_IsGetRelicIgnore) == 0x0000E8, "Wrong size on BPL_AchievementDebug_C_IsGetRelicIgnore");
static_assert(offsetof(BPL_AchievementDebug_C_IsGetRelicIgnore, __WorldContext) == 0x000000, "Member 'BPL_AchievementDebug_C_IsGetRelicIgnore::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsGetRelicIgnore, Ignore) == 0x000008, "Member 'BPL_AchievementDebug_C_IsGetRelicIgnore::Ignore' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsGetRelicIgnore, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue) == 0x000010, "Member 'BPL_AchievementDebug_C_IsGetRelicIgnore::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsGetRelicIgnore, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'BPL_AchievementDebug_C_IsGetRelicIgnore::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BPL_AchievementDebug.BPL_AchievementDebug_C.IsFoundStatusIgnore
// 0x00E8 (0x00E8 - 0x0000)
struct BPL_AchievementDebug_C_IsFoundStatusIgnore final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ignore;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40EE[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x0010(0x00D0)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_AchievementDebug_C_IsFoundStatusIgnore) == 0x000008, "Wrong alignment on BPL_AchievementDebug_C_IsFoundStatusIgnore");
static_assert(sizeof(BPL_AchievementDebug_C_IsFoundStatusIgnore) == 0x0000E8, "Wrong size on BPL_AchievementDebug_C_IsFoundStatusIgnore");
static_assert(offsetof(BPL_AchievementDebug_C_IsFoundStatusIgnore, __WorldContext) == 0x000000, "Member 'BPL_AchievementDebug_C_IsFoundStatusIgnore::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsFoundStatusIgnore, Ignore) == 0x000008, "Member 'BPL_AchievementDebug_C_IsFoundStatusIgnore::Ignore' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsFoundStatusIgnore, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue) == 0x000010, "Member 'BPL_AchievementDebug_C_IsFoundStatusIgnore::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsFoundStatusIgnore, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'BPL_AchievementDebug_C_IsFoundStatusIgnore::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BPL_AchievementDebug.BPL_AchievementDebug_C.IsBreakMagatsukaIgnore
// 0x00E8 (0x00E8 - 0x0000)
struct BPL_AchievementDebug_C_IsBreakMagatsukaIgnore final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ignore;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40EF[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x0010(0x00D0)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_AchievementDebug_C_IsBreakMagatsukaIgnore) == 0x000008, "Wrong alignment on BPL_AchievementDebug_C_IsBreakMagatsukaIgnore");
static_assert(sizeof(BPL_AchievementDebug_C_IsBreakMagatsukaIgnore) == 0x0000E8, "Wrong size on BPL_AchievementDebug_C_IsBreakMagatsukaIgnore");
static_assert(offsetof(BPL_AchievementDebug_C_IsBreakMagatsukaIgnore, __WorldContext) == 0x000000, "Member 'BPL_AchievementDebug_C_IsBreakMagatsukaIgnore::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsBreakMagatsukaIgnore, Ignore) == 0x000008, "Member 'BPL_AchievementDebug_C_IsBreakMagatsukaIgnore::Ignore' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsBreakMagatsukaIgnore, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue) == 0x000010, "Member 'BPL_AchievementDebug_C_IsBreakMagatsukaIgnore::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsBreakMagatsukaIgnore, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'BPL_AchievementDebug_C_IsBreakMagatsukaIgnore::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BPL_AchievementDebug.BPL_AchievementDebug_C.IsGetShinseiIgnore
// 0x00E8 (0x00E8 - 0x0000)
struct BPL_AchievementDebug_C_IsGetShinseiIgnore final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ignore;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40F0[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x0010(0x00D0)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_AchievementDebug_C_IsGetShinseiIgnore) == 0x000008, "Wrong alignment on BPL_AchievementDebug_C_IsGetShinseiIgnore");
static_assert(sizeof(BPL_AchievementDebug_C_IsGetShinseiIgnore) == 0x0000E8, "Wrong size on BPL_AchievementDebug_C_IsGetShinseiIgnore");
static_assert(offsetof(BPL_AchievementDebug_C_IsGetShinseiIgnore, __WorldContext) == 0x000000, "Member 'BPL_AchievementDebug_C_IsGetShinseiIgnore::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsGetShinseiIgnore, Ignore) == 0x000008, "Member 'BPL_AchievementDebug_C_IsGetShinseiIgnore::Ignore' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsGetShinseiIgnore, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue) == 0x000010, "Member 'BPL_AchievementDebug_C_IsGetShinseiIgnore::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsGetShinseiIgnore, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'BPL_AchievementDebug_C_IsGetShinseiIgnore::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BPL_AchievementDebug.BPL_AchievementDebug_C.IsCheckNaviDevilIgnore
// 0x00E8 (0x00E8 - 0x0000)
struct BPL_AchievementDebug_C_IsCheckNaviDevilIgnore final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ignore;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40F1[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x0010(0x00D0)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_AchievementDebug_C_IsCheckNaviDevilIgnore) == 0x000008, "Wrong alignment on BPL_AchievementDebug_C_IsCheckNaviDevilIgnore");
static_assert(sizeof(BPL_AchievementDebug_C_IsCheckNaviDevilIgnore) == 0x0000E8, "Wrong size on BPL_AchievementDebug_C_IsCheckNaviDevilIgnore");
static_assert(offsetof(BPL_AchievementDebug_C_IsCheckNaviDevilIgnore, __WorldContext) == 0x000000, "Member 'BPL_AchievementDebug_C_IsCheckNaviDevilIgnore::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsCheckNaviDevilIgnore, Ignore) == 0x000008, "Member 'BPL_AchievementDebug_C_IsCheckNaviDevilIgnore::Ignore' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsCheckNaviDevilIgnore, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue) == 0x000010, "Member 'BPL_AchievementDebug_C_IsCheckNaviDevilIgnore::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsCheckNaviDevilIgnore, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'BPL_AchievementDebug_C_IsCheckNaviDevilIgnore::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BPL_AchievementDebug.BPL_AchievementDebug_C.IsGardenPresentIgnore
// 0x00E8 (0x00E8 - 0x0000)
struct BPL_AchievementDebug_C_IsGardenPresentIgnore final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ignore;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40F2[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x0010(0x00D0)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_AchievementDebug_C_IsGardenPresentIgnore) == 0x000008, "Wrong alignment on BPL_AchievementDebug_C_IsGardenPresentIgnore");
static_assert(sizeof(BPL_AchievementDebug_C_IsGardenPresentIgnore) == 0x0000E8, "Wrong size on BPL_AchievementDebug_C_IsGardenPresentIgnore");
static_assert(offsetof(BPL_AchievementDebug_C_IsGardenPresentIgnore, __WorldContext) == 0x000000, "Member 'BPL_AchievementDebug_C_IsGardenPresentIgnore::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsGardenPresentIgnore, Ignore) == 0x000008, "Member 'BPL_AchievementDebug_C_IsGardenPresentIgnore::Ignore' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsGardenPresentIgnore, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue) == 0x000010, "Member 'BPL_AchievementDebug_C_IsGardenPresentIgnore::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsGardenPresentIgnore, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'BPL_AchievementDebug_C_IsGardenPresentIgnore::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BPL_AchievementDebug.BPL_AchievementDebug_C.IsGardenTalkIgnore
// 0x00E8 (0x00E8 - 0x0000)
struct BPL_AchievementDebug_C_IsGardenTalkIgnore final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ignore;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40F3[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x0010(0x00D0)()
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_AchievementDebug_C_IsGardenTalkIgnore) == 0x000008, "Wrong alignment on BPL_AchievementDebug_C_IsGardenTalkIgnore");
static_assert(sizeof(BPL_AchievementDebug_C_IsGardenTalkIgnore) == 0x0000E8, "Wrong size on BPL_AchievementDebug_C_IsGardenTalkIgnore");
static_assert(offsetof(BPL_AchievementDebug_C_IsGardenTalkIgnore, __WorldContext) == 0x000000, "Member 'BPL_AchievementDebug_C_IsGardenTalkIgnore::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsGardenTalkIgnore, Ignore) == 0x000008, "Member 'BPL_AchievementDebug_C_IsGardenTalkIgnore::Ignore' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsGardenTalkIgnore, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue) == 0x000010, "Member 'BPL_AchievementDebug_C_IsGardenTalkIgnore::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsGardenTalkIgnore, CallFunc_Conv_IntToBool_ReturnValue) == 0x0000E0, "Member 'BPL_AchievementDebug_C_IsGardenTalkIgnore::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");

// Function BPL_AchievementDebug.BPL_AchievementDebug_C.IsClearSubQuestIgnore
// 0x00E8 (0x00E8 - 0x0000)
struct BPL_AchievementDebug_C_IsClearSubQuestIgnore final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ignore;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40F4[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x0010(0x00D0)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_AchievementDebug_C_IsClearSubQuestIgnore) == 0x000008, "Wrong alignment on BPL_AchievementDebug_C_IsClearSubQuestIgnore");
static_assert(sizeof(BPL_AchievementDebug_C_IsClearSubQuestIgnore) == 0x0000E8, "Wrong size on BPL_AchievementDebug_C_IsClearSubQuestIgnore");
static_assert(offsetof(BPL_AchievementDebug_C_IsClearSubQuestIgnore, __WorldContext) == 0x000000, "Member 'BPL_AchievementDebug_C_IsClearSubQuestIgnore::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsClearSubQuestIgnore, Ignore) == 0x000008, "Member 'BPL_AchievementDebug_C_IsClearSubQuestIgnore::Ignore' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsClearSubQuestIgnore, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue) == 0x000010, "Member 'BPL_AchievementDebug_C_IsClearSubQuestIgnore::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_AchievementDebug_C_IsClearSubQuestIgnore, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'BPL_AchievementDebug_C_IsClearSubQuestIgnore::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BPL_AchievementDebug.BPL_AchievementDebug_C.AddDebugMenuAchievementCounter
// 0x0240 (0x0240 - 0x0000)
struct BPL_AchievementDebug_C_AddDebugMenuAchievementCounter final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDebugMenuNameChangeObj                K2Node_MakeStruct_DebugMenuNameChangeObj;          // 0x0008(0x0028)()
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeNameChange_ReturnValue; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_1;           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_2;           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_3;           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_4;           // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_5;           // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_6;           // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_3; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_4; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_7;           // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_8;           // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_5; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue;    // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_9;           // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_10;          // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1;  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2;  // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_11;          // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_12;          // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3;  // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4;  // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_13;          // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_14;          // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_5;  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_6; // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_15;          // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_16;          // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_7; // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_8; // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_17;          // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_18;          // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_9; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_10; // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_19;          // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_20;          // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_11; // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_12; // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_21;          // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_22;          // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_13; // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_14; // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_23;          // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_24;          // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_15; // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
