#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_SortWindow2

#include "Basic.hpp"

#include "E_SORTWINDOW_SCROLL_OFFSET_PATTERN_structs.hpp"
#include "Project_structs.hpp"
#include "E_SORTWINDOW_ANIM_STATE_structs.hpp"
#include "E_SORTWINDOW_POS_TYPE_structs.hpp"


namespace SDK::Params
{

// Function BPL_SortWindow2.BPL_SortWindow2_C.BPL_SortWindow2_Open
// 0x0070 (0x0070 - 0x0000)
struct BPL_SortWindow2_C_BPL_SortWindow2_Open final
{
public:
	E_SORT_WINDOW_SORT_TYPE                       InSortScene;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SORTWINDOW_POS_TYPE                         InPosType;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSkipAnimation;                                   // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsAutoSetupCursor;                                 // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsAutoSetupDecideSlot;                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EB5[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EB6[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EB7[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetSortWindowCtrl2_outActor;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SortWindowCtrl2_C> K2Node_DynamicCast_AsBPI_Sort_Window_Ctrl_2;       // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_SortWindow2_C_BPL_SortWindow2_Open) == 0x000008, "Wrong alignment on BPL_SortWindow2_C_BPL_SortWindow2_Open");
static_assert(sizeof(BPL_SortWindow2_C_BPL_SortWindow2_Open) == 0x000070, "Wrong size on BPL_SortWindow2_C_BPL_SortWindow2_Open");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Open, InSortScene) == 0x000000, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Open::InSortScene' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Open, InPosType) == 0x000001, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Open::InPosType' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Open, IsSkipAnimation) == 0x000002, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Open::IsSkipAnimation' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Open, IsAutoSetupCursor) == 0x000003, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Open::IsAutoSetupCursor' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Open, IsAutoSetupDecideSlot) == 0x000004, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Open::IsAutoSetupDecideSlot' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Open, __WorldContext) == 0x000008, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Open::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Open, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Open::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Open, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Open::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Open, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Open::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Open, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Open::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Open, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Open::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Open, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Open::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Open, CallFunc_BPI_GetSortWindowCtrl2_outActor) == 0x000050, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Open::CallFunc_BPI_GetSortWindowCtrl2_outActor' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Open, K2Node_DynamicCast_AsBPI_Sort_Window_Ctrl_2) == 0x000058, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Open::K2Node_DynamicCast_AsBPI_Sort_Window_Ctrl_2' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Open, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Open::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BPL_SortWindow2.BPL_SortWindow2_C.BPL_SortWindow2_Close
// 0x0078 (0x0078 - 0x0000)
struct BPL_SortWindow2_C_BPL_SortWindow2_Close final
{
public:
	bool                                          IsSkipAnimation;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EB8[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CommonUI_EventCtrl_C*               CallFunc_GetCommonUI_EventCtrl_outActor;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EB9[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EBA[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetSortWindowCtrl2_outActor;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SortWindowCtrl2_C> K2Node_DynamicCast_AsBPI_Sort_Window_Ctrl_2;       // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_SortWindow2_C_BPL_SortWindow2_Close) == 0x000008, "Wrong alignment on BPL_SortWindow2_C_BPL_SortWindow2_Close");
static_assert(sizeof(BPL_SortWindow2_C_BPL_SortWindow2_Close) == 0x000078, "Wrong size on BPL_SortWindow2_C_BPL_SortWindow2_Close");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Close, IsSkipAnimation) == 0x000000, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Close::IsSkipAnimation' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Close, __WorldContext) == 0x000008, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Close::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Close, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Close::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Close, CallFunc_GetCommonUI_EventCtrl_outActor) == 0x000018, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Close::CallFunc_GetCommonUI_EventCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Close, K2Node_DynamicCast_AsBPI_UIManager) == 0x000020, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Close::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Close, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Close::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Close, CallFunc_BPI_GetUIManager_UIManager) == 0x000038, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Close::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Close, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000040, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Close::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Close, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Close::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Close, CallFunc_BPI_GetSortWindowCtrl2_outActor) == 0x000058, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Close::CallFunc_BPI_GetSortWindowCtrl2_outActor' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Close, K2Node_DynamicCast_AsBPI_Sort_Window_Ctrl_2) == 0x000060, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Close::K2Node_DynamicCast_AsBPI_Sort_Window_Ctrl_2' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_Close, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_Close::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BPL_SortWindow2.BPL_SortWindow2_C.BPL_SortWindow2_GetListNum
// 0x0070 (0x0070 - 0x0000)
struct BPL_SortWindow2_C_BPL_SortWindow2_GetListNum final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ListNum;                                           // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EBB[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EBC[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EBD[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetSortWindowCtrl2_outActor;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SortWindowCtrl2_C> K2Node_DynamicCast_AsBPI_Sort_Window_Ctrl_2;       // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EBE[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BPI_GetListNum_ListNum;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_SortWindow2_C_BPL_SortWindow2_GetListNum) == 0x000008, "Wrong alignment on BPL_SortWindow2_C_BPL_SortWindow2_GetListNum");
static_assert(sizeof(BPL_SortWindow2_C_BPL_SortWindow2_GetListNum) == 0x000070, "Wrong size on BPL_SortWindow2_C_BPL_SortWindow2_GetListNum");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetListNum, __WorldContext) == 0x000000, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetListNum::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetListNum, ListNum) == 0x000008, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetListNum::ListNum' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetListNum, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetListNum::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetListNum, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetListNum::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetListNum, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetListNum::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetListNum, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetListNum::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetListNum, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetListNum::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetListNum, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetListNum::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetListNum, CallFunc_BPI_GetSortWindowCtrl2_outActor) == 0x000050, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetListNum::CallFunc_BPI_GetSortWindowCtrl2_outActor' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetListNum, K2Node_DynamicCast_AsBPI_Sort_Window_Ctrl_2) == 0x000058, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetListNum::K2Node_DynamicCast_AsBPI_Sort_Window_Ctrl_2' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetListNum, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetListNum::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetListNum, CallFunc_BPI_GetListNum_ListNum) == 0x00006C, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetListNum::CallFunc_BPI_GetListNum_ListNum' has a wrong offset!");

// Function BPL_SortWindow2.BPL_SortWindow2_C.BPL_SortWindow2_GetAnimState
// 0x0070 (0x0070 - 0x0000)
struct BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SORTWINDOW_ANIM_STATE                       AnimState;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EBF[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EC0[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EC1[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetSortWindowCtrl2_outActor;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SortWindowCtrl2_C> K2Node_DynamicCast_AsBPI_Sort_Window_Ctrl_2;       // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_SORTWINDOW_ANIM_STATE                       CallFunc_BPI_GetAnimState_AnimState;               // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState) == 0x000008, "Wrong alignment on BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState");
static_assert(sizeof(BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState) == 0x000070, "Wrong size on BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState, __WorldContext) == 0x000000, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState, AnimState) == 0x000008, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState::AnimState' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState, CallFunc_BPI_GetSortWindowCtrl2_outActor) == 0x000050, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState::CallFunc_BPI_GetSortWindowCtrl2_outActor' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState, K2Node_DynamicCast_AsBPI_Sort_Window_Ctrl_2) == 0x000058, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState::K2Node_DynamicCast_AsBPI_Sort_Window_Ctrl_2' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState, CallFunc_BPI_GetAnimState_AnimState) == 0x000069, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetAnimState::CallFunc_BPI_GetAnimState_AnimState' has a wrong offset!");

// Function BPL_SortWindow2.BPL_SortWindow2_C.BPL_SortWindow2_CheckInputCursor
// 0x0048 (0x0048 - 0x0000)
struct BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EC2[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BPL_SortWindow2_GetListNum_ListNum;       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BPL_SortWindow2_GetCursorIdx_ListIndex;   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EC3[0x1];                                     // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BPL_SortWindow2_GetCursorIdx_ListIndex_1; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_2;               // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_3;               // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EC4[0x1];                                     // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BPL_SortWindow2_GetListNum_ListNum_1;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BPL_SortWindow2_GetCursorIdx_ListIndex_2; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionPadCheck_Success_4;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_5;               // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EC5[0x1];                                     // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BPL_SortWindow2_GetCursorIdx_ListIndex_3; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_6;               // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_7;               // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_SORTWINDOW_ANIM_STATE                       CallFunc_BPL_SortWindow2_GetAnimState_AnimState;   // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor) == 0x000008, "Wrong alignment on BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor");
static_assert(sizeof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor) == 0x000048, "Wrong size on BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, IsPlaySE) == 0x000000, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::IsPlaySE' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, __WorldContext) == 0x000008, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, CallFunc_BPL_SortWindow2_GetListNum_ListNum) == 0x000010, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::CallFunc_BPL_SortWindow2_GetListNum_ListNum' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, CallFunc_BPL_SortWindow2_GetCursorIdx_ListIndex) == 0x000018, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::CallFunc_BPL_SortWindow2_GetCursorIdx_ListIndex' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, CallFunc_IsActionPadCheck_Success) == 0x00001C, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, CallFunc_Less_IntInt_ReturnValue) == 0x00001D, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, CallFunc_IsActionPadCheck_Success_1) == 0x00001E, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::CallFunc_IsActionPadCheck_Success_1' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, CallFunc_BPL_SortWindow2_GetCursorIdx_ListIndex_1) == 0x000020, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::CallFunc_BPL_SortWindow2_GetCursorIdx_ListIndex_1' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, CallFunc_Less_IntInt_ReturnValue_1) == 0x000024, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, CallFunc_IsActionPadCheck_Success_2) == 0x000025, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::CallFunc_IsActionPadCheck_Success_2' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, CallFunc_IsActionPadCheck_Success_3) == 0x000026, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::CallFunc_IsActionPadCheck_Success_3' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, CallFunc_BPL_SortWindow2_GetListNum_ListNum_1) == 0x000028, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::CallFunc_BPL_SortWindow2_GetListNum_ListNum_1' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00002C, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, CallFunc_BPL_SortWindow2_GetCursorIdx_ListIndex_2) == 0x000030, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::CallFunc_BPL_SortWindow2_GetCursorIdx_ListIndex_2' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, CallFunc_IsActionPadCheck_Success_4) == 0x000034, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::CallFunc_IsActionPadCheck_Success_4' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, CallFunc_Less_IntInt_ReturnValue_2) == 0x000035, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, CallFunc_IsActionPadCheck_Success_5) == 0x000036, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::CallFunc_IsActionPadCheck_Success_5' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, CallFunc_BPL_SortWindow2_GetCursorIdx_ListIndex_3) == 0x000038, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::CallFunc_BPL_SortWindow2_GetCursorIdx_ListIndex_3' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, CallFunc_Less_IntInt_ReturnValue_3) == 0x00003C, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, CallFunc_IsActionPadCheck_Success_6) == 0x00003D, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::CallFunc_IsActionPadCheck_Success_6' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, CallFunc_IsActionPadCheck_Success_7) == 0x00003E, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::CallFunc_IsActionPadCheck_Success_7' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, CallFunc_BPL_SortWindow2_GetAnimState_AnimState) == 0x00003F, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::CallFunc_BPL_SortWindow2_GetAnimState_AnimState' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor, K2Node_SwitchEnum_CmpSuccess) == 0x000040, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_CheckInputCursor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BPL_SortWindow2.BPL_SortWindow2_C.BPL_SortWindow2_GetCursorIdx
// 0x0070 (0x0070 - 0x0000)
struct BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ListIndex;                                         // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC6[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EC7[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EC8[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetSortWindowCtrl2_outActor;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SortWindowCtrl2_C> K2Node_DynamicCast_AsBPI_Sort_Window_Ctrl_2;       // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EC9[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BPI_GetCursor_ListIndex;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx) == 0x000008, "Wrong alignment on BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx");
static_assert(sizeof(BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx) == 0x000070, "Wrong size on BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx, __WorldContext) == 0x000000, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx, ListIndex) == 0x000008, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx::ListIndex' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx, CallFunc_BPI_GetSortWindowCtrl2_outActor) == 0x000050, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx::CallFunc_BPI_GetSortWindowCtrl2_outActor' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx, K2Node_DynamicCast_AsBPI_Sort_Window_Ctrl_2) == 0x000058, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx::K2Node_DynamicCast_AsBPI_Sort_Window_Ctrl_2' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx, CallFunc_BPI_GetCursor_ListIndex) == 0x00006C, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_GetCursorIdx::CallFunc_BPI_GetCursor_ListIndex' has a wrong offset!");

// Function BPL_SortWindow2.BPL_SortWindow2_C.BPL_SortWindow2_SetCursorAndOffsetIdx
// 0x0078 (0x0078 - 0x0000)
struct BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx final
{
public:
	int32                                         InListIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InScrollOffset;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInitSetting;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsPlaySE;                                          // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ECA[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ECB[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ECC[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetSortWindowCtrl2_outActor;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SortWindowCtrl2_C> K2Node_DynamicCast_AsBPI_Sort_Window_Ctrl_2;       // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx) == 0x000008, "Wrong alignment on BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx");
static_assert(sizeof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx) == 0x000078, "Wrong size on BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx, InListIndex) == 0x000000, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx::InListIndex' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx, InScrollOffset) == 0x000004, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx::InScrollOffset' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx, IsInitSetting) == 0x000008, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx::IsInitSetting' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx, IsPlaySE) == 0x000009, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx::IsPlaySE' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx, __WorldContext) == 0x000010, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx, K2Node_DynamicCast_AsBPI_UIManager) == 0x000020, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx, CallFunc_BPI_GetUIManager_UIManager) == 0x000038, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000040, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx, CallFunc_BPI_GetSortWindowCtrl2_outActor) == 0x000058, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx::CallFunc_BPI_GetSortWindowCtrl2_outActor' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx, K2Node_DynamicCast_AsBPI_Sort_Window_Ctrl_2) == 0x000060, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx::K2Node_DynamicCast_AsBPI_Sort_Window_Ctrl_2' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetIdx::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BPL_SortWindow2.BPL_SortWindow2_C.BPL_SortWindow2_SetCursorAndOffsetPattern
// 0x0070 (0x0070 - 0x0000)
struct BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern final
{
public:
	int32                                         InListIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SORTWINDOW_SCROLL_OFFSET_PATTERN            InScrollOffsetPattern;                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInitSetting;                                     // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsPlaySE;                                          // 0x0006(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ECD[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ECE[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ECF[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetSortWindowCtrl2_outActor;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SortWindowCtrl2_C> K2Node_DynamicCast_AsBPI_Sort_Window_Ctrl_2;       // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern) == 0x000008, "Wrong alignment on BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern");
static_assert(sizeof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern) == 0x000070, "Wrong size on BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern, InListIndex) == 0x000000, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern::InListIndex' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern, InScrollOffsetPattern) == 0x000004, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern::InScrollOffsetPattern' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern, IsInitSetting) == 0x000005, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern::IsInitSetting' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern, IsPlaySE) == 0x000006, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern::IsPlaySE' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern, __WorldContext) == 0x000008, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern, CallFunc_BPI_GetSortWindowCtrl2_outActor) == 0x000050, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern::CallFunc_BPI_GetSortWindowCtrl2_outActor' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern, K2Node_DynamicCast_AsBPI_Sort_Window_Ctrl_2) == 0x000058, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern::K2Node_DynamicCast_AsBPI_Sort_Window_Ctrl_2' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_SetCursorAndOffsetPattern::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BPL_SortWindow2.BPL_SortWindow2_C.BPL_SortWindow2_MoveCursor_Up
// 0x0070 (0x0070 - 0x0000)
struct BPL_SortWindow2_C_BPL_SortWindow2_MoveCursor_Up final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ED0[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ED1[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ED2[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetSortWindowCtrl2_outActor;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SortWindowCtrl2_C> K2Node_DynamicCast_AsBPI_Sort_Window_Ctrl_2;       // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_SortWindow2_C_BPL_SortWindow2_MoveCursor_Up) == 0x000008, "Wrong alignment on BPL_SortWindow2_C_BPL_SortWindow2_MoveCursor_Up");
static_assert(sizeof(BPL_SortWindow2_C_BPL_SortWindow2_MoveCursor_Up) == 0x000070, "Wrong size on BPL_SortWindow2_C_BPL_SortWindow2_MoveCursor_Up");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_MoveCursor_Up, IsPlaySE) == 0x000000, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_MoveCursor_Up::IsPlaySE' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_MoveCursor_Up, __WorldContext) == 0x000008, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_MoveCursor_Up::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_MoveCursor_Up, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_MoveCursor_Up::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SortWindow2_C_BPL_SortWindow2_MoveCursor_Up, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_SortWindow2_C_BPL_SortWindow2_MoveCursor_Up::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
