#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_EnvCtrl

#include "Basic.hpp"

#include "DaathTypeList_structs.hpp"
#include "Engine_structs.hpp"
#include "ST_MapB_EffectParam_structs.hpp"
#include "ST_LightParam_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPL_EnvCtrl.BPL_EnvCtrl_C.SetDaathEnvCtrl
// 0x0330 (0x0330 - 0x0000)
struct BPL_EnvCtrl_C_SetDaathEnvCtrl final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_LightParam                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x0318)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_EnvCtrl_C_SetDaathEnvCtrl) == 0x000008, "Wrong alignment on BPL_EnvCtrl_C_SetDaathEnvCtrl");
static_assert(sizeof(BPL_EnvCtrl_C_SetDaathEnvCtrl) == 0x000330, "Wrong size on BPL_EnvCtrl_C_SetDaathEnvCtrl");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl, RowName) == 0x000000, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl::RowName' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl, __WorldContext) == 0x000008, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000328, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function BPL_EnvCtrl.BPL_EnvCtrl_C.GetDaathEnvCtrl
// 0x0648 (0x0648 - 0x0000)
struct BPL_EnvCtrl_C_GetDaathEnvCtrl final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_LightParam                         LightParam;                                        // 0x0010(0x0318)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_LightParam                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0328(0x0318)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_EnvCtrl_C_GetDaathEnvCtrl) == 0x000008, "Wrong alignment on BPL_EnvCtrl_C_GetDaathEnvCtrl");
static_assert(sizeof(BPL_EnvCtrl_C_GetDaathEnvCtrl) == 0x000648, "Wrong size on BPL_EnvCtrl_C_GetDaathEnvCtrl");
static_assert(offsetof(BPL_EnvCtrl_C_GetDaathEnvCtrl, RowName) == 0x000000, "Member 'BPL_EnvCtrl_C_GetDaathEnvCtrl::RowName' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_GetDaathEnvCtrl, __WorldContext) == 0x000008, "Member 'BPL_EnvCtrl_C_GetDaathEnvCtrl::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_GetDaathEnvCtrl, LightParam) == 0x000010, "Member 'BPL_EnvCtrl_C_GetDaathEnvCtrl::LightParam' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_GetDaathEnvCtrl, CallFunc_GetDataTableRowFromName_OutRow) == 0x000328, "Member 'BPL_EnvCtrl_C_GetDaathEnvCtrl::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_GetDaathEnvCtrl, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000640, "Member 'BPL_EnvCtrl_C_GetDaathEnvCtrl::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function BPL_EnvCtrl.BPL_EnvCtrl_C.SetDaathEnvCtrl_Base
// 0x04E0 (0x04E0 - 0x0000)
struct BPL_EnvCtrl_C_SetDaathEnvCtrl_Base final
{
public:
	struct FST_LightParam                         ST_LightParam;                                     // 0x0000(0x0318)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_305A[0x4];                                     // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0330(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_305B[0x7];                                     // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APostProcessVolume*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0348(0x0010)(ReferenceParm)
	class UActorComponent*                        CallFunc_BPI_GetOptionFieldBrightnessCtrl_Component; // 0x0358(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_305C[0x4];                                     // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_OptionFieldBrightnessCtrl_C> K2Node_DynamicCast_AsBPI_Option_Field_Brightness_Ctrl; // 0x0368(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_305D[0x6];                                     // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAtmosphericFog*>                CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0380(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_305E[0x4];                                     // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASkyLight*>                      CallFunc_GetAllActorsOfClass_OutActors_2;          // 0x0398(0x0010)(ReferenceParm)
	TArray<class ADirectionalLight*>              CallFunc_GetAllActorsOfClass_OutActors_3;          // 0x03A8(0x0010)(ReferenceParm)
	class ASkyLight*                              CallFunc_Array_Get_Item;                           // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_305F[0x3];                                     // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R;                             // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3060[0x8];                                     // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x03F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_1;                // 0x0400(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R_1;                           // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_1;                           // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_1;                           // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_1;                           // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R_2;                           // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_2;                           // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_2;                           // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_2;                           // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_2;                // 0x0430(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_3;                // 0x0440(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R_3;                           // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_3;                           // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_3;                           // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_3;                           // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_4;                // 0x0460(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3061[0x3];                                     // 0x0479(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3062[0x3];                                     // 0x0481(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3063[0x4];                                     // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAtmosphericFog*                        CallFunc_Array_Get_Item_1;                         // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue_1;                // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3064[0x3];                                     // 0x0499(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADirectionalLight*                      CallFunc_Array_Get_Item_2;                         // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue_2;                // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3065[0x3];                                     // 0x04A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3066[0x4];                                     // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APostProcessVolume*                     CallFunc_Array_Get_Item_3;                         // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_MultiplyBrightness_SelectPP_NewParam; // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ActorHasTag_ReturnValue_3;                // 0x04C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x04C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3067[0x1];                                     // 0x04C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x04CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3068[0x3];                                     // 0x04CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base) == 0x000010, "Wrong alignment on BPL_EnvCtrl_C_SetDaathEnvCtrl_Base");
static_assert(sizeof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base) == 0x0004E0, "Wrong size on BPL_EnvCtrl_C_SetDaathEnvCtrl_Base");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, ST_LightParam) == 0x000000, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::ST_LightParam' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, __WorldContext) == 0x000318, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, Temp_int_Array_Index_Variable) == 0x000320, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_GetMapCommon_rerutn) == 0x000328, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, K2Node_DynamicCast_AsBPI_Map_Common) == 0x000330, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, K2Node_DynamicCast_bSuccess) == 0x000340, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_GetAllActorsOfClass_OutActors) == 0x000348, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_BPI_GetOptionFieldBrightnessCtrl_Component) == 0x000358, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_BPI_GetOptionFieldBrightnessCtrl_Component' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_Array_Length_ReturnValue) == 0x000360, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, K2Node_DynamicCast_AsBPI_Option_Field_Brightness_Ctrl) == 0x000368, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::K2Node_DynamicCast_AsBPI_Option_Field_Brightness_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, K2Node_DynamicCast_bSuccess_1) == 0x000378, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_IsValid_ReturnValue) == 0x000379, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000380, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_Array_Length_ReturnValue_1) == 0x000390, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_GetAllActorsOfClass_OutActors_2) == 0x000398, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_GetAllActorsOfClass_OutActors_2' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_GetAllActorsOfClass_OutActors_3) == 0x0003A8, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_GetAllActorsOfClass_OutActors_3' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_Array_Get_Item) == 0x0003B8, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_Array_Length_ReturnValue_2) == 0x0003C0, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_ActorHasTag_ReturnValue) == 0x0003C4, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_Array_Length_ReturnValue_3) == 0x0003C8, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_BreakVector_X) == 0x0003CC, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_BreakVector_Y) == 0x0003D0, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_BreakVector_Z) == 0x0003D4, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_BreakColor_R) == 0x0003D8, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_BreakColor_G) == 0x0003DC, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_BreakColor_B) == 0x0003E0, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_BreakColor_A) == 0x0003E4, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_MakeVector4_ReturnValue) == 0x0003F0, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_MakeVector4_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_MakeVector4_ReturnValue_1) == 0x000400, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_MakeVector4_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_BreakColor_R_1) == 0x000410, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_BreakColor_R_1' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_BreakColor_G_1) == 0x000414, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_BreakColor_G_1' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_BreakColor_B_1) == 0x000418, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_BreakColor_B_1' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_BreakColor_A_1) == 0x00041C, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_BreakColor_A_1' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_BreakColor_R_2) == 0x000420, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_BreakColor_R_2' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_BreakColor_G_2) == 0x000424, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_BreakColor_G_2' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_BreakColor_B_2) == 0x000428, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_BreakColor_B_2' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_BreakColor_A_2) == 0x00042C, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_BreakColor_A_2' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_MakeVector4_ReturnValue_2) == 0x000430, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_MakeVector4_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_MakeVector4_ReturnValue_3) == 0x000440, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_MakeVector4_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_BreakColor_R_3) == 0x000450, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_BreakColor_R_3' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_BreakColor_G_3) == 0x000454, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_BreakColor_G_3' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_BreakColor_B_3) == 0x000458, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_BreakColor_B_3' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_BreakColor_A_3) == 0x00045C, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_BreakColor_A_3' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_MakeVector4_ReturnValue_4) == 0x000460, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_MakeVector4_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, Temp_int_Loop_Counter_Variable) == 0x000470, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, Temp_int_Loop_Counter_Variable_1) == 0x000474, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_Less_IntInt_ReturnValue) == 0x000478, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_Add_IntInt_ReturnValue) == 0x00047C, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_Less_IntInt_ReturnValue_1) == 0x000480, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_Add_IntInt_ReturnValue_1) == 0x000484, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, Temp_int_Array_Index_Variable_1) == 0x000488, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_Array_Get_Item_1) == 0x000490, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_ActorHasTag_ReturnValue_1) == 0x000498, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_ActorHasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, Temp_int_Array_Index_Variable_2) == 0x00049C, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_Array_Get_Item_2) == 0x0004A0, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_ActorHasTag_ReturnValue_2) == 0x0004A8, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_ActorHasTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, Temp_int_Loop_Counter_Variable_2) == 0x0004AC, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, Temp_int_Array_Index_Variable_3) == 0x0004B0, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_Array_Get_Item_3) == 0x0004B8, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_BPI_MultiplyBrightness_SelectPP_NewParam) == 0x0004C0, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_BPI_MultiplyBrightness_SelectPP_NewParam' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_ActorHasTag_ReturnValue_3) == 0x0004C1, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_ActorHasTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_Less_IntInt_ReturnValue_2) == 0x0004C2, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_Add_IntInt_ReturnValue_2) == 0x0004C4, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, Temp_int_Loop_Counter_Variable_3) == 0x0004C8, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_Less_IntInt_ReturnValue_3) == 0x0004CC, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Base, CallFunc_Add_IntInt_ReturnValue_3) == 0x0004D0, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Base::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");

// Function BPL_EnvCtrl.BPL_EnvCtrl_C.GetDaathEnvCtrl_Index
// 0x0660 (0x0660 - 0x0000)
struct BPL_EnvCtrl_C_GetDaathEnvCtrl_Index final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3069[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_LightParam                         LightParam;                                        // 0x0010(0x0318)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0328(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_LightParam                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0340(0x0318)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_EnvCtrl_C_GetDaathEnvCtrl_Index) == 0x000008, "Wrong alignment on BPL_EnvCtrl_C_GetDaathEnvCtrl_Index");
static_assert(sizeof(BPL_EnvCtrl_C_GetDaathEnvCtrl_Index) == 0x000660, "Wrong size on BPL_EnvCtrl_C_GetDaathEnvCtrl_Index");
static_assert(offsetof(BPL_EnvCtrl_C_GetDaathEnvCtrl_Index, Param_Index) == 0x000000, "Member 'BPL_EnvCtrl_C_GetDaathEnvCtrl_Index::Param_Index' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_GetDaathEnvCtrl_Index, __WorldContext) == 0x000008, "Member 'BPL_EnvCtrl_C_GetDaathEnvCtrl_Index::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_GetDaathEnvCtrl_Index, LightParam) == 0x000010, "Member 'BPL_EnvCtrl_C_GetDaathEnvCtrl_Index::LightParam' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_GetDaathEnvCtrl_Index, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000328, "Member 'BPL_EnvCtrl_C_GetDaathEnvCtrl_Index::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_GetDaathEnvCtrl_Index, CallFunc_Array_Get_Item) == 0x000338, "Member 'BPL_EnvCtrl_C_GetDaathEnvCtrl_Index::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_GetDaathEnvCtrl_Index, CallFunc_GetDataTableRowFromName_OutRow) == 0x000340, "Member 'BPL_EnvCtrl_C_GetDaathEnvCtrl_Index::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_GetDaathEnvCtrl_Index, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000658, "Member 'BPL_EnvCtrl_C_GetDaathEnvCtrl_Index::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function BPL_EnvCtrl.BPL_EnvCtrl_C.SetDaathEnvCtrl_Start
// 0x0340 (0x0340 - 0x0000)
struct BPL_EnvCtrl_C_SetDaathEnvCtrl_Start final
{
public:
	EDaathTypeList                                NowDaathLightType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_306A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectGameInstance_C*                 K2Node_DynamicCast_AsProject_Game_Instance;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_306B[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_LightParam                         CallFunc_GetDaathEnvCtrl_Index_LightParam;         // 0x0028(0x0318)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Start) == 0x000008, "Wrong alignment on BPL_EnvCtrl_C_SetDaathEnvCtrl_Start");
static_assert(sizeof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Start) == 0x000340, "Wrong size on BPL_EnvCtrl_C_SetDaathEnvCtrl_Start");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Start, NowDaathLightType) == 0x000000, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Start::NowDaathLightType' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Start, __WorldContext) == 0x000008, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Start::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Start, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Start::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Start, K2Node_DynamicCast_AsProject_Game_Instance) == 0x000018, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Start::K2Node_DynamicCast_AsProject_Game_Instance' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Start, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Start::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Start, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000024, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Start::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDaathEnvCtrl_Start, CallFunc_GetDaathEnvCtrl_Index_LightParam) == 0x000028, "Member 'BPL_EnvCtrl_C_SetDaathEnvCtrl_Start::CallFunc_GetDaathEnvCtrl_Index_LightParam' has a wrong offset!");

// Function BPL_EnvCtrl.BPL_EnvCtrl_C.SetMagatukaEnvCtrl_Base
// 0x0050 (0x0050 - 0x0000)
struct BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base final
{
public:
	float                                         Intensity;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartOffset;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Misc;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APostProcessVolume*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APostProcessVolume*                     CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_306C[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_306D[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base) == 0x000008, "Wrong alignment on BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base");
static_assert(sizeof(BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base) == 0x000050, "Wrong size on BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base");
static_assert(offsetof(BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base, Intensity) == 0x000000, "Member 'BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base::Intensity' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base, StartOffset) == 0x000004, "Member 'BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base::StartOffset' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base, Misc) == 0x000008, "Member 'BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base::Misc' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base, __WorldContext) == 0x000018, "Member 'BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base, CallFunc_GetAllActorsOfClass_OutActors) == 0x000020, "Member 'BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base, CallFunc_Array_Get_Item) == 0x000038, "Member 'BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base, CallFunc_ActorHasTag_ReturnValue) == 0x000040, "Member 'BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'BPL_EnvCtrl_C_SetMagatukaEnvCtrl_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BPL_EnvCtrl.BPL_EnvCtrl_C.SetDushEnvCtrl_Base
// 0x0040 (0x0040 - 0x0000)
struct BPL_EnvCtrl_C_SetDushEnvCtrl_Base final
{
public:
	float                                         Intensity;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartOffset;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APostProcessVolume*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APostProcessVolume*                     CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_306E[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_306F[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_EnvCtrl_C_SetDushEnvCtrl_Base) == 0x000008, "Wrong alignment on BPL_EnvCtrl_C_SetDushEnvCtrl_Base");
static_assert(sizeof(BPL_EnvCtrl_C_SetDushEnvCtrl_Base) == 0x000040, "Wrong size on BPL_EnvCtrl_C_SetDushEnvCtrl_Base");
static_assert(offsetof(BPL_EnvCtrl_C_SetDushEnvCtrl_Base, Intensity) == 0x000000, "Member 'BPL_EnvCtrl_C_SetDushEnvCtrl_Base::Intensity' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDushEnvCtrl_Base, StartOffset) == 0x000004, "Member 'BPL_EnvCtrl_C_SetDushEnvCtrl_Base::StartOffset' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDushEnvCtrl_Base, __WorldContext) == 0x000008, "Member 'BPL_EnvCtrl_C_SetDushEnvCtrl_Base::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDushEnvCtrl_Base, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'BPL_EnvCtrl_C_SetDushEnvCtrl_Base::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDushEnvCtrl_Base, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BPL_EnvCtrl_C_SetDushEnvCtrl_Base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDushEnvCtrl_Base, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BPL_EnvCtrl_C_SetDushEnvCtrl_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDushEnvCtrl_Base, CallFunc_Array_Get_Item) == 0x000028, "Member 'BPL_EnvCtrl_C_SetDushEnvCtrl_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDushEnvCtrl_Base, CallFunc_ActorHasTag_ReturnValue) == 0x000030, "Member 'BPL_EnvCtrl_C_SetDushEnvCtrl_Base::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDushEnvCtrl_Base, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BPL_EnvCtrl_C_SetDushEnvCtrl_Base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDushEnvCtrl_Base, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BPL_EnvCtrl_C_SetDushEnvCtrl_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetDushEnvCtrl_Base, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BPL_EnvCtrl_C_SetDushEnvCtrl_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BPL_EnvCtrl.BPL_EnvCtrl_C.SetSpecialEnvCtrl_Base
// 0x0050 (0x0050 - 0x0000)
struct BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base final
{
public:
	float                                         Intensity;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartOffset;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Misc;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APostProcessVolume*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APostProcessVolume*                     CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3070[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3071[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base) == 0x000008, "Wrong alignment on BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base");
static_assert(sizeof(BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base) == 0x000050, "Wrong size on BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base");
static_assert(offsetof(BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base, Intensity) == 0x000000, "Member 'BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base::Intensity' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base, StartOffset) == 0x000004, "Member 'BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base::StartOffset' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base, Misc) == 0x000008, "Member 'BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base::Misc' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base, __WorldContext) == 0x000018, "Member 'BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base, CallFunc_GetAllActorsOfClass_OutActors) == 0x000020, "Member 'BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base, CallFunc_Array_Get_Item) == 0x000038, "Member 'BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base, CallFunc_ActorHasTag_ReturnValue) == 0x000040, "Member 'BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'BPL_EnvCtrl_C_SetSpecialEnvCtrl_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BPL_EnvCtrl.BPL_EnvCtrl_C.SetWarplEnvCtrl_Base
// 0x00C8 (0x00C8 - 0x0000)
struct BPL_EnvCtrl_C_SetWarplEnvCtrl_Base final
{
public:
	float                                         Weight;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3072[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hit;                                               // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3073[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWeightedBlendable>             Array;                                             // 0x0018(0x0010)(Edit, BlueprintVisible)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3074[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APostProcessVolume*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3075[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APostProcessVolume*                     CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWeightedBlendable                     CallFunc_Array_Get_Item_1;                         // 0x0060(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3076[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable;               // 0x0078(0x0010)(NoDestructor)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3077[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWeightedBlendables                    K2Node_MakeStruct_WeightedBlendables;              // 0x00A0(0x0010)()
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
