#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_GodParameterDebug

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPL_GodParameterDebug.BPL_GodParameterDebug_C.AddDebugMenuGodParameter
// 0x0228 (0x0228 - 0x0000)
struct BPL_GodParameterDebug_C_AddDebugMenuGodParameter final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGodParameterName_ReturnValue;          // 0x0008(0x0018)(ConstParm)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4105[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_1;           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_2;           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue;    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_3;           // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_4;           // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1; // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4106[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_5;           // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1;  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4107[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_6;           // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_7;           // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue;  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1; // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_8;           // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_9;           // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_10;          // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_11;          // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_2; // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_12;          // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGodParameterSKillNum_ReturnValue;      // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_3; // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGodParameterPointMaxNum_ReturnValue;   // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2;  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4108[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGodParameterName_ReturnValue_1;        // 0x0168(0x0018)(ConstParm)
	class FText                                   CallFunc_GetGodParameterName_ReturnValue_2;        // 0x0180(0x0018)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_4; // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_5; // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGodParameterPoint_ReturnValue;         // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGodParameterSKillNum_ReturnValue_1;    // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3;  // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGodParameterSKillNum_ReturnValue_2;    // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4;  // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_5;  // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3; // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter) == 0x000008, "Wrong alignment on BPL_GodParameterDebug_C_AddDebugMenuGodParameter");
static_assert(sizeof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter) == 0x000228, "Wrong size on BPL_GodParameterDebug_C_AddDebugMenuGodParameter");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, __WorldContext) == 0x000000, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_GetGodParameterName_ReturnValue) == 0x000008, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_GetGodParameterName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_DebugMenu_DispName_L10N_Text) == 0x000020, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_DebugMenu_DispName_L10N_Text' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_Conv_TextToString_ReturnValue) == 0x000030, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue) == 0x000040, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_DebugMenu_DispName_L10N_Text_1) == 0x000058, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_DebugMenu_DispName_L10N_Text_1' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_DebugMenu_DispName_L10N_Text_2) == 0x000068, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_DebugMenu_DispName_L10N_Text_2' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000078, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x000088, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_AddDebugMenuItemTypeParam_ReturnValue) == 0x00008C, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_AddDebugMenuItemTypeParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_DebugMenu_DispName_L10N_Text_3) == 0x000090, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_DebugMenu_DispName_L10N_Text_3' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_DebugMenu_DispName_L10N_Text_4) == 0x0000A0, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_DebugMenu_DispName_L10N_Text_4' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1) == 0x0000B0, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_DebugMenu_DispName_L10N_Text_5) == 0x0000B8, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_DebugMenu_DispName_L10N_Text_5' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1) == 0x0000C8, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_DebugMenu_DispName_L10N_Text_6) == 0x0000D0, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_DebugMenu_DispName_L10N_Text_6' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_DebugMenu_DispName_L10N_Text_7) == 0x0000E0, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_DebugMenu_DispName_L10N_Text_7' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue) == 0x0000F0, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1) == 0x0000F4, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_DebugMenu_DispName_L10N_Text_8) == 0x0000F8, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_DebugMenu_DispName_L10N_Text_8' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_DebugMenu_DispName_L10N_Text_9) == 0x000108, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_DebugMenu_DispName_L10N_Text_9' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_DebugMenu_DispName_L10N_Text_10) == 0x000118, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_DebugMenu_DispName_L10N_Text_10' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_DebugMenu_DispName_L10N_Text_11) == 0x000128, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_DebugMenu_DispName_L10N_Text_11' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2) == 0x000138, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_2) == 0x00013C, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_DebugMenu_DispName_L10N_Text_12) == 0x000140, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_DebugMenu_DispName_L10N_Text_12' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_GetGodParameterSKillNum_ReturnValue) == 0x000150, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_GetGodParameterSKillNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_3) == 0x000154, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_Subtract_IntInt_ReturnValue) == 0x000158, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_GetGodParameterPointMaxNum_ReturnValue) == 0x00015C, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_GetGodParameterPointMaxNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2) == 0x000160, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_GetGodParameterName_ReturnValue_1) == 0x000168, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_GetGodParameterName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_GetGodParameterName_ReturnValue_2) == 0x000180, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_GetGodParameterName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000198, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0001A8, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0001B8, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0001C8, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0001D8, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0001E8, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_4) == 0x0001F8, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_5) == 0x0001FC, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_GetGodParameterPoint_ReturnValue) == 0x000200, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_GetGodParameterPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_GetGodParameterSKillNum_ReturnValue_1) == 0x000204, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_GetGodParameterSKillNum_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3) == 0x000208, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00020C, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_GetGodParameterSKillNum_ReturnValue_2) == 0x000210, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_GetGodParameterSKillNum_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4) == 0x000214, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000218, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_5) == 0x00021C, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_AddDebugMenuGodParameter, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3) == 0x000220, "Member 'BPL_GodParameterDebug_C_AddDebugMenuGodParameter::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3' has a wrong offset!");

// Function BPL_GodParameterDebug.BPL_GodParameterDebug_C.UpdateDebugMenuGodParameter
// 0x0010 (0x0010 - 0x0000)
struct BPL_GodParameterDebug_C_UpdateDebugMenuGodParameter final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGodParameterPointMaxNum_ReturnValue;   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGodParameterPoint_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_GodParameterDebug_C_UpdateDebugMenuGodParameter) == 0x000008, "Wrong alignment on BPL_GodParameterDebug_C_UpdateDebugMenuGodParameter");
static_assert(sizeof(BPL_GodParameterDebug_C_UpdateDebugMenuGodParameter) == 0x000010, "Wrong size on BPL_GodParameterDebug_C_UpdateDebugMenuGodParameter");
static_assert(offsetof(BPL_GodParameterDebug_C_UpdateDebugMenuGodParameter, __WorldContext) == 0x000000, "Member 'BPL_GodParameterDebug_C_UpdateDebugMenuGodParameter::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_UpdateDebugMenuGodParameter, CallFunc_GetGodParameterPointMaxNum_ReturnValue) == 0x000008, "Member 'BPL_GodParameterDebug_C_UpdateDebugMenuGodParameter::CallFunc_GetGodParameterPointMaxNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_GodParameterDebug_C_UpdateDebugMenuGodParameter, CallFunc_GetGodParameterPoint_ReturnValue) == 0x00000C, "Member 'BPL_GodParameterDebug_C_UpdateDebugMenuGodParameter::CallFunc_GetGodParameterPoint_ReturnValue' has a wrong offset!");

}

