#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_RandomInputDebugger

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BPL_RandomInputDebugger.BPL_RandomInputDebugger_C.AddDebugMenu_RandomInput
// 0x03F8 (0x03F8 - 0x0000)
struct BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_index;                                           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F71[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         L_AxisMappings;                                    // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         L_ActionMappings;                                  // 0x0020(0x0010)(Edit, BlueprintVisible)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_1;           // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_2;           // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_3;           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_4;           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_5;           // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_6;           // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_7;           // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_8;           // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_9;           // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_10;          // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_11;          // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_12;          // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetRandomInputDebugger_MappingRootPath_Path; // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue; // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0114(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F72[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetRandomInputDebugger_MappingRootPath_Path_1; // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0134(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRandomInputDebuggerActionSetMax_SetMax; // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1; // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_13;          // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1; // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F73[0x2];                                     // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F74[0x4];                                     // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F75[0x3];                                     // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F76[0x3];                                     // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F77[0x4];                                     // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x01A0(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_2;             // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F78[0x3];                                     // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_3;             // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F79[0x6];                                     // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue_1; // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F7A[0x3];                                     // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x01E8(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F7B[0x3];                                     // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ConvertRandomInputDebugger_AnalogStickType_LeftStick; // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ConvertRandomInputDebugger_AnalogStickType_AxisX; // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F7C[0x6];                                     // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetRandomInputDebugger_AnalogStickPath_RootPath; // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetRandomInputDebugger_AnalogStickPath_Enable; // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetRandomInputDebugger_AnalogStickPath_MinPushTimePath; // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetRandomInputDebugger_AnalogStickPath_MaxPushTimePath; // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetRandomInputDebugger_AnalogStickPath_MinPopTimePath; // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetRandomInputDebugger_AnalogStickPath_MaxPopTimePath; // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetRandomInputDebugger_AnalogStickPath_MinValue; // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetRandomInputDebugger_AnalogStickPath_MaxValue; // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetRandomInputDebugger_AnalogStickPath_MaxValueRate; // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetRandomInputDebugger_AnalogStickPath_ReverseRate; // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_3;          // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue;    // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1;  // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_4;          // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_5;          // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2;  // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3;  // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_6;          // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_7;          // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4;  // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_5;  // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_8;          // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_9;          // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_6;  // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_7;  // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_10;         // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_11;         // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2; // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2; // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F7D[0x3];                                     // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetRandomInputDebugger_ActionPath_RootPath; // 0x0338(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetRandomInputDebugger_ActionPath_MappingPath; // 0x0348(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetRandomInputDebugger_ActionPath_MinTimePath; // 0x0358(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetRandomInputDebugger_ActionPath_MaxTimePath; // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetRandomInputDebugger_ActionPath_HoldMinTimePath; // 0x0378(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetRandomInputDebugger_ActionPath_HoldMaxTimePath; // 0x0388(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_12;         // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_13;         // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_8;  // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_9;  // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_14;         // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_15;         // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_10; // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_11; // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_16;         // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_17;         // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_2;             // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3; // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F7E[0x3];                                     // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_3;             // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F7F[0x3];                                     // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_4; // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue; // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput) == 0x000008, "Wrong alignment on BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput");
static_assert(sizeof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput) == 0x0003F8, "Wrong size on BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, __WorldContext) == 0x000000, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, L_index) == 0x000008, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::L_index' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, L_AxisMappings) == 0x000010, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::L_AxisMappings' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, L_ActionMappings) == 0x000020, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::L_ActionMappings' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_DebugMenu_DispName_L10N_Text) == 0x000030, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_DebugMenu_DispName_L10N_Text' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_DebugMenu_DispName_L10N_Text_1) == 0x000040, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_DebugMenu_DispName_L10N_Text_1' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_DebugMenu_DispName_L10N_Text_2) == 0x000050, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_DebugMenu_DispName_L10N_Text_2' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_DebugMenu_DispName_L10N_Text_3) == 0x000060, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_DebugMenu_DispName_L10N_Text_3' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_DebugMenu_DispName_L10N_Text_4) == 0x000070, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_DebugMenu_DispName_L10N_Text_4' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_DebugMenu_DispName_L10N_Text_5) == 0x000080, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_DebugMenu_DispName_L10N_Text_5' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_DebugMenu_DispName_L10N_Text_6) == 0x000090, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_DebugMenu_DispName_L10N_Text_6' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_DebugMenu_DispName_L10N_Text_7) == 0x0000A0, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_DebugMenu_DispName_L10N_Text_7' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_DebugMenu_DispName_L10N_Text_8) == 0x0000B0, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_DebugMenu_DispName_L10N_Text_8' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_DebugMenu_DispName_L10N_Text_9) == 0x0000C0, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_DebugMenu_DispName_L10N_Text_9' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_DebugMenu_DispName_L10N_Text_10) == 0x0000D0, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_DebugMenu_DispName_L10N_Text_10' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_DebugMenu_DispName_L10N_Text_11) == 0x0000E0, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_DebugMenu_DispName_L10N_Text_11' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_DebugMenu_DispName_L10N_Text_12) == 0x0000F0, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_DebugMenu_DispName_L10N_Text_12' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetRandomInputDebugger_MappingRootPath_Path) == 0x000100, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetRandomInputDebugger_MappingRootPath_Path' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue) == 0x000110, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_StringToName_ReturnValue) == 0x000114, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetRandomInputDebugger_MappingRootPath_Path_1) == 0x000120, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetRandomInputDebugger_MappingRootPath_Path_1' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x000130, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000134, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetRandomInputDebuggerActionSetMax_SetMax) == 0x00013C, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetRandomInputDebuggerActionSetMax_SetMax' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1) == 0x000140, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Subtract_IntInt_ReturnValue) == 0x000144, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_DebugMenu_DispName_L10N_Text_13) == 0x000148, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_DebugMenu_DispName_L10N_Text_13' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, Temp_int_Variable) == 0x000158, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1) == 0x00015C, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_IntToByte_ReturnValue) == 0x000160, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetValidValue_ReturnValue) == 0x000161, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, Temp_int_Variable_1) == 0x000164, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Add_IntInt_ReturnValue) == 0x000168, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000170, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000180, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000184, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Add_IntInt_ReturnValue_1) == 0x000188, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x00018C, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000190, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_MakeLiteralInt_ReturnValue) == 0x000194, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Add_IntInt_ReturnValue_2) == 0x000198, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, Temp_string_Variable) == 0x0001A0, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, Temp_int_Variable_2) == 0x0001B0, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, Temp_int_Variable_3) == 0x0001B4, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_IntToByte_ReturnValue_2) == 0x0001B8, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_IntToByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Add_IntInt_ReturnValue_3) == 0x0001BC, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetValidValue_ReturnValue_1) == 0x0001C0, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetValidValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_IntToByte_ReturnValue_3) == 0x0001C1, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_IntToByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x0001C8, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetEnumeratorValueFromIndex_ReturnValue_1) == 0x0001D8, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetEnumeratorValueFromIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x0001DC, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x0001E0, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Add_IntInt_ReturnValue_4) == 0x0001E4, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, Temp_string_Variable_1) == 0x0001E8, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x0001F8, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Add_IntInt_ReturnValue_5) == 0x0001FC, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, Temp_int_Variable_4) == 0x000200, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000204, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Add_IntInt_ReturnValue_6) == 0x000208, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, Temp_int_Variable_5) == 0x00020C, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_ConvertRandomInputDebugger_AnalogStickType_LeftStick) == 0x000210, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_ConvertRandomInputDebugger_AnalogStickType_LeftStick' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_ConvertRandomInputDebugger_AnalogStickType_AxisX) == 0x000211, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_ConvertRandomInputDebugger_AnalogStickType_AxisX' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetRandomInputDebugger_AnalogStickPath_RootPath) == 0x000218, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetRandomInputDebugger_AnalogStickPath_RootPath' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetRandomInputDebugger_AnalogStickPath_Enable) == 0x000228, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetRandomInputDebugger_AnalogStickPath_Enable' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetRandomInputDebugger_AnalogStickPath_MinPushTimePath) == 0x000238, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetRandomInputDebugger_AnalogStickPath_MinPushTimePath' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetRandomInputDebugger_AnalogStickPath_MaxPushTimePath) == 0x000248, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetRandomInputDebugger_AnalogStickPath_MaxPushTimePath' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetRandomInputDebugger_AnalogStickPath_MinPopTimePath) == 0x000258, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetRandomInputDebugger_AnalogStickPath_MinPopTimePath' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetRandomInputDebugger_AnalogStickPath_MaxPopTimePath) == 0x000268, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetRandomInputDebugger_AnalogStickPath_MaxPopTimePath' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetRandomInputDebugger_AnalogStickPath_MinValue) == 0x000278, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetRandomInputDebugger_AnalogStickPath_MinValue' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetRandomInputDebugger_AnalogStickPath_MaxValue) == 0x000288, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetRandomInputDebugger_AnalogStickPath_MaxValue' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetRandomInputDebugger_AnalogStickPath_MaxValueRate) == 0x000298, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetRandomInputDebugger_AnalogStickPath_MaxValueRate' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetRandomInputDebugger_AnalogStickPath_ReverseRate) == 0x0002A8, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetRandomInputDebugger_AnalogStickPath_ReverseRate' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_StringToName_ReturnValue_2) == 0x0002B8, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_StringToName_ReturnValue_3) == 0x0002C0, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_StringToName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_AddDebugMenuItemTypeParam_ReturnValue) == 0x0002C8, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_AddDebugMenuItemTypeParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1) == 0x0002CC, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_StringToName_ReturnValue_4) == 0x0002D0, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_StringToName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_StringToName_ReturnValue_5) == 0x0002D8, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_StringToName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2) == 0x0002E0, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3) == 0x0002E4, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_StringToName_ReturnValue_6) == 0x0002E8, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_StringToName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_StringToName_ReturnValue_7) == 0x0002F0, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_StringToName_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4) == 0x0002F8, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_5) == 0x0002FC, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_StringToName_ReturnValue_8) == 0x000300, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_StringToName_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_StringToName_ReturnValue_9) == 0x000308, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_StringToName_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_6) == 0x000310, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_7) == 0x000314, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_StringToName_ReturnValue_10) == 0x000318, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_StringToName_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_StringToName_ReturnValue_11) == 0x000320, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_StringToName_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2) == 0x000328, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2) == 0x00032C, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000330, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Add_IntInt_ReturnValue_7) == 0x000334, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetRandomInputDebugger_ActionPath_RootPath) == 0x000338, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetRandomInputDebugger_ActionPath_RootPath' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetRandomInputDebugger_ActionPath_MappingPath) == 0x000348, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetRandomInputDebugger_ActionPath_MappingPath' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetRandomInputDebugger_ActionPath_MinTimePath) == 0x000358, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetRandomInputDebugger_ActionPath_MinTimePath' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetRandomInputDebugger_ActionPath_MaxTimePath) == 0x000368, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetRandomInputDebugger_ActionPath_MaxTimePath' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetRandomInputDebugger_ActionPath_HoldMinTimePath) == 0x000378, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetRandomInputDebugger_ActionPath_HoldMinTimePath' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_GetRandomInputDebugger_ActionPath_HoldMaxTimePath) == 0x000388, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_GetRandomInputDebugger_ActionPath_HoldMaxTimePath' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_StringToName_ReturnValue_12) == 0x000398, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_StringToName_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_StringToName_ReturnValue_13) == 0x0003A0, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_StringToName_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_8) == 0x0003A8, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_9) == 0x0003AC, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_StringToName_ReturnValue_14) == 0x0003B0, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_StringToName_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_StringToName_ReturnValue_15) == 0x0003B8, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_StringToName_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_10) == 0x0003C0, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_11) == 0x0003C4, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_StringToName_ReturnValue_16) == 0x0003C8, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_StringToName_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Conv_StringToName_ReturnValue_17) == 0x0003D0, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Conv_StringToName_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_MakeLiteralInt_ReturnValue_2) == 0x0003D8, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_MakeLiteralInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3) == 0x0003DC, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Less_IntInt_ReturnValue) == 0x0003E0, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_MakeLiteralInt_ReturnValue_3) == 0x0003E4, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_MakeLiteralInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_Less_IntInt_ReturnValue_1) == 0x0003E8, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_4) == 0x0003EC, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput, CallFunc_AddDebugMenuItemTypePullDown_ReturnValue) == 0x0003F0, "Member 'BPL_RandomInputDebugger_C_AddDebugMenu_RandomInput::CallFunc_AddDebugMenuItemTypePullDown_ReturnValue' has a wrong offset!");

// Function BPL_RandomInputDebugger.BPL_RandomInputDebugger_C.SpawnDebugMenu_RandomInput
// 0x00F0 (0x00F0 - 0x0000)
struct BPL_RandomInputDebugger_C_SpawnDebugMenu_RandomInput final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x0010(0x00D0)()
	class AActor*                                 CallFunc_SpawnUIActor_ReturnValue;                 // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_RandomInputDebugger_C_SpawnDebugMenu_RandomInput) == 0x000008, "Wrong alignment on BPL_RandomInputDebugger_C_SpawnDebugMenu_RandomInput");
static_assert(sizeof(BPL_RandomInputDebugger_C_SpawnDebugMenu_RandomInput) == 0x0000F0, "Wrong size on BPL_RandomInputDebugger_C_SpawnDebugMenu_RandomInput");
static_assert(offsetof(BPL_RandomInputDebugger_C_SpawnDebugMenu_RandomInput, __WorldContext) == 0x000000, "Member 'BPL_RandomInputDebugger_C_SpawnDebugMenu_RandomInput::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_SpawnDebugMenu_RandomInput, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000008, "Member 'BPL_RandomInputDebugger_C_SpawnDebugMenu_RandomInput::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_SpawnDebugMenu_RandomInput, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue) == 0x000010, "Member 'BPL_RandomInputDebugger_C_SpawnDebugMenu_RandomInput::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_SpawnDebugMenu_RandomInput, CallFunc_SpawnUIActor_ReturnValue) == 0x0000E0, "Member 'BPL_RandomInputDebugger_C_SpawnDebugMenu_RandomInput::CallFunc_SpawnUIActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_SpawnDebugMenu_RandomInput, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000E8, "Member 'BPL_RandomInputDebugger_C_SpawnDebugMenu_RandomInput::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BPL_RandomInputDebugger.BPL_RandomInputDebugger_C.GetRandomInputDebuggerActionSetMax
// 0x0010 (0x0010 - 0x0000)
struct BPL_RandomInputDebugger_C_GetRandomInputDebuggerActionSetMax final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SetMax;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_RandomInputDebugger_C_GetRandomInputDebuggerActionSetMax) == 0x000008, "Wrong alignment on BPL_RandomInputDebugger_C_GetRandomInputDebuggerActionSetMax");
static_assert(sizeof(BPL_RandomInputDebugger_C_GetRandomInputDebuggerActionSetMax) == 0x000010, "Wrong size on BPL_RandomInputDebugger_C_GetRandomInputDebuggerActionSetMax");
static_assert(offsetof(BPL_RandomInputDebugger_C_GetRandomInputDebuggerActionSetMax, __WorldContext) == 0x000000, "Member 'BPL_RandomInputDebugger_C_GetRandomInputDebuggerActionSetMax::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_RandomInputDebugger_C_GetRandomInputDebuggerActionSetMax, SetMax) == 0x000008, "Member 'BPL_RandomInputDebugger_C_GetRandomInputDebuggerActionSetMax::SetMax' has a wrong offset!");

// Function BPL_RandomInputDebugger.BPL_RandomInputDebugger_C.GetRandomInputDebugger_MappingRootPath
// 0x0078 (0x0078 - 0x0000)
struct BPL_RandomInputDebugger_C_GetRandomInputDebugger_MappingRootPath final
{
public:
	bool                                          ActionMapping;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F80[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Path;                                              // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 L_Path;                                            // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F81[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
