#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_MapSymbolScale

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPL_MapSymbolScale.BPL_MapSymbolScale_C.BPL_AdjustMapSymbolScale
// 0x0058 (0x0058 - 0x0000)
struct BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale final
{
public:
	class AActor*                                 Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DevilID;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31CF[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevilPerformanceComponent_C*           L_Perform;                                         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharaParamComponent*                   L_Comp;                                            // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevilPerformanceComponent_C*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_DevilPerformanceCore_C> K2Node_DynamicCast_AsBPI_Devil_Performance_Core;   // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_AdjustMeshScale_NoUse;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31D0[0x5];                                     // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharaParamComponent*                   CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale) == 0x000008, "Wrong alignment on BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale");
static_assert(sizeof(BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale) == 0x000058, "Wrong size on BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale");
static_assert(offsetof(BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale, Pawn) == 0x000000, "Member 'BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale::Pawn' has a wrong offset!");
static_assert(offsetof(BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale, DevilID) == 0x000008, "Member 'BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale::DevilID' has a wrong offset!");
static_assert(offsetof(BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale, __WorldContext) == 0x000010, "Member 'BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale, L_Perform) == 0x000018, "Member 'BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale::L_Perform' has a wrong offset!");
static_assert(offsetof(BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale, L_Comp) == 0x000020, "Member 'BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale::L_Comp' has a wrong offset!");
static_assert(offsetof(BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale, CallFunc_GetComponentByClass_ReturnValue) == 0x000028, "Member 'BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale, K2Node_DynamicCast_AsBPI_Devil_Performance_Core) == 0x000030, "Member 'BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale::K2Node_DynamicCast_AsBPI_Devil_Performance_Core' has a wrong offset!");
static_assert(offsetof(BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale, CallFunc_BI_AdjustMeshScale_NoUse) == 0x000041, "Member 'BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale::CallFunc_BI_AdjustMeshScale_NoUse' has a wrong offset!");
static_assert(offsetof(BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale, CallFunc_IsValid_ReturnValue) == 0x000042, "Member 'BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000048, "Member 'BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale, CallFunc_IsValid_ReturnValue_2) == 0x000051, "Member 'BPL_MapSymbolScale_C_BPL_AdjustMapSymbolScale::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

}

