#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_BtlDebugAITempView

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPL_BtlDebugAITempView.BPL_BtlDebugAITempView_C.AddDebugMenu_BtlAITempView
// 0x0058 (0x0058 - 0x0000)
struct BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue;    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4153[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_1;           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_2;           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1;  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView) == 0x000008, "Wrong alignment on BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView");
static_assert(sizeof(BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView) == 0x000058, "Wrong size on BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView");
static_assert(offsetof(BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView, __WorldContext) == 0x000000, "Member 'BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView, CallFunc_AddDebugMenuItemTypeParam_ReturnValue) == 0x000008, "Member 'BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView::CallFunc_AddDebugMenuItemTypeParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView, CallFunc_DebugMenu_DispName_L10N_Text) == 0x000010, "Member 'BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView::CallFunc_DebugMenu_DispName_L10N_Text' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView, CallFunc_DebugMenu_DispName_L10N_Text_1) == 0x000020, "Member 'BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView::CallFunc_DebugMenu_DispName_L10N_Text_1' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue) == 0x000030, "Member 'BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1) == 0x000034, "Member 'BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView, CallFunc_DebugMenu_DispName_L10N_Text_2) == 0x000038, "Member 'BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView::CallFunc_DebugMenu_DispName_L10N_Text_2' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1) == 0x000048, "Member 'BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2) == 0x00004C, "Member 'BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x000050, "Member 'BPL_BtlDebugAITempView_C_AddDebugMenu_BtlAITempView::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");

// Function BPL_BtlDebugAITempView.BPL_BtlDebugAITempView_C.BtlAIDebug_RegisterDebugFlag
// 0x0050 (0x0050 - 0x0000)
struct BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugFlag final
{
public:
	uint8                                         Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4154[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DispName;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Comment;                                           // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BtlDebugAITempView_C> CallFunc_GetBPIBtlDebugAITempView_retValue;        // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetBPIBtlDebugAITempView_bSuccess;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4155[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_RegisterDebugFlagData_retValue;       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugFlag) == 0x000008, "Wrong alignment on BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugFlag");
static_assert(sizeof(BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugFlag) == 0x000050, "Wrong size on BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugFlag");
static_assert(offsetof(BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugFlag, Value) == 0x000000, "Member 'BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugFlag::Value' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugFlag, DispName) == 0x000008, "Member 'BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugFlag::DispName' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugFlag, Comment) == 0x000018, "Member 'BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugFlag::Comment' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugFlag, __WorldContext) == 0x000028, "Member 'BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugFlag::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugFlag, CallFunc_GetBPIBtlDebugAITempView_retValue) == 0x000030, "Member 'BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugFlag::CallFunc_GetBPIBtlDebugAITempView_retValue' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugFlag, CallFunc_GetBPIBtlDebugAITempView_bSuccess) == 0x000040, "Member 'BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugFlag::CallFunc_GetBPIBtlDebugAITempView_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugFlag, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000044, "Member 'BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugFlag::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugFlag, CallFunc_BPI_RegisterDebugFlagData_retValue) == 0x000048, "Member 'BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugFlag::CallFunc_BPI_RegisterDebugFlagData_retValue' has a wrong offset!");

// Function BPL_BtlDebugAITempView.BPL_BtlDebugAITempView_C.BtlAIDebug_RegisterDebugValue
// 0x0048 (0x0048 - 0x0000)
struct BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugValue final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4156[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DispName;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Comment;                                           // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BtlDebugAITempView_C> CallFunc_GetBPIBtlDebugAITempView_retValue;        // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetBPIBtlDebugAITempView_bSuccess;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_RegisterDebugValueData_retValue;      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugValue) == 0x000008, "Wrong alignment on BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugValue");
static_assert(sizeof(BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugValue) == 0x000048, "Wrong size on BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugValue");
static_assert(offsetof(BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugValue, Param_Index) == 0x000000, "Member 'BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugValue::Param_Index' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugValue, DispName) == 0x000008, "Member 'BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugValue::DispName' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugValue, Comment) == 0x000018, "Member 'BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugValue::Comment' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugValue, __WorldContext) == 0x000028, "Member 'BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugValue::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugValue, CallFunc_GetBPIBtlDebugAITempView_retValue) == 0x000030, "Member 'BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugValue::CallFunc_GetBPIBtlDebugAITempView_retValue' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugValue, CallFunc_GetBPIBtlDebugAITempView_bSuccess) == 0x000040, "Member 'BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugValue::CallFunc_GetBPIBtlDebugAITempView_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugValue, CallFunc_BPI_RegisterDebugValueData_retValue) == 0x000041, "Member 'BPL_BtlDebugAITempView_C_BtlAIDebug_RegisterDebugValue::CallFunc_BPI_RegisterDebugValueData_retValue' has a wrong offset!");

// Function BPL_BtlDebugAITempView.BPL_BtlDebugAITempView_C.GetBPIBtlDebugAITempView
// 0x0058 (0x0058 - 0x0000)
struct BPL_BtlDebugAITempView_C_GetBPIBtlDebugAITempView final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BtlDebugAITempView_C> RetValue;                                          // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSuccess;                                          // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4157[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DebugMenuUI_C>    CallFunc_GetBPIDebugMenuUI_retValue;               // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_BtlDebugAITempView_C> CallFunc_GetBPIDebugBtlAITempViewCtrl_retValue;    // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_BtlDebugAITempView_C> K2Node_DynamicCast_AsBPI_Btl_Debug_AITemp_View;    // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_BtlDebugAITempView_C_GetBPIBtlDebugAITempView) == 0x000008, "Wrong alignment on BPL_BtlDebugAITempView_C_GetBPIBtlDebugAITempView");
static_assert(sizeof(BPL_BtlDebugAITempView_C_GetBPIBtlDebugAITempView) == 0x000058, "Wrong size on BPL_BtlDebugAITempView_C_GetBPIBtlDebugAITempView");
static_assert(offsetof(BPL_BtlDebugAITempView_C_GetBPIBtlDebugAITempView, __WorldContext) == 0x000000, "Member 'BPL_BtlDebugAITempView_C_GetBPIBtlDebugAITempView::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_GetBPIBtlDebugAITempView, RetValue) == 0x000008, "Member 'BPL_BtlDebugAITempView_C_GetBPIBtlDebugAITempView::RetValue' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_GetBPIBtlDebugAITempView, bSuccess) == 0x000018, "Member 'BPL_BtlDebugAITempView_C_GetBPIBtlDebugAITempView::bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_GetBPIBtlDebugAITempView, CallFunc_GetBPIDebugMenuUI_retValue) == 0x000020, "Member 'BPL_BtlDebugAITempView_C_GetBPIBtlDebugAITempView::CallFunc_GetBPIDebugMenuUI_retValue' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_GetBPIBtlDebugAITempView, CallFunc_GetBPIDebugBtlAITempViewCtrl_retValue) == 0x000030, "Member 'BPL_BtlDebugAITempView_C_GetBPIBtlDebugAITempView::CallFunc_GetBPIDebugBtlAITempViewCtrl_retValue' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_GetBPIBtlDebugAITempView, K2Node_DynamicCast_AsBPI_Btl_Debug_AITemp_View) == 0x000040, "Member 'BPL_BtlDebugAITempView_C_GetBPIBtlDebugAITempView::K2Node_DynamicCast_AsBPI_Btl_Debug_AITemp_View' has a wrong offset!");
static_assert(offsetof(BPL_BtlDebugAITempView_C_GetBPIBtlDebugAITempView, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BPL_BtlDebugAITempView_C_GetBPIBtlDebugAITempView::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

