#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_MsgCtrl

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPL_MsgCtrl.BPL_MsgCtrl_C.MsgCtrl_UpdateMW_DispOff
// 0x0078 (0x0078 - 0x0000)
struct BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsVisibleMW;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EC5[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EC6[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EC7[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EC8[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl;                 // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ISetWindowVisibility_RerurnVisible;       // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff) == 0x000008, "Wrong alignment on BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff");
static_assert(sizeof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff) == 0x000078, "Wrong size on BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff, __WorldContext) == 0x000000, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff, IsVisibleMW) == 0x000008, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff::IsVisibleMW' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff, CallFunc_IsActionPadCheck_Success) == 0x000009, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff, K2Node_DynamicCast_AsBPI_UIManager) == 0x000020, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff, CallFunc_BPI_GetUIManager_UIManager) == 0x000038, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000040, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff, CallFunc_BPI_GetMsgCtrl_OutActor) == 0x000058, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff::CallFunc_BPI_GetMsgCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff, K2Node_DynamicCast_AsBPI_Msg_Ctrl) == 0x000060, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff::K2Node_DynamicCast_AsBPI_Msg_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff, CallFunc_ISetWindowVisibility_RerurnVisible) == 0x000071, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_DispOff::CallFunc_ISetWindowVisibility_RerurnVisible' has a wrong offset!");

// Function BPL_MsgCtrl.BPL_MsgCtrl_C.MsgCtrl_UpdateMW_AutoState
// 0x0010 (0x0010 - 0x0000)
struct BPL_MsgCtrl_C_MsgCtrl_UpdateMW_AutoState final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAutoMW;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAutoRead_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAutoRead_ReturnValue_1;                // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_AutoState) == 0x000008, "Wrong alignment on BPL_MsgCtrl_C_MsgCtrl_UpdateMW_AutoState");
static_assert(sizeof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_AutoState) == 0x000010, "Wrong size on BPL_MsgCtrl_C_MsgCtrl_UpdateMW_AutoState");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_AutoState, __WorldContext) == 0x000000, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_AutoState::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_AutoState, IsAutoMW) == 0x000008, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_AutoState::IsAutoMW' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_AutoState, CallFunc_IsActionPadCheck_Success) == 0x000009, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_AutoState::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_AutoState, CallFunc_GetAutoRead_ReturnValue) == 0x00000A, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_AutoState::CallFunc_GetAutoRead_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_AutoState, CallFunc_GetAutoRead_ReturnValue_1) == 0x00000B, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_AutoState::CallFunc_GetAutoRead_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_AutoState, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_AutoState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BPL_MsgCtrl.BPL_MsgCtrl_C.MsgCtrl_GetAutoWaitTIme
// 0x0078 (0x0078 - 0x0000)
struct BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC9[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ECA[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ECB[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl;                 // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ECC[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IMsgGetDrawStrLen_ReturnValue;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetVoiceAutoTime_ReturnValue;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme) == 0x000008, "Wrong alignment on BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme");
static_assert(sizeof(BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme) == 0x000078, "Wrong size on BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme, __WorldContext) == 0x000000, "Member 'BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme, ReturnValue) == 0x000008, "Member 'BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme, CallFunc_BPI_GetMsgCtrl_OutActor) == 0x000050, "Member 'BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme::CallFunc_BPI_GetMsgCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme, K2Node_DynamicCast_AsBPI_Msg_Ctrl) == 0x000058, "Member 'BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme::K2Node_DynamicCast_AsBPI_Msg_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme, CallFunc_IMsgGetDrawStrLen_ReturnValue) == 0x00006C, "Member 'BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme::CallFunc_IMsgGetDrawStrLen_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme, CallFunc_GetVoiceAutoTime_ReturnValue) == 0x000070, "Member 'BPL_MsgCtrl_C_MsgCtrl_GetAutoWaitTIme::CallFunc_GetVoiceAutoTime_ReturnValue' has a wrong offset!");

// Function BPL_MsgCtrl.BPL_MsgCtrl_C.MsgCtrl_UpdateMW_FastEffect
// 0x0010 (0x0010 - 0x0000)
struct BPL_MsgCtrl_C_MsgCtrl_UpdateMW_FastEffect final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDispEffect;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BtnHelp_GetActiveColor_byEnum_IsActive;   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_FastEffect) == 0x000008, "Wrong alignment on BPL_MsgCtrl_C_MsgCtrl_UpdateMW_FastEffect");
static_assert(sizeof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_FastEffect) == 0x000010, "Wrong size on BPL_MsgCtrl_C_MsgCtrl_UpdateMW_FastEffect");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_FastEffect, __WorldContext) == 0x000000, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_FastEffect::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_FastEffect, IsDispEffect) == 0x000008, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_FastEffect::IsDispEffect' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_FastEffect, CallFunc_IsActionPadCheck_Success) == 0x000009, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_FastEffect::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_FastEffect, CallFunc_BtnHelp_GetActiveColor_byEnum_IsActive) == 0x00000A, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_FastEffect::CallFunc_BtnHelp_GetActiveColor_byEnum_IsActive' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_UpdateMW_FastEffect, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'BPL_MsgCtrl_C_MsgCtrl_UpdateMW_FastEffect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BPL_MsgCtrl.BPL_MsgCtrl_C.MsgCtrl_IsPressedDecideKey
// 0x0018 (0x0018 - 0x0000)
struct BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PressedAdvanceKey;                                 // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsFastKey;                                         // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_2;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_3;               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_4;               // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey) == 0x000008, "Wrong alignment on BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey");
static_assert(sizeof(BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey) == 0x000018, "Wrong size on BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey, __WorldContext) == 0x000000, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey, PressedAdvanceKey) == 0x000008, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey::PressedAdvanceKey' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey, IsFastKey) == 0x000009, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey::IsFastKey' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey, CallFunc_IsActionPadCheck_Success) == 0x00000A, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey, CallFunc_IsActionPadCheck_Success_1) == 0x00000B, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey::CallFunc_IsActionPadCheck_Success_1' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey, CallFunc_IsActionPadCheck_Success_2) == 0x00000C, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey::CallFunc_IsActionPadCheck_Success_2' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey, CallFunc_IsActionPadCheck_Success_3) == 0x00000D, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey::CallFunc_IsActionPadCheck_Success_3' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey, CallFunc_IsActionPadCheck_Success_4) == 0x00000E, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey::CallFunc_IsActionPadCheck_Success_4' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey, CallFunc_BooleanOR_ReturnValue) == 0x00000F, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey, CallFunc_BooleanOR_ReturnValue_1) == 0x000010, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey, CallFunc_BooleanOR_ReturnValue_2) == 0x000011, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey, CallFunc_BooleanOR_ReturnValue_3) == 0x000012, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsPressedDecideKey::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");

// Function BPL_MsgCtrl.BPL_MsgCtrl_C.MsgCtrl_IsSelectTopCursor
// 0x00D8 (0x00D8 - 0x0000)
struct BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTop;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ECD[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ECE[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ECF[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_1;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ED0[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_3;              // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ED1[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_1;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl;                 // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ED2[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IGetSelectCursorNum_OutCursorNum;         // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_1;               // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ED3[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IGetSelectedCursorPosition_OutIndex;      // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor) == 0x000008, "Wrong alignment on BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor");
static_assert(sizeof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor) == 0x0000D8, "Wrong size on BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, __WorldContext) == 0x000000, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, IsTop) == 0x000008, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::IsTop' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, CallFunc_GetGameInstance_ReturnValue_1) == 0x000018, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, K2Node_DynamicCast_AsBPI_UIManager) == 0x000020, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, CallFunc_BPI_GetUIManager_UIManager) == 0x000050, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, CallFunc_BPI_GetUIManager_UIManager_1) == 0x000058, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::CallFunc_BPI_GetUIManager_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, K2Node_DynamicCast_AsBPI_UIManager_2) == 0x000060, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::K2Node_DynamicCast_AsBPI_UIManager_2' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, K2Node_DynamicCast_AsBPI_UIManager_3) == 0x000078, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::K2Node_DynamicCast_AsBPI_UIManager_3' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, K2Node_DynamicCast_bSuccess_3) == 0x000088, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, CallFunc_BPI_GetMsgCtrl_OutActor) == 0x000090, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::CallFunc_BPI_GetMsgCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, CallFunc_BPI_GetMsgCtrl_OutActor_1) == 0x000098, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::CallFunc_BPI_GetMsgCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, K2Node_DynamicCast_AsBPI_Msg_Ctrl) == 0x0000A0, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::K2Node_DynamicCast_AsBPI_Msg_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, K2Node_DynamicCast_bSuccess_4) == 0x0000B0, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, CallFunc_IGetSelectCursorNum_OutCursorNum) == 0x0000B4, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::CallFunc_IGetSelectCursorNum_OutCursorNum' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, K2Node_DynamicCast_AsBPI_Msg_Ctrl_1) == 0x0000B8, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::K2Node_DynamicCast_AsBPI_Msg_Ctrl_1' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, K2Node_DynamicCast_bSuccess_5) == 0x0000C8, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, CallFunc_IGetSelectedCursorPosition_OutIndex) == 0x0000CC, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::CallFunc_IGetSelectedCursorPosition_OutIndex' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000D0, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000D1, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectTopCursor::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function BPL_MsgCtrl.BPL_MsgCtrl_C.MsgCtrl_IsSelectBottomCursor
// 0x0100 (0x0100 - 0x0000)
struct BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBottom;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ED4[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ED5[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ED6[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_1;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ED7[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_3;              // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ED8[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_1;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl;                 // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ED9[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_1;               // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EDA[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IGetSelectCursorNum_OutCursorNum;         // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IGetSelectCursorNum_OutCursorNum_1;       // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EDB[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EDC[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_2;               // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EDD[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IGetSelectedCursorPosition_OutIndex;      // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor) == 0x000008, "Wrong alignment on BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor");
static_assert(sizeof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor) == 0x000100, "Wrong size on BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, __WorldContext) == 0x000000, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, IsBottom) == 0x000008, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::IsBottom' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, CallFunc_GetGameInstance_ReturnValue_1) == 0x000018, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, K2Node_DynamicCast_AsBPI_UIManager) == 0x000020, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, CallFunc_BPI_GetUIManager_UIManager) == 0x000050, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, CallFunc_BPI_GetUIManager_UIManager_1) == 0x000058, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::CallFunc_BPI_GetUIManager_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, K2Node_DynamicCast_AsBPI_UIManager_2) == 0x000060, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::K2Node_DynamicCast_AsBPI_UIManager_2' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, K2Node_DynamicCast_AsBPI_UIManager_3) == 0x000078, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::K2Node_DynamicCast_AsBPI_UIManager_3' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, K2Node_DynamicCast_bSuccess_3) == 0x000088, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, CallFunc_BPI_GetMsgCtrl_OutActor) == 0x000090, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::CallFunc_BPI_GetMsgCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, CallFunc_BPI_GetMsgCtrl_OutActor_1) == 0x000098, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::CallFunc_BPI_GetMsgCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, K2Node_DynamicCast_AsBPI_Msg_Ctrl) == 0x0000A0, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::K2Node_DynamicCast_AsBPI_Msg_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, K2Node_DynamicCast_bSuccess_4) == 0x0000B0, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, K2Node_DynamicCast_AsBPI_Msg_Ctrl_1) == 0x0000B8, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::K2Node_DynamicCast_AsBPI_Msg_Ctrl_1' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, K2Node_DynamicCast_bSuccess_5) == 0x0000C8, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, CallFunc_IGetSelectCursorNum_OutCursorNum) == 0x0000CC, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::CallFunc_IGetSelectCursorNum_OutCursorNum' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, CallFunc_IGetSelectCursorNum_OutCursorNum_1) == 0x0000D0, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::CallFunc_IGetSelectCursorNum_OutCursorNum_1' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000D4, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000D8, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, K2Node_DynamicCast_AsBPI_Msg_Ctrl_2) == 0x0000E0, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::K2Node_DynamicCast_AsBPI_Msg_Ctrl_2' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, K2Node_DynamicCast_bSuccess_6) == 0x0000F0, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, CallFunc_IGetSelectedCursorPosition_OutIndex) == 0x0000F4, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::CallFunc_IGetSelectedCursorPosition_OutIndex' has a wrong offset!");
static_assert(offsetof(BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000F8, "Member 'BPL_MsgCtrl_C_MsgCtrl_IsSelectBottomCursor::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function BPL_MsgCtrl.BPL_MsgCtrl_C.MsgCtrl_UpdateMW_MoveCursor
// 0x0298 (0x0298 - 0x0000)
struct BPL_MsgCtrl_C_MsgCtrl_UpdateMW_MoveCursor final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMoveCursor;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EDE[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_1;                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EDF[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EE0[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_1;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EE1[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_3;              // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EE2[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor;                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_1;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl;                 // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EE3[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_1;               // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgSetSelectCursorMin_OutParam;          // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgSetSelectCursorMax_OutParam;          // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MsgCtrl_IsSelectBottomCursor_IsBottom;    // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EE4[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_4;              // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EE5[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_5;              // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EE6[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_2;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_3;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_6;              // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EE7[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_7;              // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EE8[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_2;                // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_3;                // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_2;               // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EE9[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_3;               // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgSetSelectCursorMax_OutParam_1;        // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgSetSelectCursorMin_OutParam_1;        // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MsgCtrl_IsSelectTopCursor_IsTop;          // 0x019B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EEA[0x3];                                     // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_4;            // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MsgCtrl_IsSelectBottomCursor_IsBottom_1;  // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EEB[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_8;              // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EEC[0x6];                                     // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_4;             // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionPadCheck_Success_2;               // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EED[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_9;              // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EEE[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_4;                // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
