#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_SkillSearchSortWindow

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BPL_SkillSearchSortWindow.BPL_SkillSearchSortWindow_C.BPL_SkillSearchWindow_GetCurrentTabIdx
// 0x0070 (0x0070 - 0x0000)
struct BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TabIdx;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DDF[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DE0[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DE1[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetSkillSearchWindowCtrl_outActor;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SkillSearchSortCtrl_C> K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl;   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DE2[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BPI_GetCurrentTabIdx_TabIdx;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx) == 0x000008, "Wrong alignment on BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx");
static_assert(sizeof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx) == 0x000070, "Wrong size on BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx, __WorldContext) == 0x000000, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx, TabIdx) == 0x000008, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx::TabIdx' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx, CallFunc_BPI_GetSkillSearchWindowCtrl_outActor) == 0x000050, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx::CallFunc_BPI_GetSkillSearchWindowCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx, K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl) == 0x000058, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx::K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx, CallFunc_BPI_GetCurrentTabIdx_TabIdx) == 0x00006C, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentTabIdx::CallFunc_BPI_GetCurrentTabIdx_TabIdx' has a wrong offset!");

// Function BPL_SkillSearchSortWindow.BPL_SkillSearchSortWindow_C.BPL_SkillSearchWindow_ScrollList
// 0x0070 (0x0070 - 0x0000)
struct BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList final
{
public:
	int32                                         InScrollNum;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlaySE;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DE3[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DE4[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DE5[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetSkillSearchWindowCtrl_outActor;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SkillSearchSortCtrl_C> K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl;   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList) == 0x000008, "Wrong alignment on BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList");
static_assert(sizeof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList) == 0x000070, "Wrong size on BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList, InScrollNum) == 0x000000, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList::InScrollNum' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList, IsPlaySE) == 0x000004, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList::IsPlaySE' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList, __WorldContext) == 0x000008, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList, CallFunc_BPI_GetSkillSearchWindowCtrl_outActor) == 0x000050, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList::CallFunc_BPI_GetSkillSearchWindowCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList, K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl) == 0x000058, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList::K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_ScrollList::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BPL_SkillSearchSortWindow.BPL_SkillSearchSortWindow_C.BPL_SkillSearchWindow_IsEnableMouseWheel
// 0x0070 (0x0070 - 0x0000)
struct BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnable;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DE6[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DE7[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DE8[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetSkillSearchWindowCtrl_outActor;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SkillSearchSortCtrl_C> K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl;   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_IsEnableMouseWheel_IsEnable;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel) == 0x000008, "Wrong alignment on BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel");
static_assert(sizeof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel) == 0x000070, "Wrong size on BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel, __WorldContext) == 0x000000, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel, IsEnable) == 0x000008, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel::IsEnable' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel, CallFunc_BPI_GetSkillSearchWindowCtrl_outActor) == 0x000050, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel::CallFunc_BPI_GetSkillSearchWindowCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel, K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl) == 0x000058, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel::K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel, CallFunc_BPI_IsEnableMouseWheel_IsEnable) == 0x000069, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsEnableMouseWheel::CallFunc_BPI_IsEnableMouseWheel_IsEnable' has a wrong offset!");

// Function BPL_SkillSearchSortWindow.BPL_SkillSearchSortWindow_C.BPL_SkillSearchWindow_CheckMouseWheel
// 0x0070 (0x0070 - 0x0000)
struct BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DE9[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DEA[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DEB[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetSkillSearchWindowCtrl_outActor;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SkillSearchSortCtrl_C> K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl;   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel) == 0x000008, "Wrong alignment on BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel");
static_assert(sizeof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel) == 0x000070, "Wrong size on BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel, IsPlaySE) == 0x000000, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel::IsPlaySE' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel, __WorldContext) == 0x000008, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel, CallFunc_BPI_GetSkillSearchWindowCtrl_outActor) == 0x000050, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel::CallFunc_BPI_GetSkillSearchWindowCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel, K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl) == 0x000058, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel::K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckMouseWheel::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BPL_SkillSearchSortWindow.BPL_SkillSearchSortWindow_C.BPL_SkillSearchWindow_CheckInputAndUpdate
// 0x0070 (0x0070 - 0x0000)
struct BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDecideSkill;                                     // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsPressedClose;                                    // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DEC[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DED[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DEE[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetSkillSearchWindowCtrl_outActor;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SkillSearchSortCtrl_C> K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl;   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_CheckInputAndUpdate_IsDecideSkill;    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_CheckInputAndUpdate_IsPressedClose;   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate) == 0x000008, "Wrong alignment on BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate");
static_assert(sizeof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate) == 0x000070, "Wrong size on BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate, __WorldContext) == 0x000000, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate, IsDecideSkill) == 0x000008, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate::IsDecideSkill' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate, IsPressedClose) == 0x000009, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate::IsPressedClose' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate, CallFunc_BPI_GetSkillSearchWindowCtrl_outActor) == 0x000050, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate::CallFunc_BPI_GetSkillSearchWindowCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate, K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl) == 0x000058, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate::K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate, CallFunc_BPI_CheckInputAndUpdate_IsDecideSkill) == 0x000069, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate::CallFunc_BPI_CheckInputAndUpdate_IsDecideSkill' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate, CallFunc_BPI_CheckInputAndUpdate_IsPressedClose) == 0x00006A, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_CheckInputAndUpdate::CallFunc_BPI_CheckInputAndUpdate_IsPressedClose' has a wrong offset!");

// Function BPL_SkillSearchSortWindow.BPL_SkillSearchSortWindow_C.BPL_SkillSearchWindow_IsActiveWindow
// 0x0070 (0x0070 - 0x0000)
struct BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DEF[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DF0[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DF1[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetSkillSearchWindowCtrl_outActor;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SkillSearchSortCtrl_C> K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl;   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_IsActiveSkillSearchWindow_IsActive;   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow) == 0x000008, "Wrong alignment on BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow");
static_assert(sizeof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow) == 0x000070, "Wrong size on BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow, __WorldContext) == 0x000000, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow, IsActive) == 0x000008, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow::IsActive' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow, CallFunc_BPI_GetSkillSearchWindowCtrl_outActor) == 0x000050, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow::CallFunc_BPI_GetSkillSearchWindowCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow, K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl) == 0x000058, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow::K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow, CallFunc_BPI_IsActiveSkillSearchWindow_IsActive) == 0x000069, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_IsActiveWindow::CallFunc_BPI_IsActiveSkillSearchWindow_IsActive' has a wrong offset!");

// Function BPL_SkillSearchSortWindow.BPL_SkillSearchSortWindow_C.BPL_SkillSearchWindow_GetDecideSkillID
// 0x0010 (0x0010 - 0x0000)
struct BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetDecideSkillID final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillId;                                           // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUtsusemiSortSkillId_ReturnValue;       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetDecideSkillID) == 0x000008, "Wrong alignment on BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetDecideSkillID");
static_assert(sizeof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetDecideSkillID) == 0x000010, "Wrong size on BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetDecideSkillID");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetDecideSkillID, __WorldContext) == 0x000000, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetDecideSkillID::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetDecideSkillID, SkillId) == 0x000008, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetDecideSkillID::SkillId' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetDecideSkillID, CallFunc_GetUtsusemiSortSkillId_ReturnValue) == 0x00000C, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetDecideSkillID::CallFunc_GetUtsusemiSortSkillId_ReturnValue' has a wrong offset!");

// Function BPL_SkillSearchSortWindow.BPL_SkillSearchSortWindow_C.BPL_SkillSearchWindow_GetCurrentListNum
// 0x0070 (0x0070 - 0x0000)
struct BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillListNum;                                      // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DF2[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DF3[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DF4[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetSkillSearchWindowCtrl_outActor;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SkillSearchSortCtrl_C> K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl;   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DF5[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BPI_GetCurrentSkillListNum_SkillListNum;  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum) == 0x000008, "Wrong alignment on BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum");
static_assert(sizeof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum) == 0x000070, "Wrong size on BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum, __WorldContext) == 0x000000, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum, SkillListNum) == 0x000008, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum::SkillListNum' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum, CallFunc_BPI_GetSkillSearchWindowCtrl_outActor) == 0x000050, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum::CallFunc_BPI_GetSkillSearchWindowCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum, K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl) == 0x000058, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum::K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum, CallFunc_BPI_GetCurrentSkillListNum_SkillListNum) == 0x00006C, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCurrentListNum::CallFunc_BPI_GetCurrentSkillListNum_SkillListNum' has a wrong offset!");

// Function BPL_SkillSearchSortWindow.BPL_SkillSearchSortWindow_C.BPL_SkillSearchWindow_GetScrollOffset
// 0x0070 (0x0070 - 0x0000)
struct BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ScrollOffset;                                      // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DF6[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DF7[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DF8[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetSkillSearchWindowCtrl_outActor;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SkillSearchSortCtrl_C> K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl;   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DF9[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BPI_GetScrollOffset_ScrollOffset;         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset) == 0x000008, "Wrong alignment on BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset");
static_assert(sizeof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset) == 0x000070, "Wrong size on BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset, __WorldContext) == 0x000000, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset, ScrollOffset) == 0x000008, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset::ScrollOffset' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset, CallFunc_BPI_GetSkillSearchWindowCtrl_outActor) == 0x000050, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset::CallFunc_BPI_GetSkillSearchWindowCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset, K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl) == 0x000058, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset::K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset, CallFunc_BPI_GetScrollOffset_ScrollOffset) == 0x00006C, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetScrollOffset::CallFunc_BPI_GetScrollOffset_ScrollOffset' has a wrong offset!");

// Function BPL_SkillSearchSortWindow.BPL_SkillSearchSortWindow_C.BPL_SkillSearchWindow_GetCursorIdx
// 0x0070 (0x0070 - 0x0000)
struct BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCursorIdx final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CursorIdx;                                         // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DFA[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DFB[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DFC[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetSkillSearchWindowCtrl_outActor;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SkillSearchSortCtrl_C> K2Node_DynamicCast_AsBPI_Skill_Search_Sort_Ctrl;   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DFD[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BPI_GetCursorIdx_CursorIdx;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCursorIdx) == 0x000008, "Wrong alignment on BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCursorIdx");
static_assert(sizeof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCursorIdx) == 0x000070, "Wrong size on BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCursorIdx");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCursorIdx, __WorldContext) == 0x000000, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCursorIdx::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCursorIdx, CursorIdx) == 0x000008, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCursorIdx::CursorIdx' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCursorIdx, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCursorIdx::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCursorIdx, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCursorIdx::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCursorIdx, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCursorIdx::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCursorIdx, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_SkillSearchSortWindow_C_BPL_SkillSearchWindow_GetCursorIdx::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
