#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_Estoma

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPL_Estoma.BPL_Estoma_C.BPL_UnlockEstomaLight
// 0x0010 (0x0010 - 0x0000)
struct BPL_Estoma_C_BPL_UnlockEstomaLight final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Unlock;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLearningGodParameterSkill_ReturnValue;  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_Estoma_C_BPL_UnlockEstomaLight) == 0x000008, "Wrong alignment on BPL_Estoma_C_BPL_UnlockEstomaLight");
static_assert(sizeof(BPL_Estoma_C_BPL_UnlockEstomaLight) == 0x000010, "Wrong size on BPL_Estoma_C_BPL_UnlockEstomaLight");
static_assert(offsetof(BPL_Estoma_C_BPL_UnlockEstomaLight, __WorldContext) == 0x000000, "Member 'BPL_Estoma_C_BPL_UnlockEstomaLight::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_Estoma_C_BPL_UnlockEstomaLight, Unlock) == 0x000008, "Member 'BPL_Estoma_C_BPL_UnlockEstomaLight::Unlock' has a wrong offset!");
static_assert(offsetof(BPL_Estoma_C_BPL_UnlockEstomaLight, CallFunc_IsLearningGodParameterSkill_ReturnValue) == 0x000009, "Member 'BPL_Estoma_C_BPL_UnlockEstomaLight::CallFunc_IsLearningGodParameterSkill_ReturnValue' has a wrong offset!");

// Function BPL_Estoma.BPL_Estoma_C.BPL_EndEstomaEffect
// 0x0030 (0x0030 - 0x0000)
struct BPL_Estoma_C_BPL_EndEstomaEffect final
{
public:
	bool                                          bPlaySE;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8889[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Pla603_C>         K2Node_DynamicCast_AsBPI_Pla_603;                  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_Estoma_C_BPL_EndEstomaEffect) == 0x000008, "Wrong alignment on BPL_Estoma_C_BPL_EndEstomaEffect");
static_assert(sizeof(BPL_Estoma_C_BPL_EndEstomaEffect) == 0x000030, "Wrong size on BPL_Estoma_C_BPL_EndEstomaEffect");
static_assert(offsetof(BPL_Estoma_C_BPL_EndEstomaEffect, bPlaySE) == 0x000000, "Member 'BPL_Estoma_C_BPL_EndEstomaEffect::bPlaySE' has a wrong offset!");
static_assert(offsetof(BPL_Estoma_C_BPL_EndEstomaEffect, __WorldContext) == 0x000008, "Member 'BPL_Estoma_C_BPL_EndEstomaEffect::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_Estoma_C_BPL_EndEstomaEffect, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'BPL_Estoma_C_BPL_EndEstomaEffect::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Estoma_C_BPL_EndEstomaEffect, K2Node_DynamicCast_AsBPI_Pla_603) == 0x000018, "Member 'BPL_Estoma_C_BPL_EndEstomaEffect::K2Node_DynamicCast_AsBPI_Pla_603' has a wrong offset!");
static_assert(offsetof(BPL_Estoma_C_BPL_EndEstomaEffect, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_Estoma_C_BPL_EndEstomaEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BPL_Estoma.BPL_Estoma_C.BPL_BeginEstomaEffect
// 0x0030 (0x0030 - 0x0000)
struct BPL_Estoma_C_BPL_BeginEstomaEffect final
{
public:
	bool                                          bPlaySE;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_888A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Pla603_C>         K2Node_DynamicCast_AsBPI_Pla_603;                  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_Estoma_C_BPL_BeginEstomaEffect) == 0x000008, "Wrong alignment on BPL_Estoma_C_BPL_BeginEstomaEffect");
static_assert(sizeof(BPL_Estoma_C_BPL_BeginEstomaEffect) == 0x000030, "Wrong size on BPL_Estoma_C_BPL_BeginEstomaEffect");
static_assert(offsetof(BPL_Estoma_C_BPL_BeginEstomaEffect, bPlaySE) == 0x000000, "Member 'BPL_Estoma_C_BPL_BeginEstomaEffect::bPlaySE' has a wrong offset!");
static_assert(offsetof(BPL_Estoma_C_BPL_BeginEstomaEffect, __WorldContext) == 0x000008, "Member 'BPL_Estoma_C_BPL_BeginEstomaEffect::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_Estoma_C_BPL_BeginEstomaEffect, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'BPL_Estoma_C_BPL_BeginEstomaEffect::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Estoma_C_BPL_BeginEstomaEffect, K2Node_DynamicCast_AsBPI_Pla_603) == 0x000018, "Member 'BPL_Estoma_C_BPL_BeginEstomaEffect::K2Node_DynamicCast_AsBPI_Pla_603' has a wrong offset!");
static_assert(offsetof(BPL_Estoma_C_BPL_BeginEstomaEffect, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_Estoma_C_BPL_BeginEstomaEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BPL_Estoma.BPL_Estoma_C.BPL_EndEstoma
// 0x0008 (0x0008 - 0x0000)
struct BPL_Estoma_C_BPL_EndEstoma final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_Estoma_C_BPL_EndEstoma) == 0x000008, "Wrong alignment on BPL_Estoma_C_BPL_EndEstoma");
static_assert(sizeof(BPL_Estoma_C_BPL_EndEstoma) == 0x000008, "Wrong size on BPL_Estoma_C_BPL_EndEstoma");
static_assert(offsetof(BPL_Estoma_C_BPL_EndEstoma, __WorldContext) == 0x000000, "Member 'BPL_Estoma_C_BPL_EndEstoma::__WorldContext' has a wrong offset!");

// Function BPL_Estoma.BPL_Estoma_C.BPL_BeginEstoma
// 0x0008 (0x0008 - 0x0000)
struct BPL_Estoma_C_BPL_BeginEstoma final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_Estoma_C_BPL_BeginEstoma) == 0x000008, "Wrong alignment on BPL_Estoma_C_BPL_BeginEstoma");
static_assert(sizeof(BPL_Estoma_C_BPL_BeginEstoma) == 0x000008, "Wrong size on BPL_Estoma_C_BPL_BeginEstoma");
static_assert(offsetof(BPL_Estoma_C_BPL_BeginEstoma, __WorldContext) == 0x000000, "Member 'BPL_Estoma_C_BPL_BeginEstoma::__WorldContext' has a wrong offset!");

}

