#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_Garden

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BPL_Garden.BPL_Garden_C.AddDebugMenuGarden
// 0x0580 (0x0580 - 0x0000)
struct BPL_Garden_C_AddDebugMenuGarden final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         ForceTalk_EN;                                      // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         ForceTalk_JP;                                      // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         ForcePUReward_EN;                                  // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         ForcePUReward_JP;                                  // 0x0038(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         ForceRank_EN;                                      // 0x0048(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         ForceRank_JP;                                      // 0x0058(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         PlayerTalkLabels;                                  // 0x0068(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         ItemMessages;                                      // 0x0078(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         PowerMessages;                                     // 0x0088(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         ChatMessages;                                      // 0x0098(0x0010)(Edit, BlueprintVisible)
	class FString                                 ChangeMessagePath;                                 // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisplayJapaneseText_IsJapanese;     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_1;           // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_2;           // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue;    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_3;           // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisplayJapaneseText_IsJapanese_1;   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_4;           // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisplayJapaneseText_IsJapanese_2;   // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_5;           // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_6;           // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_7;           // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1;  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2;  // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_8;           // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_9;           // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3;  // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_10;          // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_11;          // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4;  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue;  // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_12;          // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_13;          // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1; // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_14;          // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_15;          // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_16;          // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_17;          // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_18;          // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1; // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2; // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_19;          // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_20;          // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_21;          // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_22;          // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_23;          // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_24;          // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_25;          // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_26;          // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_27;          // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3; // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_4; // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_28;          // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_29;          // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue; // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1; // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_30;          // 0x0300(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_31;          // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_2; // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_3; // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_32;          // 0x0328(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array_1;                          // 0x0338(0x0010)(ReferenceParm)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_5; // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array_2;                          // 0x0350(0x0010)(ReferenceParm)
	TArray<class FString>                         K2Node_MakeArray_Array_3;                          // 0x0360(0x0010)(ReferenceParm)
	TArray<class FString>                         K2Node_MakeArray_Array_4;                          // 0x0370(0x0010)(ReferenceParm)
	TArray<class FString>                         K2Node_MakeArray_Array_5;                          // 0x0380(0x0010)(ReferenceParm)
	TArray<class FString>                         K2Node_MakeArray_Array_6;                          // 0x0390(0x0010)(ReferenceParm)
	TArray<class FString>                         K2Node_MakeArray_Array_7;                          // 0x03A0(0x0010)(ReferenceParm)
	TArray<class FString>                         K2Node_MakeArray_Array_8;                          // 0x03B0(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x3];                                      // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x03C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x03D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x03F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0408(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_6; // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0420(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_7; // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x043C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0448(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_8; // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_3;          // 0x045C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_4;          // 0x0464(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_9; // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_10; // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_474[0x4];                                      // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_Select_Default;                             // 0x0478(0x0010)(ReferenceParm)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue; // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStockMaxEnum_ReturnValue;              // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491[0x3];                                      // 0x0491(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_Select_Default_1;                           // 0x04A0(0x0010)(ReferenceParm)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_1; // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array_9;                          // 0x04B8(0x0010)(ReferenceParm)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_11; // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_2; // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_3; // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_4; // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_5; // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x04E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x04F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_5;          // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_6;          // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_6; // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0514(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_515[0x3];                                      // 0x0515(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_7; // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_Select_Default_2;                           // 0x0520(0x0010)(ReferenceParm)
	class FName                                   CallFunc_ValueToName_ReturnValue;                  // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_8; // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0540(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0554(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_555[0x3];                                      // 0x0555(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55C[0x4];                                      // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0560(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_7;          // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_9; // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_Garden_C_AddDebugMenuGarden) == 0x000008, "Wrong alignment on BPL_Garden_C_AddDebugMenuGarden");
static_assert(sizeof(BPL_Garden_C_AddDebugMenuGarden) == 0x000580, "Wrong size on BPL_Garden_C_AddDebugMenuGarden");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, __WorldContext) == 0x000000, "Member 'BPL_Garden_C_AddDebugMenuGarden::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, ForceTalk_EN) == 0x000008, "Member 'BPL_Garden_C_AddDebugMenuGarden::ForceTalk_EN' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, ForceTalk_JP) == 0x000018, "Member 'BPL_Garden_C_AddDebugMenuGarden::ForceTalk_JP' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, ForcePUReward_EN) == 0x000028, "Member 'BPL_Garden_C_AddDebugMenuGarden::ForcePUReward_EN' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, ForcePUReward_JP) == 0x000038, "Member 'BPL_Garden_C_AddDebugMenuGarden::ForcePUReward_JP' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, ForceRank_EN) == 0x000048, "Member 'BPL_Garden_C_AddDebugMenuGarden::ForceRank_EN' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, ForceRank_JP) == 0x000058, "Member 'BPL_Garden_C_AddDebugMenuGarden::ForceRank_JP' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, PlayerTalkLabels) == 0x000068, "Member 'BPL_Garden_C_AddDebugMenuGarden::PlayerTalkLabels' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, ItemMessages) == 0x000078, "Member 'BPL_Garden_C_AddDebugMenuGarden::ItemMessages' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, PowerMessages) == 0x000088, "Member 'BPL_Garden_C_AddDebugMenuGarden::PowerMessages' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, ChatMessages) == 0x000098, "Member 'BPL_Garden_C_AddDebugMenuGarden::ChatMessages' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, ChangeMessagePath) == 0x0000A8, "Member 'BPL_Garden_C_AddDebugMenuGarden::ChangeMessagePath' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, K2Node_MakeArray_Array) == 0x0000B8, "Member 'BPL_Garden_C_AddDebugMenuGarden::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text) == 0x0000C8, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_ShouldDisplayJapaneseText_IsJapanese) == 0x0000D8, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_ShouldDisplayJapaneseText_IsJapanese' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_1) == 0x0000E0, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_1' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_2) == 0x0000F0, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_2' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeParam_ReturnValue) == 0x000100, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x000104, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_3) == 0x000108, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_3' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_ShouldDisplayJapaneseText_IsJapanese_1) == 0x000118, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_ShouldDisplayJapaneseText_IsJapanese_1' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_4) == 0x000120, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_4' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_ShouldDisplayJapaneseText_IsJapanese_2) == 0x000130, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_ShouldDisplayJapaneseText_IsJapanese_2' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_5) == 0x000138, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_5' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_6) == 0x000148, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_6' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_7) == 0x000158, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_7' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1) == 0x000168, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2) == 0x00016C, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_8) == 0x000170, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_8' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_9) == 0x000180, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_9' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3) == 0x000190, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_10) == 0x000198, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_10' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_11) == 0x0001A8, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_11' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4) == 0x0001B8, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue) == 0x0001BC, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_12) == 0x0001C0, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_12' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_13) == 0x0001D0, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_13' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1) == 0x0001E0, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_14) == 0x0001E8, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_14' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_15) == 0x0001F8, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_15' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_16) == 0x000208, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_16' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_17) == 0x000218, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_17' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_18) == 0x000228, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_18' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1) == 0x000238, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2) == 0x00023C, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_19) == 0x000240, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_19' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_20) == 0x000250, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_20' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_21) == 0x000260, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_21' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_22) == 0x000270, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_22' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_23) == 0x000280, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_23' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_24) == 0x000290, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_24' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_25) == 0x0002A0, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_25' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_26) == 0x0002B0, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_26' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_27) == 0x0002C0, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_27' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3) == 0x0002D0, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_4) == 0x0002D4, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_28) == 0x0002D8, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_28' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_29) == 0x0002E8, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_29' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue) == 0x0002F8, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1) == 0x0002FC, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_30) == 0x000300, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_30' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_31) == 0x000310, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_31' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_2) == 0x000320, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_3) == 0x000324, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_DebugMenu_DispName_L10N_Text_32) == 0x000328, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_DebugMenu_DispName_L10N_Text_32' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, K2Node_MakeArray_Array_1) == 0x000338, "Member 'BPL_Garden_C_AddDebugMenuGarden::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_5) == 0x000348, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, K2Node_MakeArray_Array_2) == 0x000350, "Member 'BPL_Garden_C_AddDebugMenuGarden::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, K2Node_MakeArray_Array_3) == 0x000360, "Member 'BPL_Garden_C_AddDebugMenuGarden::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, K2Node_MakeArray_Array_4) == 0x000370, "Member 'BPL_Garden_C_AddDebugMenuGarden::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, K2Node_MakeArray_Array_5) == 0x000380, "Member 'BPL_Garden_C_AddDebugMenuGarden::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, K2Node_MakeArray_Array_6) == 0x000390, "Member 'BPL_Garden_C_AddDebugMenuGarden::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, K2Node_MakeArray_Array_7) == 0x0003A0, "Member 'BPL_Garden_C_AddDebugMenuGarden::K2Node_MakeArray_Array_7' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, K2Node_MakeArray_Array_8) == 0x0003B0, "Member 'BPL_Garden_C_AddDebugMenuGarden::K2Node_MakeArray_Array_8' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, Temp_bool_Variable) == 0x0003C0, "Member 'BPL_Garden_C_AddDebugMenuGarden::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, Temp_int_Variable) == 0x0003C4, "Member 'BPL_Garden_C_AddDebugMenuGarden::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Conv_IntToString_ReturnValue) == 0x0003C8, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Concat_StrStr_ReturnValue) == 0x0003D8, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Add_IntInt_ReturnValue) == 0x0003E8, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0003F0, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Conv_StringToName_ReturnValue) == 0x000400, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000408, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_6) == 0x000418, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000420, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000430, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_7) == 0x000438, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Conv_StringToName_ReturnValue_2) == 0x00043C, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000448, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_8) == 0x000458, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Conv_StringToName_ReturnValue_3) == 0x00045C, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Conv_StringToName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Conv_StringToName_ReturnValue_4) == 0x000464, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Conv_StringToName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_9) == 0x00046C, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_10) == 0x000470, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, K2Node_Select_Default) == 0x000478, "Member 'BPL_Garden_C_AddDebugMenuGarden::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypePullDown_ReturnValue) == 0x000488, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypePullDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_GetStockMaxEnum_ReturnValue) == 0x00048C, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_GetStockMaxEnum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, Temp_bool_Variable_1) == 0x000490, "Member 'BPL_Garden_C_AddDebugMenuGarden::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Subtract_IntInt_ReturnValue) == 0x000494, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000498, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, K2Node_Select_Default_1) == 0x0004A0, "Member 'BPL_Garden_C_AddDebugMenuGarden::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_1) == 0x0004B0, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, K2Node_MakeArray_Array_9) == 0x0004B8, "Member 'BPL_Garden_C_AddDebugMenuGarden::K2Node_MakeArray_Array_9' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_11) == 0x0004C8, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_2) == 0x0004CC, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Array_Add_ReturnValue) == 0x0004D0, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_3) == 0x0004D4, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_4) == 0x0004D8, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_5) == 0x0004DC, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0004E0, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0004F0, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Conv_StringToName_ReturnValue_5) == 0x000500, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Conv_StringToName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Conv_StringToName_ReturnValue_6) == 0x000508, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Conv_StringToName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_6) == 0x000510, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, Temp_bool_Variable_2) == 0x000514, "Member 'BPL_Garden_C_AddDebugMenuGarden::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_7) == 0x000518, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, Temp_int_Variable_1) == 0x00051C, "Member 'BPL_Garden_C_AddDebugMenuGarden::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, K2Node_Select_Default_2) == 0x000520, "Member 'BPL_Garden_C_AddDebugMenuGarden::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_ValueToName_ReturnValue) == 0x000530, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_ValueToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_8) == 0x000538, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Conv_NameToString_ReturnValue) == 0x000540, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Array_Add_ReturnValue_1) == 0x000550, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000554, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Add_IntInt_ReturnValue_1) == 0x000558, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000560, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_Conv_StringToName_ReturnValue_7) == 0x000570, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_Conv_StringToName_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPL_Garden_C_AddDebugMenuGarden, CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_9) == 0x000578, "Member 'BPL_Garden_C_AddDebugMenuGarden::CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_9' has a wrong offset!");

// Function BPL_Garden.BPL_Garden_C.AddDebugMenuGarden_SP
// 0x0410 (0x0410 - 0x0000)
struct BPL_Garden_C_AddDebugMenuGarden_SP final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Path;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ResetPlayerTalkMenu;                               // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         PlayerTalkLabels_REPEAT;                           // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         PlayerTalkLabels_SINGLE;                           // 0x0028(0x0010)(Edit, BlueprintVisible)
	class FString                                 PlayerTalk_TalkTypeText;                           // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 PlayerTalk_NahobinoText;                           // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         PlayerTalkLabels_POWER;                            // 0x0058(0x0010)(Edit, BlueprintVisible)
	int32                                         TempNumHolder;                                     // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGardenManager*                         CallFunc_GetGardenManager_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GardenManager_C>  K2Node_DynamicCast_AsBPI_Garden_Manager;           // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_1;           // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFreeCameraMS_Default_Camera_Movement_Speed; // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFreeCameraMS_Dash_Camera_Movement_Speed; // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFreeCameraMS_Sneak_Camera_Movement_Speed; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFreeCameraMS_Default_Turn_Input_Scale; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFreeCameraMS_Dash_Turn_Input_Scale;    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFreeCameraMS_Sneak_Turn_Input_Scale;   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFreeCameraMS_Mouse_Turn_Input_Max;     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_2;           // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue;    // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1;  // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_3;                     // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2;  // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3;  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_4;                     // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4;  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_5;                     // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_3;           // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_5;  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_4;           // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_5;           // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_6;           // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_7;           // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AGardenManager*                         CallFunc_GetGardenManager_ReturnValue_1;           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGardenManager*                         CallFunc_GetGardenManager_ReturnValue_2;           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerTalkRepeatableTalkNum_ReturnValue; // 0x0180(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerTalkPlayOnceTalkNum_ReturnValue; // 0x0184(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
