#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_DebugEvent

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BPL_DebugEvent.BPL_DebugEvent_C.AddDebugMenuEvent
// 0x0600 (0x0600 - 0x0000)
struct BPL_DebugEvent_C_AddDebugMenuEvent final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4116[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_1;           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue;  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_2;           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_3;           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_2; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_3; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_4;           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_5;           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_4; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_5; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_6;           // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_7;           // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1; // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_8;           // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_9;           // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2; // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_3; // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_10;          // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_11;          // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_4; // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_5; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_12;          // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_13;          // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_6; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_7; // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_14;          // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_15;          // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_8; // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_9; // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_16;          // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_17;          // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_10; // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_11; // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_18;          // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_19;          // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_12; // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_13; // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_20;          // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_21;          // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_14; // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_15; // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_22;          // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_23;          // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_16; // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_17; // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_24;          // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_25;          // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_18; // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_6; // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_26;          // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_27;          // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_7; // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_8; // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_28;          // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_29;          // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_9; // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_10; // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_30;          // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_31;          // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_11; // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_12; // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_32;          // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_33;          // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_13; // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_14; // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_34;          // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_35;          // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_15; // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_16; // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_36;          // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_37;          // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_17; // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_18; // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_38;          // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_39;          // 0x0318(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_19; // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_20; // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_40;          // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_41;          // 0x0340(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_21; // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_22; // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_42;          // 0x0358(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_43;          // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_23; // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_19; // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_44;          // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_45;          // 0x0390(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_20; // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_21; // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_46;          // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_47;          // 0x03B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_22; // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_23; // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_48;          // 0x03D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_49;          // 0x03E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_24; // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_25; // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_50;          // 0x03F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_51;          // 0x0408(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_26; // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_27; // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_52;          // 0x0420(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_53;          // 0x0430(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_28; // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_29; // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_54;          // 0x0448(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_55;          // 0x0458(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_30; // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_31; // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_56;          // 0x0470(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_57;          // 0x0480(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_32; // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_33; // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_58;          // 0x0498(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_59;          // 0x04A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_34; // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_35; // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_60;          // 0x04C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_61;          // 0x04D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_24; // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_25; // 0x04E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue;    // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1; // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeText_ReturnValue;     // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1;  // 0x04F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2;  // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2; // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_36; // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_26; // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_27; // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3; // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_28; // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_29; // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_30; // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_4; // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_31; // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_5; // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_6; // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_32; // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_33; // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_34; // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_35; // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_36; // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_37; // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_38; // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_39; // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_40; // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_7; // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_37; // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_8; // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_41; // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_42; // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_9; // 0x0564(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_10; // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_43; // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_11; // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_38; // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0578(0x0010)(ReferenceParm)
	int32                                         CallFunc_AddDebugMenuItemTypeText_ReturnValue_1;   // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue; // 0x058C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array_1;                          // 0x0590(0x0010)(ReferenceParm)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_39; // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_1; // 0x05A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_44; // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_45; // 0x05AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_46; // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_40; // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_47; // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_41; // 0x05BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_42; // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_43; // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_44; // 0x05C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_12; // 0x05CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_45; // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_46; // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3;  // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4;  // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_5;  // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_13; // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeText_ReturnValue_2;   // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeText_ReturnValue_3;   // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeText_ReturnValue_4;   // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_14; // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_15; // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_DebugEvent_C_AddDebugMenuEvent) == 0x000008, "Wrong alignment on BPL_DebugEvent_C_AddDebugMenuEvent");
static_assert(sizeof(BPL_DebugEvent_C_AddDebugMenuEvent) == 0x000600, "Wrong size on BPL_DebugEvent_C_AddDebugMenuEvent");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, __WorldContext) == 0x000000, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x000008, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text) == 0x000010, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_1) == 0x000020, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_1' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue) == 0x000030, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1) == 0x000034, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_2) == 0x000038, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_2' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_3) == 0x000048, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_3' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_2) == 0x000058, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_3) == 0x00005C, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_4) == 0x000060, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_4' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_5) == 0x000070, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_5' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_4) == 0x000080, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_5) == 0x000084, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_6) == 0x000088, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_6' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_7) == 0x000098, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_7' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue) == 0x0000A8, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1) == 0x0000AC, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_8) == 0x0000B0, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_8' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_9) == 0x0000C0, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_9' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2) == 0x0000D0, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_3) == 0x0000D4, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_10) == 0x0000D8, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_10' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_11) == 0x0000E8, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_11' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_4) == 0x0000F8, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_5) == 0x0000FC, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_12) == 0x000100, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_12' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_13) == 0x000110, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_13' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_6) == 0x000120, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_7) == 0x000124, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_14) == 0x000128, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_14' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_15) == 0x000138, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_15' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_8) == 0x000148, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_9) == 0x00014C, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_16) == 0x000150, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_16' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_17) == 0x000160, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_17' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_10) == 0x000170, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_11) == 0x000174, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_18) == 0x000178, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_18' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_19) == 0x000188, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_19' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_12) == 0x000198, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_13) == 0x00019C, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_20) == 0x0001A0, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_20' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_21) == 0x0001B0, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_21' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_14) == 0x0001C0, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_15) == 0x0001C4, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_22) == 0x0001C8, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_22' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_23) == 0x0001D8, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_23' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_16) == 0x0001E8, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_17) == 0x0001EC, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_24) == 0x0001F0, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_24' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_25) == 0x000200, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_25' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_18) == 0x000210, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_6) == 0x000214, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_26) == 0x000218, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_26' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_27) == 0x000228, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_27' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_7) == 0x000238, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_8) == 0x00023C, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_28) == 0x000240, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_28' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_29) == 0x000250, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_29' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_9) == 0x000260, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_10) == 0x000264, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_30) == 0x000268, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_30' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_31) == 0x000278, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_31' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_11) == 0x000288, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_12) == 0x00028C, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_32) == 0x000290, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_32' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_33) == 0x0002A0, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_33' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_13) == 0x0002B0, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_14) == 0x0002B4, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_34) == 0x0002B8, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_34' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_35) == 0x0002C8, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_35' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_15) == 0x0002D8, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_16) == 0x0002DC, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_36) == 0x0002E0, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_36' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_37) == 0x0002F0, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_37' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_17) == 0x000300, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_18) == 0x000304, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_38) == 0x000308, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_38' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_39) == 0x000318, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_39' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_19) == 0x000328, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_20) == 0x00032C, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_40) == 0x000330, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_40' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_41) == 0x000340, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_41' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_21) == 0x000350, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_22) == 0x000354, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_42) == 0x000358, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_42' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_43) == 0x000368, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_43' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_23) == 0x000378, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_19) == 0x00037C, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_44) == 0x000380, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_44' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_45) == 0x000390, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_45' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_20) == 0x0003A0, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_21) == 0x0003A4, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_46) == 0x0003A8, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_46' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_47) == 0x0003B8, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_47' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_22) == 0x0003C8, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_23) == 0x0003CC, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_48) == 0x0003D0, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_48' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_49) == 0x0003E0, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_49' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_24) == 0x0003F0, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_25) == 0x0003F4, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_50) == 0x0003F8, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_50' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_51) == 0x000408, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_51' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_26) == 0x000418, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_27) == 0x00041C, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_52) == 0x000420, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_52' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_53) == 0x000430, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_53' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_28) == 0x000440, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_29) == 0x000444, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(BPL_DebugEvent_C_AddDebugMenuEvent, CallFunc_DebugMenu_DispName_L10N_Text_54) == 0x000448, "Member 'BPL_DebugEvent_C_AddDebugMenuEvent::CallFunc_DebugMenu_DispName_L10N_Text_54' has a wrong offset!");
