#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_SaveLoadDebug

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "ROMSaveData_ST_structs.hpp"


namespace SDK::Params
{

// Function BPL_SaveLoadDebug.BPL_SaveLoadDebug_C.AddDebugMenuSaveLoad
// 0x0028 (0x0028 - 0x0000)
struct BPL_SaveLoadDebug_C_AddDebugMenuSaveLoad final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_405A[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_SaveLoadDebug_C_AddDebugMenuSaveLoad) == 0x000008, "Wrong alignment on BPL_SaveLoadDebug_C_AddDebugMenuSaveLoad");
static_assert(sizeof(BPL_SaveLoadDebug_C_AddDebugMenuSaveLoad) == 0x000028, "Wrong size on BPL_SaveLoadDebug_C_AddDebugMenuSaveLoad");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDebugMenuSaveLoad, __WorldContext) == 0x000000, "Member 'BPL_SaveLoadDebug_C_AddDebugMenuSaveLoad::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDebugMenuSaveLoad, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x000008, "Member 'BPL_SaveLoadDebug_C_AddDebugMenuSaveLoad::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDebugMenuSaveLoad, CallFunc_DebugMenu_DispName_L10N_Text) == 0x000010, "Member 'BPL_SaveLoadDebug_C_AddDebugMenuSaveLoad::CallFunc_DebugMenu_DispName_L10N_Text' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDebugMenuSaveLoad, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue) == 0x000020, "Member 'BPL_SaveLoadDebug_C_AddDebugMenuSaveLoad::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue' has a wrong offset!");

// Function BPL_SaveLoadDebug.BPL_SaveLoadDebug_C.AddSaveDebugRoot
// 0x00C8 (0x00C8 - 0x0000)
struct BPL_SaveLoadDebug_C_AddSaveDebugRoot final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Lo_MenuRoot;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IS_EDITOR_BUILD_ReturnValue;              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_405B[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeText_ReturnValue;     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_405C[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_PCSave_PickupFilePath_ReturnValue;        // 0x0058(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue;  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1; // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_405D[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_3;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_SaveLoadDebug_C_AddSaveDebugRoot) == 0x000008, "Wrong alignment on BPL_SaveLoadDebug_C_AddSaveDebugRoot");
static_assert(sizeof(BPL_SaveLoadDebug_C_AddSaveDebugRoot) == 0x0000C8, "Wrong size on BPL_SaveLoadDebug_C_AddSaveDebugRoot");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddSaveDebugRoot, __WorldContext) == 0x000000, "Member 'BPL_SaveLoadDebug_C_AddSaveDebugRoot::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddSaveDebugRoot, Lo_MenuRoot) == 0x000008, "Member 'BPL_SaveLoadDebug_C_AddSaveDebugRoot::Lo_MenuRoot' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddSaveDebugRoot, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BPL_SaveLoadDebug_C_AddSaveDebugRoot::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddSaveDebugRoot, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BPL_SaveLoadDebug_C_AddSaveDebugRoot::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddSaveDebugRoot, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BPL_SaveLoadDebug_C_AddSaveDebugRoot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddSaveDebugRoot, CallFunc_IS_EDITOR_BUILD_ReturnValue) == 0x000024, "Member 'BPL_SaveLoadDebug_C_AddSaveDebugRoot::CallFunc_IS_EDITOR_BUILD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddSaveDebugRoot, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'BPL_SaveLoadDebug_C_AddSaveDebugRoot::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddSaveDebugRoot, CallFunc_Conv_StringToName_ReturnValue) == 0x000038, "Member 'BPL_SaveLoadDebug_C_AddSaveDebugRoot::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddSaveDebugRoot, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000040, "Member 'BPL_SaveLoadDebug_C_AddSaveDebugRoot::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddSaveDebugRoot, CallFunc_AddDebugMenuItemTypeText_ReturnValue) == 0x000050, "Member 'BPL_SaveLoadDebug_C_AddSaveDebugRoot::CallFunc_AddDebugMenuItemTypeText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddSaveDebugRoot, CallFunc_PCSave_PickupFilePath_ReturnValue) == 0x000058, "Member 'BPL_SaveLoadDebug_C_AddSaveDebugRoot::CallFunc_PCSave_PickupFilePath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddSaveDebugRoot, CallFunc_Array_Get_Item) == 0x000068, "Member 'BPL_SaveLoadDebug_C_AddSaveDebugRoot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddSaveDebugRoot, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000078, "Member 'BPL_SaveLoadDebug_C_AddSaveDebugRoot::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddSaveDebugRoot, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000088, "Member 'BPL_SaveLoadDebug_C_AddSaveDebugRoot::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddSaveDebugRoot, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000098, "Member 'BPL_SaveLoadDebug_C_AddSaveDebugRoot::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddSaveDebugRoot, CallFunc_Conv_StringToName_ReturnValue_2) == 0x0000A0, "Member 'BPL_SaveLoadDebug_C_AddSaveDebugRoot::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddSaveDebugRoot, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue) == 0x0000A8, "Member 'BPL_SaveLoadDebug_C_AddSaveDebugRoot::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddSaveDebugRoot, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1) == 0x0000AC, "Member 'BPL_SaveLoadDebug_C_AddSaveDebugRoot::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddSaveDebugRoot, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'BPL_SaveLoadDebug_C_AddSaveDebugRoot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddSaveDebugRoot, CallFunc_Less_IntInt_ReturnValue) == 0x0000B4, "Member 'BPL_SaveLoadDebug_C_AddSaveDebugRoot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddSaveDebugRoot, CallFunc_Conv_StringToName_ReturnValue_3) == 0x0000B8, "Member 'BPL_SaveLoadDebug_C_AddSaveDebugRoot::CallFunc_Conv_StringToName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddSaveDebugRoot, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x0000C0, "Member 'BPL_SaveLoadDebug_C_AddSaveDebugRoot::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");

// Function BPL_SaveLoadDebug.BPL_SaveLoadDebug_C.AddLoadDebugRoot
// 0x01C8 (0x01C8 - 0x0000)
struct BPL_SaveLoadDebug_C_AddLoadDebugRoot final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Lo_Names;                                          // 0x0008(0x0010)(Edit, BlueprintVisible)
	class FString                                 Lo_SaveName;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Lo_LoadRoot;                                       // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	E_SaveExistsResult                            CallFunc_debugSaveExist_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_405E[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	E_SaveExistsResult                            CallFunc_debugSaveExist_ReturnValue_1;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_405F[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue;  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1; // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SaveExistsResult                            CallFunc_debugSaveExist_ReturnValue_2;             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4060[0x6];                                     // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4061[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4062[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_2; // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4063[0x3];                                     // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_11;             // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_PCSave_PickupFilePath_ReturnValue;        // 0x0170(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_3;          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_12;             // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_4;          // 0x01AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_3; // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4064[0x3];                                     // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_SaveLoadDebug_C_AddLoadDebugRoot) == 0x000008, "Wrong alignment on BPL_SaveLoadDebug_C_AddLoadDebugRoot");
static_assert(sizeof(BPL_SaveLoadDebug_C_AddLoadDebugRoot) == 0x0001C8, "Wrong size on BPL_SaveLoadDebug_C_AddLoadDebugRoot");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, __WorldContext) == 0x000000, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, Lo_Names) == 0x000008, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::Lo_Names' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, Lo_SaveName) == 0x000018, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::Lo_SaveName' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, Lo_LoadRoot) == 0x000028, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::Lo_LoadRoot' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_debugSaveExist_ReturnValue) == 0x000038, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_debugSaveExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000039, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, Temp_int_Array_Index_Variable) == 0x000044, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_debugSaveExist_ReturnValue_1) == 0x000058, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_debugSaveExist_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000059, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000060, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000070, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000080, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000090, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0000A0, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Conv_StringToName_ReturnValue) == 0x0000B0, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Conv_StringToName_ReturnValue_1) == 0x0000B8, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue) == 0x0000C0, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1) == 0x0000C4, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_debugSaveExist_ReturnValue_2) == 0x0000C8, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_debugSaveExist_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000C9, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0000D0, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, Temp_int_Variable) == 0x0000E0, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Concat_StrStr_ReturnValue_7) == 0x0000E8, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Conv_IntToString_ReturnValue) == 0x0000F8, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000108, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000118, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Conv_StringToName_ReturnValue_2) == 0x000128, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000130, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_2) == 0x000134, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_SelectString_ReturnValue) == 0x000138, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Concat_StrStr_ReturnValue_10) == 0x000148, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Concat_StrStr_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000158, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Add_IntInt_ReturnValue_1) == 0x00015C, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Concat_StrStr_ReturnValue_11) == 0x000160, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Concat_StrStr_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_PCSave_PickupFilePath_ReturnValue) == 0x000170, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_PCSave_PickupFilePath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Array_Get_Item) == 0x000180, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Conv_StringToName_ReturnValue_3) == 0x000190, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Conv_StringToName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Concat_StrStr_ReturnValue_12) == 0x000198, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Concat_StrStr_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x0001A8, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Conv_StringToName_ReturnValue_4) == 0x0001AC, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Conv_StringToName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Array_Length_ReturnValue) == 0x0001B4, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_3) == 0x0001B8, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Less_IntInt_ReturnValue) == 0x0001BC, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Array_Length_ReturnValue_1) == 0x0001C0, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddLoadDebugRoot, CallFunc_Greater_IntInt_ReturnValue) == 0x0001C4, "Member 'BPL_SaveLoadDebug_C_AddLoadDebugRoot::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BPL_SaveLoadDebug.BPL_SaveLoadDebug_C.AddDeleteDebugRoot
// 0x01B8 (0x01B8 - 0x0000)
struct BPL_SaveLoadDebug_C_AddDeleteDebugRoot final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Lo_SaveName;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Lo_LoadRoot;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	E_SaveExistsResult                            CallFunc_debugSaveExist_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4065[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	E_SaveExistsResult                            CallFunc_debugSaveExist_ReturnValue_1;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4066[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue;  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1; // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SaveExistsResult                            CallFunc_debugSaveExist_ReturnValue_2;             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4067[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4068[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4069[0x3];                                     // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_2; // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_406A[0x3];                                     // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_11;             // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_PCSave_PickupFilePath_ReturnValue;        // 0x0160(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_3;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_12;             // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_4;          // 0x019C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_3; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_406B[0x3];                                     // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot) == 0x000008, "Wrong alignment on BPL_SaveLoadDebug_C_AddDeleteDebugRoot");
static_assert(sizeof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot) == 0x0001B8, "Wrong size on BPL_SaveLoadDebug_C_AddDeleteDebugRoot");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, __WorldContext) == 0x000000, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, Lo_SaveName) == 0x000008, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::Lo_SaveName' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, Lo_LoadRoot) == 0x000018, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::Lo_LoadRoot' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_debugSaveExist_ReturnValue) == 0x000028, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_debugSaveExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000029, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, Temp_int_Array_Index_Variable) == 0x000034, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_debugSaveExist_ReturnValue_1) == 0x000048, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_debugSaveExist_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000049, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000060, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000070, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000080, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000090, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Conv_StringToName_ReturnValue) == 0x0000A0, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Conv_StringToName_ReturnValue_1) == 0x0000A8, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue) == 0x0000B0, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1) == 0x0000B4, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_debugSaveExist_ReturnValue_2) == 0x0000B8, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_debugSaveExist_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000B9, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0000C0, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, Temp_int_Variable) == 0x0000D0, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Concat_StrStr_ReturnValue_7) == 0x0000D8, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Conv_IntToString_ReturnValue) == 0x0000E8, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Concat_StrStr_ReturnValue_8) == 0x0000F8, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000108, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Conv_StringToName_ReturnValue_2) == 0x000118, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000120, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_2) == 0x000124, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_SelectString_ReturnValue) == 0x000128, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Concat_StrStr_ReturnValue_10) == 0x000138, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Concat_StrStr_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000148, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Add_IntInt_ReturnValue_1) == 0x00014C, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Concat_StrStr_ReturnValue_11) == 0x000150, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Concat_StrStr_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_PCSave_PickupFilePath_ReturnValue) == 0x000160, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_PCSave_PickupFilePath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Array_Get_Item) == 0x000170, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Conv_StringToName_ReturnValue_3) == 0x000180, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Conv_StringToName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Concat_StrStr_ReturnValue_12) == 0x000188, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Concat_StrStr_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x000198, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Conv_StringToName_ReturnValue_4) == 0x00019C, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Conv_StringToName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Array_Length_ReturnValue) == 0x0001A4, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_3) == 0x0001A8, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Less_IntInt_ReturnValue) == 0x0001AC, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Array_Length_ReturnValue_1) == 0x0001B0, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDeleteDebugRoot, CallFunc_Greater_IntInt_ReturnValue) == 0x0001B4, "Member 'BPL_SaveLoadDebug_C_AddDeleteDebugRoot::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BPL_SaveLoadDebug.BPL_SaveLoadDebug_C.AddDebugMenuSaveLoadSp
// 0x0008 (0x0008 - 0x0000)
struct BPL_SaveLoadDebug_C_AddDebugMenuSaveLoadSp final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_SaveLoadDebug_C_AddDebugMenuSaveLoadSp) == 0x000008, "Wrong alignment on BPL_SaveLoadDebug_C_AddDebugMenuSaveLoadSp");
static_assert(sizeof(BPL_SaveLoadDebug_C_AddDebugMenuSaveLoadSp) == 0x000008, "Wrong size on BPL_SaveLoadDebug_C_AddDebugMenuSaveLoadSp");
static_assert(offsetof(BPL_SaveLoadDebug_C_AddDebugMenuSaveLoadSp, __WorldContext) == 0x000000, "Member 'BPL_SaveLoadDebug_C_AddDebugMenuSaveLoadSp::__WorldContext' has a wrong offset!");

// Function BPL_SaveLoadDebug.BPL_SaveLoadDebug_C.AddSettingDebugRoot
// 0x0280 (0x0280 - 0x0000)
struct BPL_SaveLoadDebug_C_AddSettingDebugRoot final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_3;                            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_4;                            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_5;                            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_6;                            // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue;    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_406C[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_7;                            // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_406D[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_8;                            // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1; // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_406E[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_9;                            // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2; // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_3; // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_10;                           // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x0128(0x00D0)()
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_406F[0x4];                                     // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_11;                           // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1; // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1;  // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_12;                           // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_4; // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_5; // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_13;                           // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_14;                           // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_6; // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_7; // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4070[0x4];                                     // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
