#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_DebugKeyboard

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPL_DebugKeyboard.BPL_DebugKeyboard_C.AddDebugMenuKeyboardDebug
// 0x0038 (0x0038 - 0x0000)
struct BPL_DebugKeyboard_C_AddDebugMenuKeyboardDebug final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E29[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_3; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue;    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_DebugKeyboard_C_AddDebugMenuKeyboardDebug) == 0x000008, "Wrong alignment on BPL_DebugKeyboard_C_AddDebugMenuKeyboardDebug");
static_assert(sizeof(BPL_DebugKeyboard_C_AddDebugMenuKeyboardDebug) == 0x000038, "Wrong size on BPL_DebugKeyboard_C_AddDebugMenuKeyboardDebug");
static_assert(offsetof(BPL_DebugKeyboard_C_AddDebugMenuKeyboardDebug, __WorldContext) == 0x000000, "Member 'BPL_DebugKeyboard_C_AddDebugMenuKeyboardDebug::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_DebugKeyboard_C_AddDebugMenuKeyboardDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue) == 0x000008, "Member 'BPL_DebugKeyboard_C_AddDebugMenuKeyboardDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_DebugKeyboard_C_AddDebugMenuKeyboardDebug, CallFunc_DebugMenu_DispName_L10N_Text) == 0x000010, "Member 'BPL_DebugKeyboard_C_AddDebugMenuKeyboardDebug::CallFunc_DebugMenu_DispName_L10N_Text' has a wrong offset!");
static_assert(offsetof(BPL_DebugKeyboard_C_AddDebugMenuKeyboardDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1) == 0x000020, "Member 'BPL_DebugKeyboard_C_AddDebugMenuKeyboardDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_DebugKeyboard_C_AddDebugMenuKeyboardDebug, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x000024, "Member 'BPL_DebugKeyboard_C_AddDebugMenuKeyboardDebug::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_DebugKeyboard_C_AddDebugMenuKeyboardDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2) == 0x000028, "Member 'BPL_DebugKeyboard_C_AddDebugMenuKeyboardDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_DebugKeyboard_C_AddDebugMenuKeyboardDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_3) == 0x00002C, "Member 'BPL_DebugKeyboard_C_AddDebugMenuKeyboardDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_DebugKeyboard_C_AddDebugMenuKeyboardDebug, CallFunc_AddDebugMenuItemTypeParam_ReturnValue) == 0x000030, "Member 'BPL_DebugKeyboard_C_AddDebugMenuKeyboardDebug::CallFunc_AddDebugMenuItemTypeParam_ReturnValue' has a wrong offset!");

}

