#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_UIManager

#include "Basic.hpp"

#include "E_TutorialWindow_WidgetState_structs.hpp"
#include "E_MoonAgeAnimationState_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_MakkaWindowAnimState_structs.hpp"
#include "Project_structs.hpp"
#include "E_ScreenTransitionFadeType_structs.hpp"


namespace SDK::Params
{

// Function BPL_UIManager.BPL_UIManager_C.CreateSSPPositionData
// 0x0048 (0x0048 - 0x0000)
struct BPL_UIManager_C_CreateSSPPositionData final
{
public:
	struct FVector2D                              InVec;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InSizeX;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InSizeY;                                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              OutVec;                                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_UIManager_C_CreateSSPPositionData) == 0x000008, "Wrong alignment on BPL_UIManager_C_CreateSSPPositionData");
static_assert(sizeof(BPL_UIManager_C_CreateSSPPositionData) == 0x000048, "Wrong size on BPL_UIManager_C_CreateSSPPositionData");
static_assert(offsetof(BPL_UIManager_C_CreateSSPPositionData, InVec) == 0x000000, "Member 'BPL_UIManager_C_CreateSSPPositionData::InVec' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CreateSSPPositionData, InSizeX) == 0x000008, "Member 'BPL_UIManager_C_CreateSSPPositionData::InSizeX' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CreateSSPPositionData, InSizeY) == 0x00000C, "Member 'BPL_UIManager_C_CreateSSPPositionData::InSizeY' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CreateSSPPositionData, __WorldContext) == 0x000010, "Member 'BPL_UIManager_C_CreateSSPPositionData::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CreateSSPPositionData, OutVec) == 0x000018, "Member 'BPL_UIManager_C_CreateSSPPositionData::OutVec' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CreateSSPPositionData, CallFunc_BreakVector2D_X) == 0x000020, "Member 'BPL_UIManager_C_CreateSSPPositionData::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CreateSSPPositionData, CallFunc_BreakVector2D_Y) == 0x000024, "Member 'BPL_UIManager_C_CreateSSPPositionData::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CreateSSPPositionData, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000028, "Member 'BPL_UIManager_C_CreateSSPPositionData::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CreateSSPPositionData, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00002C, "Member 'BPL_UIManager_C_CreateSSPPositionData::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CreateSSPPositionData, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000030, "Member 'BPL_UIManager_C_CreateSSPPositionData::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CreateSSPPositionData, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000034, "Member 'BPL_UIManager_C_CreateSSPPositionData::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CreateSSPPositionData, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000038, "Member 'BPL_UIManager_C_CreateSSPPositionData::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CreateSSPPositionData, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00003C, "Member 'BPL_UIManager_C_CreateSSPPositionData::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CreateSSPPositionData, CallFunc_MakeVector2D_ReturnValue) == 0x000040, "Member 'BPL_UIManager_C_CreateSSPPositionData::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function BPL_UIManager.BPL_UIManager_C.GetSSPPositionDataByPartsName
// 0x0048 (0x0048 - 0x0000)
struct BPL_UIManager_C_GetSSPPositionDataByPartsName final
{
public:
	class FName                                   InPartsName;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USsPlayerWidget*                        InSSPData;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InSizeX;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InSizeY;                                           // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              OutVec;                                            // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPartTransform_OutPosition;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPartTransform_OutAngle;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPartTransform_OutScale;                // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPartTransform_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39BF[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_CreateSSPPositionData_OutVec;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_UIManager_C_GetSSPPositionDataByPartsName) == 0x000008, "Wrong alignment on BPL_UIManager_C_GetSSPPositionDataByPartsName");
static_assert(sizeof(BPL_UIManager_C_GetSSPPositionDataByPartsName) == 0x000048, "Wrong size on BPL_UIManager_C_GetSSPPositionDataByPartsName");
static_assert(offsetof(BPL_UIManager_C_GetSSPPositionDataByPartsName, InPartsName) == 0x000000, "Member 'BPL_UIManager_C_GetSSPPositionDataByPartsName::InPartsName' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_GetSSPPositionDataByPartsName, InSSPData) == 0x000008, "Member 'BPL_UIManager_C_GetSSPPositionDataByPartsName::InSSPData' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_GetSSPPositionDataByPartsName, InSizeX) == 0x000010, "Member 'BPL_UIManager_C_GetSSPPositionDataByPartsName::InSizeX' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_GetSSPPositionDataByPartsName, InSizeY) == 0x000014, "Member 'BPL_UIManager_C_GetSSPPositionDataByPartsName::InSizeY' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_GetSSPPositionDataByPartsName, __WorldContext) == 0x000018, "Member 'BPL_UIManager_C_GetSSPPositionDataByPartsName::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_GetSSPPositionDataByPartsName, OutVec) == 0x000020, "Member 'BPL_UIManager_C_GetSSPPositionDataByPartsName::OutVec' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_GetSSPPositionDataByPartsName, CallFunc_GetPartTransform_OutPosition) == 0x000028, "Member 'BPL_UIManager_C_GetSSPPositionDataByPartsName::CallFunc_GetPartTransform_OutPosition' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_GetSSPPositionDataByPartsName, CallFunc_GetPartTransform_OutAngle) == 0x000030, "Member 'BPL_UIManager_C_GetSSPPositionDataByPartsName::CallFunc_GetPartTransform_OutAngle' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_GetSSPPositionDataByPartsName, CallFunc_GetPartTransform_OutScale) == 0x000034, "Member 'BPL_UIManager_C_GetSSPPositionDataByPartsName::CallFunc_GetPartTransform_OutScale' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_GetSSPPositionDataByPartsName, CallFunc_GetPartTransform_ReturnValue) == 0x00003C, "Member 'BPL_UIManager_C_GetSSPPositionDataByPartsName::CallFunc_GetPartTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_GetSSPPositionDataByPartsName, CallFunc_CreateSSPPositionData_OutVec) == 0x000040, "Member 'BPL_UIManager_C_GetSSPPositionDataByPartsName::CallFunc_CreateSSPPositionData_OutVec' has a wrong offset!");

// Function BPL_UIManager.BPL_UIManager_C.MoonAge_open
// 0x0070 (0x0070 - 0x0000)
struct BPL_UIManager_C_MoonAge_open final
{
public:
	bool                                          InAnimation;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39C0[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39C1[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39C2[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_MoonAgeCtrl_outActor;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MoonAgeCtrl_C>    K2Node_DynamicCast_AsBPI_Moon_Age_Ctrl;            // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_UIManager_C_MoonAge_open) == 0x000008, "Wrong alignment on BPL_UIManager_C_MoonAge_open");
static_assert(sizeof(BPL_UIManager_C_MoonAge_open) == 0x000070, "Wrong size on BPL_UIManager_C_MoonAge_open");
static_assert(offsetof(BPL_UIManager_C_MoonAge_open, InAnimation) == 0x000000, "Member 'BPL_UIManager_C_MoonAge_open::InAnimation' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_open, __WorldContext) == 0x000008, "Member 'BPL_UIManager_C_MoonAge_open::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_open, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_UIManager_C_MoonAge_open::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_open, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_UIManager_C_MoonAge_open::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_open, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_UIManager_C_MoonAge_open::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_open, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_UIManager_C_MoonAge_open::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_open, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_UIManager_C_MoonAge_open::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_open, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_UIManager_C_MoonAge_open::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_open, CallFunc_BPI_MoonAgeCtrl_outActor) == 0x000050, "Member 'BPL_UIManager_C_MoonAge_open::CallFunc_BPI_MoonAgeCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_open, K2Node_DynamicCast_AsBPI_Moon_Age_Ctrl) == 0x000058, "Member 'BPL_UIManager_C_MoonAge_open::K2Node_DynamicCast_AsBPI_Moon_Age_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_open, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_UIManager_C_MoonAge_open::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BPL_UIManager.BPL_UIManager_C.MoonAge_close
// 0x0070 (0x0070 - 0x0000)
struct BPL_UIManager_C_MoonAge_close final
{
public:
	bool                                          InAnimation;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39C3[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39C4[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39C5[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_MoonAgeCtrl_outActor;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MoonAgeCtrl_C>    K2Node_DynamicCast_AsBPI_Moon_Age_Ctrl;            // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_UIManager_C_MoonAge_close) == 0x000008, "Wrong alignment on BPL_UIManager_C_MoonAge_close");
static_assert(sizeof(BPL_UIManager_C_MoonAge_close) == 0x000070, "Wrong size on BPL_UIManager_C_MoonAge_close");
static_assert(offsetof(BPL_UIManager_C_MoonAge_close, InAnimation) == 0x000000, "Member 'BPL_UIManager_C_MoonAge_close::InAnimation' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_close, __WorldContext) == 0x000008, "Member 'BPL_UIManager_C_MoonAge_close::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_close, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_UIManager_C_MoonAge_close::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_close, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_UIManager_C_MoonAge_close::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_close, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_UIManager_C_MoonAge_close::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_close, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_UIManager_C_MoonAge_close::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_close, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_UIManager_C_MoonAge_close::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_close, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_UIManager_C_MoonAge_close::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_close, CallFunc_BPI_MoonAgeCtrl_outActor) == 0x000050, "Member 'BPL_UIManager_C_MoonAge_close::CallFunc_BPI_MoonAgeCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_close, K2Node_DynamicCast_AsBPI_Moon_Age_Ctrl) == 0x000058, "Member 'BPL_UIManager_C_MoonAge_close::K2Node_DynamicCast_AsBPI_Moon_Age_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_close, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_UIManager_C_MoonAge_close::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BPL_UIManager.BPL_UIManager_C.MoonAge_changeMoonAge
// 0x0070 (0x0070 - 0x0000)
struct BPL_UIManager_C_MoonAge_changeMoonAge final
{
public:
	E_MOON_AGE                                    InTyoe;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C6[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39C7[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39C8[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_MoonAgeCtrl_outActor;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MoonAgeCtrl_C>    K2Node_DynamicCast_AsBPI_Moon_Age_Ctrl;            // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_UIManager_C_MoonAge_changeMoonAge) == 0x000008, "Wrong alignment on BPL_UIManager_C_MoonAge_changeMoonAge");
static_assert(sizeof(BPL_UIManager_C_MoonAge_changeMoonAge) == 0x000070, "Wrong size on BPL_UIManager_C_MoonAge_changeMoonAge");
static_assert(offsetof(BPL_UIManager_C_MoonAge_changeMoonAge, InTyoe) == 0x000000, "Member 'BPL_UIManager_C_MoonAge_changeMoonAge::InTyoe' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_changeMoonAge, __WorldContext) == 0x000008, "Member 'BPL_UIManager_C_MoonAge_changeMoonAge::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_changeMoonAge, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_UIManager_C_MoonAge_changeMoonAge::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_changeMoonAge, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_UIManager_C_MoonAge_changeMoonAge::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_changeMoonAge, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_UIManager_C_MoonAge_changeMoonAge::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_changeMoonAge, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_UIManager_C_MoonAge_changeMoonAge::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_changeMoonAge, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_UIManager_C_MoonAge_changeMoonAge::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_changeMoonAge, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_UIManager_C_MoonAge_changeMoonAge::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_changeMoonAge, CallFunc_BPI_MoonAgeCtrl_outActor) == 0x000050, "Member 'BPL_UIManager_C_MoonAge_changeMoonAge::CallFunc_BPI_MoonAgeCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_changeMoonAge, K2Node_DynamicCast_AsBPI_Moon_Age_Ctrl) == 0x000058, "Member 'BPL_UIManager_C_MoonAge_changeMoonAge::K2Node_DynamicCast_AsBPI_Moon_Age_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_changeMoonAge, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_UIManager_C_MoonAge_changeMoonAge::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BPL_UIManager.BPL_UIManager_C.MoonAge_addMoonAge
// 0x0068 (0x0068 - 0x0000)
struct BPL_UIManager_C_MoonAge_addMoonAge final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39C9[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39CA[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_MoonAgeCtrl_outActor;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MoonAgeCtrl_C>    K2Node_DynamicCast_AsBPI_Moon_Age_Ctrl;            // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_UIManager_C_MoonAge_addMoonAge) == 0x000008, "Wrong alignment on BPL_UIManager_C_MoonAge_addMoonAge");
static_assert(sizeof(BPL_UIManager_C_MoonAge_addMoonAge) == 0x000068, "Wrong size on BPL_UIManager_C_MoonAge_addMoonAge");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addMoonAge, __WorldContext) == 0x000000, "Member 'BPL_UIManager_C_MoonAge_addMoonAge::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addMoonAge, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'BPL_UIManager_C_MoonAge_addMoonAge::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addMoonAge, K2Node_DynamicCast_AsBPI_UIManager) == 0x000010, "Member 'BPL_UIManager_C_MoonAge_addMoonAge::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addMoonAge, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BPL_UIManager_C_MoonAge_addMoonAge::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addMoonAge, CallFunc_BPI_GetUIManager_UIManager) == 0x000028, "Member 'BPL_UIManager_C_MoonAge_addMoonAge::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addMoonAge, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000030, "Member 'BPL_UIManager_C_MoonAge_addMoonAge::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addMoonAge, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BPL_UIManager_C_MoonAge_addMoonAge::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addMoonAge, CallFunc_BPI_MoonAgeCtrl_outActor) == 0x000048, "Member 'BPL_UIManager_C_MoonAge_addMoonAge::CallFunc_BPI_MoonAgeCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addMoonAge, K2Node_DynamicCast_AsBPI_Moon_Age_Ctrl) == 0x000050, "Member 'BPL_UIManager_C_MoonAge_addMoonAge::K2Node_DynamicCast_AsBPI_Moon_Age_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addMoonAge, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'BPL_UIManager_C_MoonAge_addMoonAge::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BPL_UIManager.BPL_UIManager_C.MoonAge_resetMoonAge
// 0x0068 (0x0068 - 0x0000)
struct BPL_UIManager_C_MoonAge_resetMoonAge final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39CB[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39CC[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_MoonAgeCtrl_outActor;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MoonAgeCtrl_C>    K2Node_DynamicCast_AsBPI_Moon_Age_Ctrl;            // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_UIManager_C_MoonAge_resetMoonAge) == 0x000008, "Wrong alignment on BPL_UIManager_C_MoonAge_resetMoonAge");
static_assert(sizeof(BPL_UIManager_C_MoonAge_resetMoonAge) == 0x000068, "Wrong size on BPL_UIManager_C_MoonAge_resetMoonAge");
static_assert(offsetof(BPL_UIManager_C_MoonAge_resetMoonAge, __WorldContext) == 0x000000, "Member 'BPL_UIManager_C_MoonAge_resetMoonAge::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_resetMoonAge, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'BPL_UIManager_C_MoonAge_resetMoonAge::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_resetMoonAge, K2Node_DynamicCast_AsBPI_UIManager) == 0x000010, "Member 'BPL_UIManager_C_MoonAge_resetMoonAge::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_resetMoonAge, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BPL_UIManager_C_MoonAge_resetMoonAge::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_resetMoonAge, CallFunc_BPI_GetUIManager_UIManager) == 0x000028, "Member 'BPL_UIManager_C_MoonAge_resetMoonAge::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_resetMoonAge, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000030, "Member 'BPL_UIManager_C_MoonAge_resetMoonAge::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_resetMoonAge, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BPL_UIManager_C_MoonAge_resetMoonAge::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_resetMoonAge, CallFunc_BPI_MoonAgeCtrl_outActor) == 0x000048, "Member 'BPL_UIManager_C_MoonAge_resetMoonAge::CallFunc_BPI_MoonAgeCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_resetMoonAge, K2Node_DynamicCast_AsBPI_Moon_Age_Ctrl) == 0x000050, "Member 'BPL_UIManager_C_MoonAge_resetMoonAge::K2Node_DynamicCast_AsBPI_Moon_Age_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_resetMoonAge, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'BPL_UIManager_C_MoonAge_resetMoonAge::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BPL_UIManager.BPL_UIManager_C.MoonAge_addPlayerMoveCount
// 0x0070 (0x0070 - 0x0000)
struct BPL_UIManager_C_MoonAge_addPlayerMoveCount final
{
public:
	float                                         InDeltaSeconds;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39CD[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39CE[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39CF[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_MoonAgeCtrl_outActor;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MoonAgeCtrl_C>    K2Node_DynamicCast_AsBPI_Moon_Age_Ctrl;            // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_UIManager_C_MoonAge_addPlayerMoveCount) == 0x000008, "Wrong alignment on BPL_UIManager_C_MoonAge_addPlayerMoveCount");
static_assert(sizeof(BPL_UIManager_C_MoonAge_addPlayerMoveCount) == 0x000070, "Wrong size on BPL_UIManager_C_MoonAge_addPlayerMoveCount");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addPlayerMoveCount, InDeltaSeconds) == 0x000000, "Member 'BPL_UIManager_C_MoonAge_addPlayerMoveCount::InDeltaSeconds' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addPlayerMoveCount, __WorldContext) == 0x000008, "Member 'BPL_UIManager_C_MoonAge_addPlayerMoveCount::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addPlayerMoveCount, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_UIManager_C_MoonAge_addPlayerMoveCount::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addPlayerMoveCount, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_UIManager_C_MoonAge_addPlayerMoveCount::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addPlayerMoveCount, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_UIManager_C_MoonAge_addPlayerMoveCount::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addPlayerMoveCount, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_UIManager_C_MoonAge_addPlayerMoveCount::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addPlayerMoveCount, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_UIManager_C_MoonAge_addPlayerMoveCount::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addPlayerMoveCount, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_UIManager_C_MoonAge_addPlayerMoveCount::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addPlayerMoveCount, CallFunc_BPI_MoonAgeCtrl_outActor) == 0x000050, "Member 'BPL_UIManager_C_MoonAge_addPlayerMoveCount::CallFunc_BPI_MoonAgeCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addPlayerMoveCount, K2Node_DynamicCast_AsBPI_Moon_Age_Ctrl) == 0x000058, "Member 'BPL_UIManager_C_MoonAge_addPlayerMoveCount::K2Node_DynamicCast_AsBPI_Moon_Age_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addPlayerMoveCount, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_UIManager_C_MoonAge_addPlayerMoveCount::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BPL_UIManager.BPL_UIManager_C.MoonAge_addTokyoLargeMapPlayerMoveCount
// 0x0070 (0x0070 - 0x0000)
struct BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount final
{
public:
	float                                         InDeltaSeconds;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D1[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D2[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_MoonAgeCtrl_outActor;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MoonAgeCtrl_C>    K2Node_DynamicCast_AsBPI_Moon_Age_Ctrl;            // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount) == 0x000008, "Wrong alignment on BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount");
static_assert(sizeof(BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount) == 0x000070, "Wrong size on BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount, InDeltaSeconds) == 0x000000, "Member 'BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount::InDeltaSeconds' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount, __WorldContext) == 0x000008, "Member 'BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount, CallFunc_BPI_MoonAgeCtrl_outActor) == 0x000050, "Member 'BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount::CallFunc_BPI_MoonAgeCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount, K2Node_DynamicCast_AsBPI_Moon_Age_Ctrl) == 0x000058, "Member 'BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount::K2Node_DynamicCast_AsBPI_Moon_Age_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_UIManager_C_MoonAge_addTokyoLargeMapPlayerMoveCount::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BPL_UIManager.BPL_UIManager_C.CategoryWindow_open
// 0x0078 (0x0078 - 0x0000)
struct BPL_UIManager_C_CategoryWindow_open final
{
public:
	E_WIDGET_PRIO                                 WidgetPrio;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CATEGORY_PATTERN                            CategoryPattern;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CATEGORY_FRAMEIN_TYPE                       FrameInPattern;                                    // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D3[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DefaultCursorIdx;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSkipAnim;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D4[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D5[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D6[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_CategoryWindowCtrl_outActor;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CategoryWindowCtrl_C> K2Node_DynamicCast_AsBPI_Category_Window_Ctrl;     // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenCategoryWindow_ReturnVal;             // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_UIManager_C_CategoryWindow_open) == 0x000008, "Wrong alignment on BPL_UIManager_C_CategoryWindow_open");
static_assert(sizeof(BPL_UIManager_C_CategoryWindow_open) == 0x000078, "Wrong size on BPL_UIManager_C_CategoryWindow_open");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_open, WidgetPrio) == 0x000000, "Member 'BPL_UIManager_C_CategoryWindow_open::WidgetPrio' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_open, CategoryPattern) == 0x000001, "Member 'BPL_UIManager_C_CategoryWindow_open::CategoryPattern' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_open, FrameInPattern) == 0x000002, "Member 'BPL_UIManager_C_CategoryWindow_open::FrameInPattern' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_open, DefaultCursorIdx) == 0x000004, "Member 'BPL_UIManager_C_CategoryWindow_open::DefaultCursorIdx' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_open, IsSkipAnim) == 0x000008, "Member 'BPL_UIManager_C_CategoryWindow_open::IsSkipAnim' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_open, __WorldContext) == 0x000010, "Member 'BPL_UIManager_C_CategoryWindow_open::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_open, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'BPL_UIManager_C_CategoryWindow_open::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_open, K2Node_DynamicCast_AsBPI_UIManager) == 0x000020, "Member 'BPL_UIManager_C_CategoryWindow_open::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_open, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPL_UIManager_C_CategoryWindow_open::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_open, CallFunc_BPI_GetUIManager_UIManager) == 0x000038, "Member 'BPL_UIManager_C_CategoryWindow_open::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_open, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000040, "Member 'BPL_UIManager_C_CategoryWindow_open::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_open, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BPL_UIManager_C_CategoryWindow_open::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_open, CallFunc_BPI_CategoryWindowCtrl_outActor) == 0x000058, "Member 'BPL_UIManager_C_CategoryWindow_open::CallFunc_BPI_CategoryWindowCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_open, K2Node_DynamicCast_AsBPI_Category_Window_Ctrl) == 0x000060, "Member 'BPL_UIManager_C_CategoryWindow_open::K2Node_DynamicCast_AsBPI_Category_Window_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_open, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'BPL_UIManager_C_CategoryWindow_open::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_open, CallFunc_OpenCategoryWindow_ReturnVal) == 0x000071, "Member 'BPL_UIManager_C_CategoryWindow_open::CallFunc_OpenCategoryWindow_ReturnVal' has a wrong offset!");

// Function BPL_UIManager.BPL_UIManager_C.CategoryWindow_close
// 0x0078 (0x0078 - 0x0000)
struct BPL_UIManager_C_CategoryWindow_close final
{
public:
	bool                                          IsSkipAnim;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D7[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CommonUI_EventCtrl_C*               CallFunc_GetCommonUI_EventCtrl_outActor;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D8[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D9[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_CategoryWindowCtrl_outActor;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CategoryWindowCtrl_C> K2Node_DynamicCast_AsBPI_Category_Window_Ctrl;     // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CloseCategoryWindow_ReturnVal;            // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_UIManager_C_CategoryWindow_close) == 0x000008, "Wrong alignment on BPL_UIManager_C_CategoryWindow_close");
static_assert(sizeof(BPL_UIManager_C_CategoryWindow_close) == 0x000078, "Wrong size on BPL_UIManager_C_CategoryWindow_close");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_close, IsSkipAnim) == 0x000000, "Member 'BPL_UIManager_C_CategoryWindow_close::IsSkipAnim' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_close, __WorldContext) == 0x000008, "Member 'BPL_UIManager_C_CategoryWindow_close::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_close, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_UIManager_C_CategoryWindow_close::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_close, CallFunc_GetCommonUI_EventCtrl_outActor) == 0x000018, "Member 'BPL_UIManager_C_CategoryWindow_close::CallFunc_GetCommonUI_EventCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_close, K2Node_DynamicCast_AsBPI_UIManager) == 0x000020, "Member 'BPL_UIManager_C_CategoryWindow_close::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_close, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPL_UIManager_C_CategoryWindow_close::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_close, CallFunc_BPI_GetUIManager_UIManager) == 0x000038, "Member 'BPL_UIManager_C_CategoryWindow_close::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_close, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000040, "Member 'BPL_UIManager_C_CategoryWindow_close::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_close, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BPL_UIManager_C_CategoryWindow_close::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_close, CallFunc_BPI_CategoryWindowCtrl_outActor) == 0x000058, "Member 'BPL_UIManager_C_CategoryWindow_close::CallFunc_BPI_CategoryWindowCtrl_outActor' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_close, K2Node_DynamicCast_AsBPI_Category_Window_Ctrl) == 0x000060, "Member 'BPL_UIManager_C_CategoryWindow_close::K2Node_DynamicCast_AsBPI_Category_Window_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_UIManager_C_CategoryWindow_close, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'BPL_UIManager_C_CategoryWindow_close::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
