#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_CameraLag

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPL_CameraLag.BPL_CameraLag_C.AddDebugMenuCameraLag_SP
// 0x0070 (0x0070 - 0x0000)
struct BPL_CameraLag_C_AddDebugMenuCameraLag_SP final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCustomSpringArmComponent*              CallFunc_GetPlayerSpringArm_PlayerSpringArmComponent; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue;    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue_1;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40F7[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1;  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40F8[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array_1;                          // 0x0058(0x0010)(ReferenceParm)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_1; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_CameraLag_C_AddDebugMenuCameraLag_SP) == 0x000008, "Wrong alignment on BPL_CameraLag_C_AddDebugMenuCameraLag_SP");
static_assert(sizeof(BPL_CameraLag_C_AddDebugMenuCameraLag_SP) == 0x000070, "Wrong size on BPL_CameraLag_C_AddDebugMenuCameraLag_SP");
static_assert(offsetof(BPL_CameraLag_C_AddDebugMenuCameraLag_SP, __WorldContext) == 0x000000, "Member 'BPL_CameraLag_C_AddDebugMenuCameraLag_SP::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_CameraLag_C_AddDebugMenuCameraLag_SP, K2Node_MakeArray_Array) == 0x000008, "Member 'BPL_CameraLag_C_AddDebugMenuCameraLag_SP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPL_CameraLag_C_AddDebugMenuCameraLag_SP, CallFunc_DebugMenu_DispName_L10N_Text) == 0x000018, "Member 'BPL_CameraLag_C_AddDebugMenuCameraLag_SP::CallFunc_DebugMenu_DispName_L10N_Text' has a wrong offset!");
static_assert(offsetof(BPL_CameraLag_C_AddDebugMenuCameraLag_SP, CallFunc_GetPlayerSpringArm_PlayerSpringArmComponent) == 0x000028, "Member 'BPL_CameraLag_C_AddDebugMenuCameraLag_SP::CallFunc_GetPlayerSpringArm_PlayerSpringArmComponent' has a wrong offset!");
static_assert(offsetof(BPL_CameraLag_C_AddDebugMenuCameraLag_SP, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x000030, "Member 'BPL_CameraLag_C_AddDebugMenuCameraLag_SP::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_CameraLag_C_AddDebugMenuCameraLag_SP, CallFunc_FTrunc_ReturnValue) == 0x000034, "Member 'BPL_CameraLag_C_AddDebugMenuCameraLag_SP::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_CameraLag_C_AddDebugMenuCameraLag_SP, CallFunc_Conv_BoolToInt_ReturnValue) == 0x000038, "Member 'BPL_CameraLag_C_AddDebugMenuCameraLag_SP::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_CameraLag_C_AddDebugMenuCameraLag_SP, CallFunc_AddDebugMenuItemTypeParam_ReturnValue) == 0x00003C, "Member 'BPL_CameraLag_C_AddDebugMenuCameraLag_SP::CallFunc_AddDebugMenuItemTypeParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_CameraLag_C_AddDebugMenuCameraLag_SP, CallFunc_AddDebugMenuItemTypePullDown_ReturnValue) == 0x000040, "Member 'BPL_CameraLag_C_AddDebugMenuCameraLag_SP::CallFunc_AddDebugMenuItemTypePullDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_CameraLag_C_AddDebugMenuCameraLag_SP, CallFunc_Conv_BoolToInt_ReturnValue_1) == 0x000044, "Member 'BPL_CameraLag_C_AddDebugMenuCameraLag_SP::CallFunc_Conv_BoolToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_CameraLag_C_AddDebugMenuCameraLag_SP, CallFunc_FTrunc_ReturnValue_1) == 0x000048, "Member 'BPL_CameraLag_C_AddDebugMenuCameraLag_SP::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_CameraLag_C_AddDebugMenuCameraLag_SP, CallFunc_IsValid_ReturnValue) == 0x00004C, "Member 'BPL_CameraLag_C_AddDebugMenuCameraLag_SP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_CameraLag_C_AddDebugMenuCameraLag_SP, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1) == 0x000050, "Member 'BPL_CameraLag_C_AddDebugMenuCameraLag_SP::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_CameraLag_C_AddDebugMenuCameraLag_SP, K2Node_MakeArray_Array_1) == 0x000058, "Member 'BPL_CameraLag_C_AddDebugMenuCameraLag_SP::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPL_CameraLag_C_AddDebugMenuCameraLag_SP, CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_1) == 0x000068, "Member 'BPL_CameraLag_C_AddDebugMenuCameraLag_SP::CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_1' has a wrong offset!");

}

