#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_Riberama

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPL_Riberama.BPL_Riberama_C.BPL_BeginRiberama
// 0x0008 (0x0008 - 0x0000)
struct BPL_Riberama_C_BPL_BeginRiberama final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_Riberama_C_BPL_BeginRiberama) == 0x000008, "Wrong alignment on BPL_Riberama_C_BPL_BeginRiberama");
static_assert(sizeof(BPL_Riberama_C_BPL_BeginRiberama) == 0x000008, "Wrong size on BPL_Riberama_C_BPL_BeginRiberama");
static_assert(offsetof(BPL_Riberama_C_BPL_BeginRiberama, __WorldContext) == 0x000000, "Member 'BPL_Riberama_C_BPL_BeginRiberama::__WorldContext' has a wrong offset!");

// Function BPL_Riberama.BPL_Riberama_C.BPL_EndRiberama
// 0x0008 (0x0008 - 0x0000)
struct BPL_Riberama_C_BPL_EndRiberama final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_Riberama_C_BPL_EndRiberama) == 0x000008, "Wrong alignment on BPL_Riberama_C_BPL_EndRiberama");
static_assert(sizeof(BPL_Riberama_C_BPL_EndRiberama) == 0x000008, "Wrong size on BPL_Riberama_C_BPL_EndRiberama");
static_assert(offsetof(BPL_Riberama_C_BPL_EndRiberama, __WorldContext) == 0x000000, "Member 'BPL_Riberama_C_BPL_EndRiberama::__WorldContext' has a wrong offset!");

// Function BPL_Riberama.BPL_Riberama_C.BPL_BeginRiberamaEffect
// 0x0030 (0x0030 - 0x0000)
struct BPL_Riberama_C_BPL_BeginRiberamaEffect final
{
public:
	bool                                          PlaySE;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D59[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Pla603_C>         K2Node_DynamicCast_AsBPI_Pla_603;                  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_Riberama_C_BPL_BeginRiberamaEffect) == 0x000008, "Wrong alignment on BPL_Riberama_C_BPL_BeginRiberamaEffect");
static_assert(sizeof(BPL_Riberama_C_BPL_BeginRiberamaEffect) == 0x000030, "Wrong size on BPL_Riberama_C_BPL_BeginRiberamaEffect");
static_assert(offsetof(BPL_Riberama_C_BPL_BeginRiberamaEffect, PlaySE) == 0x000000, "Member 'BPL_Riberama_C_BPL_BeginRiberamaEffect::PlaySE' has a wrong offset!");
static_assert(offsetof(BPL_Riberama_C_BPL_BeginRiberamaEffect, __WorldContext) == 0x000008, "Member 'BPL_Riberama_C_BPL_BeginRiberamaEffect::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_Riberama_C_BPL_BeginRiberamaEffect, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'BPL_Riberama_C_BPL_BeginRiberamaEffect::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Riberama_C_BPL_BeginRiberamaEffect, K2Node_DynamicCast_AsBPI_Pla_603) == 0x000018, "Member 'BPL_Riberama_C_BPL_BeginRiberamaEffect::K2Node_DynamicCast_AsBPI_Pla_603' has a wrong offset!");
static_assert(offsetof(BPL_Riberama_C_BPL_BeginRiberamaEffect, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_Riberama_C_BPL_BeginRiberamaEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BPL_Riberama.BPL_Riberama_C.BPL_EndRiberamaEffect
// 0x0030 (0x0030 - 0x0000)
struct BPL_Riberama_C_BPL_EndRiberamaEffect final
{
public:
	bool                                          PlaySE;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D5A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Pla603_C>         K2Node_DynamicCast_AsBPI_Pla_603;                  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_Riberama_C_BPL_EndRiberamaEffect) == 0x000008, "Wrong alignment on BPL_Riberama_C_BPL_EndRiberamaEffect");
static_assert(sizeof(BPL_Riberama_C_BPL_EndRiberamaEffect) == 0x000030, "Wrong size on BPL_Riberama_C_BPL_EndRiberamaEffect");
static_assert(offsetof(BPL_Riberama_C_BPL_EndRiberamaEffect, PlaySE) == 0x000000, "Member 'BPL_Riberama_C_BPL_EndRiberamaEffect::PlaySE' has a wrong offset!");
static_assert(offsetof(BPL_Riberama_C_BPL_EndRiberamaEffect, __WorldContext) == 0x000008, "Member 'BPL_Riberama_C_BPL_EndRiberamaEffect::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_Riberama_C_BPL_EndRiberamaEffect, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'BPL_Riberama_C_BPL_EndRiberamaEffect::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Riberama_C_BPL_EndRiberamaEffect, K2Node_DynamicCast_AsBPI_Pla_603) == 0x000018, "Member 'BPL_Riberama_C_BPL_EndRiberamaEffect::K2Node_DynamicCast_AsBPI_Pla_603' has a wrong offset!");
static_assert(offsetof(BPL_Riberama_C_BPL_EndRiberamaEffect, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_Riberama_C_BPL_EndRiberamaEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

