#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_UniteDebug

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPL_UniteDebug.BPL_UniteDebug_C.AddDebugMenuUnite
// 0x0070 (0x0070 - 0x0000)
struct BPL_UniteDebug_C_AddDebugMenuUnite final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue;    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4048[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1;  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2;  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3;  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4;  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_5;  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_3; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_6;  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_4; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_5; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_6; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_7; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_8; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_9; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_10; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_UniteDebug_C_AddDebugMenuUnite) == 0x000008, "Wrong alignment on BPL_UniteDebug_C_AddDebugMenuUnite");
static_assert(sizeof(BPL_UniteDebug_C_AddDebugMenuUnite) == 0x000070, "Wrong size on BPL_UniteDebug_C_AddDebugMenuUnite");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, __WorldContext) == 0x000000, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, CallFunc_AddDebugMenuItemTypeParam_ReturnValue) == 0x000008, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::CallFunc_AddDebugMenuItemTypeParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, CallFunc_DebugMenu_DispName_L10N_Text) == 0x000010, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::CallFunc_DebugMenu_DispName_L10N_Text' has a wrong offset!");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1) == 0x000020, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x000024, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2) == 0x000028, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue) == 0x00002C, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3) == 0x000030, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4) == 0x000034, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_5) == 0x000038, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1) == 0x00003C, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2) == 0x000040, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_3) == 0x000044, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_6) == 0x000048, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1) == 0x00004C, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_4) == 0x000050, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_5) == 0x000054, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_6) == 0x000058, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_7) == 0x00005C, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_8) == 0x000060, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_9) == 0x000064, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_10) == 0x000068, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPL_UniteDebug_C_AddDebugMenuUnite, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2) == 0x00006C, "Member 'BPL_UniteDebug_C_AddDebugMenuUnite::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2' has a wrong offset!");

}

