#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_MapLevelCtrl

#include "Basic.hpp"

#include "E_MAP_SYSTEMRESIDENT_ID_structs.hpp"
#include "MapSubLevelGarden_ST_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MapSubLevelTable_ST_structs.hpp"
#include "MapUnResident_ST_structs.hpp"
#include "MapSubLevelMinimap_ST_structs.hpp"
#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BPL_MapLevelCtrl.BPL_MapLevelCtrl_C.GetResidentLevel
// 0x05E0 (0x05E0 - 0x0000)
struct BPL_MapLevelCtrl_C_GetResidentLevel final
{
public:
	int32                                         MapId;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A98[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPrimaryAssetId>                ResidentLevel;                                     // 0x0010(0x0010)(Parm, OutParm)
	int32                                         L_index;                                           // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_area_id;                                         // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_map_id;                                          // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A99[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9A[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9B[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9C[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_1;       // 0x0058(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMapSubLevelTable_ST                   CallFunc_GetDataTableRowFromName_OutRow;           // 0x0078(0x02A8)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9D[0x7];                                     // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMapSubLevelTable_ST                   CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0328(0x02A8)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9E[0x3];                                     // 0x05D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x05D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x05DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_MapLevelCtrl_C_GetResidentLevel) == 0x000008, "Wrong alignment on BPL_MapLevelCtrl_C_GetResidentLevel");
static_assert(sizeof(BPL_MapLevelCtrl_C_GetResidentLevel) == 0x0005E0, "Wrong size on BPL_MapLevelCtrl_C_GetResidentLevel");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, MapId) == 0x000000, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::MapId' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, __WorldContext) == 0x000008, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, ResidentLevel) == 0x000010, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::ResidentLevel' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, L_index) == 0x000020, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::L_index' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, L_area_id) == 0x000024, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::L_area_id' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, L_map_id) == 0x000028, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::L_map_id' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, Temp_bool_True_if_break_was_hit_Variable) == 0x00002C, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, CallFunc_Not_PreBool_ReturnValue) == 0x000034, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000040, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, CallFunc_GetDataTableRowNames_OutRowNames_1) == 0x000058, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::CallFunc_GetDataTableRowNames_OutRowNames_1' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, CallFunc_Array_Get_Item) == 0x000068, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, CallFunc_GetDataTableRowFromName_OutRow) == 0x000078, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000320, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000328, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0005D0, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, CallFunc_Array_Length_ReturnValue) == 0x0005D4, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, CallFunc_Less_IntInt_ReturnValue) == 0x0005D8, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0005D9, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetResidentLevel, CallFunc_BooleanAND_ReturnValue) == 0x0005DA, "Member 'BPL_MapLevelCtrl_C_GetResidentLevel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BPL_MapLevelCtrl.BPL_MapLevelCtrl_C.GetAreaResidentLevel
// 0x05F0 (0x05F0 - 0x0000)
struct BPL_MapLevelCtrl_C_GetAreaResidentLevel final
{
public:
	int32                                         MapId;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AreaId;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPrimaryAssetId>                AreaResidentLevel;                                 // 0x0010(0x0010)(Parm, OutParm)
	int32                                         L_index;                                           // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_area_id;                                         // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_map_id;                                          // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9F[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AA0[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AA1[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0048(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_1;       // 0x0058(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMapSubLevelTable_ST                   CallFunc_GetDataTableRowFromName_OutRow;           // 0x0078(0x02A8)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AA2[0x7];                                     // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMapSubLevelTable_ST                   CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0328(0x02A8)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AA3[0x3];                                     // 0x05D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x05D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x05DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AA4[0x5];                                     // 0x05DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPrimaryAssetId>                K2Node_Select_Default;                             // 0x05E0(0x0010)(ReferenceParm)
};
static_assert(alignof(BPL_MapLevelCtrl_C_GetAreaResidentLevel) == 0x000008, "Wrong alignment on BPL_MapLevelCtrl_C_GetAreaResidentLevel");
static_assert(sizeof(BPL_MapLevelCtrl_C_GetAreaResidentLevel) == 0x0005F0, "Wrong size on BPL_MapLevelCtrl_C_GetAreaResidentLevel");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, MapId) == 0x000000, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::MapId' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, AreaId) == 0x000004, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::AreaId' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, __WorldContext) == 0x000008, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, AreaResidentLevel) == 0x000010, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::AreaResidentLevel' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, L_index) == 0x000020, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::L_index' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, L_area_id) == 0x000024, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::L_area_id' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, L_map_id) == 0x000028, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::L_map_id' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, Temp_bool_True_if_break_was_hit_Variable) == 0x00002C, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, CallFunc_Not_PreBool_ReturnValue) == 0x000034, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, Temp_int_Variable) == 0x00003C, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000048, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, CallFunc_GetDataTableRowNames_OutRowNames_1) == 0x000058, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::CallFunc_GetDataTableRowNames_OutRowNames_1' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, CallFunc_Array_Get_Item) == 0x000068, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, CallFunc_GetDataTableRowFromName_OutRow) == 0x000078, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000320, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000328, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0005D0, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, CallFunc_Array_Length_ReturnValue) == 0x0005D4, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, CallFunc_Less_IntInt_ReturnValue) == 0x0005D8, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0005D9, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, CallFunc_BooleanAND_ReturnValue) == 0x0005DA, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetAreaResidentLevel, K2Node_Select_Default) == 0x0005E0, "Member 'BPL_MapLevelCtrl_C_GetAreaResidentLevel::K2Node_Select_Default' has a wrong offset!");

// Function BPL_MapLevelCtrl.BPL_MapLevelCtrl_C.GetUnresidentLevel
// 0x0698 (0x0698 - 0x0000)
struct BPL_MapLevelCtrl_C_GetUnresidentLevel final
{
public:
	int32                                         MapId;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AreaId;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPrimaryAssetId>                UnResidentLevel;                                   // 0x0010(0x0010)(Parm, OutParm)
	TArray<struct FPrimaryAssetId>                UnLoadList;                                        // 0x0020(0x0010)(Parm, OutParm)
	int32                                         L_area_id;                                         // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AA5[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPrimaryAssetId>                L_Unprimelist;                                     // 0x0038(0x0010)(Edit, BlueprintVisible)
	TArray<struct FPrimaryAssetId>                L_primelist;                                       // 0x0048(0x0010)(Edit, BlueprintVisible)
	int32                                         L_index;                                           // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_map_id;                                          // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AA6[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AA7[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryAssetId                        CallFunc_Array_Get_Item;                           // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AA8[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AA9[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x00C8(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_1;       // 0x00D8(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AAA[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMapSubLevelTable_ST                   CallFunc_GetDataTableRowFromName_OutRow;           // 0x00F8(0x02A8)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AAB[0x1];                                     // 0x03A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMapSubLevelTable_ST                   CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x03B0(0x02A8)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0659(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AAC[0x2];                                     // 0x065A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x065C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMapUnResident_ST                      CallFunc_Array_Get_Item_3;                         // 0x0660(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x068C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x068D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x068E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x068F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MapFlagCh_OK;                             // 0x0691(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0692(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0693(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_MapLevelCtrl_C_GetUnresidentLevel) == 0x000008, "Wrong alignment on BPL_MapLevelCtrl_C_GetUnresidentLevel");
static_assert(sizeof(BPL_MapLevelCtrl_C_GetUnresidentLevel) == 0x000698, "Wrong size on BPL_MapLevelCtrl_C_GetUnresidentLevel");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, MapId) == 0x000000, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::MapId' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, AreaId) == 0x000004, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::AreaId' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, __WorldContext) == 0x000008, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, UnResidentLevel) == 0x000010, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::UnResidentLevel' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, UnLoadList) == 0x000020, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::UnLoadList' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, L_area_id) == 0x000030, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::L_area_id' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, L_Unprimelist) == 0x000038, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::L_Unprimelist' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, L_primelist) == 0x000048, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::L_primelist' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, L_index) == 0x000058, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::L_index' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, L_map_id) == 0x00005C, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::L_map_id' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, Temp_int_Array_Index_Variable) == 0x000060, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, Temp_int_Array_Index_Variable_1) == 0x00006C, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, Temp_int_Loop_Counter_Variable_1) == 0x000070, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_Add_IntInt_ReturnValue_1) == 0x000074, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, Temp_bool_True_if_break_was_hit_Variable) == 0x000078, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, Temp_int_Array_Index_Variable_2) == 0x00007C, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_Not_PreBool_ReturnValue) == 0x000080, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_Array_Get_Item) == 0x000084, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_Array_RemoveItem_ReturnValue) == 0x000098, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_Conv_NameToString_ReturnValue) == 0x0000A0, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_Concat_StrStr_ReturnValue) == 0x0000B0, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000C0, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_GetDataTableRowNames_OutRowNames) == 0x0000C8, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_GetDataTableRowNames_OutRowNames_1) == 0x0000D8, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_GetDataTableRowNames_OutRowNames_1' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_Array_Get_Item_1) == 0x0000E8, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_Array_Length_ReturnValue_1) == 0x0000F0, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000F8, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0003A0, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_Less_IntInt_ReturnValue) == 0x0003A1, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_BooleanAND_ReturnValue) == 0x0003A2, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, Temp_int_Loop_Counter_Variable_2) == 0x0003A4, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_Array_Get_Item_2) == 0x0003A8, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0003B0, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000658, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_Less_IntInt_ReturnValue_1) == 0x000659, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_Add_IntInt_ReturnValue_2) == 0x00065C, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_Array_Get_Item_3) == 0x000660, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_Array_Length_ReturnValue_2) == 0x000688, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00068C, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_Less_IntInt_ReturnValue_2) == 0x00068D, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00068E, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_BooleanOR_ReturnValue) == 0x00068F, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_BooleanOR_ReturnValue_1) == 0x000690, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_MapFlagCh_OK) == 0x000691, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_MapFlagCh_OK' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_BooleanAND_ReturnValue_1) == 0x000692, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetUnresidentLevel, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000693, "Member 'BPL_MapLevelCtrl_C_GetUnresidentLevel::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");

// Function BPL_MapLevelCtrl.BPL_MapLevelCtrl_C.GetSystemLevel
// 0x08B0 (0x08B0 - 0x0000)
struct BPL_MapLevelCtrl_C_GetSystemLevel final
{
public:
	int32                                         MapId;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MAP_SYSTEMRESIDENT_ID                       Type;                                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StreamOnly;                                        // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AAD[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPrimaryAssetId>                ResidentLevel;                                     // 0x0010(0x0010)(Parm, OutParm)
	int32                                         L_AreaIdEnv;                                       // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          L_stream_only;                                     // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AAE[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPrimaryAssetId>                LocalList;                                         // 0x0028(0x0010)(Edit, BlueprintVisible)
	int32                                         L_index;                                           // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MAP_SYSTEMRESIDENT_ID                       L_type;                                            // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AAF[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         L_map_id;                                          // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AB0[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameMode_C>       K2Node_DynamicCast_AsBPI_Game_Mode;                // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInGardenLevel_IsInGardenLevel;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AB1[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAreaIdEnv_AreaIdEnv;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAgratEnvLevel_Enable;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AB2[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPrimaryAssetId>                CallFunc_GetAgratEnvLevel_EnvLevels;               // 0x0070(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AB3[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPrimaryAssetId>                CallFunc_GetUnresidentLevel_UnResidentLevel;       // 0x0088(0x0010)(ReferenceParm)
	TArray<struct FPrimaryAssetId>                CallFunc_GetUnresidentLevel_UnLoadList;            // 0x0098(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AB4[0x1];                                     // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLastRyuketsuTableIndex_ReturnValue;    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRyuketsuData                          CallFunc_GetRyuketsuData_ReturnValue;              // 0x00B0(0x003C)(ConstParm, NoDestructor)
	struct FPrimaryAssetId                        K2Node_MakeStruct_PrimaryAssetId;                  // 0x00EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AB5[0x1];                                     // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_MAP_SYSTEMRESIDENT_ID                       Temp_byte_Variable;                                // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AB6[0x1];                                     // 0x010B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AB7[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0118(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AB8[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_1;       // 0x0130(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AB9[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMapSubLevelTable_ST                   CallFunc_GetDataTableRowFromName_OutRow;           // 0x0150(0x02A8)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x03FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ABA[0x1];                                     // 0x03FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x03FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x0404(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ABB[0x3];                                     // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMapSubLevelTable_ST                   CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0408(0x02A8)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x06B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ABC[0x2];                                     // 0x06B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryAssetId                        CallFunc_Array_Get_Item_2;                         // 0x06B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        CallFunc_Array_Get_Item_3;                         // 0x06CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x06DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ABD[0x3];                                     // 0x06DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x06E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x06E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        CallFunc_Array_Get_Item_4;                         // 0x06E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ABE[0x3];                                     // 0x06F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x06FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0700(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0704(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_2;            // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ABF[0x3];                                     // 0x0709(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryAssetId                        K2Node_Select_Default;                             // 0x070C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC0[0x4];                                     // 0x071C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPrimaryAssetId>                K2Node_MakeArray_Array;                            // 0x0720(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable_1;                              // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AC1[0xF];                                     // 0x0731(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMapSubLevelGarden_ST                  K2Node_Select_Default_1;                           // 0x0740(0x00B0)(HasGetValueTypeHash)
	struct FMapSubLevelGarden_ST                  K2Node_Select_Default_2;                           // 0x07F0(0x00B0)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x08A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x08A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_MapLevelCtrl_C_GetSystemLevel) == 0x000010, "Wrong alignment on BPL_MapLevelCtrl_C_GetSystemLevel");
static_assert(sizeof(BPL_MapLevelCtrl_C_GetSystemLevel) == 0x0008B0, "Wrong size on BPL_MapLevelCtrl_C_GetSystemLevel");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetSystemLevel, MapId) == 0x000000, "Member 'BPL_MapLevelCtrl_C_GetSystemLevel::MapId' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetSystemLevel, Type) == 0x000004, "Member 'BPL_MapLevelCtrl_C_GetSystemLevel::Type' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetSystemLevel, StreamOnly) == 0x000005, "Member 'BPL_MapLevelCtrl_C_GetSystemLevel::StreamOnly' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetSystemLevel, __WorldContext) == 0x000008, "Member 'BPL_MapLevelCtrl_C_GetSystemLevel::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetSystemLevel, ResidentLevel) == 0x000010, "Member 'BPL_MapLevelCtrl_C_GetSystemLevel::ResidentLevel' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetSystemLevel, L_AreaIdEnv) == 0x000020, "Member 'BPL_MapLevelCtrl_C_GetSystemLevel::L_AreaIdEnv' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetSystemLevel, L_stream_only) == 0x000024, "Member 'BPL_MapLevelCtrl_C_GetSystemLevel::L_stream_only' has a wrong offset!");
static_assert(offsetof(BPL_MapLevelCtrl_C_GetSystemLevel, LocalList) == 0x000028, "Member 'BPL_MapLevelCtrl_C_GetSystemLevel::LocalList' has a wrong offset!");
