#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_Shop

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BPL_Shop.BPL_Shop_C.CheckShopBuyData
// 0x0030 (0x0030 - 0x0000)
struct BPL_Shop_C_CheckShopBuyData final
{
public:
	struct FShopBuyTable                          BuyTable;                                          // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	uint8                                         Pad_7F5F[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOpen;                                             // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bNew;                                              // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckShopBuyFlag_bOK;                     // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckShopNewItemFlag_ReturnValue;         // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ItemIDIsValid_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_Shop_C_CheckShopBuyData) == 0x000008, "Wrong alignment on BPL_Shop_C_CheckShopBuyData");
static_assert(sizeof(BPL_Shop_C_CheckShopBuyData) == 0x000030, "Wrong size on BPL_Shop_C_CheckShopBuyData");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyData, BuyTable) == 0x000000, "Member 'BPL_Shop_C_CheckShopBuyData::BuyTable' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyData, __WorldContext) == 0x000018, "Member 'BPL_Shop_C_CheckShopBuyData::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyData, bOpen) == 0x000020, "Member 'BPL_Shop_C_CheckShopBuyData::bOpen' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyData, bNew) == 0x000021, "Member 'BPL_Shop_C_CheckShopBuyData::bNew' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyData, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000022, "Member 'BPL_Shop_C_CheckShopBuyData::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyData, CallFunc_CheckShopBuyFlag_bOK) == 0x000023, "Member 'BPL_Shop_C_CheckShopBuyData::CallFunc_CheckShopBuyFlag_bOK' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyData, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000024, "Member 'BPL_Shop_C_CheckShopBuyData::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyData, CallFunc_BooleanOR_ReturnValue) == 0x000025, "Member 'BPL_Shop_C_CheckShopBuyData::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyData, CallFunc_CheckShopNewItemFlag_ReturnValue) == 0x000026, "Member 'BPL_Shop_C_CheckShopBuyData::CallFunc_CheckShopNewItemFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyData, CallFunc_Not_PreBool_ReturnValue) == 0x000027, "Member 'BPL_Shop_C_CheckShopBuyData::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyData, CallFunc_ItemIDIsValid_ReturnValue) == 0x000028, "Member 'BPL_Shop_C_CheckShopBuyData::CallFunc_ItemIDIsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyData, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'BPL_Shop_C_CheckShopBuyData::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BPL_Shop.BPL_Shop_C.CheckShopBuyFlag
// 0x0028 (0x0028 - 0x0000)
struct BPL_Shop_C_CheckShopBuyFlag final
{
public:
	int32                                         StartFlag1;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StartFlag2;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EndFlag;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F60[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOK;                                               // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlagValue_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlagValue_ReturnValue_1;        // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlagValue_ReturnValue_2;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_Shop_C_CheckShopBuyFlag) == 0x000008, "Wrong alignment on BPL_Shop_C_CheckShopBuyFlag");
static_assert(sizeof(BPL_Shop_C_CheckShopBuyFlag) == 0x000028, "Wrong size on BPL_Shop_C_CheckShopBuyFlag");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyFlag, StartFlag1) == 0x000000, "Member 'BPL_Shop_C_CheckShopBuyFlag::StartFlag1' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyFlag, StartFlag2) == 0x000004, "Member 'BPL_Shop_C_CheckShopBuyFlag::StartFlag2' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyFlag, EndFlag) == 0x000008, "Member 'BPL_Shop_C_CheckShopBuyFlag::EndFlag' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyFlag, __WorldContext) == 0x000010, "Member 'BPL_Shop_C_CheckShopBuyFlag::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyFlag, bOK) == 0x000018, "Member 'BPL_Shop_C_CheckShopBuyFlag::bOK' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyFlag, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000019, "Member 'BPL_Shop_C_CheckShopBuyFlag::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyFlag, CallFunc_CheckEventFlagValue_ReturnValue) == 0x00001A, "Member 'BPL_Shop_C_CheckShopBuyFlag::CallFunc_CheckEventFlagValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyFlag, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00001B, "Member 'BPL_Shop_C_CheckShopBuyFlag::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyFlag, CallFunc_Not_PreBool_ReturnValue) == 0x00001C, "Member 'BPL_Shop_C_CheckShopBuyFlag::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyFlag, CallFunc_BooleanAND_ReturnValue) == 0x00001D, "Member 'BPL_Shop_C_CheckShopBuyFlag::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyFlag, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00001E, "Member 'BPL_Shop_C_CheckShopBuyFlag::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyFlag, CallFunc_CheckEventFlagValue_ReturnValue_1) == 0x00001F, "Member 'BPL_Shop_C_CheckShopBuyFlag::CallFunc_CheckEventFlagValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyFlag, CallFunc_CheckEventFlagValue_ReturnValue_2) == 0x000020, "Member 'BPL_Shop_C_CheckShopBuyFlag::CallFunc_CheckEventFlagValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_CheckShopBuyFlag, CallFunc_BooleanOR_ReturnValue) == 0x000021, "Member 'BPL_Shop_C_CheckShopBuyFlag::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BPL_Shop.BPL_Shop_C.IsShopNewItem
// 0x0058 (0x0058 - 0x0000)
struct BPL_Shop_C_IsShopNewItem final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNewItem;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bRet;                                              // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F61[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShopBuyTable                          BuyData;                                           // 0x000C(0x0014)(Edit, BlueprintVisible, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F62[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetShopBuyTableMax_ReturnValue;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F63[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FShopBuyTable                          CallFunc_GetShopBuyTable_ReturnValue;              // 0x0034(0x0014)(ConstParm, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckShopBuyData_bOpen;                   // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckShopBuyData_bNew;                    // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_Shop_C_IsShopNewItem) == 0x000008, "Wrong alignment on BPL_Shop_C_IsShopNewItem");
static_assert(sizeof(BPL_Shop_C_IsShopNewItem) == 0x000058, "Wrong size on BPL_Shop_C_IsShopNewItem");
static_assert(offsetof(BPL_Shop_C_IsShopNewItem, __WorldContext) == 0x000000, "Member 'BPL_Shop_C_IsShopNewItem::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_IsShopNewItem, bNewItem) == 0x000008, "Member 'BPL_Shop_C_IsShopNewItem::bNewItem' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_IsShopNewItem, bRet) == 0x000009, "Member 'BPL_Shop_C_IsShopNewItem::bRet' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_IsShopNewItem, BuyData) == 0x00000C, "Member 'BPL_Shop_C_IsShopNewItem::BuyData' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_IsShopNewItem, Temp_bool_Variable) == 0x000020, "Member 'BPL_Shop_C_IsShopNewItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_IsShopNewItem, CallFunc_GetShopBuyTableMax_ReturnValue) == 0x000024, "Member 'BPL_Shop_C_IsShopNewItem::CallFunc_GetShopBuyTableMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_IsShopNewItem, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'BPL_Shop_C_IsShopNewItem::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_IsShopNewItem, CallFunc_Not_PreBool_ReturnValue) == 0x00002C, "Member 'BPL_Shop_C_IsShopNewItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_IsShopNewItem, Temp_int_Variable) == 0x000030, "Member 'BPL_Shop_C_IsShopNewItem::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_IsShopNewItem, CallFunc_GetShopBuyTable_ReturnValue) == 0x000034, "Member 'BPL_Shop_C_IsShopNewItem::CallFunc_GetShopBuyTable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_IsShopNewItem, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'BPL_Shop_C_IsShopNewItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_IsShopNewItem, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00004C, "Member 'BPL_Shop_C_IsShopNewItem::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_IsShopNewItem, CallFunc_BooleanAND_ReturnValue) == 0x00004D, "Member 'BPL_Shop_C_IsShopNewItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_IsShopNewItem, CallFunc_CheckShopBuyData_bOpen) == 0x00004E, "Member 'BPL_Shop_C_IsShopNewItem::CallFunc_CheckShopBuyData_bOpen' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_IsShopNewItem, CallFunc_CheckShopBuyData_bNew) == 0x00004F, "Member 'BPL_Shop_C_IsShopNewItem::CallFunc_CheckShopBuyData_bNew' has a wrong offset!");
static_assert(offsetof(BPL_Shop_C_IsShopNewItem, CallFunc_BooleanAND_ReturnValue_1) == 0x000050, "Member 'BPL_Shop_C_IsShopNewItem::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

}

