#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_DebugMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPL_DebugMenu.BPL_DebugMenu_C.DebugMenu_DispName_L10N
// 0x0060 (0x0060 - 0x0000)
struct BPL_DebugMenu_C_DebugMenu_DispName_L10N final
{
public:
	class FString                                 JP;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EN;                                                // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Text;                                              // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentLanguage_ReturnValue;           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IS_EDITOR_BUILD_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27C7[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_DebugMenu_C_DebugMenu_DispName_L10N) == 0x000008, "Wrong alignment on BPL_DebugMenu_C_DebugMenu_DispName_L10N");
static_assert(sizeof(BPL_DebugMenu_C_DebugMenu_DispName_L10N) == 0x000060, "Wrong size on BPL_DebugMenu_C_DebugMenu_DispName_L10N");
static_assert(offsetof(BPL_DebugMenu_C_DebugMenu_DispName_L10N, JP) == 0x000000, "Member 'BPL_DebugMenu_C_DebugMenu_DispName_L10N::JP' has a wrong offset!");
static_assert(offsetof(BPL_DebugMenu_C_DebugMenu_DispName_L10N, EN) == 0x000010, "Member 'BPL_DebugMenu_C_DebugMenu_DispName_L10N::EN' has a wrong offset!");
static_assert(offsetof(BPL_DebugMenu_C_DebugMenu_DispName_L10N, __WorldContext) == 0x000020, "Member 'BPL_DebugMenu_C_DebugMenu_DispName_L10N::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_DebugMenu_C_DebugMenu_DispName_L10N, Text) == 0x000028, "Member 'BPL_DebugMenu_C_DebugMenu_DispName_L10N::Text' has a wrong offset!");
static_assert(offsetof(BPL_DebugMenu_C_DebugMenu_DispName_L10N, CallFunc_GetCurrentLanguage_ReturnValue) == 0x000038, "Member 'BPL_DebugMenu_C_DebugMenu_DispName_L10N::CallFunc_GetCurrentLanguage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_DebugMenu_C_DebugMenu_DispName_L10N, CallFunc_IS_EDITOR_BUILD_ReturnValue) == 0x000048, "Member 'BPL_DebugMenu_C_DebugMenu_DispName_L10N::CallFunc_IS_EDITOR_BUILD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_DebugMenu_C_DebugMenu_DispName_L10N, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000049, "Member 'BPL_DebugMenu_C_DebugMenu_DispName_L10N::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_DebugMenu_C_DebugMenu_DispName_L10N, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x00004A, "Member 'BPL_DebugMenu_C_DebugMenu_DispName_L10N::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_DebugMenu_C_DebugMenu_DispName_L10N, CallFunc_BooleanOR_ReturnValue) == 0x00004B, "Member 'BPL_DebugMenu_C_DebugMenu_DispName_L10N::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_DebugMenu_C_DebugMenu_DispName_L10N, CallFunc_BooleanOR_ReturnValue_1) == 0x00004C, "Member 'BPL_DebugMenu_C_DebugMenu_DispName_L10N::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_DebugMenu_C_DebugMenu_DispName_L10N, CallFunc_SelectString_ReturnValue) == 0x000050, "Member 'BPL_DebugMenu_C_DebugMenu_DispName_L10N::CallFunc_SelectString_ReturnValue' has a wrong offset!");

// Function BPL_DebugMenu.BPL_DebugMenu_C.GetBPIDebugMenuUI
// 0x0060 (0x0060 - 0x0000)
struct BPL_DebugMenu_C_GetBPIDebugMenuUI final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_DebugMenuUI_C>    RetValue;                                          // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         Lo_List;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0028(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_DebugMenuUI_C>    K2Node_DynamicCast_AsBPI_Debug_Menu_UI;            // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27C8[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_DebugMenu_C_GetBPIDebugMenuUI) == 0x000008, "Wrong alignment on BPL_DebugMenu_C_GetBPIDebugMenuUI");
static_assert(sizeof(BPL_DebugMenu_C_GetBPIDebugMenuUI) == 0x000060, "Wrong size on BPL_DebugMenu_C_GetBPIDebugMenuUI");
static_assert(offsetof(BPL_DebugMenu_C_GetBPIDebugMenuUI, __WorldContext) == 0x000000, "Member 'BPL_DebugMenu_C_GetBPIDebugMenuUI::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_DebugMenu_C_GetBPIDebugMenuUI, RetValue) == 0x000008, "Member 'BPL_DebugMenu_C_GetBPIDebugMenuUI::RetValue' has a wrong offset!");
static_assert(offsetof(BPL_DebugMenu_C_GetBPIDebugMenuUI, Lo_List) == 0x000018, "Member 'BPL_DebugMenu_C_GetBPIDebugMenuUI::Lo_List' has a wrong offset!");
static_assert(offsetof(BPL_DebugMenu_C_GetBPIDebugMenuUI, CallFunc_GetAllActorsWithInterface_OutActors) == 0x000028, "Member 'BPL_DebugMenu_C_GetBPIDebugMenuUI::CallFunc_GetAllActorsWithInterface_OutActors' has a wrong offset!");
static_assert(offsetof(BPL_DebugMenu_C_GetBPIDebugMenuUI, CallFunc_Array_Get_Item) == 0x000038, "Member 'BPL_DebugMenu_C_GetBPIDebugMenuUI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPL_DebugMenu_C_GetBPIDebugMenuUI, K2Node_DynamicCast_AsBPI_Debug_Menu_UI) == 0x000040, "Member 'BPL_DebugMenu_C_GetBPIDebugMenuUI::K2Node_DynamicCast_AsBPI_Debug_Menu_UI' has a wrong offset!");
static_assert(offsetof(BPL_DebugMenu_C_GetBPIDebugMenuUI, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BPL_DebugMenu_C_GetBPIDebugMenuUI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_DebugMenu_C_GetBPIDebugMenuUI, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'BPL_DebugMenu_C_GetBPIDebugMenuUI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_DebugMenu_C_GetBPIDebugMenuUI, CallFunc_Greater_IntInt_ReturnValue) == 0x000058, "Member 'BPL_DebugMenu_C_GetBPIDebugMenuUI::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

