#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_ConsoleCommand

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "PlayerCameraInitParam_structs.hpp"


namespace SDK::Params
{

// Function BPL_ConsoleCommand.BPL_ConsoleCommand_C.AddDebugMenuConsoleCommand
// 0x01C0 (0x01C0 - 0x0000)
struct BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_557B[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_1;           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_557C[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_2;           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_3;           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_4;           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_4; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_3; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_5; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_6; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue;    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_7; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_8; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1;  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2;  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue;  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_557D[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3;  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4;  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_5;  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_6;  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_7;  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayerCameraInitParam                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x00D4(0x00A4)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_557E[0x3];                                     // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_9; // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPixelDensity_ReturnValue;              // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_8;  // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_9;  // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_3;                     // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_10; // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_11; // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_10; // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_11; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_12; // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_13; // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_14; // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_15; // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand) == 0x000008, "Wrong alignment on BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand");
static_assert(sizeof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand) == 0x0001C0, "Wrong size on BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, __WorldContext) == 0x000000, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue) == 0x000008, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_DebugMenu_DispName_L10N_Text) == 0x000010, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_DebugMenu_DispName_L10N_Text' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_DebugMenu_DispName_L10N_Text_1) == 0x000020, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_DebugMenu_DispName_L10N_Text_1' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x000030, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_DebugMenu_DispName_L10N_Text_2) == 0x000038, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_DebugMenu_DispName_L10N_Text_2' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_DebugMenu_DispName_L10N_Text_3) == 0x000048, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_DebugMenu_DispName_L10N_Text_3' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1) == 0x000058, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1) == 0x00005C, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_DebugMenu_DispName_L10N_Text_4) == 0x000060, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_DebugMenu_DispName_L10N_Text_4' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2) == 0x000070, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2) == 0x000074, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3) == 0x000078, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_4) == 0x00007C, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_3) == 0x000080, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_5) == 0x000084, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_6) == 0x000088, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeParam_ReturnValue) == 0x00008C, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_7) == 0x000090, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_8) == 0x000094, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1) == 0x000098, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2) == 0x00009C, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue) == 0x0000A0, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, K2Node_MakeArray_Array) == 0x0000A8, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_MakeLiteralInt_ReturnValue) == 0x0000B8, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypePullDown_ReturnValue) == 0x0000BC, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypePullDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3) == 0x0000C0, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4) == 0x0000C4, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_5) == 0x0000C8, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_6) == 0x0000CC, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_7) == 0x0000D0, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000D4, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000178, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_9) == 0x00017C, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_GetPixelDensity_ReturnValue) == 0x000180, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_GetPixelDensity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_FTrunc_ReturnValue) == 0x000184, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_FTrunc_ReturnValue_1) == 0x000188, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_8) == 0x00018C, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_9) == 0x000190, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_FTrunc_ReturnValue_2) == 0x000194, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_FTrunc_ReturnValue_3) == 0x000198, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_FTrunc_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_10) == 0x00019C, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_11) == 0x0001A0, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_10) == 0x0001A4, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_11) == 0x0001A8, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_12) == 0x0001AC, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_13) == 0x0001B0, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_14) == 0x0001B4, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_15) == 0x0001B8, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_15' has a wrong offset!");

// Function BPL_ConsoleCommand.BPL_ConsoleCommand_C.AddDebugMenuConsoleCommand_FPS
// 0x0018 (0x0018 - 0x0000)
struct BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_FPS final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue;  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue;    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_FPS) == 0x000008, "Wrong alignment on BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_FPS");
static_assert(sizeof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_FPS) == 0x000018, "Wrong size on BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_FPS");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_FPS, __WorldContext) == 0x000000, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_FPS::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_FPS, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue) == 0x000008, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_FPS::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_FPS, CallFunc_AddDebugMenuItemTypeParam_ReturnValue) == 0x00000C, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_FPS::CallFunc_AddDebugMenuItemTypeParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_FPS, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue) == 0x000010, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_FPS::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_FPS, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x000014, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_FPS::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");

// Function BPL_ConsoleCommand.BPL_ConsoleCommand_C.AddDebugMenuConsoleCommand_DebugFlag
// 0x0060 (0x0060 - 0x0000)
struct BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_557F[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5580[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5581[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5582[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag) == 0x000008, "Wrong alignment on BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag");
static_assert(sizeof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag) == 0x000060, "Wrong size on BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag, __WorldContext) == 0x000000, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag, CallFunc_MakeLiteralInt_ReturnValue) == 0x000008, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag, Temp_int_Variable) == 0x00000C, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag, Temp_int_Variable_1) == 0x000010, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag, CallFunc_Conv_IntToByte_ReturnValue) == 0x000014, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag, CallFunc_GetValidValue_ReturnValue) == 0x00001C, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x00001D, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000020, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000030, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000048, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag, CallFunc_Conv_StringToName_ReturnValue) == 0x00004C, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue) == 0x000054, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x00005C, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DebugFlag::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");

// Function BPL_ConsoleCommand.BPL_ConsoleCommand_C.IsDisableDebugMenu
// 0x00E8 (0x00E8 - 0x0000)
struct BPL_ConsoleCommand_C_IsDisableDebugMenu final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Disable;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5583[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x0010(0x00D0)()
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_ConsoleCommand_C_IsDisableDebugMenu) == 0x000008, "Wrong alignment on BPL_ConsoleCommand_C_IsDisableDebugMenu");
static_assert(sizeof(BPL_ConsoleCommand_C_IsDisableDebugMenu) == 0x0000E8, "Wrong size on BPL_ConsoleCommand_C_IsDisableDebugMenu");
static_assert(offsetof(BPL_ConsoleCommand_C_IsDisableDebugMenu, __WorldContext) == 0x000000, "Member 'BPL_ConsoleCommand_C_IsDisableDebugMenu::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_IsDisableDebugMenu, Disable) == 0x000008, "Member 'BPL_ConsoleCommand_C_IsDisableDebugMenu::Disable' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_IsDisableDebugMenu, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue) == 0x000010, "Member 'BPL_ConsoleCommand_C_IsDisableDebugMenu::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_IsDisableDebugMenu, CallFunc_Conv_IntToBool_ReturnValue) == 0x0000E0, "Member 'BPL_ConsoleCommand_C_IsDisableDebugMenu::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");

// Function BPL_ConsoleCommand.BPL_ConsoleCommand_C.AddDebugMenuConsoleCommand_DistanceScales
// 0x0028 (0x0028 - 0x0000)
struct BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DistanceScales final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue;    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue;  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1;  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2;  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3;  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4;  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DistanceScales) == 0x000008, "Wrong alignment on BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DistanceScales");
static_assert(sizeof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DistanceScales) == 0x000028, "Wrong size on BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DistanceScales");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DistanceScales, __WorldContext) == 0x000000, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DistanceScales::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DistanceScales, CallFunc_AddDebugMenuItemTypeParam_ReturnValue) == 0x000008, "Member 'BPL_ConsoleCommand_C_AddDebugMenuConsoleCommand_DistanceScales::CallFunc_AddDebugMenuItemTypeParam_ReturnValue' has a wrong offset!");
