#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_GraphicDebug

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BPL_GraphicDebug.BPL_GraphicDebug_C.AddDebugMenu_Graphic
// 0x0030 (0x0030 - 0x0000)
struct BPL_GraphicDebug_C_AddDebugMenu_Graphic final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue;  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E2A[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue;    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_GraphicDebug_C_AddDebugMenu_Graphic) == 0x000008, "Wrong alignment on BPL_GraphicDebug_C_AddDebugMenu_Graphic");
static_assert(sizeof(BPL_GraphicDebug_C_AddDebugMenu_Graphic) == 0x000030, "Wrong size on BPL_GraphicDebug_C_AddDebugMenu_Graphic");
static_assert(offsetof(BPL_GraphicDebug_C_AddDebugMenu_Graphic, __WorldContext) == 0x000000, "Member 'BPL_GraphicDebug_C_AddDebugMenu_Graphic::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_GraphicDebug_C_AddDebugMenu_Graphic, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue) == 0x000008, "Member 'BPL_GraphicDebug_C_AddDebugMenu_Graphic::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_GraphicDebug_C_AddDebugMenu_Graphic, CallFunc_DebugMenu_DispName_L10N_Text) == 0x000010, "Member 'BPL_GraphicDebug_C_AddDebugMenu_Graphic::CallFunc_DebugMenu_DispName_L10N_Text' has a wrong offset!");
static_assert(offsetof(BPL_GraphicDebug_C_AddDebugMenu_Graphic, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue) == 0x000020, "Member 'BPL_GraphicDebug_C_AddDebugMenu_Graphic::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_GraphicDebug_C_AddDebugMenu_Graphic, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x000024, "Member 'BPL_GraphicDebug_C_AddDebugMenu_Graphic::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_GraphicDebug_C_AddDebugMenu_Graphic, CallFunc_AddDebugMenuItemTypeParam_ReturnValue) == 0x000028, "Member 'BPL_GraphicDebug_C_AddDebugMenu_Graphic::CallFunc_AddDebugMenuItemTypeParam_ReturnValue' has a wrong offset!");

// Function BPL_GraphicDebug.BPL_GraphicDebug_C.SpwanDebugMenu_Graphic
// 0x00E8 (0x00E8 - 0x0000)
struct BPL_GraphicDebug_C_SpwanDebugMenu_Graphic final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_SpawnUIActor_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x0010(0x00D0)()
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_GraphicDebug_C_SpwanDebugMenu_Graphic) == 0x000008, "Wrong alignment on BPL_GraphicDebug_C_SpwanDebugMenu_Graphic");
static_assert(sizeof(BPL_GraphicDebug_C_SpwanDebugMenu_Graphic) == 0x0000E8, "Wrong size on BPL_GraphicDebug_C_SpwanDebugMenu_Graphic");
static_assert(offsetof(BPL_GraphicDebug_C_SpwanDebugMenu_Graphic, __WorldContext) == 0x000000, "Member 'BPL_GraphicDebug_C_SpwanDebugMenu_Graphic::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_GraphicDebug_C_SpwanDebugMenu_Graphic, CallFunc_SpawnUIActor_ReturnValue) == 0x000008, "Member 'BPL_GraphicDebug_C_SpwanDebugMenu_Graphic::CallFunc_SpawnUIActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_GraphicDebug_C_SpwanDebugMenu_Graphic, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue) == 0x000010, "Member 'BPL_GraphicDebug_C_SpwanDebugMenu_Graphic::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_GraphicDebug_C_SpwanDebugMenu_Graphic, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'BPL_GraphicDebug_C_SpwanDebugMenu_Graphic::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

}

