#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_BattleDesignDebug

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BPL_BattleDesignDebug.BPL_BattleDesignDebug_C.AddDebugMenuBattleDesignDebug
// 0x0020 (0x0020 - 0x0000)
struct BPL_BattleDesignDebug_C_AddDebugMenuBattleDesignDebug final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_BattleDesignDebug_C_AddDebugMenuBattleDesignDebug) == 0x000008, "Wrong alignment on BPL_BattleDesignDebug_C_AddDebugMenuBattleDesignDebug");
static_assert(sizeof(BPL_BattleDesignDebug_C_AddDebugMenuBattleDesignDebug) == 0x000020, "Wrong size on BPL_BattleDesignDebug_C_AddDebugMenuBattleDesignDebug");
static_assert(offsetof(BPL_BattleDesignDebug_C_AddDebugMenuBattleDesignDebug, __WorldContext) == 0x000000, "Member 'BPL_BattleDesignDebug_C_AddDebugMenuBattleDesignDebug::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_AddDebugMenuBattleDesignDebug, CallFunc_DebugMenu_DispName_L10N_Text) == 0x000008, "Member 'BPL_BattleDesignDebug_C_AddDebugMenuBattleDesignDebug::CallFunc_DebugMenu_DispName_L10N_Text' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_AddDebugMenuBattleDesignDebug, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x000018, "Member 'BPL_BattleDesignDebug_C_AddDebugMenuBattleDesignDebug::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");

// Function BPL_BattleDesignDebug.BPL_BattleDesignDebug_C.BattleDebugAddCameraParam
// 0x07E0 (0x07E0 - 0x0000)
struct BPL_BattleDesignDebug_C_BattleDebugAddCameraParam final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_ListIndex;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Lo_ListItemNames;                                  // 0x0010(0x0010)(Edit, BlueprintVisible)
	class FString                                 Lo_ItemName;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Lo_DebugPath;                                      // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Lo_DebugRootPath;                                  // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_RetrieveCameraNames_CameraNames;          // 0x0050(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_RetrieveCameraNames_CameraNames_1;        // 0x0068(0x0010)(ReferenceParm)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_RetrieveCameraNames_CameraNames_2;        // 0x0080(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_RetrieveCameraNames_CameraNames_3;        // 0x0090(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_RetrieveCameraNames_CameraNames_4;        // 0x00A0(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_RetrieveCameraNames_CameraNames_5;        // 0x00B0(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_RetrieveCameraNames_CameraNames_6;        // 0x00C0(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_RetrieveCameraNames_CameraNames_7;        // 0x00D0(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_RetrieveCameraNames_CameraNames_8;        // 0x00E0(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_RetrieveCameraNames_CameraNames_9;        // 0x00F0(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_RetrieveCameraNames_CameraNames_10;       // 0x0100(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2; // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_3;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_4;          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_4; // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_5;          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_6;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_5; // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_6; // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_7;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_8;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_7; // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_8; // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_9;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_10;         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_9; // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_10; // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_11;         // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_12;         // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_11; // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_12; // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_13;         // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_14;         // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_13; // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_14; // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_15;         // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_15; // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_16;         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue; // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_17;         // 0x01F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1; // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_18;         // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2; // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_19;         // 0x022C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_3; // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_20;         // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_4; // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0268(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array_1;                          // 0x0288(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_21;         // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_5; // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_22;         // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_23;         // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue; // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_1; // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_24;         // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_6; // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_11;             // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_12;             // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_25;         // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_26;         // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_7; // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_8; // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_13;             // 0x0348(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_14;             // 0x0358(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_27;         // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_28;         // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeText_ReturnValue;     // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeText_ReturnValue_1;   // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_15;             // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_16;             // 0x0390(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_29;         // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_30;         // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeText_ReturnValue_2;   // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeText_ReturnValue_3;   // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_17;             // 0x03B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_18;             // 0x03C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_31;         // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_9; // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_19;             // 0x03E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_20;             // 0x03F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_21;             // 0x0408(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_22;             // 0x0418(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_23;             // 0x0428(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_24;             // 0x0438(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_25;             // 0x0448(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_26;             // 0x0458(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_27;             // 0x0468(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_28;             // 0x0478(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_32;         // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_33;         // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_10; // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_11; // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_29;             // 0x04A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_30;             // 0x04B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_34;         // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_35;         // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_12; // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_13; // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_31;             // 0x04D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_32;             // 0x04E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_36;         // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_37;         // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_14; // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_15; // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_33;             // 0x0510(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_34;             // 0x0520(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_38;         // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_39;         // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_16; // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_17; // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_35;             // 0x0548(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_36;             // 0x0558(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_40;         // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_41;         // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_2; // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_3; // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_37;             // 0x0580(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_38;             // 0x0590(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_42;         // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_43;         // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_4; // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_5; // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_39;             // 0x05B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_40;             // 0x05C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_44;         // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_45;         // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_6; // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_7; // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_41;             // 0x05F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_42;             // 0x0600(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_46;         // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_47;         // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_8; // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_9; // 0x0624(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_43;             // 0x0628(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_48;         // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_44;             // 0x0640(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_18; // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_654[0x4];                                      // 0x0654(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_45;             // 0x0658(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_46;             // 0x0668(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_49;         // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_50;         // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_19; // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_10; // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_47;             // 0x0690(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_51;         // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_48;             // 0x06A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_20; // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BC[0x4];                                      // 0x06BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_49;             // 0x06C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_50;             // 0x06D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_52;         // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_51;             // 0x06E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_11; // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_53;         // 0x06FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_21; // 0x0704(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_52;             // 0x0708(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_53;             // 0x0718(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_54;             // 0x0728(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_54;         // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_55;             // 0x0740(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue;    // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_55;         // 0x0754(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75C[0x4];                                      // 0x075C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0760(0x0010)(ReferenceParm)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_22; // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_56;         // 0x0774(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_57;         // 0x077C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_16; // 0x0784(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_17; // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78C[0x4];                                      // 0x078C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_56;             // 0x0790(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_57;             // 0x07A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_58;         // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_12; // 0x07B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BC[0x4];                                      // 0x07BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_58;             // 0x07C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_59;         // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_23; // 0x07D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam) == 0x000008, "Wrong alignment on BPL_BattleDesignDebug_C_BattleDebugAddCameraParam");
static_assert(sizeof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam) == 0x0007E0, "Wrong size on BPL_BattleDesignDebug_C_BattleDebugAddCameraParam");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, __WorldContext) == 0x000000, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, Lo_ListIndex) == 0x000008, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::Lo_ListIndex' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, Lo_ListItemNames) == 0x000010, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::Lo_ListItemNames' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, Lo_ItemName) == 0x000020, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::Lo_ItemName' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, Lo_DebugPath) == 0x000030, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::Lo_DebugPath' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, Lo_DebugRootPath) == 0x000040, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::Lo_DebugRootPath' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_RetrieveCameraNames_CameraNames) == 0x000050, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_RetrieveCameraNames_CameraNames' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue) == 0x000060, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_RetrieveCameraNames_CameraNames_1) == 0x000068, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_RetrieveCameraNames_CameraNames_1' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x000078, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_RetrieveCameraNames_CameraNames_2) == 0x000080, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_RetrieveCameraNames_CameraNames_2' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_RetrieveCameraNames_CameraNames_3) == 0x000090, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_RetrieveCameraNames_CameraNames_3' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_RetrieveCameraNames_CameraNames_4) == 0x0000A0, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_RetrieveCameraNames_CameraNames_4' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_RetrieveCameraNames_CameraNames_5) == 0x0000B0, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_RetrieveCameraNames_CameraNames_5' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_RetrieveCameraNames_CameraNames_6) == 0x0000C0, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_RetrieveCameraNames_CameraNames_6' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_RetrieveCameraNames_CameraNames_7) == 0x0000D0, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_RetrieveCameraNames_CameraNames_7' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_RetrieveCameraNames_CameraNames_8) == 0x0000E0, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_RetrieveCameraNames_CameraNames_8' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_RetrieveCameraNames_CameraNames_9) == 0x0000F0, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_RetrieveCameraNames_CameraNames_9' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_RetrieveCameraNames_CameraNames_10) == 0x000100, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_RetrieveCameraNames_CameraNames_10' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000110, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_2) == 0x000118, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1) == 0x000120, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2) == 0x000124, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_3) == 0x000128, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_4) == 0x000130, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3) == 0x000138, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_4) == 0x00013C, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_5) == 0x000140, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_6) == 0x000148, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_5) == 0x000150, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_6) == 0x000154, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_7) == 0x000158, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_8) == 0x000160, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_7) == 0x000168, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_8) == 0x00016C, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_9) == 0x000170, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_10) == 0x000178, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_9) == 0x000180, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_10) == 0x000184, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_11) == 0x000188, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_12) == 0x000190, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_11) == 0x000198, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_12) == 0x00019C, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_13) == 0x0001A0, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_14) == 0x0001A8, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_13) == 0x0001B0, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_14) == 0x0001B4, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_15) == 0x0001B8, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_15) == 0x0001C0, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Concat_StrStr_ReturnValue) == 0x0001C8, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_16) == 0x0001D8, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0001E0, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue) == 0x0001F0, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_17) == 0x0001F4, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1) == 0x0001FC, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000200, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_18) == 0x000210, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000218, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2) == 0x000228, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_19) == 0x00022C, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_3) == 0x000234, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000238, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_20) == 0x000248, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000250, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_4) == 0x000260, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, K2Node_MakeArray_Array) == 0x000268, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000278, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, K2Node_MakeArray_Array_1) == 0x000288, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_21) == 0x000298, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_5) == 0x0002A0, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Concat_StrStr_ReturnValue_7) == 0x0002A8, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Concat_StrStr_ReturnValue_8) == 0x0002B8, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_22) == 0x0002C8, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_23) == 0x0002D0, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypePullDown_ReturnValue) == 0x0002D8, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypePullDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_1) == 0x0002DC, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Concat_StrStr_ReturnValue_9) == 0x0002E0, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_24) == 0x0002F0, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Concat_StrStr_ReturnValue_10) == 0x0002F8, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Concat_StrStr_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_6) == 0x000308, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Concat_StrStr_ReturnValue_11) == 0x000310, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Concat_StrStr_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Concat_StrStr_ReturnValue_12) == 0x000320, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Concat_StrStr_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BPL_BattleDesignDebug_C_BattleDebugAddCameraParam, CallFunc_Conv_StringToName_ReturnValue_25) == 0x000330, "Member 'BPL_BattleDesignDebug_C_BattleDebugAddCameraParam::CallFunc_Conv_StringToName_ReturnValue_25' has a wrong offset!");
