#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_PartyDebug

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BPL_PartyDebug.BPL_PartyDebug_C.AddDebugMenuParty
// 0x00C0 (0x00C0 - 0x0000)
struct BPL_PartyDebug_C_AddDebugMenuParty final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStockMaxEnum_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40F9[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_1;           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40FA[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_2;           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_3;           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue;  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStockMax_ReturnValue;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDebugMenuNameChangeObj                K2Node_MakeStruct_DebugMenuNameChangeObj;          // 0x0060(0x0028)()
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue;    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeNameChange_ReturnValue; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDebugMenuNameChangeObj                K2Node_MakeStruct_DebugMenuNameChangeObj_1;        // 0x0090(0x0028)()
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeNameChange_ReturnValue_1; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_PartyDebug_C_AddDebugMenuParty) == 0x000008, "Wrong alignment on BPL_PartyDebug_C_AddDebugMenuParty");
static_assert(sizeof(BPL_PartyDebug_C_AddDebugMenuParty) == 0x0000C0, "Wrong size on BPL_PartyDebug_C_AddDebugMenuParty");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuParty, __WorldContext) == 0x000000, "Member 'BPL_PartyDebug_C_AddDebugMenuParty::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuParty, CallFunc_GetStockMaxEnum_ReturnValue) == 0x000008, "Member 'BPL_PartyDebug_C_AddDebugMenuParty::CallFunc_GetStockMaxEnum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuParty, CallFunc_DebugMenu_DispName_L10N_Text) == 0x000010, "Member 'BPL_PartyDebug_C_AddDebugMenuParty::CallFunc_DebugMenu_DispName_L10N_Text' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuParty, CallFunc_DebugMenu_DispName_L10N_Text_1) == 0x000020, "Member 'BPL_PartyDebug_C_AddDebugMenuParty::CallFunc_DebugMenu_DispName_L10N_Text_1' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuParty, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x000030, "Member 'BPL_PartyDebug_C_AddDebugMenuParty::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuParty, CallFunc_DebugMenu_DispName_L10N_Text_2) == 0x000038, "Member 'BPL_PartyDebug_C_AddDebugMenuParty::CallFunc_DebugMenu_DispName_L10N_Text_2' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuParty, CallFunc_DebugMenu_DispName_L10N_Text_3) == 0x000048, "Member 'BPL_PartyDebug_C_AddDebugMenuParty::CallFunc_DebugMenu_DispName_L10N_Text_3' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuParty, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue) == 0x000058, "Member 'BPL_PartyDebug_C_AddDebugMenuParty::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuParty, CallFunc_GetStockMax_ReturnValue) == 0x00005C, "Member 'BPL_PartyDebug_C_AddDebugMenuParty::CallFunc_GetStockMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuParty, K2Node_MakeStruct_DebugMenuNameChangeObj) == 0x000060, "Member 'BPL_PartyDebug_C_AddDebugMenuParty::K2Node_MakeStruct_DebugMenuNameChangeObj' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuParty, CallFunc_AddDebugMenuItemTypeParam_ReturnValue) == 0x000088, "Member 'BPL_PartyDebug_C_AddDebugMenuParty::CallFunc_AddDebugMenuItemTypeParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuParty, CallFunc_AddDebugMenuItemTypeNameChange_ReturnValue) == 0x00008C, "Member 'BPL_PartyDebug_C_AddDebugMenuParty::CallFunc_AddDebugMenuItemTypeNameChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuParty, K2Node_MakeStruct_DebugMenuNameChangeObj_1) == 0x000090, "Member 'BPL_PartyDebug_C_AddDebugMenuParty::K2Node_MakeStruct_DebugMenuNameChangeObj_1' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuParty, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1) == 0x0000B8, "Member 'BPL_PartyDebug_C_AddDebugMenuParty::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuParty, CallFunc_AddDebugMenuItemTypeNameChange_ReturnValue_1) == 0x0000BC, "Member 'BPL_PartyDebug_C_AddDebugMenuParty::CallFunc_AddDebugMenuItemTypeNameChange_ReturnValue_1' has a wrong offset!");

// Function BPL_PartyDebug.BPL_PartyDebug_C.AddDebugMenuPartyCharaData
// 0x0008 (0x0008 - 0x0000)
struct BPL_PartyDebug_C_AddDebugMenuPartyCharaData final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_PartyDebug_C_AddDebugMenuPartyCharaData) == 0x000008, "Wrong alignment on BPL_PartyDebug_C_AddDebugMenuPartyCharaData");
static_assert(sizeof(BPL_PartyDebug_C_AddDebugMenuPartyCharaData) == 0x000008, "Wrong size on BPL_PartyDebug_C_AddDebugMenuPartyCharaData");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuPartyCharaData, __WorldContext) == 0x000000, "Member 'BPL_PartyDebug_C_AddDebugMenuPartyCharaData::__WorldContext' has a wrong offset!");

// Function BPL_PartyDebug.BPL_PartyDebug_C.CalcDebugMenuPartyCharaData
// 0x0008 (0x0008 - 0x0000)
struct BPL_PartyDebug_C_CalcDebugMenuPartyCharaData final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_PartyDebug_C_CalcDebugMenuPartyCharaData) == 0x000008, "Wrong alignment on BPL_PartyDebug_C_CalcDebugMenuPartyCharaData");
static_assert(sizeof(BPL_PartyDebug_C_CalcDebugMenuPartyCharaData) == 0x000008, "Wrong size on BPL_PartyDebug_C_CalcDebugMenuPartyCharaData");
static_assert(offsetof(BPL_PartyDebug_C_CalcDebugMenuPartyCharaData, __WorldContext) == 0x000000, "Member 'BPL_PartyDebug_C_CalcDebugMenuPartyCharaData::__WorldContext' has a wrong offset!");

// Function BPL_PartyDebug.BPL_PartyDebug_C.AddDebugMenuPartyCharaData_New
// 0x02B8 (0x02B8 - 0x0000)
struct BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue;    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEntryNkmNum_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNkmIndexByEntryList_ReturnValue;       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40FB[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FNkmData                               CallFunc_GetNkmData_ReturnValue;                   // 0x0060(0x0120)(ConstParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40FC[0x2];                                     // 0x0182(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCharData                              CallFunc_GetPlayerData_ReturnValue;                // 0x0188(0x0130)(ConstParm)
};
static_assert(alignof(BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New) == 0x000008, "Wrong alignment on BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New");
static_assert(sizeof(BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New) == 0x0002B8, "Wrong size on BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New, __WorldContext) == 0x000000, "Member 'BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New, CallFunc_DebugMenu_DispName_L10N_Text) == 0x000008, "Member 'BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New::CallFunc_DebugMenu_DispName_L10N_Text' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New, CallFunc_Conv_NameToString_ReturnValue) == 0x000018, "Member 'BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New, CallFunc_AddDebugMenuItemTypeParam_ReturnValue) == 0x000028, "Member 'BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New::CallFunc_AddDebugMenuItemTypeParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New, CallFunc_GetEntryNkmNum_ReturnValue) == 0x00002C, "Member 'BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New::CallFunc_GetEntryNkmNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New, Temp_int_Variable) == 0x000030, "Member 'BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New, CallFunc_GetNkmIndexByEntryList_ReturnValue) == 0x000038, "Member 'BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New::CallFunc_GetNkmIndexByEntryList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00003C, "Member 'BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New, CallFunc_Conv_IntToString_ReturnValue) == 0x000040, "Member 'BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New, CallFunc_GetNkmData_ReturnValue) == 0x000060, "Member 'BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New::CallFunc_GetNkmData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000180, "Member 'BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000181, "Member 'BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New, CallFunc_Add_IntInt_ReturnValue) == 0x000184, "Member 'BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New, CallFunc_GetPlayerData_ReturnValue) == 0x000188, "Member 'BPL_PartyDebug_C_AddDebugMenuPartyCharaData_New::CallFunc_GetPlayerData_ReturnValue' has a wrong offset!");

// Function BPL_PartyDebug.BPL_PartyDebug_C.AddCharaDataOne
// 0x0978 (0x0978 - 0x0000)
struct BPL_PartyDebug_C_AddCharaDataOne final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FCharData                              CharData;                                          // 0x0010(0x0130)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	struct FNkmData                               NkmData;                                           // 0x0140(0x0120)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsNkm;                                             // 0x0260(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40FD[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_GlobalEntryId;                                  // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Lo_BonusDevil;                                     // 0x0274(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40FE[0x3];                                     // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Lo_minLevel;                                       // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_Id;                                             // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_Index;                                          // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40FF[0x4];                                     // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Lo_Path2;                                          // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Lo_IsDead;                                         // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4100[0x3];                                     // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Lo_Exp;                                            // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 Lo_SkillTekisei;                                   // 0x02A0(0x0010)(Edit, BlueprintVisible)
	int32                                         Lo_Level;                                          // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4101[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLearnSkill>                    Lo_AutoSkill;                                      // 0x02B8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FLearnSkill>                    Lo_Skill;                                          // 0x02C8(0x0010)(Edit, BlueprintVisible)
	struct FAbilData                              Lo_AbilData;                                       // 0x02D8(0x001C)(Edit, BlueprintVisible)
	int32                                         Lo_Mp;                                             // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_Hp;                                             // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4102[0x4];                                     // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Lo_DispName;                                       // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Lo_IsNkm;                                          // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4103[0x7];                                     // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNkmData                               Lo_NkmData;                                        // 0x0318(0x0120)(Edit, BlueprintVisible)
	struct FCharData                              Lo_CharData;                                       // 0x0438(0x0130)(Edit, BlueprintVisible)
	class FString                                 Lo_Path;                                           // 0x0568(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4104[0x4];                                     // 0x0584(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0588(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevelMax_ReturnValue;                  // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x059C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue;    // 0x05A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x05A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSkillIdMax_ReturnValue;                // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x05BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue; // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x05C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4105[0x4];                                     // 0x05CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x05D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1; // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_3;          // 0x05EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4106[0x4];                                     // 0x05F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x05F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4107[0x4];                                     // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0610(0x0010)(ReferenceParm)
	TArray<class FString>                         K2Node_MakeArray_Array_1;                          // 0x0620(0x0010)(ReferenceParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4108[0x7];                                     // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0638(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array_2;                          // 0x0648(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0658(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0668(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array_3;                          // 0x0678(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0690(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_4;          // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x06A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1; // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_5;          // 0x06BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1;  // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x06CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4109[0x3];                                     // 0x06CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x06D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_410A[0x4];                                     // 0x06DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x06E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_2;                         // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_6;          // 0x06F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_410B[0x4];                                     // 0x06FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0700(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2;  // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_410C[0x4];                                     // 0x0714(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0718(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_7;          // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x0730(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3;  // 0x0740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_410D[0x4];                                     // 0x0744(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0748(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x0758(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0768(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_410E[0x4];                                     // 0x076C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_11;             // 0x0770(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_8;          // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_410F[0x3];                                     // 0x0789(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddDebugMenuItemTypeNameChange_ReturnValue; // 0x078C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4110[0x4];                                     // 0x0794(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_12;             // 0x0798(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLearnSkill                            CallFunc_Array_Get_Item_3;                         // 0x07A8(0x0008)()
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x07B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x07B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4111[0x3];                                     // 0x07B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_13;             // 0x07B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_9;          // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4;  // 0x07D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4112[0x4];                                     // 0x07D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_14;             // 0x07D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_15;             // 0x07E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_10;         // 0x07F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_5;  // 0x0800(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4113[0x4];                                     // 0x0804(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_16;             // 0x0808(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_11;         // 0x0818(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_6;  // 0x0820(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_12;         // 0x0824(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2; // 0x082C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_13;         // 0x0830(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3; // 0x0838(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4114[0x4];                                     // 0x083C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDevilBaseData                         CallFunc_GetDevilBaseData_ReturnValue;             // 0x0840(0x0108)(ConstParm)
	class FText                                   CallFunc_GetDevilName_ReturnValue;                 // 0x0948(0x0018)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0960(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BIT_AND_ReturnValue;                      // 0x0970(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_PartyDebug_C_AddCharaDataOne) == 0x000008, "Wrong alignment on BPL_PartyDebug_C_AddCharaDataOne");
static_assert(sizeof(BPL_PartyDebug_C_AddCharaDataOne) == 0x000978, "Wrong size on BPL_PartyDebug_C_AddCharaDataOne");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Path) == 0x000000, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Path' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CharData) == 0x000010, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CharData' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, NkmData) == 0x000140, "Member 'BPL_PartyDebug_C_AddCharaDataOne::NkmData' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, IsNkm) == 0x000260, "Member 'BPL_PartyDebug_C_AddCharaDataOne::IsNkm' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, __WorldContext) == 0x000268, "Member 'BPL_PartyDebug_C_AddCharaDataOne::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Lo_GlobalEntryId) == 0x000270, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Lo_GlobalEntryId' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Lo_BonusDevil) == 0x000274, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Lo_BonusDevil' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Lo_minLevel) == 0x000278, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Lo_minLevel' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Lo_Id) == 0x00027C, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Lo_Id' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Lo_Index) == 0x000280, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Lo_Index' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Lo_Path2) == 0x000288, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Lo_Path2' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Lo_IsDead) == 0x000298, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Lo_IsDead' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Lo_Exp) == 0x00029C, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Lo_Exp' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Lo_SkillTekisei) == 0x0002A0, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Lo_SkillTekisei' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Lo_Level) == 0x0002B0, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Lo_Level' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Lo_AutoSkill) == 0x0002B8, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Lo_AutoSkill' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Lo_Skill) == 0x0002C8, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Lo_Skill' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Lo_AbilData) == 0x0002D8, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Lo_AbilData' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Lo_Mp) == 0x0002F4, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Lo_Mp' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Lo_Hp) == 0x0002F8, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Lo_Hp' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Lo_DispName) == 0x000300, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Lo_DispName' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Lo_IsNkm) == 0x000310, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Lo_IsNkm' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Lo_NkmData) == 0x000318, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Lo_NkmData' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Lo_CharData) == 0x000438, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Lo_CharData' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Lo_Path) == 0x000568, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Lo_Path' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Temp_int_Loop_Counter_Variable) == 0x000578, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Add_IntInt_ReturnValue) == 0x00057C, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Temp_int_Array_Index_Variable) == 0x000580, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Concat_StrStr_ReturnValue) == 0x000588, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_GetLevelMax_ReturnValue) == 0x000598, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_GetLevelMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Conv_StringToName_ReturnValue) == 0x00059C, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_AddDebugMenuItemTypeParam_ReturnValue) == 0x0005A4, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_AddDebugMenuItemTypeParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0005A8, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_GetSkillIdMax_ReturnValue) == 0x0005B8, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_GetSkillIdMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Conv_StringToName_ReturnValue_1) == 0x0005BC, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue) == 0x0005C4, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Temp_int_Array_Index_Variable_1) == 0x0005C8, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0005D0, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Conv_StringToName_ReturnValue_2) == 0x0005E0, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1) == 0x0005E8, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Conv_StringToName_ReturnValue_3) == 0x0005EC, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Conv_StringToName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0005F8, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x000608, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, K2Node_MakeArray_Array) == 0x000610, "Member 'BPL_PartyDebug_C_AddCharaDataOne::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, K2Node_MakeArray_Array_1) == 0x000620, "Member 'BPL_PartyDebug_C_AddCharaDataOne::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_MakeLiteralByte_ReturnValue) == 0x000630, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000638, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, K2Node_MakeArray_Array_2) == 0x000648, "Member 'BPL_PartyDebug_C_AddCharaDataOne::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000658, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000668, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, K2Node_MakeArray_Array_3) == 0x000678, "Member 'BPL_PartyDebug_C_AddCharaDataOne::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Array_Get_Item) == 0x000688, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Array_Length_ReturnValue) == 0x00068C, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Array_Get_Item_1) == 0x000690, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Conv_StringToName_ReturnValue_4) == 0x0006A0, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Conv_StringToName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Concat_StrStr_ReturnValue_7) == 0x0006A8, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1) == 0x0006B8, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Conv_StringToName_ReturnValue_5) == 0x0006BC, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Conv_StringToName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1) == 0x0006C4, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Temp_int_Loop_Counter_Variable_1) == 0x0006C8, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Less_IntInt_ReturnValue) == 0x0006CC, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Add_IntInt_ReturnValue_1) == 0x0006D0, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Array_Length_ReturnValue_1) == 0x0006D4, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Temp_int_Array_Index_Variable_2) == 0x0006D8, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Concat_StrStr_ReturnValue_8) == 0x0006E0, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Array_Get_Item_2) == 0x0006F0, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Conv_StringToName_ReturnValue_6) == 0x0006F4, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Conv_StringToName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Conv_IntToString_ReturnValue) == 0x000700, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2) == 0x000710, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000718, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Conv_StringToName_ReturnValue_7) == 0x000728, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Conv_StringToName_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_DebugMenu_DispName_L10N_Text) == 0x000730, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_DebugMenu_DispName_L10N_Text' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3) == 0x000740, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000748, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Concat_StrStr_ReturnValue_10) == 0x000758, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Concat_StrStr_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, Temp_int_Loop_Counter_Variable_2) == 0x000768, "Member 'BPL_PartyDebug_C_AddCharaDataOne::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Concat_StrStr_ReturnValue_11) == 0x000770, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Concat_StrStr_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Conv_StringToName_ReturnValue_8) == 0x000780, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Conv_StringToName_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Less_IntInt_ReturnValue_1) == 0x000788, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_AddDebugMenuItemTypeNameChange_ReturnValue) == 0x00078C, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_AddDebugMenuItemTypeNameChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Add_IntInt_ReturnValue_2) == 0x000790, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Concat_StrStr_ReturnValue_12) == 0x000798, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Concat_StrStr_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Array_Get_Item_3) == 0x0007A8, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Array_Length_ReturnValue_2) == 0x0007B0, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Less_IntInt_ReturnValue_2) == 0x0007B4, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Concat_StrStr_ReturnValue_13) == 0x0007B8, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Concat_StrStr_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Conv_StringToName_ReturnValue_9) == 0x0007C8, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Conv_StringToName_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4) == 0x0007D0, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Concat_StrStr_ReturnValue_14) == 0x0007D8, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Concat_StrStr_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Concat_StrStr_ReturnValue_15) == 0x0007E8, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Concat_StrStr_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Conv_StringToName_ReturnValue_10) == 0x0007F8, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Conv_StringToName_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_5) == 0x000800, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Concat_StrStr_ReturnValue_16) == 0x000808, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Concat_StrStr_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Conv_StringToName_ReturnValue_11) == 0x000818, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Conv_StringToName_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_6) == 0x000820, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Conv_StringToName_ReturnValue_12) == 0x000824, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Conv_StringToName_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2) == 0x00082C, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Conv_StringToName_ReturnValue_13) == 0x000830, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Conv_StringToName_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3) == 0x000838, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_GetDevilBaseData_ReturnValue) == 0x000840, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_GetDevilBaseData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_GetDevilName_ReturnValue) == 0x000948, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_GetDevilName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_Conv_TextToString_ReturnValue) == 0x000960, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_PartyDebug_C_AddCharaDataOne, CallFunc_BIT_AND_ReturnValue) == 0x000970, "Member 'BPL_PartyDebug_C_AddCharaDataOne::CallFunc_BIT_AND_ReturnValue' has a wrong offset!");

// Function BPL_PartyDebug.BPL_PartyDebug_C.AddDebugMenuParty_LevelUpOption
// 0x0018 (0x0018 - 0x0000)
struct BPL_PartyDebug_C_AddDebugMenuParty_LevelUpOption final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_PartyDebug_C_AddDebugMenuParty_LevelUpOption) == 0x000008, "Wrong alignment on BPL_PartyDebug_C_AddDebugMenuParty_LevelUpOption");
