#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_TutorialWindowCtrl2

#include "Basic.hpp"

#include "E_AmuletTutorial_MsgType_structs.hpp"
#include "ST_AmuletTutorialMsgInfo_structs.hpp"
#include "Project_structs.hpp"
#include "E_TutorialWindow_WidgetState_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function BPL_TutorialWindowCtrl2.BPL_TutorialWindowCtrl2_C.BPL_TutorialWIndow2_Open
// 0x0070 (0x0070 - 0x0000)
struct BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open final
{
public:
	E_WIDGET_PRIO                                 InWidgetPrio;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlaySE;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsSkipAnimation;                                   // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsDrawBlackCurtain;                                // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsEscClose;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetTutorialWindowCtrl2_outActor;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_TutorialWindowCtrl2_C> K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2;   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open) == 0x000008, "Wrong alignment on BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open");
static_assert(sizeof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open) == 0x000070, "Wrong size on BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open, InWidgetPrio) == 0x000000, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open::InWidgetPrio' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open, IsPlaySE) == 0x000001, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open::IsPlaySE' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open, IsSkipAnimation) == 0x000002, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open::IsSkipAnimation' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open, IsDrawBlackCurtain) == 0x000003, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open::IsDrawBlackCurtain' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open, IsEscClose) == 0x000004, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open::IsEscClose' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open, __WorldContext) == 0x000008, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open, CallFunc_BPI_GetTutorialWindowCtrl2_outActor) == 0x000050, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open::CallFunc_BPI_GetTutorialWindowCtrl2_outActor' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open, K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2) == 0x000058, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open::K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Open::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BPL_TutorialWindowCtrl2.BPL_TutorialWindowCtrl2_C.BPL_TutorialWIndow2_Close
// 0x0070 (0x0070 - 0x0000)
struct BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsSkipAnimation;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetTutorialWindowCtrl2_outActor;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_TutorialWindowCtrl2_C> K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2;   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close) == 0x000008, "Wrong alignment on BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close");
static_assert(sizeof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close) == 0x000070, "Wrong size on BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close, IsPlaySE) == 0x000000, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close::IsPlaySE' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close, IsSkipAnimation) == 0x000001, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close::IsSkipAnimation' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close, __WorldContext) == 0x000008, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close, CallFunc_BPI_GetTutorialWindowCtrl2_outActor) == 0x000050, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close::CallFunc_BPI_GetTutorialWindowCtrl2_outActor' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close, K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2) == 0x000058, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close::K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Close::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BPL_TutorialWindowCtrl2.BPL_TutorialWindowCtrl2_C.BPL_TutorialWIndow2_SetTextJustification
// 0x0070 (0x0070 - 0x0000)
struct BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification final
{
public:
	ETextJustify                                  InJustification;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetTutorialWindowCtrl2_outActor;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_TutorialWindowCtrl2_C> K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2;   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification) == 0x000008, "Wrong alignment on BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification");
static_assert(sizeof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification) == 0x000070, "Wrong size on BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification, InJustification) == 0x000000, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification::InJustification' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification, __WorldContext) == 0x000008, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification, CallFunc_BPI_GetTutorialWindowCtrl2_outActor) == 0x000050, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification::CallFunc_BPI_GetTutorialWindowCtrl2_outActor' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification, K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2) == 0x000058, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification::K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTextJustification::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BPL_TutorialWindowCtrl2.BPL_TutorialWindowCtrl2_C.BPL_TutorialWIndow2_GetScrollState
// 0x0070 (0x0070 - 0x0000)
struct BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRequiredScroll;                                  // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ScrollPosRate;                                     // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetTutorialWindowCtrl2_outActor;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_TutorialWindowCtrl2_C> K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2;   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_GetScrollState_IsRequiredScroll;      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BPI_GetScrollState_ScrollPosRate;         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState) == 0x000008, "Wrong alignment on BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState");
static_assert(sizeof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState) == 0x000070, "Wrong size on BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState, __WorldContext) == 0x000000, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState, IsRequiredScroll) == 0x000008, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState::IsRequiredScroll' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState, ScrollPosRate) == 0x00000C, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState::ScrollPosRate' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState, CallFunc_BPI_GetTutorialWindowCtrl2_outActor) == 0x000050, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState::CallFunc_BPI_GetTutorialWindowCtrl2_outActor' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState, K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2) == 0x000058, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState::K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState, CallFunc_BPI_GetScrollState_IsRequiredScroll) == 0x000069, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState::CallFunc_BPI_GetScrollState_IsRequiredScroll' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState, CallFunc_BPI_GetScrollState_ScrollPosRate) == 0x00006C, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_GetScrollState::CallFunc_BPI_GetScrollState_ScrollPosRate' has a wrong offset!");

// Function BPL_TutorialWindowCtrl2.BPL_TutorialWindowCtrl2_C.BPL_TutorialWIndow2_SetScrollOffset
// 0x0070 (0x0070 - 0x0000)
struct BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset final
{
public:
	int32                                         InScrollOffset;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlaySE;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetTutorialWindowCtrl2_outActor;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_TutorialWindowCtrl2_C> K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2;   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset) == 0x000008, "Wrong alignment on BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset");
static_assert(sizeof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset) == 0x000070, "Wrong size on BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset, InScrollOffset) == 0x000000, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset::InScrollOffset' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset, IsPlaySE) == 0x000004, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset::IsPlaySE' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset, __WorldContext) == 0x000008, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset, CallFunc_BPI_GetTutorialWindowCtrl2_outActor) == 0x000050, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset::CallFunc_BPI_GetTutorialWindowCtrl2_outActor' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset, K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2) == 0x000058, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset::K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetScrollOffset::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BPL_TutorialWindowCtrl2.BPL_TutorialWindowCtrl2_C.BPL_TutorialWIndow2_Scroll_Up
// 0x0070 (0x0070 - 0x0000)
struct BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetTutorialWindowCtrl2_outActor;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_TutorialWindowCtrl2_C> K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2;   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up) == 0x000008, "Wrong alignment on BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up");
static_assert(sizeof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up) == 0x000070, "Wrong size on BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up, IsPlaySE) == 0x000000, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up::IsPlaySE' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up, __WorldContext) == 0x000008, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up, CallFunc_BPI_GetTutorialWindowCtrl2_outActor) == 0x000050, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up::CallFunc_BPI_GetTutorialWindowCtrl2_outActor' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up, K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2) == 0x000058, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up::K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Up::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BPL_TutorialWindowCtrl2.BPL_TutorialWindowCtrl2_C.BPL_TutorialWIndow2_Scroll_Down
// 0x0070 (0x0070 - 0x0000)
struct BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetTutorialWindowCtrl2_outActor;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_TutorialWindowCtrl2_C> K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2;   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down) == 0x000008, "Wrong alignment on BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down");
static_assert(sizeof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down) == 0x000070, "Wrong size on BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down, IsPlaySE) == 0x000000, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down::IsPlaySE' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down, __WorldContext) == 0x000008, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down, CallFunc_BPI_GetTutorialWindowCtrl2_outActor) == 0x000050, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down::CallFunc_BPI_GetTutorialWindowCtrl2_outActor' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down, K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2) == 0x000058, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down::K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Scroll_Down::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BPL_TutorialWindowCtrl2.BPL_TutorialWindowCtrl2_C.BPL_TutorialWIndow2_Page_Up
// 0x0070 (0x0070 - 0x0000)
struct BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetTutorialWindowCtrl2_outActor;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_TutorialWindowCtrl2_C> K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2;   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up) == 0x000008, "Wrong alignment on BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up");
static_assert(sizeof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up) == 0x000070, "Wrong size on BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up, IsPlaySE) == 0x000000, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up::IsPlaySE' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up, __WorldContext) == 0x000008, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up, CallFunc_BPI_GetTutorialWindowCtrl2_outActor) == 0x000050, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up::CallFunc_BPI_GetTutorialWindowCtrl2_outActor' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up, K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2) == 0x000058, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up::K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Up::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BPL_TutorialWindowCtrl2.BPL_TutorialWindowCtrl2_C.BPL_TutorialWIndow2_Page_Down
// 0x0070 (0x0070 - 0x0000)
struct BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down final
{
public:
	bool                                          IsPlaySE;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetTutorialWindowCtrl2_outActor;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_TutorialWindowCtrl2_C> K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2;   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down) == 0x000008, "Wrong alignment on BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down");
static_assert(sizeof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down) == 0x000070, "Wrong size on BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down, IsPlaySE) == 0x000000, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down::IsPlaySE' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down, __WorldContext) == 0x000008, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down, CallFunc_BPI_GetTutorialWindowCtrl2_outActor) == 0x000050, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down::CallFunc_BPI_GetTutorialWindowCtrl2_outActor' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down, K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2) == 0x000058, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down::K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_Page_Down::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BPL_TutorialWindowCtrl2.BPL_TutorialWindowCtrl2_C.BPL_TutorialWIndow2_SetTitle_byID
// 0x0078 (0x0078 - 0x0000)
struct BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTitle_byID final
{
public:
	const class UScriptMessageAsset*              InMessageAsset;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMessageId;                                       // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetTutorialWindowCtrl2_outActor;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_TutorialWindowCtrl2_C> K2Node_DynamicCast_AsBPI_Tutorial_Window_Ctrl_2;   // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTitle_byID) == 0x000008, "Wrong alignment on BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTitle_byID");
static_assert(sizeof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTitle_byID) == 0x000078, "Wrong size on BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTitle_byID");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTitle_byID, InMessageAsset) == 0x000000, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTitle_byID::InMessageAsset' has a wrong offset!");
static_assert(offsetof(BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTitle_byID, InMessageId) == 0x000008, "Member 'BPL_TutorialWindowCtrl2_C_BPL_TutorialWIndow2_SetTitle_byID::InMessageId' has a wrong offset!");
