#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_EventViewDebugMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPL_EventViewDebugMenu.BPL_EventViewDebugMenu_C.AddDebugMenu_EventView
// 0x0058 (0x0058 - 0x0000)
struct BPL_EventViewDebugMenu_C_AddDebugMenu_EventView final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E31[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_1;           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue;  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_2;           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_EventViewDebugMenu_C_AddDebugMenu_EventView) == 0x000008, "Wrong alignment on BPL_EventViewDebugMenu_C_AddDebugMenu_EventView");
static_assert(sizeof(BPL_EventViewDebugMenu_C_AddDebugMenu_EventView) == 0x000058, "Wrong size on BPL_EventViewDebugMenu_C_AddDebugMenu_EventView");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_EventView, __WorldContext) == 0x000000, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_EventView::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_EventView, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x000008, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_EventView::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_EventView, CallFunc_DebugMenu_DispName_L10N_Text) == 0x000010, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_EventView::CallFunc_DebugMenu_DispName_L10N_Text' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_EventView, CallFunc_DebugMenu_DispName_L10N_Text_1) == 0x000020, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_EventView::CallFunc_DebugMenu_DispName_L10N_Text_1' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_EventView, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue) == 0x000030, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_EventView::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_EventView, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1) == 0x000034, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_EventView::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_EventView, CallFunc_DebugMenu_DispName_L10N_Text_2) == 0x000038, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_EventView::CallFunc_DebugMenu_DispName_L10N_Text_2' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_EventView, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue) == 0x000048, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_EventView::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_EventView, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1) == 0x00004C, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_EventView::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_EventView, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2) == 0x000050, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_EventView::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_EventView, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3) == 0x000054, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_EventView::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3' has a wrong offset!");

// Function BPL_EventViewDebugMenu.BPL_EventViewDebugMenu_C.AddDebugMenuSp_EventView
// 0x0058 (0x0058 - 0x0000)
struct BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 EventView;                                         // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E32[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BI_IsEventView_IsEventView;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E33[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue;  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView) == 0x000008, "Wrong alignment on BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView");
static_assert(sizeof(BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView) == 0x000058, "Wrong size on BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView, __WorldContext) == 0x000000, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView, EventView) == 0x000008, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView::EventView' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView, K2Node_DynamicCast_AsBPI_Map_Common) == 0x000020, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView, CallFunc_BI_IsEventView_IsEventView) == 0x000048, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView::CallFunc_BI_IsEventView_IsEventView' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView, CallFunc_Conv_StringToName_ReturnValue) == 0x00004C, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue) == 0x000054, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenuSp_EventView::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue' has a wrong offset!");

// Function BPL_EventViewDebugMenu.BPL_EventViewDebugMenu_C.AddDebugMenu_SaveData
// 0x0148 (0x0148 - 0x0000)
struct BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData final
{
public:
	class FString                                 PC_PathName;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Game_PathName;                                     // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Lo_GamePath;                                       // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Lo_PCPath;                                         // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E34[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E35[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E36[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_PCSave_PickupFilePath_ReturnValue;        // 0x0080(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E37[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E38[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue;  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E39[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Split_LeftS;                              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E3A[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1; // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E3B[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Split_LeftS_1;                            // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS_1;                           // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue_1;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E3C[0x1];                                     // 0x013B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData) == 0x000008, "Wrong alignment on BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData");
static_assert(sizeof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData) == 0x000148, "Wrong size on BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, PC_PathName) == 0x000000, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::PC_PathName' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, Game_PathName) == 0x000010, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::Game_PathName' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, __WorldContext) == 0x000020, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, Lo_GamePath) == 0x000028, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::Lo_GamePath' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, Lo_PCPath) == 0x000038, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::Lo_PCPath' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, Temp_int_Array_Index_Variable) == 0x000048, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000068, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_PCSave_PickupFilePath_ReturnValue) == 0x000080, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_PCSave_PickupFilePath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_Array_Get_Item) == 0x000098, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A8, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000B0, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_Conv_StringToName_ReturnValue) == 0x0000C0, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000C8, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue) == 0x0000D8, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_Conv_StringToName_ReturnValue_1) == 0x0000DC, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_Split_LeftS) == 0x0000E8, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_Split_RightS) == 0x0000F8, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_Split_ReturnValue) == 0x000108, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1) == 0x00010C, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000110, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_Split_LeftS_1) == 0x000118, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_Split_LeftS_1' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_Split_RightS_1) == 0x000128, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_Split_RightS_1' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_Split_ReturnValue_1) == 0x000138, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_Split_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000139, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x00013A, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_Array_Length_ReturnValue_1) == 0x00013C, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData, CallFunc_Less_IntInt_ReturnValue) == 0x000140, "Member 'BPL_EventViewDebugMenu_C_AddDebugMenu_SaveData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

