#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_BattleDebug

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function BPL_BattleDebug.BPL_BattleDebug_C.AddDebugMenuBattleDebug
// 0x04B0 (0x04B0 - 0x0000)
struct BPL_BattleDebug_C_AddDebugMenuBattleDebug final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Lo_shiseijoName;                                   // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         Lo_difficutyName;                                  // 0x0018(0x0010)(Edit, BlueprintVisible)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_1;           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_2;           // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_3;           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_3; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_4;           // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_5;           // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_4; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_6;           // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_7;           // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_5; // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_6; // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_8;           // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_9;           // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_7; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_8; // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_10;          // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_11;          // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1; // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_9; // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_12;          // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_13;          // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_10; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_11; // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_14;          // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_15;          // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_12; // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2; // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_16;          // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_17;          // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_13; // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_14; // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_18;          // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_19;          // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue;    // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1;  // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_20;          // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_21;          // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_15; // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_16; // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_22;          // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_23;          // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_17; // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_18; // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_24;          // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_25;          // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_19; // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_20; // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_26;          // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_27;          // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_21; // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_22; // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_BPL_GetBIBattleMain_retValue;             // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPL_GetBIBattleMain_success;              // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_559D[0x3];                                     // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559E[0x2];                                     // 0x0272(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BI_GetPlayerUpliftingGauge_ret;           // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559F[0x4];                                     // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55A0[0x2];                                     // 0x0296(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_2;             // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55A1[0x3];                                     // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_3;             // 0x02AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55A2[0x2];                                     // 0x02AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue_1; // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55A3[0x3];                                     // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3; // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GAME_DIFFICULTY                             CallFunc_GetDifficulty_ReturnValue;                // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55A4[0x3];                                     // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue; // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55A5[0x3];                                     // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_23; // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue;  // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_24; // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_25; // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_26; // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_27; // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_28; // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_29; // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_30; // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_31; // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_32; // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_33; // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_34; // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_35; // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_4; // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_36; // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_37; // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_5; // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_1; // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_2; // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_38; // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_39; // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2;  // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_3;  // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_4;  // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_5;  // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_6; // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_40; // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_41; // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_42; // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_7; // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_43; // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_6;  // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_44; // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_7;  // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_45; // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_46; // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_47; // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_48; // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_49; // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_50; // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_51; // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_52; // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_53; // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_8; // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_9; // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_3; // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_10; // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_4; // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_5; // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUpliftingGaugeMax_ReturnValue;         // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUpliftingGaugeMax_ReturnValue_1;       // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_8;  // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_9;  // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_11; // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_10; // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_54; // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEncountDataNum_ReturnValue;            // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_55; // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_11; // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_12; // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_13; // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_14; // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_56; // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_57; // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_58; // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_15; // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_59; // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_6; // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_16; // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_60; // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_12; // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55A6[0x3];                                     // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_61; // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_13; // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEmemyBaseTableNum_ReturnValue;         // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_14; // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypePullDown_ReturnValue_1; // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue_7; // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_62; // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_15; // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_16; // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_63; // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_64; // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_65; // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_66; // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_67; // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_68; // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_17; // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_17; // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_69; // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_70; // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_18; // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_71; // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_72; // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_19; // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_20; // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_73; // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_74; // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_75; // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_76; // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_77; // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_21; // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_22; // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_78; // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_79; // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_80; // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_23; // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_81; // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_82; // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_24; // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_25; // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_BattleDebug_C_AddDebugMenuBattleDebug) == 0x000008, "Wrong alignment on BPL_BattleDebug_C_AddDebugMenuBattleDebug");
static_assert(sizeof(BPL_BattleDebug_C_AddDebugMenuBattleDebug) == 0x0004B0, "Wrong size on BPL_BattleDebug_C_AddDebugMenuBattleDebug");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, __WorldContext) == 0x000000, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, Lo_shiseijoName) == 0x000008, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::Lo_shiseijoName' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, Lo_difficutyName) == 0x000018, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::Lo_difficutyName' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text) == 0x000028, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_1) == 0x000038, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_1' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue) == 0x000048, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1) == 0x00004C, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_2) == 0x000050, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_2' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_3) == 0x000060, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_3' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2) == 0x000070, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_3) == 0x000074, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_4) == 0x000078, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_4' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_5) == 0x000088, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_5' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_4) == 0x000098, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x00009C, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_6) == 0x0000A0, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_6' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_7) == 0x0000B0, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_7' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_5) == 0x0000C0, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_6) == 0x0000C4, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_8) == 0x0000C8, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_8' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_9) == 0x0000D8, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_9' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_7) == 0x0000E8, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_8) == 0x0000EC, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_10) == 0x0000F0, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_10' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_11) == 0x000100, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_11' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1) == 0x000110, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_9) == 0x000114, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_12) == 0x000118, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_12' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_13) == 0x000128, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_13' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_10) == 0x000138, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_11) == 0x00013C, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_14) == 0x000140, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_14' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_15) == 0x000150, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_15' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_12) == 0x000160, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2) == 0x000164, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_16) == 0x000168, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_16' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_17) == 0x000178, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_17' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_13) == 0x000188, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_14) == 0x00018C, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_18) == 0x000190, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_18' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_19) == 0x0001A0, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_19' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeParam_ReturnValue) == 0x0001B0, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1) == 0x0001B4, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_20) == 0x0001B8, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_20' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_21) == 0x0001C8, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_21' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_15) == 0x0001D8, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_16) == 0x0001DC, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_22) == 0x0001E0, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_22' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_23) == 0x0001F0, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_23' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_17) == 0x000200, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_18) == 0x000204, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_24) == 0x000208, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_24' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_25) == 0x000218, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_25' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_19) == 0x000228, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_20) == 0x00022C, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_26) == 0x000230, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_26' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_DebugMenu_DispName_L10N_Text_27) == 0x000240, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_DebugMenu_DispName_L10N_Text_27' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_21) == 0x000250, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_22) == 0x000254, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_BPL_GetBIBattleMain_retValue) == 0x000258, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_BPL_GetBIBattleMain_retValue' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_BPL_GetBIBattleMain_success) == 0x000268, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_BPL_GetBIBattleMain_success' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, Temp_int_Variable) == 0x00026C, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_Conv_IntToByte_ReturnValue) == 0x000270, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_GetValidValue_ReturnValue) == 0x000271, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_BI_GetPlayerUpliftingGauge_ret) == 0x000274, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_BI_GetPlayerUpliftingGauge_ret' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, Temp_int_Variable_1) == 0x000278, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000280, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_Add_IntInt_ReturnValue) == 0x000290, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000294, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000295, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000298, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, Temp_int_Variable_2) == 0x00029C, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, Temp_int_Variable_3) == 0x0002A0, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_Conv_IntToByte_ReturnValue_2) == 0x0002A4, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_Conv_IntToByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_Add_IntInt_ReturnValue_1) == 0x0002A8, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_GetValidValue_ReturnValue_1) == 0x0002AC, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_GetValidValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_Conv_IntToByte_ReturnValue_3) == 0x0002AD, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_Conv_IntToByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x0002B0, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_GetEnumeratorValueFromIndex_ReturnValue_1) == 0x0002C0, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_GetEnumeratorValueFromIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x0002C4, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3) == 0x0002C8, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_GetDifficulty_ReturnValue) == 0x0002CC, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_GetDifficulty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x0002D0, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_MakeLiteralInt_ReturnValue) == 0x0002D4, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypePullDown_ReturnValue) == 0x0002D8, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypePullDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_Less_IntInt_ReturnValue) == 0x0002DC, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_Array_Add_ReturnValue) == 0x0002E0, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_23) == 0x0002E4, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(BPL_BattleDebug_C_AddDebugMenuBattleDebug, CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue) == 0x0002E8, "Member 'BPL_BattleDebug_C_AddDebugMenuBattleDebug::CallFunc_AddDebugMenuItemTypeFuncObj_ReturnValue' has a wrong offset!");
