#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_ShopDebug

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPL_ShopDebug.BPL_ShopDebug_C.AddDebugMenuShop
// 0x0060 (0x0060 - 0x0000)
struct BPL_ShopDebug_C_AddDebugMenuShop final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_1;           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue;    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_2;           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugMenu_DispName_L10N_Text_3;           // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1;  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2;  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_ShopDebug_C_AddDebugMenuShop) == 0x000008, "Wrong alignment on BPL_ShopDebug_C_AddDebugMenuShop");
static_assert(sizeof(BPL_ShopDebug_C_AddDebugMenuShop) == 0x000060, "Wrong size on BPL_ShopDebug_C_AddDebugMenuShop");
static_assert(offsetof(BPL_ShopDebug_C_AddDebugMenuShop, __WorldContext) == 0x000000, "Member 'BPL_ShopDebug_C_AddDebugMenuShop::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_ShopDebug_C_AddDebugMenuShop, CallFunc_DebugMenu_DispName_L10N_Text) == 0x000008, "Member 'BPL_ShopDebug_C_AddDebugMenuShop::CallFunc_DebugMenu_DispName_L10N_Text' has a wrong offset!");
static_assert(offsetof(BPL_ShopDebug_C_AddDebugMenuShop, CallFunc_DebugMenu_DispName_L10N_Text_1) == 0x000018, "Member 'BPL_ShopDebug_C_AddDebugMenuShop::CallFunc_DebugMenu_DispName_L10N_Text_1' has a wrong offset!");
static_assert(offsetof(BPL_ShopDebug_C_AddDebugMenuShop, CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue) == 0x000028, "Member 'BPL_ShopDebug_C_AddDebugMenuShop::CallFunc_AddDebugMenuItemTypeCheckBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ShopDebug_C_AddDebugMenuShop, CallFunc_AddDebugMenuItemTypeParam_ReturnValue) == 0x00002C, "Member 'BPL_ShopDebug_C_AddDebugMenuShop::CallFunc_AddDebugMenuItemTypeParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ShopDebug_C_AddDebugMenuShop, CallFunc_DebugMenu_DispName_L10N_Text_2) == 0x000030, "Member 'BPL_ShopDebug_C_AddDebugMenuShop::CallFunc_DebugMenu_DispName_L10N_Text_2' has a wrong offset!");
static_assert(offsetof(BPL_ShopDebug_C_AddDebugMenuShop, CallFunc_DebugMenu_DispName_L10N_Text_3) == 0x000040, "Member 'BPL_ShopDebug_C_AddDebugMenuShop::CallFunc_DebugMenu_DispName_L10N_Text_3' has a wrong offset!");
static_assert(offsetof(BPL_ShopDebug_C_AddDebugMenuShop, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1) == 0x000050, "Member 'BPL_ShopDebug_C_AddDebugMenuShop::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ShopDebug_C_AddDebugMenuShop, CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2) == 0x000054, "Member 'BPL_ShopDebug_C_AddDebugMenuShop::CallFunc_AddDebugMenuItemTypeParam_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_ShopDebug_C_AddDebugMenuShop, CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue) == 0x000058, "Member 'BPL_ShopDebug_C_AddDebugMenuShop::CallFunc_AddDebugMenuItemTypeJumpPage_ReturnValue' has a wrong offset!");

}

