#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_EventScript

#include "Basic.hpp"

#include "BossRushTalk_Struct_structs.hpp"


namespace SDK::Params
{

// Function BPL_EventScript.BPL_EventScript_C.SpeakingFunction
// 0x0050 (0x0050 - 0x0000)
struct BPL_EventScript_C_SpeakingFunction final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaLipSync_C>   K2Node_DynamicCast_AsBPI_Chara_Lip_Sync;           // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaLipSync_C>   K2Node_DynamicCast_AsBPI_Chara_Lip_Sync_1;         // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_EventScript_C_SpeakingFunction) == 0x000008, "Wrong alignment on BPL_EventScript_C_SpeakingFunction");
static_assert(sizeof(BPL_EventScript_C_SpeakingFunction) == 0x000050, "Wrong size on BPL_EventScript_C_SpeakingFunction");
static_assert(offsetof(BPL_EventScript_C_SpeakingFunction, Actor) == 0x000000, "Member 'BPL_EventScript_C_SpeakingFunction::Actor' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_SpeakingFunction, Enable) == 0x000008, "Member 'BPL_EventScript_C_SpeakingFunction::Enable' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_SpeakingFunction, __WorldContext) == 0x000010, "Member 'BPL_EventScript_C_SpeakingFunction::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_SpeakingFunction, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BPL_EventScript_C_SpeakingFunction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_SpeakingFunction, K2Node_DynamicCast_AsBPI_Chara_Lip_Sync) == 0x000020, "Member 'BPL_EventScript_C_SpeakingFunction::K2Node_DynamicCast_AsBPI_Chara_Lip_Sync' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_SpeakingFunction, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPL_EventScript_C_SpeakingFunction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_SpeakingFunction, K2Node_DynamicCast_AsBPI_Chara_Lip_Sync_1) == 0x000038, "Member 'BPL_EventScript_C_SpeakingFunction::K2Node_DynamicCast_AsBPI_Chara_Lip_Sync_1' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_SpeakingFunction, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_EventScript_C_SpeakingFunction::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BPL_EventScript.BPL_EventScript_C.EventTextSetTag
// 0x0070 (0x0070 - 0x0000)
struct BPL_EventScript_C_EventTextSetTag final
{
public:
	int32                                         TagIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl;                 // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_EventScript_C_EventTextSetTag) == 0x000008, "Wrong alignment on BPL_EventScript_C_EventTextSetTag");
static_assert(sizeof(BPL_EventScript_C_EventTextSetTag) == 0x000070, "Wrong size on BPL_EventScript_C_EventTextSetTag");
static_assert(offsetof(BPL_EventScript_C_EventTextSetTag, TagIndex) == 0x000000, "Member 'BPL_EventScript_C_EventTextSetTag::TagIndex' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_EventTextSetTag, Value) == 0x000004, "Member 'BPL_EventScript_C_EventTextSetTag::Value' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_EventTextSetTag, __WorldContext) == 0x000008, "Member 'BPL_EventScript_C_EventTextSetTag::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_EventTextSetTag, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPL_EventScript_C_EventTextSetTag::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_EventTextSetTag, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'BPL_EventScript_C_EventTextSetTag::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_EventTextSetTag, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPL_EventScript_C_EventTextSetTag::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_EventTextSetTag, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'BPL_EventScript_C_EventTextSetTag::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_EventTextSetTag, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'BPL_EventScript_C_EventTextSetTag::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_EventTextSetTag, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPL_EventScript_C_EventTextSetTag::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_EventTextSetTag, CallFunc_BPI_GetMsgCtrl_OutActor) == 0x000050, "Member 'BPL_EventScript_C_EventTextSetTag::CallFunc_BPI_GetMsgCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_EventTextSetTag, K2Node_DynamicCast_AsBPI_Msg_Ctrl) == 0x000058, "Member 'BPL_EventScript_C_EventTextSetTag::K2Node_DynamicCast_AsBPI_Msg_Ctrl' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_EventTextSetTag, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BPL_EventScript_C_EventTextSetTag::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BPL_EventScript.BPL_EventScript_C.StartTimeAttackMission
// 0x0038 (0x0038 - 0x0000)
struct BPL_EventScript_C_StartTimeAttackMission final
{
public:
	int32                                         MissionId;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameMode_C>       K2Node_DynamicCast_AsBPI_Game_Mode;                // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ApplyMissionMapBGM_dummy;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_EventScript_C_StartTimeAttackMission) == 0x000008, "Wrong alignment on BPL_EventScript_C_StartTimeAttackMission");
static_assert(sizeof(BPL_EventScript_C_StartTimeAttackMission) == 0x000038, "Wrong size on BPL_EventScript_C_StartTimeAttackMission");
static_assert(offsetof(BPL_EventScript_C_StartTimeAttackMission, MissionId) == 0x000000, "Member 'BPL_EventScript_C_StartTimeAttackMission::MissionId' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_StartTimeAttackMission, __WorldContext) == 0x000008, "Member 'BPL_EventScript_C_StartTimeAttackMission::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_StartTimeAttackMission, Dummy) == 0x000010, "Member 'BPL_EventScript_C_StartTimeAttackMission::Dummy' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_StartTimeAttackMission, CallFunc_GetGameMode_ReturnValue) == 0x000018, "Member 'BPL_EventScript_C_StartTimeAttackMission::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_StartTimeAttackMission, K2Node_DynamicCast_AsBPI_Game_Mode) == 0x000020, "Member 'BPL_EventScript_C_StartTimeAttackMission::K2Node_DynamicCast_AsBPI_Game_Mode' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_StartTimeAttackMission, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPL_EventScript_C_StartTimeAttackMission::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_StartTimeAttackMission, CallFunc_ApplyMissionMapBGM_dummy) == 0x000031, "Member 'BPL_EventScript_C_StartTimeAttackMission::CallFunc_ApplyMissionMapBGM_dummy' has a wrong offset!");

// Function BPL_EventScript.BPL_EventScript_C.FinishTimeAttackMission
// 0x0038 (0x0038 - 0x0000)
struct BPL_EventScript_C_FinishTimeAttackMission final
{
public:
	int32                                         MissionId;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameMode_C>       K2Node_DynamicCast_AsBPI_Game_Mode;                // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ApplyMissionMapBGM_dummy;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_EventScript_C_FinishTimeAttackMission) == 0x000008, "Wrong alignment on BPL_EventScript_C_FinishTimeAttackMission");
static_assert(sizeof(BPL_EventScript_C_FinishTimeAttackMission) == 0x000038, "Wrong size on BPL_EventScript_C_FinishTimeAttackMission");
static_assert(offsetof(BPL_EventScript_C_FinishTimeAttackMission, MissionId) == 0x000000, "Member 'BPL_EventScript_C_FinishTimeAttackMission::MissionId' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_FinishTimeAttackMission, __WorldContext) == 0x000008, "Member 'BPL_EventScript_C_FinishTimeAttackMission::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_FinishTimeAttackMission, Dummy) == 0x000010, "Member 'BPL_EventScript_C_FinishTimeAttackMission::Dummy' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_FinishTimeAttackMission, CallFunc_GetGameMode_ReturnValue) == 0x000018, "Member 'BPL_EventScript_C_FinishTimeAttackMission::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_FinishTimeAttackMission, K2Node_DynamicCast_AsBPI_Game_Mode) == 0x000020, "Member 'BPL_EventScript_C_FinishTimeAttackMission::K2Node_DynamicCast_AsBPI_Game_Mode' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_FinishTimeAttackMission, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPL_EventScript_C_FinishTimeAttackMission::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_FinishTimeAttackMission, CallFunc_ApplyMissionMapBGM_dummy) == 0x000031, "Member 'BPL_EventScript_C_FinishTimeAttackMission::CallFunc_ApplyMissionMapBGM_dummy' has a wrong offset!");

// Function BPL_EventScript.BPL_EventScript_C.BPL_CheckRemoteDevil
// 0x0010 (0x0010 - 0x0000)
struct BPL_EventScript_C_BPL_CheckRemoteDevil final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlaying;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPL_EventScript_C_BPL_CheckRemoteDevil) == 0x000008, "Wrong alignment on BPL_EventScript_C_BPL_CheckRemoteDevil");
static_assert(sizeof(BPL_EventScript_C_BPL_CheckRemoteDevil) == 0x000010, "Wrong size on BPL_EventScript_C_BPL_CheckRemoteDevil");
static_assert(offsetof(BPL_EventScript_C_BPL_CheckRemoteDevil, __WorldContext) == 0x000000, "Member 'BPL_EventScript_C_BPL_CheckRemoteDevil::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_CheckRemoteDevil, IsPlaying) == 0x000008, "Member 'BPL_EventScript_C_BPL_CheckRemoteDevil::IsPlaying' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_CheckRemoteDevil, CallFunc_CheckEventFlag_ReturnValue) == 0x000009, "Member 'BPL_EventScript_C_BPL_CheckRemoteDevil::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");

// Function BPL_EventScript.BPL_EventScript_C.BPL_IsAllBossRushClear_OriginalMode
// 0x00E8 (0x00E8 - 0x0000)
struct BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsClear;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 L_EncountIDs;                                      // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAlreadyClearBossRushAll_OriginalMode_ReturnValue; // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBossRushTalk_Struct                   CallFunc_GetDataTableRowFromName_OutRow;           // 0x0050(0x0090)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode) == 0x000008, "Wrong alignment on BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode");
static_assert(sizeof(BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode) == 0x0000E8, "Wrong size on BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode, __WorldContext) == 0x000000, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode, IsClear) == 0x000008, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode::IsClear' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode, L_EncountIDs) == 0x000010, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode::L_EncountIDs' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode, CallFunc_IsAlreadyClearBossRushAll_OriginalMode_ReturnValue) == 0x000024, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode::CallFunc_IsAlreadyClearBossRushAll_OriginalMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000030, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode, CallFunc_Array_Get_Item) == 0x000044, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode, CallFunc_GetDataTableRowFromName_OutRow) == 0x000050, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000E0, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode, CallFunc_Array_Add_ReturnValue) == 0x0000E4, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_OriginalMode::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BPL_EventScript.BPL_EventScript_C.BPL_IsAllBossRushClear_ChallengeMode
// 0x00E8 (0x00E8 - 0x0000)
struct BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsClear;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           L_FlagNames;                                       // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAlreadyClearBossRushAll_ChallengeMode_ReturnValue; // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBossRushTalk_Struct                   CallFunc_GetDataTableRowFromName_OutRow;           // 0x0050(0x0090)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode) == 0x000008, "Wrong alignment on BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode");
static_assert(sizeof(BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode) == 0x0000E8, "Wrong size on BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode, __WorldContext) == 0x000000, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode, IsClear) == 0x000008, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode::IsClear' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode, L_FlagNames) == 0x000010, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode::L_FlagNames' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode, CallFunc_IsAlreadyClearBossRushAll_ChallengeMode_ReturnValue) == 0x00002C, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode::CallFunc_IsAlreadyClearBossRushAll_ChallengeMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000030, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode, CallFunc_Array_Get_Item) == 0x000044, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode, CallFunc_GetDataTableRowFromName_OutRow) == 0x000050, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000E0, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode, CallFunc_Array_Add_ReturnValue) == 0x0000E4, "Member 'BPL_EventScript_C_BPL_IsAllBossRushClear_ChallengeMode::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BPL_EventScript.BPL_EventScript_C.BPL_CountClearedBossRush_OriginalMode
// 0x00F0 (0x00F0 - 0x0000)
struct BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ClearedCount;                                      // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 L_EncountIDs;                                      // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountAlreadyClearBossRush_OriginalMode_ReturnValue; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0030(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBossRushTalk_Struct                   CallFunc_GetDataTableRowFromName_OutRow;           // 0x0050(0x0090)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode) == 0x000008, "Wrong alignment on BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode");
static_assert(sizeof(BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode) == 0x0000F0, "Wrong size on BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode");
static_assert(offsetof(BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode, __WorldContext) == 0x000000, "Member 'BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode, ClearedCount) == 0x000008, "Member 'BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode::ClearedCount' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode, L_EncountIDs) == 0x000010, "Member 'BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode::L_EncountIDs' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode, CallFunc_CountAlreadyClearBossRush_OriginalMode_ReturnValue) == 0x000024, "Member 'BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode::CallFunc_CountAlreadyClearBossRush_OriginalMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000030, "Member 'BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode, CallFunc_Array_Get_Item) == 0x000040, "Member 'BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode, CallFunc_GetDataTableRowFromName_OutRow) == 0x000050, "Member 'BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000E0, "Member 'BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode, CallFunc_Less_IntInt_ReturnValue) == 0x0000E1, "Member 'BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode, CallFunc_Add_IntInt_ReturnValue) == 0x0000E4, "Member 'BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode, CallFunc_Array_Add_ReturnValue) == 0x0000E8, "Member 'BPL_EventScript_C_BPL_CountClearedBossRush_OriginalMode::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BPL_EventScript.BPL_EventScript_C.BPL_CountClearedBossRush_ChallengeMode
// 0x00E8 (0x00E8 - 0x0000)
struct BPL_EventScript_C_BPL_CountClearedBossRush_ChallengeMode final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ClearedCount;                                      // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           L_FlagNames;                                       // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountAlreadyClearBossRush_ChallengeMode_ReturnValue; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBossRushTalk_Struct                   CallFunc_GetDataTableRowFromName_OutRow;           // 0x0050(0x0090)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_EventScript_C_BPL_CountClearedBossRush_ChallengeMode) == 0x000008, "Wrong alignment on BPL_EventScript_C_BPL_CountClearedBossRush_ChallengeMode");
static_assert(sizeof(BPL_EventScript_C_BPL_CountClearedBossRush_ChallengeMode) == 0x0000E8, "Wrong size on BPL_EventScript_C_BPL_CountClearedBossRush_ChallengeMode");
static_assert(offsetof(BPL_EventScript_C_BPL_CountClearedBossRush_ChallengeMode, __WorldContext) == 0x000000, "Member 'BPL_EventScript_C_BPL_CountClearedBossRush_ChallengeMode::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_EventScript_C_BPL_CountClearedBossRush_ChallengeMode, ClearedCount) == 0x000008, "Member 'BPL_EventScript_C_BPL_CountClearedBossRush_ChallengeMode::ClearedCount' has a wrong offset!");
