#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTL_LIGHT_PLAY_PARAM

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct BTL_LIGHT_PLAY_PARAM.BTL_LIGHT_PLAY_PARAM
// 0x0078 (0x0078 - 0x0000)
struct FBTL_LIGHT_PLAY_PARAM final
{
public:
	class FString                                 SocketName_5_B0D9AA984CEDB385B69F3DA97CEBBA2E;     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                OffsetPos_9_BC2B93E842F649D214887BB71555BA2C;      // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_493B[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialInterface>      LightFuncMatIndex_43_6DB1467F461AE4F52512D19259D53CE6; // 0x0020(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         GroupID_14_069B27CA4C8FD5AC3199DF8707537E01;       // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCastShadow_17_F77F504D4D6E600C9935E6997A2AAFF2;  // 0x004C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsFollowSocket_19_21F3BDA84F2A6BAF5459CE9261F2FFD8; // 0x004D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_493C[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveLinearColor*                      Color_24_E0236CF84A174635FCEF3CA645067475;         // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Intensity_27_3405AA8447E4DDE89D8557AAE2E28C55;     // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Radius_29_84593E17488F356B3E87BBB3FA19E28C;        // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            FalloffExponent_41_65493A6241E0CAFCC04DB5A316FFA6AE; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideInReflection_35_87AE02AA4FD92D8FAB3676B5A0A419A6; // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HideInAbsorbAndBlock_36_DBA2BC5F41E3C039D35610843161D63A; // 0x0071(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsCharaOnly_38_FE06A202495562DAFB735D8B21A7F6F2;   // 0x0072(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FBTL_LIGHT_PLAY_PARAM) == 0x000008, "Wrong alignment on FBTL_LIGHT_PLAY_PARAM");
static_assert(sizeof(FBTL_LIGHT_PLAY_PARAM) == 0x000078, "Wrong size on FBTL_LIGHT_PLAY_PARAM");
static_assert(offsetof(FBTL_LIGHT_PLAY_PARAM, SocketName_5_B0D9AA984CEDB385B69F3DA97CEBBA2E) == 0x000000, "Member 'FBTL_LIGHT_PLAY_PARAM::SocketName_5_B0D9AA984CEDB385B69F3DA97CEBBA2E' has a wrong offset!");
static_assert(offsetof(FBTL_LIGHT_PLAY_PARAM, OffsetPos_9_BC2B93E842F649D214887BB71555BA2C) == 0x000010, "Member 'FBTL_LIGHT_PLAY_PARAM::OffsetPos_9_BC2B93E842F649D214887BB71555BA2C' has a wrong offset!");
static_assert(offsetof(FBTL_LIGHT_PLAY_PARAM, LightFuncMatIndex_43_6DB1467F461AE4F52512D19259D53CE6) == 0x000020, "Member 'FBTL_LIGHT_PLAY_PARAM::LightFuncMatIndex_43_6DB1467F461AE4F52512D19259D53CE6' has a wrong offset!");
static_assert(offsetof(FBTL_LIGHT_PLAY_PARAM, GroupID_14_069B27CA4C8FD5AC3199DF8707537E01) == 0x000048, "Member 'FBTL_LIGHT_PLAY_PARAM::GroupID_14_069B27CA4C8FD5AC3199DF8707537E01' has a wrong offset!");
static_assert(offsetof(FBTL_LIGHT_PLAY_PARAM, IsCastShadow_17_F77F504D4D6E600C9935E6997A2AAFF2) == 0x00004C, "Member 'FBTL_LIGHT_PLAY_PARAM::IsCastShadow_17_F77F504D4D6E600C9935E6997A2AAFF2' has a wrong offset!");
static_assert(offsetof(FBTL_LIGHT_PLAY_PARAM, IsFollowSocket_19_21F3BDA84F2A6BAF5459CE9261F2FFD8) == 0x00004D, "Member 'FBTL_LIGHT_PLAY_PARAM::IsFollowSocket_19_21F3BDA84F2A6BAF5459CE9261F2FFD8' has a wrong offset!");
static_assert(offsetof(FBTL_LIGHT_PLAY_PARAM, Color_24_E0236CF84A174635FCEF3CA645067475) == 0x000050, "Member 'FBTL_LIGHT_PLAY_PARAM::Color_24_E0236CF84A174635FCEF3CA645067475' has a wrong offset!");
static_assert(offsetof(FBTL_LIGHT_PLAY_PARAM, Intensity_27_3405AA8447E4DDE89D8557AAE2E28C55) == 0x000058, "Member 'FBTL_LIGHT_PLAY_PARAM::Intensity_27_3405AA8447E4DDE89D8557AAE2E28C55' has a wrong offset!");
static_assert(offsetof(FBTL_LIGHT_PLAY_PARAM, Radius_29_84593E17488F356B3E87BBB3FA19E28C) == 0x000060, "Member 'FBTL_LIGHT_PLAY_PARAM::Radius_29_84593E17488F356B3E87BBB3FA19E28C' has a wrong offset!");
static_assert(offsetof(FBTL_LIGHT_PLAY_PARAM, FalloffExponent_41_65493A6241E0CAFCC04DB5A316FFA6AE) == 0x000068, "Member 'FBTL_LIGHT_PLAY_PARAM::FalloffExponent_41_65493A6241E0CAFCC04DB5A316FFA6AE' has a wrong offset!");
static_assert(offsetof(FBTL_LIGHT_PLAY_PARAM, HideInReflection_35_87AE02AA4FD92D8FAB3676B5A0A419A6) == 0x000070, "Member 'FBTL_LIGHT_PLAY_PARAM::HideInReflection_35_87AE02AA4FD92D8FAB3676B5A0A419A6' has a wrong offset!");
static_assert(offsetof(FBTL_LIGHT_PLAY_PARAM, HideInAbsorbAndBlock_36_DBA2BC5F41E3C039D35610843161D63A) == 0x000071, "Member 'FBTL_LIGHT_PLAY_PARAM::HideInAbsorbAndBlock_36_DBA2BC5F41E3C039D35610843161D63A' has a wrong offset!");
static_assert(offsetof(FBTL_LIGHT_PLAY_PARAM, IsCharaOnly_38_FE06A202495562DAFB735D8B21A7F6F2) == 0x000072, "Member 'FBTL_LIGHT_PLAY_PARAM::IsCharaOnly_38_FE06A202495562DAFB735D8B21A7F6F2' has a wrong offset!");

}

