#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTL_TASK_RECEIVED_STREAM_DATA

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK
{

// UserDefinedStruct BTL_TASK_RECEIVED_STREAM_DATA.BTL_TASK_RECEIVED_STREAM_DATA
// 0x0068 (0x0068 - 0x0000)
struct FBTL_TASK_RECEIVED_STREAM_DATA final
{
public:
	E_BTL_TASK_COM                                Command_3_E9153AEF4EE07C5F2A0064BFA00F10F2;        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PecID_11_14961C1A49CE8619137A40B1CBF42CE8;         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlTaskData                           Stream_12_4BFDC01444C7AB1B304DB3A669FA3749;        // 0x0008(0x0030)(Edit, BlueprintVisible)
	struct FBtlTaskData                           Stream2_15_00E3149D4E7412469DB049AE9783D605;       // 0x0038(0x0030)(Edit, BlueprintVisible)
};
static_assert(alignof(FBTL_TASK_RECEIVED_STREAM_DATA) == 0x000008, "Wrong alignment on FBTL_TASK_RECEIVED_STREAM_DATA");
static_assert(sizeof(FBTL_TASK_RECEIVED_STREAM_DATA) == 0x000068, "Wrong size on FBTL_TASK_RECEIVED_STREAM_DATA");
static_assert(offsetof(FBTL_TASK_RECEIVED_STREAM_DATA, Command_3_E9153AEF4EE07C5F2A0064BFA00F10F2) == 0x000000, "Member 'FBTL_TASK_RECEIVED_STREAM_DATA::Command_3_E9153AEF4EE07C5F2A0064BFA00F10F2' has a wrong offset!");
static_assert(offsetof(FBTL_TASK_RECEIVED_STREAM_DATA, PecID_11_14961C1A49CE8619137A40B1CBF42CE8) == 0x000004, "Member 'FBTL_TASK_RECEIVED_STREAM_DATA::PecID_11_14961C1A49CE8619137A40B1CBF42CE8' has a wrong offset!");
static_assert(offsetof(FBTL_TASK_RECEIVED_STREAM_DATA, Stream_12_4BFDC01444C7AB1B304DB3A669FA3749) == 0x000008, "Member 'FBTL_TASK_RECEIVED_STREAM_DATA::Stream_12_4BFDC01444C7AB1B304DB3A669FA3749' has a wrong offset!");
static_assert(offsetof(FBTL_TASK_RECEIVED_STREAM_DATA, Stream2_15_00E3149D4E7412469DB049AE9783D605) == 0x000038, "Member 'FBTL_TASK_RECEIVED_STREAM_DATA::Stream2_15_00E3149D4E7412469DB049AE9783D605' has a wrong offset!");

}

