#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTL_ADD_DECAL_TASK_OBJ

#include "Basic.hpp"

#include "BTL_ADD_DECAL_TASK_DATA_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTL_ADD_DECAL_TASK_OBJ.BTL_ADD_DECAL_TASK_OBJ_C
// 0x0058 (0x0278 - 0x0220)
class ABTL_ADD_DECAL_TASK_OBJ_C final : public AActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FBTL_ADD_DECAL_TASK_DATA               DecalTaskData;                                     // 0x0228(0x0040)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<int32>                                 DecalAttackEffectID;                               // 0x0268(0x0010)(Edit, BlueprintVisible)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTL_ADD_DECAL_TASK_OBJ_C">();
	}
	static class ABTL_ADD_DECAL_TASK_OBJ_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABTL_ADD_DECAL_TASK_OBJ_C>();
	}
};
static_assert(alignof(ABTL_ADD_DECAL_TASK_OBJ_C) == 0x000008, "Wrong alignment on ABTL_ADD_DECAL_TASK_OBJ_C");
static_assert(sizeof(ABTL_ADD_DECAL_TASK_OBJ_C) == 0x000278, "Wrong size on ABTL_ADD_DECAL_TASK_OBJ_C");
static_assert(offsetof(ABTL_ADD_DECAL_TASK_OBJ_C, DefaultSceneRoot) == 0x000220, "Member 'ABTL_ADD_DECAL_TASK_OBJ_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABTL_ADD_DECAL_TASK_OBJ_C, DecalTaskData) == 0x000228, "Member 'ABTL_ADD_DECAL_TASK_OBJ_C::DecalTaskData' has a wrong offset!");
static_assert(offsetof(ABTL_ADD_DECAL_TASK_OBJ_C, DecalAttackEffectID) == 0x000268, "Member 'ABTL_ADD_DECAL_TASK_OBJ_C::DecalAttackEffectID' has a wrong offset!");

}

