#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTL_CURSOR_MEMORY_T

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK
{

// UserDefinedStruct BTL_CURSOR_MEMORY_T.BTL_CURSOR_MEMORY_T
// 0x000C (0x000C - 0x0000)
struct FBTL_CURSOR_MEMORY_T final
{
public:
	E_BTL_UI_COMMAND                              Command_2_BC58054944575C313E32E3A2679D77CE;        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A30[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CursorIndex_6_8CB5330E42A511DF6FFA47B1DFC43688;    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UsedItemID_9_5B8D84D349FE8684257866B3AAF25A4B;     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FBTL_CURSOR_MEMORY_T) == 0x000004, "Wrong alignment on FBTL_CURSOR_MEMORY_T");
static_assert(sizeof(FBTL_CURSOR_MEMORY_T) == 0x00000C, "Wrong size on FBTL_CURSOR_MEMORY_T");
static_assert(offsetof(FBTL_CURSOR_MEMORY_T, Command_2_BC58054944575C313E32E3A2679D77CE) == 0x000000, "Member 'FBTL_CURSOR_MEMORY_T::Command_2_BC58054944575C313E32E3A2679D77CE' has a wrong offset!");
static_assert(offsetof(FBTL_CURSOR_MEMORY_T, CursorIndex_6_8CB5330E42A511DF6FFA47B1DFC43688) == 0x000004, "Member 'FBTL_CURSOR_MEMORY_T::CursorIndex_6_8CB5330E42A511DF6FFA47B1DFC43688' has a wrong offset!");
static_assert(offsetof(FBTL_CURSOR_MEMORY_T, UsedItemID_9_5B8D84D349FE8684257866B3AAF25A4B) == 0x000008, "Member 'FBTL_CURSOR_MEMORY_T::UsedItemID_9_5B8D84D349FE8684257866B3AAF25A4B' has a wrong offset!");

}

