#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTL_ADD_PLAY_EFFECT_TASK_DATA

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct BTL_ADD_PLAY_EFFECT_TASK_DATA.BTL_ADD_PLAY_EFFECT_TASK_DATA
// 0x0038 (0x0038 - 0x0000)
struct FBTL_ADD_PLAY_EFFECT_TASK_DATA final
{
public:
	class UParticleSystem*                        ParticleData_5_0A67A616433B1B440EAEDCA94708848D;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          ModSkeletal_7_C4135BED40B99CABDA93C38FA118DA6C;    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ModAnim_9_D7B8282A4E3E88A32F95FF81172D8C28;        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ModSocketName_11_B731042345ACC4979F778CAA54ABB9D5; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPairTargetLocationOverride_13_076C43CB45862E9C2E0B5FADCA2C1A4B; // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B7[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PairTargetLocation_16_6B5FD35449230E2E77558DAA95466C0E; // 0x0024(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsIgnoreSideScale_18_CA41C0404E4AF709E11CD5B9D13ED4C2; // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FBTL_ADD_PLAY_EFFECT_TASK_DATA) == 0x000008, "Wrong alignment on FBTL_ADD_PLAY_EFFECT_TASK_DATA");
static_assert(sizeof(FBTL_ADD_PLAY_EFFECT_TASK_DATA) == 0x000038, "Wrong size on FBTL_ADD_PLAY_EFFECT_TASK_DATA");
static_assert(offsetof(FBTL_ADD_PLAY_EFFECT_TASK_DATA, ParticleData_5_0A67A616433B1B440EAEDCA94708848D) == 0x000000, "Member 'FBTL_ADD_PLAY_EFFECT_TASK_DATA::ParticleData_5_0A67A616433B1B440EAEDCA94708848D' has a wrong offset!");
static_assert(offsetof(FBTL_ADD_PLAY_EFFECT_TASK_DATA, ModSkeletal_7_C4135BED40B99CABDA93C38FA118DA6C) == 0x000008, "Member 'FBTL_ADD_PLAY_EFFECT_TASK_DATA::ModSkeletal_7_C4135BED40B99CABDA93C38FA118DA6C' has a wrong offset!");
static_assert(offsetof(FBTL_ADD_PLAY_EFFECT_TASK_DATA, ModAnim_9_D7B8282A4E3E88A32F95FF81172D8C28) == 0x000010, "Member 'FBTL_ADD_PLAY_EFFECT_TASK_DATA::ModAnim_9_D7B8282A4E3E88A32F95FF81172D8C28' has a wrong offset!");
static_assert(offsetof(FBTL_ADD_PLAY_EFFECT_TASK_DATA, ModSocketName_11_B731042345ACC4979F778CAA54ABB9D5) == 0x000018, "Member 'FBTL_ADD_PLAY_EFFECT_TASK_DATA::ModSocketName_11_B731042345ACC4979F778CAA54ABB9D5' has a wrong offset!");
static_assert(offsetof(FBTL_ADD_PLAY_EFFECT_TASK_DATA, IsPairTargetLocationOverride_13_076C43CB45862E9C2E0B5FADCA2C1A4B) == 0x000020, "Member 'FBTL_ADD_PLAY_EFFECT_TASK_DATA::IsPairTargetLocationOverride_13_076C43CB45862E9C2E0B5FADCA2C1A4B' has a wrong offset!");
static_assert(offsetof(FBTL_ADD_PLAY_EFFECT_TASK_DATA, PairTargetLocation_16_6B5FD35449230E2E77558DAA95466C0E) == 0x000024, "Member 'FBTL_ADD_PLAY_EFFECT_TASK_DATA::PairTargetLocation_16_6B5FD35449230E2E77558DAA95466C0E' has a wrong offset!");
static_assert(offsetof(FBTL_ADD_PLAY_EFFECT_TASK_DATA, IsIgnoreSideScale_18_CA41C0404E4AF709E11CD5B9D13ED4C2) == 0x000030, "Member 'FBTL_ADD_PLAY_EFFECT_TASK_DATA::IsIgnoreSideScale_18_CA41C0404E4AF709E11CD5B9D13ED4C2' has a wrong offset!");

}

