#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BtlUISkill_UseData_st

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct BtlUISkill_UseData_st.BtlUISkill_UseData_st
// 0x0018 (0x0018 - 0x0000)
struct FBtlUISkill_UseData_st final
{
public:
	int32                                         SkillId_4_2660CBC34242F5197D52089823DA3FE7;        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          M_IsUsed_1_6572B94D4B06369E7695CABCB0163B8A;       // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          M_IsCritical_6_A51153FB42993AEAA258249B1E3F532B;   // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A2E[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         M_Cost_9_B12A0B384AF7EF664CC70493A3431C3A;         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          M_IsStanTarget_12_B1DD6E3B454C531BE00123B9AE01F8A2; // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A2F[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         M_SkillAptitude_15_95DBAFA34FAC8D1EEB4C8B984B13A78A; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          M_IsCostOK_17_BBB165FF449EBAED4CE9AC9921AD18EB;    // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          M_IsNotEnoughMember_19_11A81E0A40AB53EBD53B06BC80AD543E; // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FBtlUISkill_UseData_st) == 0x000004, "Wrong alignment on FBtlUISkill_UseData_st");
static_assert(sizeof(FBtlUISkill_UseData_st) == 0x000018, "Wrong size on FBtlUISkill_UseData_st");
static_assert(offsetof(FBtlUISkill_UseData_st, SkillId_4_2660CBC34242F5197D52089823DA3FE7) == 0x000000, "Member 'FBtlUISkill_UseData_st::SkillId_4_2660CBC34242F5197D52089823DA3FE7' has a wrong offset!");
static_assert(offsetof(FBtlUISkill_UseData_st, M_IsUsed_1_6572B94D4B06369E7695CABCB0163B8A) == 0x000004, "Member 'FBtlUISkill_UseData_st::M_IsUsed_1_6572B94D4B06369E7695CABCB0163B8A' has a wrong offset!");
static_assert(offsetof(FBtlUISkill_UseData_st, M_IsCritical_6_A51153FB42993AEAA258249B1E3F532B) == 0x000005, "Member 'FBtlUISkill_UseData_st::M_IsCritical_6_A51153FB42993AEAA258249B1E3F532B' has a wrong offset!");
static_assert(offsetof(FBtlUISkill_UseData_st, M_Cost_9_B12A0B384AF7EF664CC70493A3431C3A) == 0x000008, "Member 'FBtlUISkill_UseData_st::M_Cost_9_B12A0B384AF7EF664CC70493A3431C3A' has a wrong offset!");
static_assert(offsetof(FBtlUISkill_UseData_st, M_IsStanTarget_12_B1DD6E3B454C531BE00123B9AE01F8A2) == 0x00000C, "Member 'FBtlUISkill_UseData_st::M_IsStanTarget_12_B1DD6E3B454C531BE00123B9AE01F8A2' has a wrong offset!");
static_assert(offsetof(FBtlUISkill_UseData_st, M_SkillAptitude_15_95DBAFA34FAC8D1EEB4C8B984B13A78A) == 0x000010, "Member 'FBtlUISkill_UseData_st::M_SkillAptitude_15_95DBAFA34FAC8D1EEB4C8B984B13A78A' has a wrong offset!");
static_assert(offsetof(FBtlUISkill_UseData_st, M_IsCostOK_17_BBB165FF449EBAED4CE9AC9921AD18EB) == 0x000014, "Member 'FBtlUISkill_UseData_st::M_IsCostOK_17_BBB165FF449EBAED4CE9AC9921AD18EB' has a wrong offset!");
static_assert(offsetof(FBtlUISkill_UseData_st, M_IsNotEnoughMember_19_11A81E0A40AB53EBD53B06BC80AD543E) == 0x000015, "Member 'FBtlUISkill_UseData_st::M_IsNotEnoughMember_19_11A81E0A40AB53EBD53B06BC80AD543E' has a wrong offset!");

}

