#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharaSmearFrameComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CharaSmearFrameComponent.CharaSmearFrameComponent_C.ExecuteUbergraph_CharaSmearFrameComponent
// 0x00A8 (0x00A8 - 0x0000)
struct CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCurrentPosition_ReturnValue;           // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCurrentPosition_ReturnValue_1;         // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCurrentPosition_ReturnValue_2;         // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent) == 0x000008, "Wrong alignment on CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent");
static_assert(sizeof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent) == 0x0000A8, "Wrong size on CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, EntryPoint) == 0x000000, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, CallFunc_GetCurrentPosition_ReturnValue) == 0x000004, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::CallFunc_GetCurrentPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, Temp_int_Variable) == 0x000010, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, Temp_int_Variable_1) == 0x000014, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000020, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000024, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000030, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, CallFunc_VSizeSquared_ReturnValue) == 0x000034, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000038, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, CallFunc_Array_Get_Item) == 0x000040, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, CallFunc_Less_IntInt_ReturnValue_1) == 0x00005C, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000060, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000070, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, K2Node_Event_DeltaSeconds) == 0x000074, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000078, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00007C, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, CallFunc_GetCurrentPosition_ReturnValue_1) == 0x000088, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::CallFunc_GetCurrentPosition_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, CallFunc_Array_Length_ReturnValue_2) == 0x000094, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, CallFunc_Greater_IntInt_ReturnValue) == 0x000098, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent, CallFunc_GetCurrentPosition_ReturnValue_2) == 0x00009C, "Member 'CharaSmearFrameComponent_C_ExecuteUbergraph_CharaSmearFrameComponent::CallFunc_GetCurrentPosition_ReturnValue_2' has a wrong offset!");

// Function CharaSmearFrameComponent.CharaSmearFrameComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct CharaSmearFrameComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharaSmearFrameComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on CharaSmearFrameComponent_C_ReceiveTick");
static_assert(sizeof(CharaSmearFrameComponent_C_ReceiveTick) == 0x000004, "Wrong size on CharaSmearFrameComponent_C_ReceiveTick");
static_assert(offsetof(CharaSmearFrameComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'CharaSmearFrameComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function CharaSmearFrameComponent.CharaSmearFrameComponent_C.EnableSmear
// 0x0028 (0x0028 - 0x0000)
struct CharaSmearFrameComponent_C_EnableSmear final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCurrentPosition_ReturnValue;           // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharaSmearFrameComponent_C_EnableSmear) == 0x000008, "Wrong alignment on CharaSmearFrameComponent_C_EnableSmear");
static_assert(sizeof(CharaSmearFrameComponent_C_EnableSmear) == 0x000028, "Wrong size on CharaSmearFrameComponent_C_EnableSmear");
static_assert(offsetof(CharaSmearFrameComponent_C_EnableSmear, Enable) == 0x000000, "Member 'CharaSmearFrameComponent_C_EnableSmear::Enable' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_EnableSmear, Temp_int_Variable) == 0x000004, "Member 'CharaSmearFrameComponent_C_EnableSmear::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_EnableSmear, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'CharaSmearFrameComponent_C_EnableSmear::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_EnableSmear, CallFunc_GetCurrentPosition_ReturnValue) == 0x00000C, "Member 'CharaSmearFrameComponent_C_EnableSmear::CallFunc_GetCurrentPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_EnableSmear, CallFunc_Array_Get_Item) == 0x000018, "Member 'CharaSmearFrameComponent_C_EnableSmear::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_EnableSmear, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'CharaSmearFrameComponent_C_EnableSmear::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_EnableSmear, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'CharaSmearFrameComponent_C_EnableSmear::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function CharaSmearFrameComponent.CharaSmearFrameComponent_C.SetDMI
// 0x0010 (0x0010 - 0x0000)
struct CharaSmearFrameComponent_C_SetDMI final
{
public:
	TArray<class UMaterialInstanceDynamic*>       DMI;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CharaSmearFrameComponent_C_SetDMI) == 0x000008, "Wrong alignment on CharaSmearFrameComponent_C_SetDMI");
static_assert(sizeof(CharaSmearFrameComponent_C_SetDMI) == 0x000010, "Wrong size on CharaSmearFrameComponent_C_SetDMI");
static_assert(offsetof(CharaSmearFrameComponent_C_SetDMI, DMI) == 0x000000, "Member 'CharaSmearFrameComponent_C_SetDMI::DMI' has a wrong offset!");

// Function CharaSmearFrameComponent.CharaSmearFrameComponent_C.GetCurrentPosition
// 0x0030 (0x0030 - 0x0000)
struct CharaSmearFrameComponent_C_GetCurrentPosition final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharaSmearFrameComponent_C_GetCurrentPosition) == 0x000008, "Wrong alignment on CharaSmearFrameComponent_C_GetCurrentPosition");
static_assert(sizeof(CharaSmearFrameComponent_C_GetCurrentPosition) == 0x000030, "Wrong size on CharaSmearFrameComponent_C_GetCurrentPosition");
static_assert(offsetof(CharaSmearFrameComponent_C_GetCurrentPosition, ReturnValue) == 0x000000, "Member 'CharaSmearFrameComponent_C_GetCurrentPosition::ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_GetCurrentPosition, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'CharaSmearFrameComponent_C_GetCurrentPosition::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_GetCurrentPosition, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'CharaSmearFrameComponent_C_GetCurrentPosition::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaSmearFrameComponent_C_GetCurrentPosition, CallFunc_GetSocketLocation_ReturnValue) == 0x000020, "Member 'CharaSmearFrameComponent_C_GetCurrentPosition::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");

}

