#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharaFloatingComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CharaFloatingComponent.CharaFloatingComponent_C.Update
// 0x0060 (0x0060 - 0x0000)
struct CharaFloatingComponent_C_Update final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27AF[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkinnedMeshComponent*                  Mesh;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IKEnable;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27B0[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IKPerch;                                           // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WatchOnesStep;                                     // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27B1[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                GazePoint;                                         // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GazePointEnable;                                   // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27B2[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Offset;                                            // 0x002C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DeltaRotation;                                     // 0x0038(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_UpdateFloatingRotation_DeltaRotation;     // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_UpdateFloatingLocation_Offset;            // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharaFloatingComponent_C_Update) == 0x000008, "Wrong alignment on CharaFloatingComponent_C_Update");
static_assert(sizeof(CharaFloatingComponent_C_Update) == 0x000060, "Wrong size on CharaFloatingComponent_C_Update");
static_assert(offsetof(CharaFloatingComponent_C_Update, DeltaTime) == 0x000000, "Member 'CharaFloatingComponent_C_Update::DeltaTime' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_Update, Mesh) == 0x000008, "Member 'CharaFloatingComponent_C_Update::Mesh' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_Update, IKEnable) == 0x000010, "Member 'CharaFloatingComponent_C_Update::IKEnable' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_Update, IKPerch) == 0x000014, "Member 'CharaFloatingComponent_C_Update::IKPerch' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_Update, WatchOnesStep) == 0x000018, "Member 'CharaFloatingComponent_C_Update::WatchOnesStep' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_Update, GazePoint) == 0x00001C, "Member 'CharaFloatingComponent_C_Update::GazePoint' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_Update, GazePointEnable) == 0x000028, "Member 'CharaFloatingComponent_C_Update::GazePointEnable' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_Update, Offset) == 0x00002C, "Member 'CharaFloatingComponent_C_Update::Offset' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_Update, DeltaRotation) == 0x000038, "Member 'CharaFloatingComponent_C_Update::DeltaRotation' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_Update, CallFunc_UpdateFloatingRotation_DeltaRotation) == 0x000044, "Member 'CharaFloatingComponent_C_Update::CallFunc_UpdateFloatingRotation_DeltaRotation' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_Update, CallFunc_UpdateFloatingLocation_Offset) == 0x000050, "Member 'CharaFloatingComponent_C_Update::CallFunc_UpdateFloatingLocation_Offset' has a wrong offset!");

// Function CharaFloatingComponent.CharaFloatingComponent_C.UpdateFloatingRotation
// 0x0330 (0x0330 - 0x0000)
struct CharaFloatingComponent_C_UpdateFloatingRotation final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27B3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkinnedMeshComponent*                  Mesh;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IKEnable;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27B4[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IKPerch;                                           // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WatchOnesStep;                                     // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27B5[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                GazePoint;                                         // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GazePointEnable;                                   // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27B6[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               DeltaRotation;                                     // 0x002C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               RotationTarget;                                    // 0x0038(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                NormalAfter;                                       // 0x0044(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalBefore;                                      // 0x0050(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CharacterScale;                                    // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTimeCache;                                    // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               Temp_byte_Variable;                                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27B7[0xB];                                     // 0x0065(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               Temp_byte_Variable_1;                              // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27B8[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMinElement_ReturnValue;                // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27B9[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               K2Node_Select_Default;                             // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27BA[0x3];                                     // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_ModifyRotation_ReturnValue;               // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0150(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x0180(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue_1;          // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27BB[0x8];                                     // 0x0228(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_2;         // 0x0230(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_3;                // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_3;                // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_3;                   // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotation_ReturnValue;                 // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue_2;          // 0x029C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeNormalFromTrianglePoints_ReturnValue; // 0x02A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TraceGround_Hit;                          // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27BC[0x3];                                     // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_TraceGround_Location;                     // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TraceGround_Normal;                       // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_TraceGround_Surface;                      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TraceGround_Hit_1;                        // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27BD[0x2];                                     // 0x02DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_TraceGround_Location_1;                   // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TraceGround_Normal_1;                     // 0x02E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_TraceGround_Surface_1;                    // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TraceGround_Hit_2;                        // 0x02F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27BE[0x2];                                     // 0x02F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_TraceGround_Location_2;                   // 0x02F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TraceGround_Normal_2;                     // 0x0304(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_TraceGround_Surface_2;                    // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27BF[0x3];                                     // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeNormalFromTrianglePoints_ReturnValue_1; // 0x0314(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharaFloatingComponent_C_UpdateFloatingRotation) == 0x000010, "Wrong alignment on CharaFloatingComponent_C_UpdateFloatingRotation");
static_assert(sizeof(CharaFloatingComponent_C_UpdateFloatingRotation) == 0x000330, "Wrong size on CharaFloatingComponent_C_UpdateFloatingRotation");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, DeltaTime) == 0x000000, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::DeltaTime' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, Mesh) == 0x000008, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::Mesh' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, IKEnable) == 0x000010, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::IKEnable' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, IKPerch) == 0x000014, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::IKPerch' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, WatchOnesStep) == 0x000018, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::WatchOnesStep' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, GazePoint) == 0x00001C, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::GazePoint' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, GazePointEnable) == 0x000028, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::GazePointEnable' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, DeltaRotation) == 0x00002C, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::DeltaRotation' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, RotationTarget) == 0x000038, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::RotationTarget' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, NormalAfter) == 0x000044, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::NormalAfter' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, NormalBefore) == 0x000050, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::NormalBefore' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CharacterScale) == 0x00005C, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CharacterScale' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, DeltaTimeCache) == 0x000060, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::DeltaTimeCache' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, Temp_byte_Variable) == 0x000064, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000070, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_BreakTransform_Location) == 0x0000A0, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_BreakTransform_Rotation) == 0x0000AC, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_BreakTransform_Scale) == 0x0000B8, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, Temp_byte_Variable_1) == 0x0000C4, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_GetMinElement_ReturnValue) == 0x0000C8, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_GetMinElement_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x0000CC, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, Temp_bool_Variable) == 0x0000D8, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000DC, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_Add_VectorVector_ReturnValue) == 0x0000E8, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000F4, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000100, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, K2Node_Select_Default) == 0x00010C, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_ModifyRotation_ReturnValue) == 0x000110, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_ModifyRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_MakeVector_ReturnValue) == 0x00011C, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_RLerp_ReturnValue) == 0x000128, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_MakeVector_ReturnValue_1) == 0x000134, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_MakeVector_ReturnValue_2) == 0x000140, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00014C, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_GetSocketTransform_ReturnValue) == 0x000150, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_GetSocketTransform_ReturnValue_1) == 0x000180, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_GetSocketTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_BreakTransform_Location_1) == 0x0001B0, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_BreakTransform_Rotation_1) == 0x0001BC, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_BreakTransform_Scale_1) == 0x0001C8, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_BreakTransform_Location_2) == 0x0001D4, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_BreakTransform_Location_2' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_BreakTransform_Rotation_2) == 0x0001E0, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_BreakTransform_Rotation_2' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_BreakTransform_Scale_2) == 0x0001EC, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_BreakTransform_Scale_2' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0001F8, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000204, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_TransformLocation_ReturnValue) == 0x000210, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_TransformLocation_ReturnValue_1) == 0x00021C, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_TransformLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_GetSocketTransform_ReturnValue_2) == 0x000230, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_GetSocketTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_BreakTransform_Location_3) == 0x000260, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_BreakTransform_Location_3' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_BreakTransform_Rotation_3) == 0x00026C, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_BreakTransform_Rotation_3' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_BreakTransform_Scale_3) == 0x000278, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_BreakTransform_Scale_3' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_MakeRotation_ReturnValue) == 0x000284, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_MakeRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_Add_VectorVector_ReturnValue_4) == 0x000290, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_TransformLocation_ReturnValue_2) == 0x00029C, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_TransformLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_MakeNormalFromTrianglePoints_ReturnValue) == 0x0002A8, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_MakeNormalFromTrianglePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0002B4, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0002B8, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_TraceGround_Hit) == 0x0002BC, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_TraceGround_Hit' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_TraceGround_Location) == 0x0002C0, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_TraceGround_Location' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_TraceGround_Normal) == 0x0002CC, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_TraceGround_Normal' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_TraceGround_Surface) == 0x0002D8, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_TraceGround_Surface' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_TraceGround_Hit_1) == 0x0002D9, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_TraceGround_Hit_1' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_TraceGround_Location_1) == 0x0002DC, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_TraceGround_Location_1' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_TraceGround_Normal_1) == 0x0002E8, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_TraceGround_Normal_1' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_TraceGround_Surface_1) == 0x0002F4, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_TraceGround_Surface_1' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_TraceGround_Hit_2) == 0x0002F5, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_TraceGround_Hit_2' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_TraceGround_Location_2) == 0x0002F8, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_TraceGround_Location_2' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_TraceGround_Normal_2) == 0x000304, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_TraceGround_Normal_2' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_TraceGround_Surface_2) == 0x000310, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_TraceGround_Surface_2' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_MakeNormalFromTrianglePoints_ReturnValue_1) == 0x000314, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_MakeNormalFromTrianglePoints_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_SelectFloat_ReturnValue) == 0x000320, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingRotation, CallFunc_RInterpTo_ReturnValue) == 0x000324, "Member 'CharaFloatingComponent_C_UpdateFloatingRotation::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");

// Function CharaFloatingComponent.CharaFloatingComponent_C.UpdateFloatingLocation
// 0x00B0 (0x00B0 - 0x0000)
struct CharaFloatingComponent_C_UpdateFloatingLocation final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkinnedMeshComponent*                  Mesh;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IKEnable;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27C1[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IKPerch;                                           // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset;                                            // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OffsetZCurrent;                                    // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTimeCache;                                    // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27C2[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue;     // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharaFloatingComponent_C_UpdateFloatingLocation) == 0x000010, "Wrong alignment on CharaFloatingComponent_C_UpdateFloatingLocation");
static_assert(sizeof(CharaFloatingComponent_C_UpdateFloatingLocation) == 0x0000B0, "Wrong size on CharaFloatingComponent_C_UpdateFloatingLocation");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingLocation, DeltaTime) == 0x000000, "Member 'CharaFloatingComponent_C_UpdateFloatingLocation::DeltaTime' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingLocation, Mesh) == 0x000008, "Member 'CharaFloatingComponent_C_UpdateFloatingLocation::Mesh' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingLocation, IKEnable) == 0x000010, "Member 'CharaFloatingComponent_C_UpdateFloatingLocation::IKEnable' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingLocation, IKPerch) == 0x000014, "Member 'CharaFloatingComponent_C_UpdateFloatingLocation::IKPerch' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingLocation, Offset) == 0x000018, "Member 'CharaFloatingComponent_C_UpdateFloatingLocation::Offset' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingLocation, OffsetZCurrent) == 0x000024, "Member 'CharaFloatingComponent_C_UpdateFloatingLocation::OffsetZCurrent' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingLocation, DeltaTimeCache) == 0x000028, "Member 'CharaFloatingComponent_C_UpdateFloatingLocation::DeltaTimeCache' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingLocation, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00002C, "Member 'CharaFloatingComponent_C_UpdateFloatingLocation::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingLocation, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000030, "Member 'CharaFloatingComponent_C_UpdateFloatingLocation::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingLocation, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000060, "Member 'CharaFloatingComponent_C_UpdateFloatingLocation::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingLocation, CallFunc_MakeVector_ReturnValue) == 0x000064, "Member 'CharaFloatingComponent_C_UpdateFloatingLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingLocation, CallFunc_MakeVector_ReturnValue_1) == 0x000070, "Member 'CharaFloatingComponent_C_UpdateFloatingLocation::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingLocation, CallFunc_TransformLocation_ReturnValue) == 0x00007C, "Member 'CharaFloatingComponent_C_UpdateFloatingLocation::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingLocation, CallFunc_Less_FloatFloat_ReturnValue) == 0x000088, "Member 'CharaFloatingComponent_C_UpdateFloatingLocation::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingLocation, CallFunc_SelectFloat_ReturnValue) == 0x00008C, "Member 'CharaFloatingComponent_C_UpdateFloatingLocation::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingLocation, CallFunc_SelectFloat_ReturnValue_1) == 0x000090, "Member 'CharaFloatingComponent_C_UpdateFloatingLocation::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingLocation, CallFunc_InverseTransformLocation_ReturnValue) == 0x000094, "Member 'CharaFloatingComponent_C_UpdateFloatingLocation::CallFunc_InverseTransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingLocation, CallFunc_FInterpTo_ReturnValue) == 0x0000A0, "Member 'CharaFloatingComponent_C_UpdateFloatingLocation::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingLocation, CallFunc_BreakVector_X) == 0x0000A4, "Member 'CharaFloatingComponent_C_UpdateFloatingLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingLocation, CallFunc_BreakVector_Y) == 0x0000A8, "Member 'CharaFloatingComponent_C_UpdateFloatingLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(CharaFloatingComponent_C_UpdateFloatingLocation, CallFunc_BreakVector_Z) == 0x0000AC, "Member 'CharaFloatingComponent_C_UpdateFloatingLocation::CallFunc_BreakVector_Z' has a wrong offset!");

// Function CharaFloatingComponent.CharaFloatingComponent_C.ModifyRotation
// 0x05E0 (0x05E0 - 0x0000)
struct CharaFloatingComponent_C_ModifyRotation final
{
public:
	struct FRotator                               Rotation;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27C3[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkinnedMeshComponent*                  Mesh;                                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GazePoint;                                         // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GazePointEnable;                                   // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27C4[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ReturnValue;                                       // 0x0028(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	struct FRotator                               RootRotationTarget;                                // 0x0034(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         AngleHorizontalTarget;                             // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AngleVerticalTarget;                               // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FocalPointLocal;                                   // 0x0048(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GazePointLocal;                                    // 0x0054(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ViewPointLocal;                                    // 0x0060(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C5[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue_1;                      // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C6[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RotatorFromAxisAndAngle_ReturnValue;      // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RotatorFromAxisAndAngle_ReturnValue_1;    // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromAtoB_ReturnValue;              // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_DegAtan2_ReturnValue;                     // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_NegateRotator_ReturnValue;                // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RotatorFromAxisAndAngle_ReturnValue_2;    // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize2D_ReturnValue;                      // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAtan2_ReturnValue_1;                   // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RotatorFromAxisAndAngle_ReturnValue_3;    // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSizeSquared_ReturnValue_1;               // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_2;            // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Sqrt_ReturnValue;                         // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAtan2_ReturnValue_2;                   // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize2D_ReturnValue_1;                    // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue_2;                      // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAtan2_ReturnValue_3;                   // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_DegCos_ReturnValue;                       // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_QuadraticFormula_X0;                      // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_QuadraticFormula_X1;                      // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_QuadraticFormula_ReturnValue;             // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27C7[0x3];                                     // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize2D_ReturnValue_2;                    // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAtan2_ReturnValue_4;                   // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue_3;                      // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
