#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharaBadStatus

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BadStatusParticles_T_structs.hpp"
#include "Engine_structs.hpp"
#include "BadStatusDecal_T_structs.hpp"


namespace SDK::Params
{

// Function CharaBadStatus.CharaBadStatus_C.ExecuteUbergraph_CharaBadStatus
// 0x06E0 (0x06E0 - 0x0000)
struct CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BI_GetBadStatusEffectScale_Scale;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29A3[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_29A4[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_12;                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29A5[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_11;                      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System_1;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29A6[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_10;                      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System_2;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29A7[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_9;                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System_3;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29A8[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_8;                       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_4;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          K2Node_DynamicCast_AsSound_Atom_Cue;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29A9[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_7;                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_5;                            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BAD_STATUS                                  Temp_byte_Variable;                                // 0x0111(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BAD_STATUS                                  Temp_byte_Variable_1;                              // 0x0112(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BAD_STATUS                                  Temp_byte_Variable_2;                              // 0x0113(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29AA[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_6;                       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_6;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System_4;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BAD_STATUS                                  Temp_byte_Variable_3;                              // 0x0131(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29AB[0x6];                                     // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_5;                       // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_7;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System_5;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BAD_STATUS                                  Temp_byte_Variable_4;                              // 0x0151(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29AC[0x6];                                     // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_4;                       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_8;                            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System_6;            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BAD_STATUS                                  Temp_byte_Variable_5;                              // 0x0171(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29AD[0x6];                                     // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_9;                            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System_7;            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BAD_STATUS                                  Temp_byte_Variable_6;                              // 0x0191(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BAD_STATUS                                  Temp_byte_Variable_7;                              // 0x0192(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29AE[0x5];                                     // 0x0193(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_10;                           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance;            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29AF[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_11;                           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System_8;            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29B0[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_12;                           // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System_9;            // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BAD_STATUS                                  Temp_byte_Variable_8;                              // 0x01F1(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BAD_STATUS                                  Temp_byte_Variable_9;                              // 0x01F2(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29B1[0x5];                                     // 0x01F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UParticleSystem>         K2Node_CustomEvent_Asset_10;                       // 0x01F8(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29B2[0x3];                                     // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x0224(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_29B3[0x4];                                     // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UParticleSystem>         K2Node_CustomEvent_Asset_9;                        // 0x0238(0x0028)(HasGetValueTypeHash)
	E_BAD_STATUS                                  K2Node_CustomEvent_BadStatus;                      // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29B4[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UParticleSystem>         K2Node_CustomEvent_Asset_8;                        // 0x0268(0x0028)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29B5[0x6];                                     // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UParticleSystemComponent*         K2Node_CustomEvent_PSComp;                         // 0x0298(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UParticleSystem>         K2Node_CustomEvent_Asset_7;                        // 0x02A0(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_2; // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29B6[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UParticleSystem>         K2Node_CustomEvent_Asset_6;                        // 0x02D0(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_3; // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29B7[0x3];                                     // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x02FC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_29B8[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UParticleSystem>         K2Node_CustomEvent_Asset_5;                        // 0x0310(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_4; // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29B9[0x3];                                     // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasBadStatus_HasBadStatus;                // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29BA[0x7];                                     // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundAtomCue>           K2Node_CustomEvent_Sound;                          // 0x0348(0x0028)(HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0370(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_5; // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29BB[0x3];                                     // 0x037D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_6;            // 0x0380(0x0010)(ZeroConstructor, NoDestructor)
	struct FBadStatusDecal_T                      K2Node_CustomEvent_DecalSetting;                   // 0x0390(0x0058)(ContainsInstancedReference, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetTargetMesh_ParticleSettings;           // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_6; // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29BC[0x3];                                     // 0x03F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x03F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_Event_Accessor;                             // 0x0400(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UDecalComponent*                        CallFunc_SpawnDecalAttached_ReturnValue;           // 0x0410(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_BI_CreateBadStatusPSComp_PSComp;          // 0x0418(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_7;            // 0x0420(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_BI_GetBadStatusEffectScale_Scale_1;       // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29BD[0x4];                                     // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_BI_CreateBadStatusPSComp_PSComp_1;        // 0x0438(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_BI_CreateBadStatusPSComp_PSComp_2;        // 0x0440(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_BI_CreateBadStatusPSComp_PSComp_3;        // 0x0448(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_BI_CreateBadStatusPSComp_PSComp_4;        // 0x0450(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_BI_CreateBadStatusPSComp_PSComp_5;        // 0x0458(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_BI_CreateBadStatusPSComp_PSComp_6;        // 0x0460(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_BI_CreateBadStatusPSComp_PSComp_7;        // 0x0468(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_BI_CreateBadStatusPSComp_PSComp_8;        // 0x0470(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_BI_CreateBadStatusPSComp_PSComp_9;        // 0x0478(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue_1;     // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29BE[0x3];                                     // 0x0489(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_8;            // 0x048C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_29BF[0x4];                                     // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UParticleSystem>         K2Node_CustomEvent_Asset_4;                        // 0x04A0(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_7; // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29C0[0x7];                                     // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UParticleSystem>         K2Node_CustomEvent_Asset_3;                        // 0x04D0(0x0028)(HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Map_Find_Value;                           // 0x04F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_8; // 0x0501(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29C1[0x2];                                     // 0x0502(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_9;            // 0x0504(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_29C2[0x4];                                     // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UParticleSystem>         K2Node_CustomEvent_Asset_2;                        // 0x0518(0x0028)(HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Map_Find_Value_1;                         // 0x0540(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_9; // 0x0549(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29C3[0x6];                                     // 0x054A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UParticleSystem>         K2Node_CustomEvent_Asset_1;                        // 0x0550(0x0028)(HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Map_Find_Value_2;                         // 0x0578(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_10; // 0x0581(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29C4[0x2];                                     // 0x0582(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_10;           // 0x0584(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_29C5[0x4];                                     // 0x0594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Map_Find_Value_3;                         // 0x0598(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29C6[0x7];                                     // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBadStatusDecal_T                      K2Node_CustomEvent_DecalData;                      // 0x05A8(0x0058)(ContainsInstancedReference, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_11;           // 0x0600(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_11; // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29C7[0x7];                                     // 0x0611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetTargetMesh_ParticleSettings_1;         // 0x0618(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0620(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0658(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C8[0x4];                                     // 0x0664(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADevilSpawnDecal_C*                     CallFunc_FinishSpawningActor_ReturnValue;          // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UParticleSystem>         K2Node_CustomEvent_Asset;                          // 0x0670(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_12; // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29C9[0x3];                                     // 0x0699(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_12;           // 0x069C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_29CA[0x4];                                     // 0x06AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Map_Find_Value_4;                         // 0x06B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_4;                   // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29CB[0x7];                                     // 0x06B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               K2Node_CustomEvent_PSystem;                        // 0x06C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UParticleSystemComponent* PSystem)> K2Node_CreateDelegate_OutputDelegate_13;           // 0x06C8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus) == 0x000010, "Wrong alignment on CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus");
static_assert(sizeof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus) == 0x0006E0, "Wrong size on CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, EntryPoint) == 0x000000, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_BI_GetBadStatusEffectScale_Scale) == 0x000004, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_BI_GetBadStatusEffectScale_Scale' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000018, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CreateDelegate_OutputDelegate_2) == 0x000034, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CreateDelegate_OutputDelegate_3) == 0x000044, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_Loaded_12) == 0x000058, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_Loaded_12' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_object_Variable) == 0x000060, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_AsParticle_System) == 0x000068, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_AsParticle_System' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_Loaded_11) == 0x000078, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_Loaded_11' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_object_Variable_1) == 0x000080, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_AsParticle_System_1) == 0x000088, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_AsParticle_System_1' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_Loaded_10) == 0x000098, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_Loaded_10' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_object_Variable_2) == 0x0000A0, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_AsParticle_System_2) == 0x0000A8, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_AsParticle_System_2' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_Loaded_9) == 0x0000B8, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_Loaded_9' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_object_Variable_3) == 0x0000C0, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_AsParticle_System_3) == 0x0000C8, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_AsParticle_System_3' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_bSuccess_3) == 0x0000D0, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_Loaded_8) == 0x0000D8, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_Loaded_8' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_object_Variable_4) == 0x0000E0, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_AsSound_Atom_Cue) == 0x0000E8, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_AsSound_Atom_Cue' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_bSuccess_4) == 0x0000F0, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_Loaded_7) == 0x0000F8, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_Loaded_7' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_object_Variable_5) == 0x000100, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_AsMaterial_Interface) == 0x000108, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_AsMaterial_Interface' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_bSuccess_5) == 0x000110, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_byte_Variable) == 0x000111, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_byte_Variable_1) == 0x000112, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_byte_Variable_2) == 0x000113, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_Loaded_6) == 0x000118, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_Loaded_6' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_object_Variable_6) == 0x000120, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_AsParticle_System_4) == 0x000128, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_AsParticle_System_4' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_bSuccess_6) == 0x000130, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_byte_Variable_3) == 0x000131, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_Loaded_5) == 0x000138, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_Loaded_5' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_object_Variable_7) == 0x000140, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_AsParticle_System_5) == 0x000148, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_AsParticle_System_5' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_bSuccess_7) == 0x000150, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_byte_Variable_4) == 0x000151, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_Loaded_4) == 0x000158, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_Loaded_4' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_object_Variable_8) == 0x000160, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_AsParticle_System_6) == 0x000168, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_AsParticle_System_6' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_bSuccess_8) == 0x000170, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_byte_Variable_5) == 0x000171, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_Loaded_3) == 0x000178, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_object_Variable_9) == 0x000180, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_AsParticle_System_7) == 0x000188, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_AsParticle_System_7' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_bSuccess_9) == 0x000190, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_byte_Variable_6) == 0x000191, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_byte_Variable_7) == 0x000192, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_Loaded_2) == 0x000198, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_object_Variable_10) == 0x0001A0, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_AsMaterial_Instance) == 0x0001A8, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_AsMaterial_Instance' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_bSuccess_10) == 0x0001B0, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_Loaded_1) == 0x0001B8, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_object_Variable_11) == 0x0001C0, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_AsParticle_System_8) == 0x0001C8, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_AsParticle_System_8' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_bSuccess_11) == 0x0001D0, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_Loaded) == 0x0001D8, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_object_Variable_12) == 0x0001E0, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_AsParticle_System_9) == 0x0001E8, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_AsParticle_System_9' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_DynamicCast_bSuccess_12) == 0x0001F0, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_byte_Variable_8) == 0x0001F1, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, Temp_byte_Variable_9) == 0x0001F2, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_Asset_10) == 0x0001F8, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_Asset_10' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000220, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CreateDelegate_OutputDelegate_4) == 0x000224, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_Asset_9) == 0x000238, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_Asset_9' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_BadStatus) == 0x000260, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_BadStatus' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_Asset_8) == 0x000268, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_Asset_8' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_SwitchEnum_CmpSuccess) == 0x000290, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x000291, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_PSComp) == 0x000298, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_PSComp' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_Asset_7) == 0x0002A0, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_Asset_7' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_IsValidSoftObjectReference_ReturnValue_2) == 0x0002C8, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_IsValidSoftObjectReference_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_Asset_6) == 0x0002D0, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_Asset_6' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_IsValidSoftObjectReference_ReturnValue_3) == 0x0002F8, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_IsValidSoftObjectReference_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002FC, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_Asset_5) == 0x000310, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_Asset_5' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_IsValidSoftObjectReference_ReturnValue_4) == 0x000338, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_IsValidSoftObjectReference_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_Event_DeltaSeconds) == 0x00033C, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_HasBadStatus_HasBadStatus) == 0x000340, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_HasBadStatus_HasBadStatus' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_Sound) == 0x000348, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_Sound' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_Location) == 0x000370, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_IsValidSoftObjectReference_ReturnValue_5) == 0x00037C, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_IsValidSoftObjectReference_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CreateDelegate_OutputDelegate_6) == 0x000380, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_DecalSetting) == 0x000390, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_DecalSetting' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_GetTargetMesh_ParticleSettings) == 0x0003E8, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_GetTargetMesh_ParticleSettings' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_IsValidSoftObjectReference_ReturnValue_6) == 0x0003F0, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_IsValidSoftObjectReference_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0003F4, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_Event_Accessor) == 0x000400, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_Event_Accessor' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_SpawnDecalAttached_ReturnValue) == 0x000410, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_SpawnDecalAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_BI_CreateBadStatusPSComp_PSComp) == 0x000418, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_BI_CreateBadStatusPSComp_PSComp' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CreateDelegate_OutputDelegate_7) == 0x000420, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_BI_GetBadStatusEffectScale_Scale_1) == 0x000430, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_BI_GetBadStatusEffectScale_Scale_1' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_BI_CreateBadStatusPSComp_PSComp_1) == 0x000438, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_BI_CreateBadStatusPSComp_PSComp_1' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_BI_CreateBadStatusPSComp_PSComp_2) == 0x000440, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_BI_CreateBadStatusPSComp_PSComp_2' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_BI_CreateBadStatusPSComp_PSComp_3) == 0x000448, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_BI_CreateBadStatusPSComp_PSComp_3' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_BI_CreateBadStatusPSComp_PSComp_4) == 0x000450, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_BI_CreateBadStatusPSComp_PSComp_4' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_BI_CreateBadStatusPSComp_PSComp_5) == 0x000458, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_BI_CreateBadStatusPSComp_PSComp_5' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_BI_CreateBadStatusPSComp_PSComp_6) == 0x000460, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_BI_CreateBadStatusPSComp_PSComp_6' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_BI_CreateBadStatusPSComp_PSComp_7) == 0x000468, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_BI_CreateBadStatusPSComp_PSComp_7' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_BI_CreateBadStatusPSComp_PSComp_8) == 0x000470, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_BI_CreateBadStatusPSComp_PSComp_8' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_BI_CreateBadStatusPSComp_PSComp_9) == 0x000478, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_BI_CreateBadStatusPSComp_PSComp_9' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_Conv_InterfaceToObject_ReturnValue_1) == 0x000480, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_Conv_InterfaceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, CallFunc_IsValid_ReturnValue_1) == 0x000488, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CreateDelegate_OutputDelegate_8) == 0x00048C, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus, K2Node_CustomEvent_Asset_4) == 0x0004A0, "Member 'CharaBadStatus_C_ExecuteUbergraph_CharaBadStatus::K2Node_CustomEvent_Asset_4' has a wrong offset!");
