#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharaBaseLight

#include "Basic.hpp"

#include "E_CHARA_MATERIAL_ANIMATION_SLOT_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_IK_TYPE_LIST_structs.hpp"
#include "Project_structs.hpp"
#include "Engine_structs.hpp"
#include "MaterialAnimSetting_T_structs.hpp"


namespace SDK::Params
{

// Function CharaBaseLight.CharaBaseLight_C.ExecuteUbergraph_CharaBaseLight
// 0x0108 (0x0108 - 0x0000)
struct CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsForceUpdate;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2650[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Teleport)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_ForceDitherOff;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2651[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Speed;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Delay;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2652[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharaLipSync*                          K2Node_Event_PlayLipSync;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsLoop;                               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsReset;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Enable;                               // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2653[0x1];                                     // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2654[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Chara_AnimBP_C>   K2Node_DynamicCast_AsBPI_Chara_Anim_BP;            // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_CHARA_ANIMATION_MODE                        CallFunc_GetAnimationMode_ModeCurrent;             // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CHARA_ANIMATION_MODE                        CallFunc_GetAnimationMode_ModePrevious;            // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2655[0x5];                                     // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Chara_AnimBP_C>   K2Node_DynamicCast_AsBPI_Chara_Anim_BP_1;          // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2656[0x5];                                     // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Chara_AnimBP_C>   K2Node_DynamicCast_AsBPI_Chara_Anim_BP_2;          // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2657[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Chara_AnimBP_C>   K2Node_DynamicCast_AsBPI_Chara_Anim_BP_3;          // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2658[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Chara_AnimBP_C>   K2Node_DynamicCast_AsBPI_Chara_Anim_BP_4;          // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnyMontagePlaying_ReturnValue;          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2659[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_CHARA_MOTION_ID>                     CallFunc_Update_OutputPlayingMotions;              // 0x00C8(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Teleport;                       // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Dither100;                            // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CHARA_MOTION_ID                             CallFunc_GetNowMotionID_retValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_265A[0x6];                                     // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGazeTargetHolder*                      CallFunc_GetGazeTargetHolder_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGazeTarget>           CallFunc_UnregisterGazeTarget_InTarget_CastInput;  // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_Event_IsActive;                             // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Disable;                              // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight) == 0x000008, "Wrong alignment on CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight");
static_assert(sizeof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight) == 0x000108, "Wrong size on CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, EntryPoint) == 0x000000, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_Event_IsForceUpdate) == 0x000004, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_Event_IsForceUpdate' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, Temp_bool_Variable) == 0x000005, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_Event_ForceDitherOff) == 0x000018, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_Event_ForceDitherOff' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_Event_Speed) == 0x00001C, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_Event_Speed' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_Event_Delay) == 0x000020, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_Event_Delay' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_Event_PlayLipSync) == 0x000028, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_Event_PlayLipSync' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_Event_IsLoop) == 0x000030, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_Event_IsLoop' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_Event_IsReset) == 0x000031, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_Event_IsReset' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_Event_Enable) == 0x000032, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_Event_Enable' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, CallFunc_IsValid_ReturnValue) == 0x000033, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, CallFunc_IsValid_ReturnValue_1) == 0x000034, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, CallFunc_IsValid_ReturnValue_2) == 0x000035, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, CallFunc_IsValid_ReturnValue_3) == 0x000036, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_Event_DeltaTime) == 0x00003C, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, CallFunc_GetAnimInstance_ReturnValue) == 0x000040, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, CallFunc_IsValid_ReturnValue_4) == 0x000048, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_DynamicCast_AsBPI_Chara_Anim_BP) == 0x000050, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_DynamicCast_AsBPI_Chara_Anim_BP' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, CallFunc_GetAnimationMode_ModeCurrent) == 0x000061, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::CallFunc_GetAnimationMode_ModeCurrent' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, CallFunc_GetAnimationMode_ModePrevious) == 0x000062, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::CallFunc_GetAnimationMode_ModePrevious' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_DynamicCast_AsBPI_Chara_Anim_BP_1) == 0x000068, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_DynamicCast_AsBPI_Chara_Anim_BP_1' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000079, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00007A, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_DynamicCast_AsBPI_Chara_Anim_BP_2) == 0x000080, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_DynamicCast_AsBPI_Chara_Anim_BP_2' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_DynamicCast_AsBPI_Chara_Anim_BP_3) == 0x000098, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_DynamicCast_AsBPI_Chara_Anim_BP_3' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_DynamicCast_bSuccess_3) == 0x0000A8, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_DynamicCast_AsBPI_Chara_Anim_BP_4) == 0x0000B0, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_DynamicCast_AsBPI_Chara_Anim_BP_4' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_DynamicCast_bSuccess_4) == 0x0000C0, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, CallFunc_IsAnyMontagePlaying_ReturnValue) == 0x0000C1, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::CallFunc_IsAnyMontagePlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, CallFunc_Update_OutputPlayingMotions) == 0x0000C8, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::CallFunc_Update_OutputPlayingMotions' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, CallFunc_IsPlaying_ReturnValue) == 0x0000D8, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_CustomEvent_Teleport) == 0x0000D9, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_CustomEvent_Teleport' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_Select_Default) == 0x0000DA, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_Event_Dither100) == 0x0000DB, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_Event_Dither100' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000DC, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, CallFunc_GetNowMotionID_retValue) == 0x0000E0, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::CallFunc_GetNowMotionID_retValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_Event_EndPlayReason) == 0x0000E1, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, CallFunc_GetGazeTargetHolder_ReturnValue) == 0x0000E8, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::CallFunc_GetGazeTargetHolder_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, CallFunc_UnregisterGazeTarget_InTarget_CastInput) == 0x0000F0, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::CallFunc_UnregisterGazeTarget_InTarget_CastInput' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_Event_IsActive) == 0x000100, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_Event_IsActive' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight, K2Node_Event_Disable) == 0x000101, "Member 'CharaBaseLight_C_ExecuteUbergraph_CharaBaseLight::K2Node_Event_Disable' has a wrong offset!");

// Function CharaBaseLight.CharaBaseLight_C.BI_SetForceUpdateLookAt
// 0x0001 (0x0001 - 0x0000)
struct CharaBaseLight_C_BI_SetForceUpdateLookAt final
{
public:
	bool                                          IsForceUpdate;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharaBaseLight_C_BI_SetForceUpdateLookAt) == 0x000001, "Wrong alignment on CharaBaseLight_C_BI_SetForceUpdateLookAt");
static_assert(sizeof(CharaBaseLight_C_BI_SetForceUpdateLookAt) == 0x000001, "Wrong size on CharaBaseLight_C_BI_SetForceUpdateLookAt");
static_assert(offsetof(CharaBaseLight_C_BI_SetForceUpdateLookAt, IsForceUpdate) == 0x000000, "Member 'CharaBaseLight_C_BI_SetForceUpdateLookAt::IsForceUpdate' has a wrong offset!");

// Function CharaBaseLight.CharaBaseLight_C.BI_ForceDisableLimitLookAt
// 0x0001 (0x0001 - 0x0000)
struct CharaBaseLight_C_BI_ForceDisableLimitLookAt final
{
public:
	bool                                          Disable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharaBaseLight_C_BI_ForceDisableLimitLookAt) == 0x000001, "Wrong alignment on CharaBaseLight_C_BI_ForceDisableLimitLookAt");
static_assert(sizeof(CharaBaseLight_C_BI_ForceDisableLimitLookAt) == 0x000001, "Wrong size on CharaBaseLight_C_BI_ForceDisableLimitLookAt");
static_assert(offsetof(CharaBaseLight_C_BI_ForceDisableLimitLookAt, Disable) == 0x000000, "Member 'CharaBaseLight_C_BI_ForceDisableLimitLookAt::Disable' has a wrong offset!");

// Function CharaBaseLight.CharaBaseLight_C.BI_SetLimitLookAtRange
// 0x0001 (0x0001 - 0x0000)
struct CharaBaseLight_C_BI_SetLimitLookAtRange final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharaBaseLight_C_BI_SetLimitLookAtRange) == 0x000001, "Wrong alignment on CharaBaseLight_C_BI_SetLimitLookAtRange");
static_assert(sizeof(CharaBaseLight_C_BI_SetLimitLookAtRange) == 0x000001, "Wrong size on CharaBaseLight_C_BI_SetLimitLookAtRange");
static_assert(offsetof(CharaBaseLight_C_BI_SetLimitLookAtRange, IsActive) == 0x000000, "Member 'CharaBaseLight_C_BI_SetLimitLookAtRange::IsActive' has a wrong offset!");

// Function CharaBaseLight.CharaBaseLight_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct CharaBaseLight_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharaBaseLight_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on CharaBaseLight_C_ReceiveEndPlay");
static_assert(sizeof(CharaBaseLight_C_ReceiveEndPlay) == 0x000001, "Wrong size on CharaBaseLight_C_ReceiveEndPlay");
static_assert(offsetof(CharaBaseLight_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'CharaBaseLight_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function CharaBaseLight.CharaBaseLight_C.BI_GuestBattleInitialize
// 0x0001 (0x0001 - 0x0000)
struct CharaBaseLight_C_BI_GuestBattleInitialize final
{
public:
	bool                                          Dither100;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharaBaseLight_C_BI_GuestBattleInitialize) == 0x000001, "Wrong alignment on CharaBaseLight_C_BI_GuestBattleInitialize");
static_assert(sizeof(CharaBaseLight_C_BI_GuestBattleInitialize) == 0x000001, "Wrong size on CharaBaseLight_C_BI_GuestBattleInitialize");
static_assert(offsetof(CharaBaseLight_C_BI_GuestBattleInitialize, Dither100) == 0x000000, "Member 'CharaBaseLight_C_BI_GuestBattleInitialize::Dither100' has a wrong offset!");

// Function CharaBaseLight.CharaBaseLight_C.OnTransformUpdatedForIK
// 0x0001 (0x0001 - 0x0000)
struct CharaBaseLight_C_OnTransformUpdatedForIK final
{
public:
	bool                                          Teleport;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharaBaseLight_C_OnTransformUpdatedForIK) == 0x000001, "Wrong alignment on CharaBaseLight_C_OnTransformUpdatedForIK");
static_assert(sizeof(CharaBaseLight_C_OnTransformUpdatedForIK) == 0x000001, "Wrong size on CharaBaseLight_C_OnTransformUpdatedForIK");
static_assert(offsetof(CharaBaseLight_C_OnTransformUpdatedForIK, Teleport) == 0x000000, "Member 'CharaBaseLight_C_OnTransformUpdatedForIK::Teleport' has a wrong offset!");

// Function CharaBaseLight.CharaBaseLight_C.UpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct CharaBaseLight_C_UpdateAnimation final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharaBaseLight_C_UpdateAnimation) == 0x000004, "Wrong alignment on CharaBaseLight_C_UpdateAnimation");
static_assert(sizeof(CharaBaseLight_C_UpdateAnimation) == 0x000004, "Wrong size on CharaBaseLight_C_UpdateAnimation");
static_assert(offsetof(CharaBaseLight_C_UpdateAnimation, DeltaTime) == 0x000000, "Member 'CharaBaseLight_C_UpdateAnimation::DeltaTime' has a wrong offset!");

// Function CharaBaseLight.CharaBaseLight_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct CharaBaseLight_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharaBaseLight_C_ReceiveTick) == 0x000004, "Wrong alignment on CharaBaseLight_C_ReceiveTick");
static_assert(sizeof(CharaBaseLight_C_ReceiveTick) == 0x000004, "Wrong size on CharaBaseLight_C_ReceiveTick");
static_assert(offsetof(CharaBaseLight_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'CharaBaseLight_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function CharaBaseLight.CharaBaseLight_C.BI_SetDevilRootMotion
// 0x0001 (0x0001 - 0x0000)
struct CharaBaseLight_C_BI_SetDevilRootMotion final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharaBaseLight_C_BI_SetDevilRootMotion) == 0x000001, "Wrong alignment on CharaBaseLight_C_BI_SetDevilRootMotion");
static_assert(sizeof(CharaBaseLight_C_BI_SetDevilRootMotion) == 0x000001, "Wrong size on CharaBaseLight_C_BI_SetDevilRootMotion");
static_assert(offsetof(CharaBaseLight_C_BI_SetDevilRootMotion, Enable) == 0x000000, "Member 'CharaBaseLight_C_BI_SetDevilRootMotion::Enable' has a wrong offset!");

// Function CharaBaseLight.CharaBaseLight_C.BI_AdjustMeshScale
// 0x0001 (0x0001 - 0x0000)
struct CharaBaseLight_C_BI_AdjustMeshScale final
{
public:
	bool                                          IsReset;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharaBaseLight_C_BI_AdjustMeshScale) == 0x000001, "Wrong alignment on CharaBaseLight_C_BI_AdjustMeshScale");
static_assert(sizeof(CharaBaseLight_C_BI_AdjustMeshScale) == 0x000001, "Wrong size on CharaBaseLight_C_BI_AdjustMeshScale");
static_assert(offsetof(CharaBaseLight_C_BI_AdjustMeshScale, IsReset) == 0x000000, "Member 'CharaBaseLight_C_BI_AdjustMeshScale::IsReset' has a wrong offset!");

// Function CharaBaseLight.CharaBaseLight_C.PlayLipSync
// 0x0010 (0x0010 - 0x0000)
struct CharaBaseLight_C_PlayLipSync final
{
public:
	class UCharaLipSync*                          Param_PlayLipSync;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoop;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharaBaseLight_C_PlayLipSync) == 0x000008, "Wrong alignment on CharaBaseLight_C_PlayLipSync");
static_assert(sizeof(CharaBaseLight_C_PlayLipSync) == 0x000010, "Wrong size on CharaBaseLight_C_PlayLipSync");
static_assert(offsetof(CharaBaseLight_C_PlayLipSync, Param_PlayLipSync) == 0x000000, "Member 'CharaBaseLight_C_PlayLipSync::Param_PlayLipSync' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_PlayLipSync, IsLoop) == 0x000008, "Member 'CharaBaseLight_C_PlayLipSync::IsLoop' has a wrong offset!");

// Function CharaBaseLight.CharaBaseLight_C.BI_SetLipClearDelay
// 0x0004 (0x0004 - 0x0000)
struct CharaBaseLight_C_BI_SetLipClearDelay final
{
public:
	float                                         Delay;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharaBaseLight_C_BI_SetLipClearDelay) == 0x000004, "Wrong alignment on CharaBaseLight_C_BI_SetLipClearDelay");
static_assert(sizeof(CharaBaseLight_C_BI_SetLipClearDelay) == 0x000004, "Wrong size on CharaBaseLight_C_BI_SetLipClearDelay");
static_assert(offsetof(CharaBaseLight_C_BI_SetLipClearDelay, Delay) == 0x000000, "Member 'CharaBaseLight_C_BI_SetLipClearDelay::Delay' has a wrong offset!");

// Function CharaBaseLight.CharaBaseLight_C.BI_SetHeadIKSpeed
// 0x0004 (0x0004 - 0x0000)
struct CharaBaseLight_C_BI_SetHeadIKSpeed final
{
public:
	float                                         Speed;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharaBaseLight_C_BI_SetHeadIKSpeed) == 0x000004, "Wrong alignment on CharaBaseLight_C_BI_SetHeadIKSpeed");
static_assert(sizeof(CharaBaseLight_C_BI_SetHeadIKSpeed) == 0x000004, "Wrong size on CharaBaseLight_C_BI_SetHeadIKSpeed");
static_assert(offsetof(CharaBaseLight_C_BI_SetHeadIKSpeed, Speed) == 0x000000, "Member 'CharaBaseLight_C_BI_SetHeadIKSpeed::Speed' has a wrong offset!");

// Function CharaBaseLight.CharaBaseLight_C.BI_TempToggleCameraDitherState
// 0x0001 (0x0001 - 0x0000)
struct CharaBaseLight_C_BI_TempToggleCameraDitherState final
{
public:
	bool                                          ForceDitherOff;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharaBaseLight_C_BI_TempToggleCameraDitherState) == 0x000001, "Wrong alignment on CharaBaseLight_C_BI_TempToggleCameraDitherState");
static_assert(sizeof(CharaBaseLight_C_BI_TempToggleCameraDitherState) == 0x000001, "Wrong size on CharaBaseLight_C_BI_TempToggleCameraDitherState");
static_assert(offsetof(CharaBaseLight_C_BI_TempToggleCameraDitherState, ForceDitherOff) == 0x000000, "Member 'CharaBaseLight_C_BI_TempToggleCameraDitherState::ForceDitherOff' has a wrong offset!");

// Function CharaBaseLight.CharaBaseLight_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct CharaBaseLight_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_HasActorBegunPlay_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_265B[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharaBaseLight_C_UserConstructionScript) == 0x000004, "Wrong alignment on CharaBaseLight_C_UserConstructionScript");
static_assert(sizeof(CharaBaseLight_C_UserConstructionScript) == 0x000008, "Wrong size on CharaBaseLight_C_UserConstructionScript");
static_assert(offsetof(CharaBaseLight_C_UserConstructionScript, CallFunc_HasActorBegunPlay_ReturnValue) == 0x000000, "Member 'CharaBaseLight_C_UserConstructionScript::CallFunc_HasActorBegunPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_UserConstructionScript, CallFunc_MakeLiteralInt_ReturnValue) == 0x000004, "Member 'CharaBaseLight_C_UserConstructionScript::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");

// Function CharaBaseLight.CharaBaseLight_C.PlayMotion
// 0x0020 (0x0020 - 0x0000)
struct CharaBaseLight_C_PlayMotion final
{
public:
	E_CHARA_MOTION_ID                             Param_MotionID;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_IsUseDuration;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_265C[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Duration;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUseBlendTimeOverride;                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_265D[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendTimeOverride;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartOffsetTime;                                   // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lo_BlendTimeOverride;                              // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_CHARA_MOTION_ID                             CallFunc_AdjustValidMotionID_ValidMotionID;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CHARA_MOTION_ID                             CallFunc_GetNowMotionID_retValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CHARA_MOTION_ID                             CallFunc_GetNowMotionID_retValue_1;                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharaBaseLight_C_PlayMotion) == 0x000004, "Wrong alignment on CharaBaseLight_C_PlayMotion");
static_assert(sizeof(CharaBaseLight_C_PlayMotion) == 0x000020, "Wrong size on CharaBaseLight_C_PlayMotion");
static_assert(offsetof(CharaBaseLight_C_PlayMotion, Param_MotionID) == 0x000000, "Member 'CharaBaseLight_C_PlayMotion::Param_MotionID' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_PlayMotion, Param_IsUseDuration) == 0x000001, "Member 'CharaBaseLight_C_PlayMotion::Param_IsUseDuration' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_PlayMotion, Duration) == 0x000004, "Member 'CharaBaseLight_C_PlayMotion::Duration' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_PlayMotion, IsUseBlendTimeOverride) == 0x000008, "Member 'CharaBaseLight_C_PlayMotion::IsUseBlendTimeOverride' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_PlayMotion, BlendTimeOverride) == 0x00000C, "Member 'CharaBaseLight_C_PlayMotion::BlendTimeOverride' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_PlayMotion, StartOffsetTime) == 0x000010, "Member 'CharaBaseLight_C_PlayMotion::StartOffsetTime' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_PlayMotion, Lo_BlendTimeOverride) == 0x000014, "Member 'CharaBaseLight_C_PlayMotion::Lo_BlendTimeOverride' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_PlayMotion, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'CharaBaseLight_C_PlayMotion::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_PlayMotion, CallFunc_AdjustValidMotionID_ValidMotionID) == 0x000019, "Member 'CharaBaseLight_C_PlayMotion::CallFunc_AdjustValidMotionID_ValidMotionID' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_PlayMotion, CallFunc_GetNowMotionID_retValue) == 0x00001A, "Member 'CharaBaseLight_C_PlayMotion::CallFunc_GetNowMotionID_retValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_PlayMotion, CallFunc_GetNowMotionID_retValue_1) == 0x00001B, "Member 'CharaBaseLight_C_PlayMotion::CallFunc_GetNowMotionID_retValue_1' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_PlayMotion, CallFunc_SelectFloat_ReturnValue) == 0x00001C, "Member 'CharaBaseLight_C_PlayMotion::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

// Function CharaBaseLight.CharaBaseLight_C.PauseMotion
// 0x0008 (0x0008 - 0x0000)
struct CharaBaseLight_C_PauseMotion final
{
public:
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharaBaseLight_C_PauseMotion) == 0x000008, "Wrong alignment on CharaBaseLight_C_PauseMotion");
static_assert(sizeof(CharaBaseLight_C_PauseMotion) == 0x000008, "Wrong size on CharaBaseLight_C_PauseMotion");
static_assert(offsetof(CharaBaseLight_C_PauseMotion, CallFunc_GetAnimInstance_ReturnValue) == 0x000000, "Member 'CharaBaseLight_C_PauseMotion::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");

// Function CharaBaseLight.CharaBaseLight_C.ResumeMotion
// 0x0008 (0x0008 - 0x0000)
struct CharaBaseLight_C_ResumeMotion final
{
public:
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharaBaseLight_C_ResumeMotion) == 0x000008, "Wrong alignment on CharaBaseLight_C_ResumeMotion");
static_assert(sizeof(CharaBaseLight_C_ResumeMotion) == 0x000008, "Wrong size on CharaBaseLight_C_ResumeMotion");
static_assert(offsetof(CharaBaseLight_C_ResumeMotion, CallFunc_GetAnimInstance_ReturnValue) == 0x000000, "Member 'CharaBaseLight_C_ResumeMotion::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");

// Function CharaBaseLight.CharaBaseLight_C.SetLegIKEnable
// 0x0048 (0x0048 - 0x0000)
struct CharaBaseLight_C_SetLegIKEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Immediately;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_265E[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharaLegComponent_C*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_265F[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2660[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharaIK_AnimBP_C> K2Node_DynamicCast_AsBPI_Chara_IK_Anim_BP;         // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharaBaseLight_C_SetLegIKEnable) == 0x000008, "Wrong alignment on CharaBaseLight_C_SetLegIKEnable");
static_assert(sizeof(CharaBaseLight_C_SetLegIKEnable) == 0x000048, "Wrong size on CharaBaseLight_C_SetLegIKEnable");
static_assert(offsetof(CharaBaseLight_C_SetLegIKEnable, Enable) == 0x000000, "Member 'CharaBaseLight_C_SetLegIKEnable::Enable' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetLegIKEnable, Immediately) == 0x000001, "Member 'CharaBaseLight_C_SetLegIKEnable::Immediately' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetLegIKEnable, Temp_int_Array_Index_Variable) == 0x000004, "Member 'CharaBaseLight_C_SetLegIKEnable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetLegIKEnable, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'CharaBaseLight_C_SetLegIKEnable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetLegIKEnable, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'CharaBaseLight_C_SetLegIKEnable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetLegIKEnable, CallFunc_Array_Get_Item) == 0x000010, "Member 'CharaBaseLight_C_SetLegIKEnable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetLegIKEnable, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'CharaBaseLight_C_SetLegIKEnable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetLegIKEnable, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'CharaBaseLight_C_SetLegIKEnable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetLegIKEnable, CallFunc_Array_Length_ReturnValue_1) == 0x000020, "Member 'CharaBaseLight_C_SetLegIKEnable::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetLegIKEnable, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'CharaBaseLight_C_SetLegIKEnable::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetLegIKEnable, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000025, "Member 'CharaBaseLight_C_SetLegIKEnable::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetLegIKEnable, CallFunc_GetAnimInstance_ReturnValue) == 0x000028, "Member 'CharaBaseLight_C_SetLegIKEnable::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetLegIKEnable, K2Node_DynamicCast_AsBPI_Chara_IK_Anim_BP) == 0x000030, "Member 'CharaBaseLight_C_SetLegIKEnable::K2Node_DynamicCast_AsBPI_Chara_IK_Anim_BP' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetLegIKEnable, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'CharaBaseLight_C_SetLegIKEnable::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CharaBaseLight.CharaBaseLight_C.SetHeadIKEnable
// 0x0060 (0x0060 - 0x0000)
struct CharaBaseLight_C_SetHeadIKEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Immediately;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2661[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCharaHeadComponent_C*>          Lo_HandComps;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2662[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharaHeadComponent_C*                  CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2663[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2664[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharaIK_AnimBP_C> K2Node_DynamicCast_AsBPI_Chara_IK_Anim_BP;         // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharaBaseLight_C_SetHeadIKEnable) == 0x000008, "Wrong alignment on CharaBaseLight_C_SetHeadIKEnable");
static_assert(sizeof(CharaBaseLight_C_SetHeadIKEnable) == 0x000060, "Wrong size on CharaBaseLight_C_SetHeadIKEnable");
static_assert(offsetof(CharaBaseLight_C_SetHeadIKEnable, Enable) == 0x000000, "Member 'CharaBaseLight_C_SetHeadIKEnable::Enable' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetHeadIKEnable, Immediately) == 0x000001, "Member 'CharaBaseLight_C_SetHeadIKEnable::Immediately' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetHeadIKEnable, Lo_HandComps) == 0x000008, "Member 'CharaBaseLight_C_SetHeadIKEnable::Lo_HandComps' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetHeadIKEnable, Temp_int_Array_Index_Variable) == 0x000018, "Member 'CharaBaseLight_C_SetHeadIKEnable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetHeadIKEnable, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'CharaBaseLight_C_SetHeadIKEnable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetHeadIKEnable, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'CharaBaseLight_C_SetHeadIKEnable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetHeadIKEnable, CallFunc_Array_Get_Item) == 0x000028, "Member 'CharaBaseLight_C_SetHeadIKEnable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetHeadIKEnable, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'CharaBaseLight_C_SetHeadIKEnable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetHeadIKEnable, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'CharaBaseLight_C_SetHeadIKEnable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetHeadIKEnable, CallFunc_Array_Length_ReturnValue_1) == 0x000038, "Member 'CharaBaseLight_C_SetHeadIKEnable::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetHeadIKEnable, CallFunc_Greater_IntInt_ReturnValue) == 0x00003C, "Member 'CharaBaseLight_C_SetHeadIKEnable::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetHeadIKEnable, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x00003D, "Member 'CharaBaseLight_C_SetHeadIKEnable::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetHeadIKEnable, CallFunc_GetAnimInstance_ReturnValue) == 0x000040, "Member 'CharaBaseLight_C_SetHeadIKEnable::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetHeadIKEnable, K2Node_DynamicCast_AsBPI_Chara_IK_Anim_BP) == 0x000048, "Member 'CharaBaseLight_C_SetHeadIKEnable::K2Node_DynamicCast_AsBPI_Chara_IK_Anim_BP' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetHeadIKEnable, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'CharaBaseLight_C_SetHeadIKEnable::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CharaBaseLight.CharaBaseLight_C.SetEyeIKEnable
// 0x0048 (0x0048 - 0x0000)
struct CharaBaseLight_C_SetEyeIKEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Immediately;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2665[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharaEyeComponent_C*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2666[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2667[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharaIK_AnimBP_C> K2Node_DynamicCast_AsBPI_Chara_IK_Anim_BP;         // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharaBaseLight_C_SetEyeIKEnable) == 0x000008, "Wrong alignment on CharaBaseLight_C_SetEyeIKEnable");
static_assert(sizeof(CharaBaseLight_C_SetEyeIKEnable) == 0x000048, "Wrong size on CharaBaseLight_C_SetEyeIKEnable");
static_assert(offsetof(CharaBaseLight_C_SetEyeIKEnable, Enable) == 0x000000, "Member 'CharaBaseLight_C_SetEyeIKEnable::Enable' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetEyeIKEnable, Immediately) == 0x000001, "Member 'CharaBaseLight_C_SetEyeIKEnable::Immediately' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetEyeIKEnable, Temp_int_Array_Index_Variable) == 0x000004, "Member 'CharaBaseLight_C_SetEyeIKEnable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetEyeIKEnable, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'CharaBaseLight_C_SetEyeIKEnable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetEyeIKEnable, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'CharaBaseLight_C_SetEyeIKEnable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetEyeIKEnable, CallFunc_Array_Get_Item) == 0x000010, "Member 'CharaBaseLight_C_SetEyeIKEnable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetEyeIKEnable, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000018, "Member 'CharaBaseLight_C_SetEyeIKEnable::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetEyeIKEnable, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'CharaBaseLight_C_SetEyeIKEnable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetEyeIKEnable, CallFunc_Array_Length_ReturnValue_1) == 0x000020, "Member 'CharaBaseLight_C_SetEyeIKEnable::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetEyeIKEnable, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'CharaBaseLight_C_SetEyeIKEnable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetEyeIKEnable, CallFunc_Greater_IntInt_ReturnValue) == 0x000025, "Member 'CharaBaseLight_C_SetEyeIKEnable::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetEyeIKEnable, CallFunc_GetAnimInstance_ReturnValue) == 0x000028, "Member 'CharaBaseLight_C_SetEyeIKEnable::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetEyeIKEnable, K2Node_DynamicCast_AsBPI_Chara_IK_Anim_BP) == 0x000030, "Member 'CharaBaseLight_C_SetEyeIKEnable::K2Node_DynamicCast_AsBPI_Chara_IK_Anim_BP' has a wrong offset!");
static_assert(offsetof(CharaBaseLight_C_SetEyeIKEnable, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'CharaBaseLight_C_SetEyeIKEnable::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CharaBaseLight.CharaBaseLight_C.InitializeIK
// 0x01F8 (0x01F8 - 0x0000)
struct CharaBaseLight_C_InitializeIK final
{
public:
