#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharaSinkTesterInterface

#include "Basic.hpp"


namespace SDK::Params
{

// Function CharaSinkTesterInterface.CharaSinkTesterInterface_C.TestSink
// 0x0018 (0x0018 - 0x0000)
struct CharaSinkTesterInterface_C_TestSink final
{
public:
	class USkinnedMeshComponent*                  Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SinkLimit;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A04[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SinkMin;                                           // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SinkMax;                                           // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharaSinkTesterInterface_C_TestSink) == 0x000008, "Wrong alignment on CharaSinkTesterInterface_C_TestSink");
static_assert(sizeof(CharaSinkTesterInterface_C_TestSink) == 0x000018, "Wrong size on CharaSinkTesterInterface_C_TestSink");
static_assert(offsetof(CharaSinkTesterInterface_C_TestSink, Mesh) == 0x000000, "Member 'CharaSinkTesterInterface_C_TestSink::Mesh' has a wrong offset!");
static_assert(offsetof(CharaSinkTesterInterface_C_TestSink, SinkLimit) == 0x000008, "Member 'CharaSinkTesterInterface_C_TestSink::SinkLimit' has a wrong offset!");
static_assert(offsetof(CharaSinkTesterInterface_C_TestSink, Debug) == 0x00000C, "Member 'CharaSinkTesterInterface_C_TestSink::Debug' has a wrong offset!");
static_assert(offsetof(CharaSinkTesterInterface_C_TestSink, SinkMin) == 0x000010, "Member 'CharaSinkTesterInterface_C_TestSink::SinkMin' has a wrong offset!");
static_assert(offsetof(CharaSinkTesterInterface_C_TestSink, SinkMax) == 0x000014, "Member 'CharaSinkTesterInterface_C_TestSink::SinkMax' has a wrong offset!");

}

