#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharaSmearFrameComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CharaSmearFrameComponent.CharaSmearFrameComponent_C
// 0x0040 (0x00F0 - 0x00B0)
class UCharaSmearFrameComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         SmearAmount;                                       // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SmearTreshold;                                     // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                M_SmearDirection;                                  // 0x00C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                M_PreviousPosition;                                // 0x00CC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       M_DMIs;                                            // 0x00D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          M_EnableSmear;                                     // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CharaSmearFrameComponent(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void EnableSmear(bool Enable);
	void SetDMI(TArray<class UMaterialInstanceDynamic*>& DMI);
	struct FVector GetCurrentPosition();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharaSmearFrameComponent_C">();
	}
	static class UCharaSmearFrameComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharaSmearFrameComponent_C>();
	}
};
static_assert(alignof(UCharaSmearFrameComponent_C) == 0x000008, "Wrong alignment on UCharaSmearFrameComponent_C");
static_assert(sizeof(UCharaSmearFrameComponent_C) == 0x0000F0, "Wrong size on UCharaSmearFrameComponent_C");
static_assert(offsetof(UCharaSmearFrameComponent_C, UberGraphFrame) == 0x0000B0, "Member 'UCharaSmearFrameComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCharaSmearFrameComponent_C, SmearAmount) == 0x0000B8, "Member 'UCharaSmearFrameComponent_C::SmearAmount' has a wrong offset!");
static_assert(offsetof(UCharaSmearFrameComponent_C, SmearTreshold) == 0x0000BC, "Member 'UCharaSmearFrameComponent_C::SmearTreshold' has a wrong offset!");
static_assert(offsetof(UCharaSmearFrameComponent_C, M_SmearDirection) == 0x0000C0, "Member 'UCharaSmearFrameComponent_C::M_SmearDirection' has a wrong offset!");
static_assert(offsetof(UCharaSmearFrameComponent_C, M_PreviousPosition) == 0x0000CC, "Member 'UCharaSmearFrameComponent_C::M_PreviousPosition' has a wrong offset!");
static_assert(offsetof(UCharaSmearFrameComponent_C, M_DMIs) == 0x0000D8, "Member 'UCharaSmearFrameComponent_C::M_DMIs' has a wrong offset!");
static_assert(offsetof(UCharaSmearFrameComponent_C, M_EnableSmear) == 0x0000E8, "Member 'UCharaSmearFrameComponent_C::M_EnableSmear' has a wrong offset!");

}

