#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CriWareRuntime

#include "Basic.hpp"

#include "CriWareRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CriWareRuntime.AtomAsrRack.GetAsrRack
// 0x0010 (0x0010 - 0x0000)
struct AtomAsrRack_GetAsrRack final
{
public:
	int32                                         AsrRackId;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F2B[0x4];                                      // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomAsrRack*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomAsrRack_GetAsrRack) == 0x000008, "Wrong alignment on AtomAsrRack_GetAsrRack");
static_assert(sizeof(AtomAsrRack_GetAsrRack) == 0x000010, "Wrong size on AtomAsrRack_GetAsrRack");
static_assert(offsetof(AtomAsrRack_GetAsrRack, AsrRackId) == 0x000000, "Member 'AtomAsrRack_GetAsrRack::AsrRackId' has a wrong offset!");
static_assert(offsetof(AtomAsrRack_GetAsrRack, ReturnValue) == 0x000008, "Member 'AtomAsrRack_GetAsrRack::ReturnValue' has a wrong offset!");

// Function CriWareRuntime.AtomAsrRack.GetDefaultAsrRack
// 0x0008 (0x0008 - 0x0000)
struct AtomAsrRack_GetDefaultAsrRack final
{
public:
	class UAtomAsrRack*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomAsrRack_GetDefaultAsrRack) == 0x000008, "Wrong alignment on AtomAsrRack_GetDefaultAsrRack");
static_assert(sizeof(AtomAsrRack_GetDefaultAsrRack) == 0x000008, "Wrong size on AtomAsrRack_GetDefaultAsrRack");
static_assert(offsetof(AtomAsrRack_GetDefaultAsrRack, ReturnValue) == 0x000000, "Member 'AtomAsrRack_GetDefaultAsrRack::ReturnValue' has a wrong offset!");

// Function CriWareRuntime.AtomAsrRack.ApplyDspBusSnapshot
// 0x0018 (0x0018 - 0x0000)
struct AtomAsrRack_ApplyDspBusSnapshot final
{
public:
	class FString                                 SnapshotName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Milliseconds;                                      // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F2C[0x4];                                      // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomAsrRack_ApplyDspBusSnapshot) == 0x000008, "Wrong alignment on AtomAsrRack_ApplyDspBusSnapshot");
static_assert(sizeof(AtomAsrRack_ApplyDspBusSnapshot) == 0x000018, "Wrong size on AtomAsrRack_ApplyDspBusSnapshot");
static_assert(offsetof(AtomAsrRack_ApplyDspBusSnapshot, SnapshotName) == 0x000000, "Member 'AtomAsrRack_ApplyDspBusSnapshot::SnapshotName' has a wrong offset!");
static_assert(offsetof(AtomAsrRack_ApplyDspBusSnapshot, Milliseconds) == 0x000010, "Member 'AtomAsrRack_ApplyDspBusSnapshot::Milliseconds' has a wrong offset!");

// Function CriWareRuntime.AtomAsrRack.AttachDspBusSetting
// 0x0010 (0x0010 - 0x0000)
struct AtomAsrRack_AttachDspBusSetting final
{
public:
	class FString                                 SettingName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomAsrRack_AttachDspBusSetting) == 0x000008, "Wrong alignment on AtomAsrRack_AttachDspBusSetting");
static_assert(sizeof(AtomAsrRack_AttachDspBusSetting) == 0x000010, "Wrong size on AtomAsrRack_AttachDspBusSetting");
static_assert(offsetof(AtomAsrRack_AttachDspBusSetting, SettingName) == 0x000000, "Member 'AtomAsrRack_AttachDspBusSetting::SettingName' has a wrong offset!");

// Function CriWareRuntime.AtomAsrRack.ConnectToPadSpeaker
// 0x0004 (0x0004 - 0x0000)
struct AtomAsrRack_ConnectToPadSpeaker final
{
public:
	int32                                         UserIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomAsrRack_ConnectToPadSpeaker) == 0x000004, "Wrong alignment on AtomAsrRack_ConnectToPadSpeaker");
static_assert(sizeof(AtomAsrRack_ConnectToPadSpeaker) == 0x000004, "Wrong size on AtomAsrRack_ConnectToPadSpeaker");
static_assert(offsetof(AtomAsrRack_ConnectToPadSpeaker, UserIndex) == 0x000000, "Member 'AtomAsrRack_ConnectToPadSpeaker::UserIndex' has a wrong offset!");

// Function CriWareRuntime.AtomAsrRack.GetBusAnalyzerInfo
// 0x0050 (0x0050 - 0x0000)
struct AtomAsrRack_GetBusAnalyzerInfo final
{
public:
	class FString                                 DspBusName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Num_channels;                                      // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F2D[0x4];                                      // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 Rms_levels;                                        // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 Peak_levels;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 Peak_hold_levels;                                  // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F2E[0x7];                                      // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomAsrRack_GetBusAnalyzerInfo) == 0x000008, "Wrong alignment on AtomAsrRack_GetBusAnalyzerInfo");
static_assert(sizeof(AtomAsrRack_GetBusAnalyzerInfo) == 0x000050, "Wrong size on AtomAsrRack_GetBusAnalyzerInfo");
static_assert(offsetof(AtomAsrRack_GetBusAnalyzerInfo, DspBusName) == 0x000000, "Member 'AtomAsrRack_GetBusAnalyzerInfo::DspBusName' has a wrong offset!");
static_assert(offsetof(AtomAsrRack_GetBusAnalyzerInfo, Num_channels) == 0x000010, "Member 'AtomAsrRack_GetBusAnalyzerInfo::Num_channels' has a wrong offset!");
static_assert(offsetof(AtomAsrRack_GetBusAnalyzerInfo, Rms_levels) == 0x000018, "Member 'AtomAsrRack_GetBusAnalyzerInfo::Rms_levels' has a wrong offset!");
static_assert(offsetof(AtomAsrRack_GetBusAnalyzerInfo, Peak_levels) == 0x000028, "Member 'AtomAsrRack_GetBusAnalyzerInfo::Peak_levels' has a wrong offset!");
static_assert(offsetof(AtomAsrRack_GetBusAnalyzerInfo, Peak_hold_levels) == 0x000038, "Member 'AtomAsrRack_GetBusAnalyzerInfo::Peak_hold_levels' has a wrong offset!");
static_assert(offsetof(AtomAsrRack_GetBusAnalyzerInfo, ReturnValue) == 0x000048, "Member 'AtomAsrRack_GetBusAnalyzerInfo::ReturnValue' has a wrong offset!");

// Function CriWareRuntime.AtomAsrRack.SetBusSendLevelByName
// 0x0028 (0x0028 - 0x0000)
struct AtomAsrRack_SetBusSendLevelByName final
{
public:
	class FString                                 SourceBusName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DestBusName;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Level;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F2F[0x4];                                      // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomAsrRack_SetBusSendLevelByName) == 0x000008, "Wrong alignment on AtomAsrRack_SetBusSendLevelByName");
static_assert(sizeof(AtomAsrRack_SetBusSendLevelByName) == 0x000028, "Wrong size on AtomAsrRack_SetBusSendLevelByName");
static_assert(offsetof(AtomAsrRack_SetBusSendLevelByName, SourceBusName) == 0x000000, "Member 'AtomAsrRack_SetBusSendLevelByName::SourceBusName' has a wrong offset!");
static_assert(offsetof(AtomAsrRack_SetBusSendLevelByName, DestBusName) == 0x000010, "Member 'AtomAsrRack_SetBusSendLevelByName::DestBusName' has a wrong offset!");
static_assert(offsetof(AtomAsrRack_SetBusSendLevelByName, Level) == 0x000020, "Member 'AtomAsrRack_SetBusSendLevelByName::Level' has a wrong offset!");

// Function CriWareRuntime.AtomAsrRack.SetBusVolumeByName
// 0x0018 (0x0018 - 0x0000)
struct AtomAsrRack_SetBusVolumeByName final
{
public:
	class FString                                 BusName;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Volume;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F30[0x4];                                      // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomAsrRack_SetBusVolumeByName) == 0x000008, "Wrong alignment on AtomAsrRack_SetBusVolumeByName");
static_assert(sizeof(AtomAsrRack_SetBusVolumeByName) == 0x000018, "Wrong size on AtomAsrRack_SetBusVolumeByName");
static_assert(offsetof(AtomAsrRack_SetBusVolumeByName, BusName) == 0x000000, "Member 'AtomAsrRack_SetBusVolumeByName::BusName' has a wrong offset!");
static_assert(offsetof(AtomAsrRack_SetBusVolumeByName, Volume) == 0x000010, "Member 'AtomAsrRack_SetBusVolumeByName::Volume' has a wrong offset!");

// Function CriWareRuntime.AtomAsrRack.SetEffectBypass
// 0x0028 (0x0028 - 0x0000)
struct AtomAsrRack_SetEffectBypass final
{
public:
	class FString                                 BusName;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EffectName;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Bypasses;                                          // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F31[0x7];                                      // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomAsrRack_SetEffectBypass) == 0x000008, "Wrong alignment on AtomAsrRack_SetEffectBypass");
static_assert(sizeof(AtomAsrRack_SetEffectBypass) == 0x000028, "Wrong size on AtomAsrRack_SetEffectBypass");
static_assert(offsetof(AtomAsrRack_SetEffectBypass, BusName) == 0x000000, "Member 'AtomAsrRack_SetEffectBypass::BusName' has a wrong offset!");
static_assert(offsetof(AtomAsrRack_SetEffectBypass, EffectName) == 0x000010, "Member 'AtomAsrRack_SetEffectBypass::EffectName' has a wrong offset!");
static_assert(offsetof(AtomAsrRack_SetEffectBypass, Bypasses) == 0x000020, "Member 'AtomAsrRack_SetEffectBypass::Bypasses' has a wrong offset!");

// Function CriWareRuntime.AtomCategory.GetAttachedAisacInfoById
// 0x0040 (0x0040 - 0x0000)
struct AtomCategory_GetAttachedAisacInfoById final
{
public:
	int32                                         CategoryId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AisacAttachedIndex;                                // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsSuccess;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F32[0x7];                                      // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAtomAisacInfo                         AisacInfo;                                         // 0x0010(0x0030)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomCategory_GetAttachedAisacInfoById) == 0x000008, "Wrong alignment on AtomCategory_GetAttachedAisacInfoById");
static_assert(sizeof(AtomCategory_GetAttachedAisacInfoById) == 0x000040, "Wrong size on AtomCategory_GetAttachedAisacInfoById");
static_assert(offsetof(AtomCategory_GetAttachedAisacInfoById, CategoryId) == 0x000000, "Member 'AtomCategory_GetAttachedAisacInfoById::CategoryId' has a wrong offset!");
static_assert(offsetof(AtomCategory_GetAttachedAisacInfoById, AisacAttachedIndex) == 0x000004, "Member 'AtomCategory_GetAttachedAisacInfoById::AisacAttachedIndex' has a wrong offset!");
static_assert(offsetof(AtomCategory_GetAttachedAisacInfoById, IsSuccess) == 0x000008, "Member 'AtomCategory_GetAttachedAisacInfoById::IsSuccess' has a wrong offset!");
static_assert(offsetof(AtomCategory_GetAttachedAisacInfoById, AisacInfo) == 0x000010, "Member 'AtomCategory_GetAttachedAisacInfoById::AisacInfo' has a wrong offset!");

// Function CriWareRuntime.AtomCategory.GetAttachedAisacInfoByName
// 0x0048 (0x0048 - 0x0000)
struct AtomCategory_GetAttachedAisacInfoByName final
{
public:
	class FString                                 CategoryName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AisacAttachedIndex;                                // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsSuccess;                                         // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F33[0x3];                                      // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAtomAisacInfo                         AisacInfo;                                         // 0x0018(0x0030)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomCategory_GetAttachedAisacInfoByName) == 0x000008, "Wrong alignment on AtomCategory_GetAttachedAisacInfoByName");
static_assert(sizeof(AtomCategory_GetAttachedAisacInfoByName) == 0x000048, "Wrong size on AtomCategory_GetAttachedAisacInfoByName");
static_assert(offsetof(AtomCategory_GetAttachedAisacInfoByName, CategoryName) == 0x000000, "Member 'AtomCategory_GetAttachedAisacInfoByName::CategoryName' has a wrong offset!");
static_assert(offsetof(AtomCategory_GetAttachedAisacInfoByName, AisacAttachedIndex) == 0x000010, "Member 'AtomCategory_GetAttachedAisacInfoByName::AisacAttachedIndex' has a wrong offset!");
static_assert(offsetof(AtomCategory_GetAttachedAisacInfoByName, IsSuccess) == 0x000014, "Member 'AtomCategory_GetAttachedAisacInfoByName::IsSuccess' has a wrong offset!");
static_assert(offsetof(AtomCategory_GetAttachedAisacInfoByName, AisacInfo) == 0x000018, "Member 'AtomCategory_GetAttachedAisacInfoByName::AisacInfo' has a wrong offset!");

// Function CriWareRuntime.AtomCategory.GetCurrentAisacControlValueById
// 0x000C (0x000C - 0x0000)
struct AtomCategory_GetCurrentAisacControlValueById final
{
public:
	int32                                         CategoryId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AisacControlId;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomCategory_GetCurrentAisacControlValueById) == 0x000004, "Wrong alignment on AtomCategory_GetCurrentAisacControlValueById");
static_assert(sizeof(AtomCategory_GetCurrentAisacControlValueById) == 0x00000C, "Wrong size on AtomCategory_GetCurrentAisacControlValueById");
static_assert(offsetof(AtomCategory_GetCurrentAisacControlValueById, CategoryId) == 0x000000, "Member 'AtomCategory_GetCurrentAisacControlValueById::CategoryId' has a wrong offset!");
static_assert(offsetof(AtomCategory_GetCurrentAisacControlValueById, AisacControlId) == 0x000004, "Member 'AtomCategory_GetCurrentAisacControlValueById::AisacControlId' has a wrong offset!");
static_assert(offsetof(AtomCategory_GetCurrentAisacControlValueById, ReturnValue) == 0x000008, "Member 'AtomCategory_GetCurrentAisacControlValueById::ReturnValue' has a wrong offset!");

// Function CriWareRuntime.AtomCategory.GetCurrentAisacControlValueByName
// 0x0028 (0x0028 - 0x0000)
struct AtomCategory_GetCurrentAisacControlValueByName final
{
public:
	class FString                                 CategoryName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AisacControlName;                                  // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F34[0x4];                                      // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomCategory_GetCurrentAisacControlValueByName) == 0x000008, "Wrong alignment on AtomCategory_GetCurrentAisacControlValueByName");
static_assert(sizeof(AtomCategory_GetCurrentAisacControlValueByName) == 0x000028, "Wrong size on AtomCategory_GetCurrentAisacControlValueByName");
static_assert(offsetof(AtomCategory_GetCurrentAisacControlValueByName, CategoryName) == 0x000000, "Member 'AtomCategory_GetCurrentAisacControlValueByName::CategoryName' has a wrong offset!");
static_assert(offsetof(AtomCategory_GetCurrentAisacControlValueByName, AisacControlName) == 0x000010, "Member 'AtomCategory_GetCurrentAisacControlValueByName::AisacControlName' has a wrong offset!");
static_assert(offsetof(AtomCategory_GetCurrentAisacControlValueByName, ReturnValue) == 0x000020, "Member 'AtomCategory_GetCurrentAisacControlValueByName::ReturnValue' has a wrong offset!");

// Function CriWareRuntime.AtomCategory.GetNumAttachedAisacsById
// 0x0008 (0x0008 - 0x0000)
struct AtomCategory_GetNumAttachedAisacsById final
{
public:
	int32                                         CategoryId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomCategory_GetNumAttachedAisacsById) == 0x000004, "Wrong alignment on AtomCategory_GetNumAttachedAisacsById");
static_assert(sizeof(AtomCategory_GetNumAttachedAisacsById) == 0x000008, "Wrong size on AtomCategory_GetNumAttachedAisacsById");
static_assert(offsetof(AtomCategory_GetNumAttachedAisacsById, CategoryId) == 0x000000, "Member 'AtomCategory_GetNumAttachedAisacsById::CategoryId' has a wrong offset!");
static_assert(offsetof(AtomCategory_GetNumAttachedAisacsById, ReturnValue) == 0x000004, "Member 'AtomCategory_GetNumAttachedAisacsById::ReturnValue' has a wrong offset!");

// Function CriWareRuntime.AtomCategory.GetNumAttachedAisacsByName
// 0x0018 (0x0018 - 0x0000)
struct AtomCategory_GetNumAttachedAisacsByName final
{
public:
	class FString                                 CategoryName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F35[0x4];                                      // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomCategory_GetNumAttachedAisacsByName) == 0x000008, "Wrong alignment on AtomCategory_GetNumAttachedAisacsByName");
static_assert(sizeof(AtomCategory_GetNumAttachedAisacsByName) == 0x000018, "Wrong size on AtomCategory_GetNumAttachedAisacsByName");
static_assert(offsetof(AtomCategory_GetNumAttachedAisacsByName, CategoryName) == 0x000000, "Member 'AtomCategory_GetNumAttachedAisacsByName::CategoryName' has a wrong offset!");
static_assert(offsetof(AtomCategory_GetNumAttachedAisacsByName, ReturnValue) == 0x000010, "Member 'AtomCategory_GetNumAttachedAisacsByName::ReturnValue' has a wrong offset!");

// Function CriWareRuntime.AtomCategory.GetVolumeByName
// 0x0018 (0x0018 - 0x0000)
struct AtomCategory_GetVolumeByName final
{
public:
	class FString                                 CategoryName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F36[0x4];                                      // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomCategory_GetVolumeByName) == 0x000008, "Wrong alignment on AtomCategory_GetVolumeByName");
static_assert(sizeof(AtomCategory_GetVolumeByName) == 0x000018, "Wrong size on AtomCategory_GetVolumeByName");
static_assert(offsetof(AtomCategory_GetVolumeByName, CategoryName) == 0x000000, "Member 'AtomCategory_GetVolumeByName::CategoryName' has a wrong offset!");
static_assert(offsetof(AtomCategory_GetVolumeByName, ReturnValue) == 0x000010, "Member 'AtomCategory_GetVolumeByName::ReturnValue' has a wrong offset!");

// Function CriWareRuntime.AtomCategory.IsPausedByName
// 0x0018 (0x0018 - 0x0000)
struct AtomCategory_IsPausedByName final
{
public:
	class FString                                 CategoryName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F37[0x7];                                      // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomCategory_IsPausedByName) == 0x000008, "Wrong alignment on AtomCategory_IsPausedByName");
static_assert(sizeof(AtomCategory_IsPausedByName) == 0x000018, "Wrong size on AtomCategory_IsPausedByName");
static_assert(offsetof(AtomCategory_IsPausedByName, CategoryName) == 0x000000, "Member 'AtomCategory_IsPausedByName::CategoryName' has a wrong offset!");
static_assert(offsetof(AtomCategory_IsPausedByName, ReturnValue) == 0x000010, "Member 'AtomCategory_IsPausedByName::ReturnValue' has a wrong offset!");

// Function CriWareRuntime.AtomCategory.PauseByName
// 0x0018 (0x0018 - 0x0000)
struct AtomCategory_PauseByName final
{
public:
	class FString                                 CategoryName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPause;                                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F38[0x7];                                      // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomCategory_PauseByName) == 0x000008, "Wrong alignment on AtomCategory_PauseByName");
static_assert(sizeof(AtomCategory_PauseByName) == 0x000018, "Wrong size on AtomCategory_PauseByName");
static_assert(offsetof(AtomCategory_PauseByName, CategoryName) == 0x000000, "Member 'AtomCategory_PauseByName::CategoryName' has a wrong offset!");
static_assert(offsetof(AtomCategory_PauseByName, bPause) == 0x000010, "Member 'AtomCategory_PauseByName::bPause' has a wrong offset!");

// Function CriWareRuntime.AtomCategory.ResetAllAisacControlById
// 0x0008 (0x0008 - 0x0000)
struct AtomCategory_ResetAllAisacControlById final
{
public:
	int32                                         CategoryId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F39[0x3];                                      // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomCategory_ResetAllAisacControlById) == 0x000004, "Wrong alignment on AtomCategory_ResetAllAisacControlById");
static_assert(sizeof(AtomCategory_ResetAllAisacControlById) == 0x000008, "Wrong size on AtomCategory_ResetAllAisacControlById");
static_assert(offsetof(AtomCategory_ResetAllAisacControlById, CategoryId) == 0x000000, "Member 'AtomCategory_ResetAllAisacControlById::CategoryId' has a wrong offset!");
static_assert(offsetof(AtomCategory_ResetAllAisacControlById, ReturnValue) == 0x000004, "Member 'AtomCategory_ResetAllAisacControlById::ReturnValue' has a wrong offset!");

// Function CriWareRuntime.AtomCategory.ResetAllAisacControlByName
// 0x0018 (0x0018 - 0x0000)
struct AtomCategory_ResetAllAisacControlByName final
{
public:
	class FString                                 CategoryName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F3A[0x7];                                      // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomCategory_ResetAllAisacControlByName) == 0x000008, "Wrong alignment on AtomCategory_ResetAllAisacControlByName");
static_assert(sizeof(AtomCategory_ResetAllAisacControlByName) == 0x000018, "Wrong size on AtomCategory_ResetAllAisacControlByName");
static_assert(offsetof(AtomCategory_ResetAllAisacControlByName, CategoryName) == 0x000000, "Member 'AtomCategory_ResetAllAisacControlByName::CategoryName' has a wrong offset!");
static_assert(offsetof(AtomCategory_ResetAllAisacControlByName, ReturnValue) == 0x000010, "Member 'AtomCategory_ResetAllAisacControlByName::ReturnValue' has a wrong offset!");

// Function CriWareRuntime.AtomCategory.SetAisacControlByName
// 0x0028 (0x0028 - 0x0000)
struct AtomCategory_SetAisacControlByName final
{
public:
	class FString                                 CategoryName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AisacName;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F3B[0x4];                                      // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomCategory_SetAisacControlByName) == 0x000008, "Wrong alignment on AtomCategory_SetAisacControlByName");
static_assert(sizeof(AtomCategory_SetAisacControlByName) == 0x000028, "Wrong size on AtomCategory_SetAisacControlByName");
static_assert(offsetof(AtomCategory_SetAisacControlByName, CategoryName) == 0x000000, "Member 'AtomCategory_SetAisacControlByName::CategoryName' has a wrong offset!");
static_assert(offsetof(AtomCategory_SetAisacControlByName, AisacName) == 0x000010, "Member 'AtomCategory_SetAisacControlByName::AisacName' has a wrong offset!");
static_assert(offsetof(AtomCategory_SetAisacControlByName, Value) == 0x000020, "Member 'AtomCategory_SetAisacControlByName::Value' has a wrong offset!");

// Function CriWareRuntime.AtomCategory.SetVolumeByName
// 0x0018 (0x0018 - 0x0000)
struct AtomCategory_SetVolumeByName final
{
public:
	class FString                                 CategoryName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Volume;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F3C[0x4];                                      // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomCategory_SetVolumeByName) == 0x000008, "Wrong alignment on AtomCategory_SetVolumeByName");
static_assert(sizeof(AtomCategory_SetVolumeByName) == 0x000018, "Wrong size on AtomCategory_SetVolumeByName");
static_assert(offsetof(AtomCategory_SetVolumeByName, CategoryName) == 0x000000, "Member 'AtomCategory_SetVolumeByName::CategoryName' has a wrong offset!");
static_assert(offsetof(AtomCategory_SetVolumeByName, Volume) == 0x000010, "Member 'AtomCategory_SetVolumeByName::Volume' has a wrong offset!");

// Function CriWareRuntime.AtomCategory.StopByName
// 0x0010 (0x0010 - 0x0000)
struct AtomCategory_StopByName final
{
public:
	class FString                                 CategoryName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomCategory_StopByName) == 0x000008, "Wrong alignment on AtomCategory_StopByName");
static_assert(sizeof(AtomCategory_StopByName) == 0x000010, "Wrong size on AtomCategory_StopByName");
static_assert(offsetof(AtomCategory_StopByName, CategoryName) == 0x000000, "Member 'AtomCategory_StopByName::CategoryName' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.DestroyComponentByID
// 0x0004 (0x0004 - 0x0000)
struct AtomComponent_DestroyComponentByID final
{
public:
	int32                                         TargetID;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_DestroyComponentByID) == 0x000004, "Wrong alignment on AtomComponent_DestroyComponentByID");
static_assert(sizeof(AtomComponent_DestroyComponentByID) == 0x000004, "Wrong size on AtomComponent_DestroyComponentByID");
static_assert(offsetof(AtomComponent_DestroyComponentByID, TargetID) == 0x000000, "Member 'AtomComponent_DestroyComponentByID::TargetID' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.GetAtomComponentFromID
// 0x0010 (0x0010 - 0x0000)
struct AtomComponent_GetAtomComponentFromID final
{
public:
	int32                                         TargetID;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F48[0x4];                                      // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_GetAtomComponentFromID) == 0x000008, "Wrong alignment on AtomComponent_GetAtomComponentFromID");
static_assert(sizeof(AtomComponent_GetAtomComponentFromID) == 0x000010, "Wrong size on AtomComponent_GetAtomComponentFromID");
static_assert(offsetof(AtomComponent_GetAtomComponentFromID, TargetID) == 0x000000, "Member 'AtomComponent_GetAtomComponentFromID::TargetID' has a wrong offset!");
static_assert(offsetof(AtomComponent_GetAtomComponentFromID, ReturnValue) == 0x000008, "Member 'AtomComponent_GetAtomComponentFromID::ReturnValue' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.GetDefaultAttenuationEnable
// 0x0001 (0x0001 - 0x0000)
struct AtomComponent_GetDefaultAttenuationEnable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_GetDefaultAttenuationEnable) == 0x000001, "Wrong alignment on AtomComponent_GetDefaultAttenuationEnable");
static_assert(sizeof(AtomComponent_GetDefaultAttenuationEnable) == 0x000001, "Wrong size on AtomComponent_GetDefaultAttenuationEnable");
static_assert(offsetof(AtomComponent_GetDefaultAttenuationEnable, ReturnValue) == 0x000000, "Member 'AtomComponent_GetDefaultAttenuationEnable::ReturnValue' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.SetDefaultAttenuationEnable
// 0x0001 (0x0001 - 0x0000)
struct AtomComponent_SetDefaultAttenuationEnable final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_SetDefaultAttenuationEnable) == 0x000001, "Wrong alignment on AtomComponent_SetDefaultAttenuationEnable");
static_assert(sizeof(AtomComponent_SetDefaultAttenuationEnable) == 0x000001, "Wrong size on AtomComponent_SetDefaultAttenuationEnable");
static_assert(offsetof(AtomComponent_SetDefaultAttenuationEnable, bEnable) == 0x000000, "Member 'AtomComponent_SetDefaultAttenuationEnable::bEnable' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.EnqueueSound
// 0x0008 (0x0008 - 0x0000)
struct AtomComponent_EnqueueSound final
{
public:
	class USoundAtomCue*                          NewSound;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_EnqueueSound) == 0x000008, "Wrong alignment on AtomComponent_EnqueueSound");
static_assert(sizeof(AtomComponent_EnqueueSound) == 0x000008, "Wrong size on AtomComponent_EnqueueSound");
static_assert(offsetof(AtomComponent_EnqueueSound, NewSound) == 0x000000, "Member 'AtomComponent_EnqueueSound::NewSound' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.FadeIn
// 0x000C (0x000C - 0x0000)
struct AtomComponent_FadeIn final
{
public:
	float                                         FadeInDuration;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeVolumeLevel;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_FadeIn) == 0x000004, "Wrong alignment on AtomComponent_FadeIn");
static_assert(sizeof(AtomComponent_FadeIn) == 0x00000C, "Wrong size on AtomComponent_FadeIn");
static_assert(offsetof(AtomComponent_FadeIn, FadeInDuration) == 0x000000, "Member 'AtomComponent_FadeIn::FadeInDuration' has a wrong offset!");
static_assert(offsetof(AtomComponent_FadeIn, FadeVolumeLevel) == 0x000004, "Member 'AtomComponent_FadeIn::FadeVolumeLevel' has a wrong offset!");
static_assert(offsetof(AtomComponent_FadeIn, StartTime) == 0x000008, "Member 'AtomComponent_FadeIn::StartTime' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.FadeOut
// 0x0008 (0x0008 - 0x0000)
struct AtomComponent_FadeOut final
{
public:
	float                                         FadeOutDuration;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeVolumeLevel;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_FadeOut) == 0x000004, "Wrong alignment on AtomComponent_FadeOut");
static_assert(sizeof(AtomComponent_FadeOut) == 0x000008, "Wrong size on AtomComponent_FadeOut");
static_assert(offsetof(AtomComponent_FadeOut, FadeOutDuration) == 0x000000, "Member 'AtomComponent_FadeOut::FadeOutDuration' has a wrong offset!");
static_assert(offsetof(AtomComponent_FadeOut, FadeVolumeLevel) == 0x000004, "Member 'AtomComponent_FadeOut::FadeVolumeLevel' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.GetNumQueuedSounds
// 0x0004 (0x0004 - 0x0000)
struct AtomComponent_GetNumQueuedSounds final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_GetNumQueuedSounds) == 0x000004, "Wrong alignment on AtomComponent_GetNumQueuedSounds");
static_assert(sizeof(AtomComponent_GetNumQueuedSounds) == 0x000004, "Wrong size on AtomComponent_GetNumQueuedSounds");
static_assert(offsetof(AtomComponent_GetNumQueuedSounds, ReturnValue) == 0x000000, "Member 'AtomComponent_GetNumQueuedSounds::ReturnValue' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.GetSequencePosition
// 0x0004 (0x0004 - 0x0000)
struct AtomComponent_GetSequencePosition final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_GetSequencePosition) == 0x000004, "Wrong alignment on AtomComponent_GetSequencePosition");
static_assert(sizeof(AtomComponent_GetSequencePosition) == 0x000004, "Wrong size on AtomComponent_GetSequencePosition");
static_assert(offsetof(AtomComponent_GetSequencePosition, ReturnValue) == 0x000000, "Member 'AtomComponent_GetSequencePosition::ReturnValue' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.GetStatus
// 0x0001 (0x0001 - 0x0000)
struct AtomComponent_GetStatus final
{
public:
	EAtomComponentStatus                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_GetStatus) == 0x000001, "Wrong alignment on AtomComponent_GetStatus");
static_assert(sizeof(AtomComponent_GetStatus) == 0x000001, "Wrong size on AtomComponent_GetStatus");
static_assert(offsetof(AtomComponent_GetStatus, ReturnValue) == 0x000000, "Member 'AtomComponent_GetStatus::ReturnValue' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.GetTime
// 0x0004 (0x0004 - 0x0000)
struct AtomComponent_GetTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_GetTime) == 0x000004, "Wrong alignment on AtomComponent_GetTime");
static_assert(sizeof(AtomComponent_GetTime) == 0x000004, "Wrong size on AtomComponent_GetTime");
static_assert(offsetof(AtomComponent_GetTime, ReturnValue) == 0x000000, "Member 'AtomComponent_GetTime::ReturnValue' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.IsPaused
// 0x0001 (0x0001 - 0x0000)
struct AtomComponent_IsPaused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_IsPaused) == 0x000001, "Wrong alignment on AtomComponent_IsPaused");
static_assert(sizeof(AtomComponent_IsPaused) == 0x000001, "Wrong size on AtomComponent_IsPaused");
static_assert(offsetof(AtomComponent_IsPaused, ReturnValue) == 0x000000, "Member 'AtomComponent_IsPaused::ReturnValue' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.IsPlaying
// 0x0001 (0x0001 - 0x0000)
struct AtomComponent_IsPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_IsPlaying) == 0x000001, "Wrong alignment on AtomComponent_IsPlaying");
static_assert(sizeof(AtomComponent_IsPlaying) == 0x000001, "Wrong size on AtomComponent_IsPlaying");
static_assert(offsetof(AtomComponent_IsPlaying, ReturnValue) == 0x000000, "Member 'AtomComponent_IsPlaying::ReturnValue' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.Pause
// 0x0001 (0x0001 - 0x0000)
struct AtomComponent_Pause final
{
public:
	bool                                          bPause;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_Pause) == 0x000001, "Wrong alignment on AtomComponent_Pause");
static_assert(sizeof(AtomComponent_Pause) == 0x000001, "Wrong size on AtomComponent_Pause");
static_assert(offsetof(AtomComponent_Pause, bPause) == 0x000000, "Member 'AtomComponent_Pause::bPause' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.Play
// 0x0004 (0x0004 - 0x0000)
struct AtomComponent_Play final
{
public:
	float                                         StartTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_Play) == 0x000004, "Wrong alignment on AtomComponent_Play");
static_assert(sizeof(AtomComponent_Play) == 0x000004, "Wrong size on AtomComponent_Play");
static_assert(offsetof(AtomComponent_Play, StartTime) == 0x000000, "Member 'AtomComponent_Play::StartTime' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.SetAisacByName
// 0x0018 (0x0018 - 0x0000)
struct AtomComponent_SetAisacByName final
{
public:
	class FString                                 ControlName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ControlValue;                                      // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F49[0x4];                                      // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomComponent_SetAisacByName) == 0x000008, "Wrong alignment on AtomComponent_SetAisacByName");
static_assert(sizeof(AtomComponent_SetAisacByName) == 0x000018, "Wrong size on AtomComponent_SetAisacByName");
static_assert(offsetof(AtomComponent_SetAisacByName, ControlName) == 0x000000, "Member 'AtomComponent_SetAisacByName::ControlName' has a wrong offset!");
static_assert(offsetof(AtomComponent_SetAisacByName, ControlValue) == 0x000010, "Member 'AtomComponent_SetAisacByName::ControlValue' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.SetAsrRackID
// 0x0004 (0x0004 - 0x0000)
struct AtomComponent_SetAsrRackID final
{
public:
	int32                                         Asr_rack_id;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_SetAsrRackID) == 0x000004, "Wrong alignment on AtomComponent_SetAsrRackID");
static_assert(sizeof(AtomComponent_SetAsrRackID) == 0x000004, "Wrong size on AtomComponent_SetAsrRackID");
static_assert(offsetof(AtomComponent_SetAsrRackID, Asr_rack_id) == 0x000000, "Member 'AtomComponent_SetAsrRackID::Asr_rack_id' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.SetAsrRackIdArray
// 0x0010 (0x0010 - 0x0000)
struct AtomComponent_SetAsrRackIdArray final
{
public:
	TArray<int32>                                 AsrRackIDs;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_SetAsrRackIdArray) == 0x000008, "Wrong alignment on AtomComponent_SetAsrRackIdArray");
static_assert(sizeof(AtomComponent_SetAsrRackIdArray) == 0x000010, "Wrong size on AtomComponent_SetAsrRackIdArray");
static_assert(offsetof(AtomComponent_SetAsrRackIdArray, AsrRackIDs) == 0x000000, "Member 'AtomComponent_SetAsrRackIdArray::AsrRackIDs' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.SetBusSendLevel
// 0x0008 (0x0008 - 0x0000)
struct AtomComponent_SetBusSendLevel final
{
public:
	int32                                         BusId;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Level;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_SetBusSendLevel) == 0x000004, "Wrong alignment on AtomComponent_SetBusSendLevel");
static_assert(sizeof(AtomComponent_SetBusSendLevel) == 0x000008, "Wrong size on AtomComponent_SetBusSendLevel");
static_assert(offsetof(AtomComponent_SetBusSendLevel, BusId) == 0x000000, "Member 'AtomComponent_SetBusSendLevel::BusId' has a wrong offset!");
static_assert(offsetof(AtomComponent_SetBusSendLevel, Level) == 0x000004, "Member 'AtomComponent_SetBusSendLevel::Level' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.SetBusSendLevelByName
// 0x0018 (0x0018 - 0x0000)
struct AtomComponent_SetBusSendLevelByName final
{
public:
	class FString                                 BusName;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Level;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F4A[0x4];                                      // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomComponent_SetBusSendLevelByName) == 0x000008, "Wrong alignment on AtomComponent_SetBusSendLevelByName");
static_assert(sizeof(AtomComponent_SetBusSendLevelByName) == 0x000018, "Wrong size on AtomComponent_SetBusSendLevelByName");
static_assert(offsetof(AtomComponent_SetBusSendLevelByName, BusName) == 0x000000, "Member 'AtomComponent_SetBusSendLevelByName::BusName' has a wrong offset!");
static_assert(offsetof(AtomComponent_SetBusSendLevelByName, Level) == 0x000010, "Member 'AtomComponent_SetBusSendLevelByName::Level' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.SetBusSendLevelOffset
// 0x0008 (0x0008 - 0x0000)
struct AtomComponent_SetBusSendLevelOffset final
{
public:
	int32                                         BusId;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LevelOffset;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_SetBusSendLevelOffset) == 0x000004, "Wrong alignment on AtomComponent_SetBusSendLevelOffset");
static_assert(sizeof(AtomComponent_SetBusSendLevelOffset) == 0x000008, "Wrong size on AtomComponent_SetBusSendLevelOffset");
static_assert(offsetof(AtomComponent_SetBusSendLevelOffset, BusId) == 0x000000, "Member 'AtomComponent_SetBusSendLevelOffset::BusId' has a wrong offset!");
static_assert(offsetof(AtomComponent_SetBusSendLevelOffset, LevelOffset) == 0x000004, "Member 'AtomComponent_SetBusSendLevelOffset::LevelOffset' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.SetBusSendLevelOffsetByName
// 0x0018 (0x0018 - 0x0000)
struct AtomComponent_SetBusSendLevelOffsetByName final
{
public:
	class FString                                 BusName;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LevelOffset;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F4B[0x4];                                      // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomComponent_SetBusSendLevelOffsetByName) == 0x000008, "Wrong alignment on AtomComponent_SetBusSendLevelOffsetByName");
static_assert(sizeof(AtomComponent_SetBusSendLevelOffsetByName) == 0x000018, "Wrong size on AtomComponent_SetBusSendLevelOffsetByName");
static_assert(offsetof(AtomComponent_SetBusSendLevelOffsetByName, BusName) == 0x000000, "Member 'AtomComponent_SetBusSendLevelOffsetByName::BusName' has a wrong offset!");
static_assert(offsetof(AtomComponent_SetBusSendLevelOffsetByName, LevelOffset) == 0x000010, "Member 'AtomComponent_SetBusSendLevelOffsetByName::LevelOffset' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.SetNextBlockIndex
// 0x0004 (0x0004 - 0x0000)
struct AtomComponent_SetNextBlockIndex final
{
public:
	int32                                         BlockIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_SetNextBlockIndex) == 0x000004, "Wrong alignment on AtomComponent_SetNextBlockIndex");
static_assert(sizeof(AtomComponent_SetNextBlockIndex) == 0x000004, "Wrong size on AtomComponent_SetNextBlockIndex");
static_assert(offsetof(AtomComponent_SetNextBlockIndex, BlockIndex) == 0x000000, "Member 'AtomComponent_SetNextBlockIndex::BlockIndex' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.SetPitch
// 0x0004 (0x0004 - 0x0000)
struct AtomComponent_SetPitch final
{
public:
	float                                         Pitch;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_SetPitch) == 0x000004, "Wrong alignment on AtomComponent_SetPitch");
static_assert(sizeof(AtomComponent_SetPitch) == 0x000004, "Wrong size on AtomComponent_SetPitch");
static_assert(offsetof(AtomComponent_SetPitch, Pitch) == 0x000000, "Member 'AtomComponent_SetPitch::Pitch' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.SetPitchMultiplier
// 0x0004 (0x0004 - 0x0000)
struct AtomComponent_SetPitchMultiplier final
{
public:
	float                                         NewPitchMultiplier;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_SetPitchMultiplier) == 0x000004, "Wrong alignment on AtomComponent_SetPitchMultiplier");
static_assert(sizeof(AtomComponent_SetPitchMultiplier) == 0x000004, "Wrong size on AtomComponent_SetPitchMultiplier");
static_assert(offsetof(AtomComponent_SetPitchMultiplier, NewPitchMultiplier) == 0x000000, "Member 'AtomComponent_SetPitchMultiplier::NewPitchMultiplier' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.SetSelectorLabel
// 0x0020 (0x0020 - 0x0000)
struct AtomComponent_SetSelectorLabel final
{
public:
	class FString                                 Selector;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Label;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_SetSelectorLabel) == 0x000008, "Wrong alignment on AtomComponent_SetSelectorLabel");
static_assert(sizeof(AtomComponent_SetSelectorLabel) == 0x000020, "Wrong size on AtomComponent_SetSelectorLabel");
static_assert(offsetof(AtomComponent_SetSelectorLabel, Selector) == 0x000000, "Member 'AtomComponent_SetSelectorLabel::Selector' has a wrong offset!");
static_assert(offsetof(AtomComponent_SetSelectorLabel, Label) == 0x000010, "Member 'AtomComponent_SetSelectorLabel::Label' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.SetSound
// 0x0008 (0x0008 - 0x0000)
struct AtomComponent_SetSound final
{
public:
	class USoundAtomCue*                          NewSound;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_SetSound) == 0x000008, "Wrong alignment on AtomComponent_SetSound");
static_assert(sizeof(AtomComponent_SetSound) == 0x000008, "Wrong size on AtomComponent_SetSound");
static_assert(offsetof(AtomComponent_SetSound, NewSound) == 0x000000, "Member 'AtomComponent_SetSound::NewSound' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.SetSoundObject
// 0x0008 (0x0008 - 0x0000)
struct AtomComponent_SetSoundObject final
{
public:
	class UAtomSoundObject*                       SoundObject;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_SetSoundObject) == 0x000008, "Wrong alignment on AtomComponent_SetSoundObject");
static_assert(sizeof(AtomComponent_SetSoundObject) == 0x000008, "Wrong size on AtomComponent_SetSoundObject");
static_assert(offsetof(AtomComponent_SetSoundObject, SoundObject) == 0x000000, "Member 'AtomComponent_SetSoundObject::SoundObject' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.SetVolume
// 0x0004 (0x0004 - 0x0000)
struct AtomComponent_SetVolume final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_SetVolume) == 0x000004, "Wrong alignment on AtomComponent_SetVolume");
static_assert(sizeof(AtomComponent_SetVolume) == 0x000004, "Wrong size on AtomComponent_SetVolume");
static_assert(offsetof(AtomComponent_SetVolume, Volume) == 0x000000, "Member 'AtomComponent_SetVolume::Volume' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.GetAtomComponentID
// 0x0004 (0x0004 - 0x0000)
struct AtomComponent_GetAtomComponentID final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_GetAtomComponentID) == 0x000004, "Wrong alignment on AtomComponent_GetAtomComponentID");
static_assert(sizeof(AtomComponent_GetAtomComponentID) == 0x000004, "Wrong size on AtomComponent_GetAtomComponentID");
static_assert(offsetof(AtomComponent_GetAtomComponentID, ReturnValue) == 0x000000, "Member 'AtomComponent_GetAtomComponentID::ReturnValue' has a wrong offset!");

// Function CriWareRuntime.AtomComponent.GetCueName
// 0x0010 (0x0010 - 0x0000)
struct AtomComponent_GetCueName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomComponent_GetCueName) == 0x000008, "Wrong alignment on AtomComponent_GetCueName");
