#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CriWareRuntime

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CriWareRuntime_structs.hpp"


namespace SDK
{

// Class CriWareRuntime.AtomAsrRack
// 0x0018 (0x0040 - 0x0028)
class UAtomAsrRack final : public UObject
{
public:
	int32                                         RackId;                                            // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F3F[0x14];                                     // 0x002C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAtomAsrRack* GetAsrRack(int32 AsrRackId);
	static class UAtomAsrRack* GetDefaultAsrRack();

	void ApplyDspBusSnapshot(const class FString& SnapshotName, int32 Milliseconds);
	void AttachDspBusSetting(const class FString& SettingName);
	void ConnectToPadSpeaker(int32 UserIndex);
	void DetachDspBusSetting();
	bool GetBusAnalyzerInfo(const class FString& DspBusName, int32* Num_channels, TArray<float>* Rms_levels, TArray<float>* Peak_levels, TArray<float>* Peak_hold_levels);
	void SetBusSendLevelByName(const class FString& SourceBusName, const class FString& DestBusName, float Level);
	void SetBusVolumeByName(const class FString& BusName, float Volume);
	void SetEffectBypass(const class FString& BusName, const class FString& EffectName, bool Bypasses);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomAsrRack">();
	}
	static class UAtomAsrRack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomAsrRack>();
	}
};
static_assert(alignof(UAtomAsrRack) == 0x000008, "Wrong alignment on UAtomAsrRack");
static_assert(sizeof(UAtomAsrRack) == 0x000040, "Wrong size on UAtomAsrRack");
static_assert(offsetof(UAtomAsrRack, RackId) == 0x000028, "Member 'UAtomAsrRack::RackId' has a wrong offset!");

// Class CriWareRuntime.AtomCategory
// 0x0000 (0x0028 - 0x0028)
class UAtomCategory final : public UBlueprintFunctionLibrary
{
public:
	static void GetAttachedAisacInfoById(int32 CategoryId, int32 AisacAttachedIndex, bool* IsSuccess, struct FAtomAisacInfo* AisacInfo);
	static void GetAttachedAisacInfoByName(const class FString& CategoryName, int32 AisacAttachedIndex, bool* IsSuccess, struct FAtomAisacInfo* AisacInfo);
	static float GetCurrentAisacControlValueById(int32 CategoryId, int32 AisacControlId);
	static float GetCurrentAisacControlValueByName(const class FString& CategoryName, const class FString& AisacControlName);
	static int32 GetNumAttachedAisacsById(int32 CategoryId);
	static int32 GetNumAttachedAisacsByName(const class FString& CategoryName);
	static float GetVolumeByName(const class FString& CategoryName);
	static bool IsPausedByName(const class FString& CategoryName);
	static void PauseByName(const class FString& CategoryName, bool bPause);
	static bool ResetAllAisacControlById(int32 CategoryId);
	static bool ResetAllAisacControlByName(const class FString& CategoryName);
	static void SetAisacControlByName(const class FString& CategoryName, const class FString& AisacName, float Value);
	static void SetVolumeByName(const class FString& CategoryName, float Volume);
	static void StopByName(const class FString& CategoryName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomCategory">();
	}
	static class UAtomCategory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomCategory>();
	}
};
static_assert(alignof(UAtomCategory) == 0x000008, "Wrong alignment on UAtomCategory");
static_assert(sizeof(UAtomCategory) == 0x000028, "Wrong size on UAtomCategory");

// Class CriWareRuntime.AtomComponent
// 0x0D60 (0x0F60 - 0x0200)
class UAtomComponent final : public USceneComponent
{
public:
	class USoundAtomCue*                          Sound;                                             // 0x01F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAutoDestroy : 1;                                  // 0x0200(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_F52[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bPersistAcrossLevelTransition;                     // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F53[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bStopWhenOwnerDestroyed : 1;                       // 0x0208(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsUISound : 1;                                    // 0x0208(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_F54[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultVolume;                                     // 0x0210(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableMultipleSoundPlayback;                      // 0x0214(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsePlaylist;                                      // 0x0215(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F55[0x2];                                      // 0x0216(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomSoundObject*                       DefaultSoundObject;                                // 0x0218(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DefaultBlockIndex;                                 // 0x0220(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F56[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAtomAisacControlParam>         DefaultAisacControl;                               // 0x0228(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomSelectorParam>             DefaultSelectorLabel;                              // 0x0238(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bOnly2DSound;                                      // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F57[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnAudioFinished;                                   // 0x0250(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UWorld*                                 PlayWorld;                                         // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameViewportClient*                    GameViewport;                                      // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F58[0x18];                                     // 0x0270(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bOverrideAttenuation : 1;                          // 0x0288(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_F59[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAttenuation*                      AttenuationSettings;                               // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoundAttenuationSettings              AttenuationOverrides;                              // 0x0298(0x03A0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_F5A[0x8F0];                                    // 0x0638(0x08F0)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCueSheet*                     CueSheet;                                          // 0x0F28(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F5B[0x10];                                     // 0x0F30(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomSoundObject*                       AppliedSoundObject;                                // 0x0F40(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F5C[0x18];                                     // 0x0F48(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void DestroyComponentByID(int32 TargetID);
	static class UAtomComponent* GetAtomComponentFromID(int32 TargetID);
	static bool GetDefaultAttenuationEnable();
	static void SetDefaultAttenuationEnable(bool bEnable);

	void EnqueueSound(class USoundAtomCue* NewSound);
	void FadeIn(float FadeInDuration, float FadeVolumeLevel, float StartTime);
	void FadeOut(float FadeOutDuration, float FadeVolumeLevel);
	int32 GetNumQueuedSounds();
	float GetSequencePosition();
	EAtomComponentStatus GetStatus();
	float GetTime();
	bool IsPaused();
	bool IsPlaying();
	void OnAudioFinished__DelegateSignature();
	void Pause(bool bPause);
	void Play(float StartTime);
	void SetAisacByName(const class FString& ControlName, float ControlValue);
	void SetAsrRackID(int32 Asr_rack_id);
	void SetAsrRackIdArray(const TArray<int32>& AsrRackIDs);
	void SetBusSendLevel(int32 BusId, float Level);
	void SetBusSendLevelByName(const class FString& BusName, float Level);
	void SetBusSendLevelOffset(int32 BusId, float LevelOffset);
	void SetBusSendLevelOffsetByName(const class FString& BusName, float LevelOffset);
	void SetNextBlockIndex(int32 BlockIndex);
	void SetPitch(float Pitch);
	void SetPitchMultiplier(float NewPitchMultiplier);
	void SetSelectorLabel(const class FString& Selector, const class FString& Label);
	void SetSound(class USoundAtomCue* NewSound);
	void SetSoundObject(class UAtomSoundObject* SoundObject);
	void SetVolume(float Volume);
	void Stop();

	int32 GetAtomComponentID() const;
	class FString GetCueName() const;
	float GetCurrentCullingBoundaryDistance() const;
	float GetCurrentCullingMarginDistance() const;
	float GetCurrentEconomicTickBoundaryDistance() const;
	float GetCurrentEconomicTickFrequency() const;
	float GetCurrentEconomicTickMarginDistance() const;
	float GetCurrentMaxAttenuationDistance() const;
	bool HasBeenEconomicTick() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomComponent">();
	}
	static class UAtomComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomComponent>();
	}
};
static_assert(alignof(UAtomComponent) == 0x000010, "Wrong alignment on UAtomComponent");
static_assert(sizeof(UAtomComponent) == 0x000F60, "Wrong size on UAtomComponent");
static_assert(offsetof(UAtomComponent, Sound) == 0x0001F8, "Member 'UAtomComponent::Sound' has a wrong offset!");
static_assert(offsetof(UAtomComponent, bPersistAcrossLevelTransition) == 0x000204, "Member 'UAtomComponent::bPersistAcrossLevelTransition' has a wrong offset!");
static_assert(offsetof(UAtomComponent, DefaultVolume) == 0x000210, "Member 'UAtomComponent::DefaultVolume' has a wrong offset!");
static_assert(offsetof(UAtomComponent, bEnableMultipleSoundPlayback) == 0x000214, "Member 'UAtomComponent::bEnableMultipleSoundPlayback' has a wrong offset!");
static_assert(offsetof(UAtomComponent, bUsePlaylist) == 0x000215, "Member 'UAtomComponent::bUsePlaylist' has a wrong offset!");
static_assert(offsetof(UAtomComponent, DefaultSoundObject) == 0x000218, "Member 'UAtomComponent::DefaultSoundObject' has a wrong offset!");
static_assert(offsetof(UAtomComponent, DefaultBlockIndex) == 0x000220, "Member 'UAtomComponent::DefaultBlockIndex' has a wrong offset!");
static_assert(offsetof(UAtomComponent, DefaultAisacControl) == 0x000228, "Member 'UAtomComponent::DefaultAisacControl' has a wrong offset!");
static_assert(offsetof(UAtomComponent, DefaultSelectorLabel) == 0x000238, "Member 'UAtomComponent::DefaultSelectorLabel' has a wrong offset!");
static_assert(offsetof(UAtomComponent, bOnly2DSound) == 0x000248, "Member 'UAtomComponent::bOnly2DSound' has a wrong offset!");
static_assert(offsetof(UAtomComponent, OnAudioFinished) == 0x000250, "Member 'UAtomComponent::OnAudioFinished' has a wrong offset!");
static_assert(offsetof(UAtomComponent, PlayWorld) == 0x000260, "Member 'UAtomComponent::PlayWorld' has a wrong offset!");
static_assert(offsetof(UAtomComponent, GameViewport) == 0x000268, "Member 'UAtomComponent::GameViewport' has a wrong offset!");
static_assert(offsetof(UAtomComponent, AttenuationSettings) == 0x000290, "Member 'UAtomComponent::AttenuationSettings' has a wrong offset!");
static_assert(offsetof(UAtomComponent, AttenuationOverrides) == 0x000298, "Member 'UAtomComponent::AttenuationOverrides' has a wrong offset!");
static_assert(offsetof(UAtomComponent, CueSheet) == 0x000F28, "Member 'UAtomComponent::CueSheet' has a wrong offset!");
static_assert(offsetof(UAtomComponent, AppliedSoundObject) == 0x000F40, "Member 'UAtomComponent::AppliedSoundObject' has a wrong offset!");

// Class CriWareRuntime.AtomComponentPool
// 0x0040 (0x0068 - 0x0028)
class UAtomComponentPool final : public UObject
{
public:
	TArray<class UAtomComponent*>                 Pool;                                              // 0x0028(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F61[0x30];                                     // 0x0038(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomComponentPool">();
	}
	static class UAtomComponentPool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomComponentPool>();
	}
};
static_assert(alignof(UAtomComponentPool) == 0x000008, "Wrong alignment on UAtomComponentPool");
static_assert(sizeof(UAtomComponentPool) == 0x000068, "Wrong size on UAtomComponentPool");
static_assert(offsetof(UAtomComponentPool, Pool) == 0x000028, "Member 'UAtomComponentPool::Pool' has a wrong offset!");

// Class CriWareRuntime.AtomCueSheetLoaderComponent
// 0x0090 (0x0290 - 0x0200)
class UAtomCueSheetLoaderComponent final : public USceneComponent
{
public:
	struct FSoftObjectPath                        CueSheetReference;                                 // 0x01F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCriFsBinderComponent*                  BinderComponent;                                   // 0x0210(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnLoadCompleted;                                   // 0x0218(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnLoadError;                                       // 0x0228(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_F62[0x30];                                     // 0x0238(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCueSheet*                     CueSheet;                                          // 0x0268(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F63[0x20];                                     // 0x0270(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void LoadAtomCueSheet(class UObject* WorldContextObject, TSoftObjectPtr<class USoundAtomCueSheet> Asset, TDelegate<void(class USoundAtomCueSheet* Loaded)> OnLoaded, const struct FLatentActionInfo& LatentInfo);

	class USoundAtomCueSheet* GetAtomCueSheet();
	EAtomCueSheetLoaderComponentStatus GetStatus();
	void Load();
	void OnAtomCueSheetLoaded__DelegateSignature(class USoundAtomCueSheet* Loaded);
	void OnLoadCompleted__DelegateSignature();
	void OnLoadError__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomCueSheetLoaderComponent">();
	}
	static class UAtomCueSheetLoaderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomCueSheetLoaderComponent>();
	}
};
static_assert(alignof(UAtomCueSheetLoaderComponent) == 0x000010, "Wrong alignment on UAtomCueSheetLoaderComponent");
static_assert(sizeof(UAtomCueSheetLoaderComponent) == 0x000290, "Wrong size on UAtomCueSheetLoaderComponent");
static_assert(offsetof(UAtomCueSheetLoaderComponent, CueSheetReference) == 0x0001F8, "Member 'UAtomCueSheetLoaderComponent::CueSheetReference' has a wrong offset!");
static_assert(offsetof(UAtomCueSheetLoaderComponent, BinderComponent) == 0x000210, "Member 'UAtomCueSheetLoaderComponent::BinderComponent' has a wrong offset!");
static_assert(offsetof(UAtomCueSheetLoaderComponent, OnLoadCompleted) == 0x000218, "Member 'UAtomCueSheetLoaderComponent::OnLoadCompleted' has a wrong offset!");
static_assert(offsetof(UAtomCueSheetLoaderComponent, OnLoadError) == 0x000228, "Member 'UAtomCueSheetLoaderComponent::OnLoadError' has a wrong offset!");
static_assert(offsetof(UAtomCueSheetLoaderComponent, CueSheet) == 0x000268, "Member 'UAtomCueSheetLoaderComponent::CueSheet' has a wrong offset!");

// Class CriWareRuntime.AtomDeviceWatcher
// 0x0028 (0x0050 - 0x0028)
class UAtomDeviceWatcher final : public UObject
{
public:
	FMulticastInlineDelegateProperty_             OnDeviceUpdated;                                   // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_F64[0x18];                                     // 0x0038(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetDeviceChannelCount();
	class FString GetDeviceName();
	void OnDeviceUpdated__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomDeviceWatcher">();
	}
	static class UAtomDeviceWatcher* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomDeviceWatcher>();
	}
};
static_assert(alignof(UAtomDeviceWatcher) == 0x000008, "Wrong alignment on UAtomDeviceWatcher");
static_assert(sizeof(UAtomDeviceWatcher) == 0x000050, "Wrong size on UAtomDeviceWatcher");
static_assert(offsetof(UAtomDeviceWatcher, OnDeviceUpdated) == 0x000028, "Member 'UAtomDeviceWatcher::OnDeviceUpdated' has a wrong offset!");

// Class CriWareRuntime.AtomDisposer
// 0x0010 (0x0230 - 0x0220)
class AAtomDisposer final : public AActor
{
public:
	uint8                                         Pad_F65[0x10];                                     // 0x0220(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomDisposer">();
	}
	static class AAtomDisposer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAtomDisposer>();
	}
};
static_assert(alignof(AAtomDisposer) == 0x000008, "Wrong alignment on AAtomDisposer");
static_assert(sizeof(AAtomDisposer) == 0x000230, "Wrong size on AAtomDisposer");

// Class CriWareRuntime.AtomListenerFocusPoint
// 0x0010 (0x0210 - 0x0200)
class UAtomListenerFocusPoint final : public USceneComponent
{
public:
	float                                         DistanceFocusLevel;                                // 0x01F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DirectionFocusLevel;                               // 0x01FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F66[0x10];                                     // 0x0200(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomListenerFocusPoint">();
	}
	static class UAtomListenerFocusPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomListenerFocusPoint>();
	}
};
static_assert(alignof(UAtomListenerFocusPoint) == 0x000010, "Wrong alignment on UAtomListenerFocusPoint");
static_assert(sizeof(UAtomListenerFocusPoint) == 0x000210, "Wrong size on UAtomListenerFocusPoint");
static_assert(offsetof(UAtomListenerFocusPoint, DistanceFocusLevel) == 0x0001F8, "Member 'UAtomListenerFocusPoint::DistanceFocusLevel' has a wrong offset!");
static_assert(offsetof(UAtomListenerFocusPoint, DirectionFocusLevel) == 0x0001FC, "Member 'UAtomListenerFocusPoint::DirectionFocusLevel' has a wrong offset!");

// Class CriWareRuntime.AtomParameterComponent
// 0x0008 (0x00B8 - 0x00B0)
class UAtomParameterComponent final : public UActorComponent
{
public:
	class UAtomSoundObject*                       SoundObject;                                       // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomParameterComponent">();
	}
	static class UAtomParameterComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomParameterComponent>();
	}
};
static_assert(alignof(UAtomParameterComponent) == 0x000008, "Wrong alignment on UAtomParameterComponent");
static_assert(sizeof(UAtomParameterComponent) == 0x0000B8, "Wrong size on UAtomParameterComponent");
static_assert(offsetof(UAtomParameterComponent, SoundObject) == 0x0000B0, "Member 'UAtomParameterComponent::SoundObject' has a wrong offset!");

// Class CriWareRuntime.AtomProfileData
// 0x0000 (0x0028 - 0x0028)
class UAtomProfileData final : public UBlueprintFunctionLibrary
{
public:
	static void CriWareAdx2ProfileDataSort(const TArray<struct FAtomProfileItem>& Original_item, EAtomProfileSortType Sort_type, EAtomSortOrderType Order_type, TArray<struct FAtomProfileItem>* Sorted_item);
	static TArray<struct FAtomProfileItem> CriWareAdx2ProfileDataUpdate(const class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomProfileData">();
	}
	static class UAtomProfileData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomProfileData>();
	}
};
static_assert(alignof(UAtomProfileData) == 0x000008, "Wrong alignment on UAtomProfileData");
static_assert(sizeof(UAtomProfileData) == 0x000028, "Wrong size on UAtomProfileData");

// Class CriWareRuntime.AtomSound
// 0x0008 (0x0228 - 0x0220)
class AAtomSound final : public AActor
{
public:
	class UAtomComponent*                         AtomComponent;                                     // 0x0220(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomSound">();
	}
	static class AAtomSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAtomSound>();
	}
};
static_assert(alignof(AAtomSound) == 0x000008, "Wrong alignment on AAtomSound");
static_assert(sizeof(AAtomSound) == 0x000228, "Wrong size on AAtomSound");
static_assert(offsetof(AAtomSound, AtomComponent) == 0x000220, "Member 'AAtomSound::AtomComponent' has a wrong offset!");

// Class CriWareRuntime.AtomSoundData
// 0x0010 (0x0230 - 0x0220)
class AAtomSoundData final : public AActor
{
public:
	class USoundAtomCueSheet*                     CueSheet;                                          // 0x0220(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F68[0x8];                                      // 0x0228(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomSoundData">();
	}
	static class AAtomSoundData* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAtomSoundData>();
	}
};
static_assert(alignof(AAtomSoundData) == 0x000008, "Wrong alignment on AAtomSoundData");
static_assert(sizeof(AAtomSoundData) == 0x000230, "Wrong size on AAtomSoundData");
static_assert(offsetof(AAtomSoundData, CueSheet) == 0x000220, "Member 'AAtomSoundData::CueSheet' has a wrong offset!");

// Class CriWareRuntime.AtomSoundObject
// 0x0018 (0x0048 - 0x0030)
class UAtomSoundObject final : public UDataAsset
{
public:
	bool                                          EnableVoiceLimitScope;                             // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableCategoryCueLimitScope;                       // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F69[0x16];                                     // 0x0032(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomSoundObject">();
	}
	static class UAtomSoundObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomSoundObject>();
	}
};
static_assert(alignof(UAtomSoundObject) == 0x000008, "Wrong alignment on UAtomSoundObject");
static_assert(sizeof(UAtomSoundObject) == 0x000048, "Wrong size on UAtomSoundObject");
static_assert(offsetof(UAtomSoundObject, EnableVoiceLimitScope) == 0x000030, "Member 'UAtomSoundObject::EnableVoiceLimitScope' has a wrong offset!");
static_assert(offsetof(UAtomSoundObject, EnableCategoryCueLimitScope) == 0x000031, "Member 'UAtomSoundObject::EnableCategoryCueLimitScope' has a wrong offset!");

// Class CriWareRuntime.AtomSpectrumAnalyzer
// 0x0000 (0x0028 - 0x0028)
class UAtomSpectrumAnalyzer final : public UBlueprintFunctionLibrary
{
public:
	static void CreateDspSpectra(class UAtomAsrRack* Asr_rack, const class FString& bus_name, int32 Num_bands);
	static void GetLevels(TArray<float>* Spectra);
	static void GetLevelsDB(float Display_range, TArray<float>* Spectra);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomSpectrumAnalyzer">();
	}
	static class UAtomSpectrumAnalyzer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomSpectrumAnalyzer>();
	}
};
static_assert(alignof(UAtomSpectrumAnalyzer) == 0x000008, "Wrong alignment on UAtomSpectrumAnalyzer");
static_assert(sizeof(UAtomSpectrumAnalyzer) == 0x000028, "Wrong size on UAtomSpectrumAnalyzer");

// Class CriWareRuntime.AtomStatics
// 0x0000 (0x0028 - 0x0028)
class UAtomStatics final : public UBlueprintFunctionLibrary
{
public:
	static void AddToAtomComponentIds(class UObject* AtomPlayGateRef, class UObject* SkeltalMeshComponentRef, int32 AtomComponentID);
	static class UAtomComponent* CreateRootedAtomComponent(const class UObject* WorldContextObject, bool bAutoDestroy);
	static bool GetForceCreateAtomComponent();
	static bool LoadAtomConfig(class USoundAtomConfig* AcfObject);
	static void PauseAudioOutput(bool bPause);
	static void PlaySoundAtLocation(class UObject* WorldContextObject, class USoundAtomCue* Sound, const struct FVector& Location, const struct FRotator& Rotation, float VolumeMultiplier, float PitchMultiplier, float StartTime, class USoundAttenuation* AttenuationSettings, class USoundConcurrency* ConcurrencySettings);
	static class UAtomComponent* PlaySoundAttached(class USoundAtomCue* Sound, class USceneComponent* AttachToComponent, class FName AttachPointName, const struct FVector& Location, bool bStopWhenAttachedToDestroyed, float VolumeMultiplier, float PitchMultiplier, float StartTime, class USoundAttenuation* AttenuationSettings);
	static class UAtomComponent* PlaySoundForAnimNotify(class USoundAtomCue* Sound, class USceneComponent* AttachToComponent, class FName AttachPointName, const struct FVector& Location, bool bStopWhenAttachedToDestroyed, float VolumeMultiplier, float PitchMultiplier, float StartTime, class USoundAttenuation* AttenuationSettings, bool bFollow);
	static void SetForceCreateAtomComponent(bool Enable);
	static class UAtomComponent* SpawnSound2D(const class UObject* WorldContextObject, class USoundAtomCue* Sound, float PitchMultiplier, float StartTime, bool bPersistAcrossLevelTransition, bool bAutoDestroy);
	static class UAtomComponent* SpawnSoundAtLocation(const class UObject* WorldContextObject, class USoundAtomCue* Sound, const struct FVector& Location, const struct FRotator& Rotation, float VolumeMultiplier, float PitchMultiplier, float StartTime, class USoundAttenuation* AttenuationSettings, class USoundConcurrency* ConcurrencySettings, bool bAutoDestroy);
	static class UAtomComponent* SpawnSoundAttached(class USoundAtomCue* Sound, class USceneComponent* AttachToComponent, class FName AttachPointName, const struct FVector& Location, const struct FRotator& Rotation, EAttachLocation LocationType, bool bStopWhenAttachedToDestroyed, float VolumeMultiplier, float PitchMultiplier, float StartTime, class USoundAttenuation* AttenuationSettings, class USoundConcurrency* ConcurrencySettings, bool bAutoDestroy);
	static void StopAllSounds();
	static void StopAllSoundsForKeyFromAtomComponentIds(class UObject* AtomPlayGateRef, class UObject* SkeltalMeshComponentRef);
	static void UpdateDistanceFactorForAllSounds(float ArgDistanceFactor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomStatics">();
	}
	static class UAtomStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomStatics>();
	}
};
static_assert(alignof(UAtomStatics) == 0x000008, "Wrong alignment on UAtomStatics");
static_assert(sizeof(UAtomStatics) == 0x000028, "Wrong size on UAtomStatics");

// Class CriWareRuntime.AtomTriggerTableFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UAtomTriggerTableFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool GetDataTableRowFromName(class UDataTable* Table, class FName RowName, struct FAtomTriggerRow* OutRow);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomTriggerTableFunctionLibrary">();
	}
	static class UAtomTriggerTableFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomTriggerTableFunctionLibrary>();
	}
};
static_assert(alignof(UAtomTriggerTableFunctionLibrary) == 0x000008, "Wrong alignment on UAtomTriggerTableFunctionLibrary");
static_assert(sizeof(UAtomTriggerTableFunctionLibrary) == 0x000028, "Wrong size on UAtomTriggerTableFunctionLibrary");

// Class CriWareRuntime.CriFsBinderComponent
// 0x0050 (0x0250 - 0x0200)
class UCriFsBinderComponent final : public USceneComponent
{
public:
	class FString                                 FilePath;                                          // 0x01F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnBindCompleted;                                   // 0x0208(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnBindError;                                       // 0x0218(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_F7B[0x28];                                     // 0x0228(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Bind();
	ECriFsBinderStatus GetStatus();
	void OnBindCompleted__DelegateSignature();
	void OnBindError__DelegateSignature();
	void Stop();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CriFsBinderComponent">();
	}
	static class UCriFsBinderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCriFsBinderComponent>();
	}
};
static_assert(alignof(UCriFsBinderComponent) == 0x000010, "Wrong alignment on UCriFsBinderComponent");
static_assert(sizeof(UCriFsBinderComponent) == 0x000250, "Wrong size on UCriFsBinderComponent");
static_assert(offsetof(UCriFsBinderComponent, FilePath) == 0x0001F8, "Member 'UCriFsBinderComponent::FilePath' has a wrong offset!");
static_assert(offsetof(UCriFsBinderComponent, OnBindCompleted) == 0x000208, "Member 'UCriFsBinderComponent::OnBindCompleted' has a wrong offset!");
static_assert(offsetof(UCriFsBinderComponent, OnBindError) == 0x000218, "Member 'UCriFsBinderComponent::OnBindError' has a wrong offset!");

// Class CriWareRuntime.CriFsLoader
// 0x0008 (0x0228 - 0x0220)
class ACriFsLoader final : public AActor
{
public:
	class UCriFsLoaderComponent*                  LoaderComponent;                                   // 0x0220(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CriFsLoader">();
	}
	static class ACriFsLoader* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACriFsLoader>();
	}
};
static_assert(alignof(ACriFsLoader) == 0x000008, "Wrong alignment on ACriFsLoader");
static_assert(sizeof(ACriFsLoader) == 0x000228, "Wrong size on ACriFsLoader");
static_assert(offsetof(ACriFsLoader, LoaderComponent) == 0x000220, "Member 'ACriFsLoader::LoaderComponent' has a wrong offset!");

// Class CriWareRuntime.CriFsLoaderComponent
// 0x0070 (0x0270 - 0x0200)
class UCriFsLoaderComponent final : public USceneComponent
{
public:
	class FString                                 FilePath;                                          // 0x01F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnLoadCompleted;                                   // 0x0208(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnLoadError;                                       // 0x0218(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_F7C[0x48];                                     // 0x0228(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const TArray<uint8> GetDataArray();
	ECriFsLoaderStatus GetStatus();
	void Load();
	void OnLoadCompleted__DelegateSignature();
	void OnLoadError__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CriFsLoaderComponent">();
	}
	static class UCriFsLoaderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCriFsLoaderComponent>();
	}
};
static_assert(alignof(UCriFsLoaderComponent) == 0x000010, "Wrong alignment on UCriFsLoaderComponent");
static_assert(sizeof(UCriFsLoaderComponent) == 0x000270, "Wrong size on UCriFsLoaderComponent");
static_assert(offsetof(UCriFsLoaderComponent, FilePath) == 0x0001F8, "Member 'UCriFsLoaderComponent::FilePath' has a wrong offset!");
static_assert(offsetof(UCriFsLoaderComponent, OnLoadCompleted) == 0x000208, "Member 'UCriFsLoaderComponent::OnLoadCompleted' has a wrong offset!");
static_assert(offsetof(UCriFsLoaderComponent, OnLoadError) == 0x000218, "Member 'UCriFsLoaderComponent::OnLoadError' has a wrong offset!");

// Class CriWareRuntime.CriWareFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UCriWareFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void SetGameVariableByName(const class FString& GameVariableName, float Value);
	static void SetGlobalLabelToSelectorByName(const class FString& SelectorName, const class FString& LabelName);
	static void SetSpeakerAngleArray(ECriWareSpeakerSystem SpeakerSystem, const TArray<float>& Angles);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CriWareFunctionLibrary">();
	}
	static class UCriWareFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCriWareFunctionLibrary>();
	}
};
static_assert(alignof(UCriWareFunctionLibrary) == 0x000008, "Wrong alignment on UCriWareFunctionLibrary");
static_assert(sizeof(UCriWareFunctionLibrary) == 0x000028, "Wrong size on UCriWareFunctionLibrary");

// Class CriWareRuntime.CriWareInitializer
// 0x0000 (0x0028 - 0x0028)
class UCriWareInitializer final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CriWareInitializer">();
	}
	static class UCriWareInitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCriWareInitializer>();
	}
};
static_assert(alignof(UCriWareInitializer) == 0x000008, "Wrong alignment on UCriWareInitializer");
static_assert(sizeof(UCriWareInitializer) == 0x000028, "Wrong size on UCriWareInitializer");

// Class CriWareRuntime.CriWarePluginSettings
// 0x0280 (0x02A8 - 0x0028)
class UCriWarePluginSettings final : public UObject
{
public:
	bool                                          bNoExistCriWareIni;                                // 0x0028(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F7F[0x7];                                      // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDirectoryPath                         NonAssetContentDir;                                // 0x0030(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FString                                 ContentDir;                                        // 0x0040(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F80[0x10];                                     // 0x0050(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumBinders;                                        // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F81[0x4];                                      // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxBinds;                                          // 0x0068(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F82[0x4];                                      // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumLoaders;                                        // 0x0070(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F83[0x4];                                      // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxPath;                                           // 0x0078(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F84[0x4];                                      // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          OutputsLogFileSystem;                              // 0x0080(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F85[0x3];                                      // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_FileAccessThreadAffinityMask;                  // 0x0084(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F86[0x4];                                      // 0x0088(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_DataDecompressionThreadAffinityMask;           // 0x008C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F87[0x4];                                      // 0x0090(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_MemoryFileSystemThreadAffinityMask;            // 0x0094(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F88[0x4];                                      // 0x0098(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_FileAccessThreadPriority;                      // 0x009C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F89[0x4];                                      // 0x00A0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_DataDecompressionThreadPriority;               // 0x00A4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F8A[0x4];                                      // 0x00A8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_MemoryFileSystemThreadPriority;                // 0x00AC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F8B[0x4];                                      // 0x00B0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          AutomaticallyCreateCueAsset;                       // 0x00B4(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UsesInGamePreview;                                 // 0x00B5(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F8C[0x1];                                      // 0x00B6(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          OutputsLogAtom;                                    // 0x00B7(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F8D[0x4];                                      // 0x00B8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxVirtualVoices;                                  // 0x00BC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F8E[0x4];                                      // 0x00C0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumStandardMemoryVoices;                           // 0x00C4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F8F[0x4];                                      // 0x00C8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StandardMemoryVoiceNumChannels;                    // 0x00CC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F90[0x4];                                      // 0x00D0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StandardMemoryVoiceSamplingRate;                   // 0x00D4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F91[0x4];                                      // 0x00D8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumStandardStreamingVoices;                        // 0x00DC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F92[0x4];                                      // 0x00E0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StandardStreamingVoiceNumChannels;                 // 0x00E4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F93[0x4];                                      // 0x00E8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StandardStreamingVoiceSamplingRate;                // 0x00EC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F94[0x4];                                      // 0x00F0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          PoolAtomComponent;                                 // 0x00F4(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F95[0x3];                                      // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        AtomConfig;                                        // 0x00F8(0x0018)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F96[0x18];                                     // 0x0110(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AcfFileName;                                       // 0x0128(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceFactor;                                    // 0x0138(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F97[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	EAtomSoundRendererType                        SoundRendererTypeUI;                               // 0x0140(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F98[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SoundRendererType;                                 // 0x0144(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F99[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAtomAsrRackConfigUI>           AsrRackConfigUI;                                   // 0x0150(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomAsrRackConfig>             AsrRackConfig;                                     // 0x0160(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9A[0x10];                                     // 0x0170(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Hardware1;                                         // 0x0180(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Hardware2;                                         // 0x0190(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Hardware3;                                         // 0x01A0(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Hardware4;                                         // 0x01B0(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EconomicTickMarginDistance;                        // 0x01C0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9B[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EconomicTickFrequency;                             // 0x01C8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9C[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CullingMarginDistance;                             // 0x01D0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9D[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HcaMxVoiceSamplingRate;                            // 0x01D8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9E[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumHcaMxMemoryVoices;                              // 0x01E0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9F[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HcaMxMemoryVoiceNumChannels;                       // 0x01E8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA0[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumHcaMxStreamingVoices;                           // 0x01F0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA1[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HcaMxStreamingVoiceNumChannels;                    // 0x01F8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA2[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          WASAPI_IsExclusive;                                // 0x0200(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA3[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WASAPI_BitsPerSample;                              // 0x0204(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA4[0x4];                                      // 0x0208(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WASAPI_SamplingRate;                               // 0x020C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA5[0x4];                                      // 0x0210(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WASAPI_NumChannels;                                // 0x0214(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA6[0x4];                                      // 0x0218(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_ServerThreadAffinityMask;                      // 0x021C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA7[0x4];                                      // 0x0220(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_OutputThreadAffinityMask;                      // 0x0224(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA8[0x4];                                      // 0x0228(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_ServerThreadPriority;                          // 0x022C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA9[0x4];                                      // 0x0230(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_OutputThreadPriority;                          // 0x0234(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FAA[0x4];                                      // 0x0238(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          PS4_UseAudio3d;                                    // 0x023C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FAB[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_NumberOfAudio3dMemoryVoices;                   // 0x0240(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FAC[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_SamplingRateOfAudio3dMemoryVoices;             // 0x0248(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FAD[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_NumberOfAudio3dStreamingVoices;                // 0x0250(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FAE[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_SamplingRateOfAudio3dStreamingVoices;          // 0x0258(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FAF[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          InitializeMana;                                    // 0x0260(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
