#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomRigRail

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Project_structs.hpp"


namespace SDK::Params
{

// Function CustomRigRail.CustomRigRail_C.UserConstructionScript
// 0x02D0 (0x02D0 - 0x0000)
struct CustomRigRail_C_UserConstructionScript final
{
public:
	TArray<struct FCustomSplinePoint>             Lo_SplinePoint;                                    // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Lo_Cnt;                                            // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A32[0x8];                                     // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetAdjustedCamOffsetTrans_ReturnValue;    // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddActorWorldTransform_SweepHitResult; // 0x0050(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddActorLocalTransform_SweepHitResult; // 0x00D8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCustomSplinePoint                     CallFunc_Array_Get_Item;                           // 0x0168(0x0034)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A33[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCustomSplinePoint                     K2Node_MakeStruct_CustomSplinePoint;               // 0x01D4(0x0034)(NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0208(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A34[0x3];                                     // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue_1;        // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A35[0x3];                                     // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomRigRail_C_UserConstructionScript) == 0x000010, "Wrong alignment on CustomRigRail_C_UserConstructionScript");
static_assert(sizeof(CustomRigRail_C_UserConstructionScript) == 0x0002D0, "Wrong size on CustomRigRail_C_UserConstructionScript");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, Lo_SplinePoint) == 0x000000, "Member 'CustomRigRail_C_UserConstructionScript::Lo_SplinePoint' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, Lo_Cnt) == 0x000010, "Member 'CustomRigRail_C_UserConstructionScript::Lo_Cnt' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000014, "Member 'CustomRigRail_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, CallFunc_GetAdjustedCamOffsetTrans_ReturnValue) == 0x000020, "Member 'CustomRigRail_C_UserConstructionScript::CallFunc_GetAdjustedCamOffsetTrans_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, CallFunc_K2_AddActorWorldTransform_SweepHitResult) == 0x000050, "Member 'CustomRigRail_C_UserConstructionScript::CallFunc_K2_AddActorWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, CallFunc_K2_AddActorLocalTransform_SweepHitResult) == 0x0000D8, "Member 'CustomRigRail_C_UserConstructionScript::CallFunc_K2_AddActorLocalTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000160, "Member 'CustomRigRail_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000164, "Member 'CustomRigRail_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000168, "Member 'CustomRigRail_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x00019C, "Member 'CustomRigRail_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x0001A0, "Member 'CustomRigRail_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, CallFunc_Conv_VectorToString_ReturnValue) == 0x0001A8, "Member 'CustomRigRail_C_UserConstructionScript::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue) == 0x0001B8, "Member 'CustomRigRail_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001C8, "Member 'CustomRigRail_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, K2Node_MakeStruct_CustomSplinePoint) == 0x0001D4, "Member 'CustomRigRail_C_UserConstructionScript::K2Node_MakeStruct_CustomSplinePoint' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000208, "Member 'CustomRigRail_C_UserConstructionScript::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000290, "Member 'CustomRigRail_C_UserConstructionScript::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x000294, "Member 'CustomRigRail_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, CallFunc_Conv_VectorToString_ReturnValue_1) == 0x000298, "Member 'CustomRigRail_C_UserConstructionScript::CallFunc_Conv_VectorToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0002A8, "Member 'CustomRigRail_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess) == 0x0002B8, "Member 'CustomRigRail_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_1) == 0x0002BC, "Member 'CustomRigRail_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_UserConstructionScript, CallFunc_Greater_IntInt_ReturnValue) == 0x0002C0, "Member 'CustomRigRail_C_UserConstructionScript::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function CustomRigRail.CustomRigRail_C.Reset Transform
// 0x01E0 (0x01E0 - 0x0000)
struct CustomRigRail_C_Reset_Transform final
{
public:
	struct FTransform                             CallFunc_GetAdjustedCamOffsetTrans_ReturnValue;    // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddActorLocalTransform_SweepHitResult; // 0x0030(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x00B8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A36[0x3];                                     // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddActorWorldTransform_SweepHitResult; // 0x0144(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomRigRail_C_Reset_Transform) == 0x000010, "Wrong alignment on CustomRigRail_C_Reset_Transform");
static_assert(sizeof(CustomRigRail_C_Reset_Transform) == 0x0001E0, "Wrong size on CustomRigRail_C_Reset_Transform");
static_assert(offsetof(CustomRigRail_C_Reset_Transform, CallFunc_GetAdjustedCamOffsetTrans_ReturnValue) == 0x000000, "Member 'CustomRigRail_C_Reset_Transform::CallFunc_GetAdjustedCamOffsetTrans_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_Reset_Transform, CallFunc_K2_AddActorLocalTransform_SweepHitResult) == 0x000030, "Member 'CustomRigRail_C_Reset_Transform::CallFunc_K2_AddActorLocalTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_Reset_Transform, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0000B8, "Member 'CustomRigRail_C_Reset_Transform::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_Reset_Transform, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000140, "Member 'CustomRigRail_C_Reset_Transform::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_Reset_Transform, CallFunc_K2_AddActorWorldTransform_SweepHitResult) == 0x000144, "Member 'CustomRigRail_C_Reset_Transform::CallFunc_K2_AddActorWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_Reset_Transform, CallFunc_Array_Length_ReturnValue) == 0x0001CC, "Member 'CustomRigRail_C_Reset_Transform::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_Reset_Transform, K2Node_SwitchEnum_CmpSuccess) == 0x0001D0, "Member 'CustomRigRail_C_Reset_Transform::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_Reset_Transform, CallFunc_Greater_IntInt_ReturnValue) == 0x0001D1, "Member 'CustomRigRail_C_Reset_Transform::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function CustomRigRail.CustomRigRail_C.GetAdjustedCamOffsetTrans
// 0x0090 (0x0090 - 0x0000)
struct CustomRigRail_C_GetAdjustedCamOffsetTrans final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomRigRail_C_GetAdjustedCamOffsetTrans) == 0x000010, "Wrong alignment on CustomRigRail_C_GetAdjustedCamOffsetTrans");
static_assert(sizeof(CustomRigRail_C_GetAdjustedCamOffsetTrans) == 0x000090, "Wrong size on CustomRigRail_C_GetAdjustedCamOffsetTrans");
static_assert(offsetof(CustomRigRail_C_GetAdjustedCamOffsetTrans, ReturnValue) == 0x000000, "Member 'CustomRigRail_C_GetAdjustedCamOffsetTrans::ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_GetAdjustedCamOffsetTrans, CallFunc_BreakTransform_Location) == 0x000030, "Member 'CustomRigRail_C_GetAdjustedCamOffsetTrans::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_GetAdjustedCamOffsetTrans, CallFunc_BreakTransform_Rotation) == 0x00003C, "Member 'CustomRigRail_C_GetAdjustedCamOffsetTrans::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_GetAdjustedCamOffsetTrans, CallFunc_BreakTransform_Scale) == 0x000048, "Member 'CustomRigRail_C_GetAdjustedCamOffsetTrans::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_GetAdjustedCamOffsetTrans, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000054, "Member 'CustomRigRail_C_GetAdjustedCamOffsetTrans::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomRigRail_C_GetAdjustedCamOffsetTrans, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'CustomRigRail_C_GetAdjustedCamOffsetTrans::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

}

