#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DAF_CommonSandSmoke

#include "Basic.hpp"


namespace SDK::Params
{

// Function DAF_CommonSandSmoke.DAF_CommonSandSmoke_C.ExecuteUbergraph_DAF_CommonSandSmoke
// 0x0050 (0x0050 - 0x0000)
struct DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UParticleSystemComponent* PSystem)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B05[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectGameInstance_C*                 K2Node_DynamicCast_AsProject_Game_Instance;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B06[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               K2Node_CustomEvent_PSystem;                        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke) == 0x000008, "Wrong alignment on DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke");
static_assert(sizeof(DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke) == 0x000050, "Wrong size on DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke");
static_assert(offsetof(DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke, EntryPoint) == 0x000000, "Member 'DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke::EntryPoint' has a wrong offset!");
static_assert(offsetof(DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke, CallFunc_GetPlayerPawn_ReturnValue) == 0x000018, "Member 'DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke, CallFunc_GetDistanceTo_ReturnValue) == 0x000024, "Member 'DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke, CallFunc_GetGameInstance_ReturnValue) == 0x000028, "Member 'DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke, K2Node_DynamicCast_AsProject_Game_Instance) == 0x000030, "Member 'DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke::K2Node_DynamicCast_AsProject_Game_Instance' has a wrong offset!");
static_assert(offsetof(DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke, CallFunc_Add_FloatFloat_ReturnValue) == 0x00003C, "Member 'DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke, K2Node_CustomEvent_PSystem) == 0x000040, "Member 'DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke::K2Node_CustomEvent_PSystem' has a wrong offset!");
static_assert(offsetof(DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000048, "Member 'DAF_CommonSandSmoke_C_ExecuteUbergraph_DAF_CommonSandSmoke::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function DAF_CommonSandSmoke.DAF_CommonSandSmoke_C.OnSystemFinished_§ŸÛ»_0
// 0x0008 (0x0008 - 0x0000)
struct DAF_CommonSandSmoke_C_OnSystemFinished______0 final
{
public:
	class UParticleSystemComponent*               PSystem;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DAF_CommonSandSmoke_C_OnSystemFinished______0) == 0x000008, "Wrong alignment on DAF_CommonSandSmoke_C_OnSystemFinished______0");
static_assert(sizeof(DAF_CommonSandSmoke_C_OnSystemFinished______0) == 0x000008, "Wrong size on DAF_CommonSandSmoke_C_OnSystemFinished______0");
static_assert(offsetof(DAF_CommonSandSmoke_C_OnSystemFinished______0, PSystem) == 0x000000, "Member 'DAF_CommonSandSmoke_C_OnSystemFinished______0::PSystem' has a wrong offset!");

// Function DAF_CommonSandSmoke.DAF_CommonSandSmoke_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct DAF_CommonSandSmoke_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DAF_CommonSandSmoke_C_ReceiveTick) == 0x000004, "Wrong alignment on DAF_CommonSandSmoke_C_ReceiveTick");
static_assert(sizeof(DAF_CommonSandSmoke_C_ReceiveTick) == 0x000004, "Wrong size on DAF_CommonSandSmoke_C_ReceiveTick");
static_assert(offsetof(DAF_CommonSandSmoke_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'DAF_CommonSandSmoke_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

