#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DAF_CommonSandSmoke

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "DAF_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DAF_CommonSandSmoke.DAF_CommonSandSmoke_C
// 0x0030 (0x0260 - 0x0230)
class ADAF_CommonSandSmoke_C final : public ADAF_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_DAF_CommonSandSmoke_C;              // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<EObjectTypeQuery>                      Obj;                                               // 0x0238(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Fix;                                               // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B04[0x3];                                     // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           NewVar_0;                                          // 0x024C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DAF_CommonSandSmoke(int32 EntryPoint);
	void OnSystemFinished______0(class UParticleSystemComponent* PSystem);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DAF_CommonSandSmoke_C">();
	}
	static class ADAF_CommonSandSmoke_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADAF_CommonSandSmoke_C>();
	}
};
static_assert(alignof(ADAF_CommonSandSmoke_C) == 0x000008, "Wrong alignment on ADAF_CommonSandSmoke_C");
static_assert(sizeof(ADAF_CommonSandSmoke_C) == 0x000260, "Wrong size on ADAF_CommonSandSmoke_C");
static_assert(offsetof(ADAF_CommonSandSmoke_C, UberGraphFrame_DAF_CommonSandSmoke_C) == 0x000230, "Member 'ADAF_CommonSandSmoke_C::UberGraphFrame_DAF_CommonSandSmoke_C' has a wrong offset!");
static_assert(offsetof(ADAF_CommonSandSmoke_C, Obj) == 0x000238, "Member 'ADAF_CommonSandSmoke_C::Obj' has a wrong offset!");
static_assert(offsetof(ADAF_CommonSandSmoke_C, Fix) == 0x000248, "Member 'ADAF_CommonSandSmoke_C::Fix' has a wrong offset!");
static_assert(offsetof(ADAF_CommonSandSmoke_C, NewVar_0) == 0x00024C, "Member 'ADAF_CommonSandSmoke_C::NewVar_0' has a wrong offset!");

}

