#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeadActionParticles_T

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK
{

// UserDefinedStruct DeadActionParticles_T.DeadActionParticles_T
// 0x0098 (0x0098 - 0x0000)
struct FDeadActionParticles_T final
{
public:
	E_BTL_DEAD_EFFECT                             DeadType_6_3E0D3BD1469180CC55F8F8A8865EF1CE;       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22CA[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UParticleSystem>> Particle_32_59C0C9534D8B3FB93124DC9949F2E563;      // 0x0008(0x0010)(Edit, BlueprintVisible)
	TSoftObjectPtr<class USoundAtomCue>           SE_16_25CB62A147CE0424051D7581D477BFB9;            // 0x0018(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   SocketName_9_4B854009409F0B56A1463C9A10156304;     // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UCurveFloat>             ProgressCurve_31_7B813843462FFC515AAA6892687235B4; // 0x0048(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialParameterApplier> MaterialParameterApplier_30_5DCE4B094A2287D8DCC7A9BE452B4777; // 0x0070(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FDeadActionParticles_T) == 0x000008, "Wrong alignment on FDeadActionParticles_T");
static_assert(sizeof(FDeadActionParticles_T) == 0x000098, "Wrong size on FDeadActionParticles_T");
static_assert(offsetof(FDeadActionParticles_T, DeadType_6_3E0D3BD1469180CC55F8F8A8865EF1CE) == 0x000000, "Member 'FDeadActionParticles_T::DeadType_6_3E0D3BD1469180CC55F8F8A8865EF1CE' has a wrong offset!");
static_assert(offsetof(FDeadActionParticles_T, Particle_32_59C0C9534D8B3FB93124DC9949F2E563) == 0x000008, "Member 'FDeadActionParticles_T::Particle_32_59C0C9534D8B3FB93124DC9949F2E563' has a wrong offset!");
static_assert(offsetof(FDeadActionParticles_T, SE_16_25CB62A147CE0424051D7581D477BFB9) == 0x000018, "Member 'FDeadActionParticles_T::SE_16_25CB62A147CE0424051D7581D477BFB9' has a wrong offset!");
static_assert(offsetof(FDeadActionParticles_T, SocketName_9_4B854009409F0B56A1463C9A10156304) == 0x000040, "Member 'FDeadActionParticles_T::SocketName_9_4B854009409F0B56A1463C9A10156304' has a wrong offset!");
static_assert(offsetof(FDeadActionParticles_T, ProgressCurve_31_7B813843462FFC515AAA6892687235B4) == 0x000048, "Member 'FDeadActionParticles_T::ProgressCurve_31_7B813843462FFC515AAA6892687235B4' has a wrong offset!");
static_assert(offsetof(FDeadActionParticles_T, MaterialParameterApplier_30_5DCE4B094A2287D8DCC7A9BE452B4777) == 0x000070, "Member 'FDeadActionParticles_T::MaterialParameterApplier_30_5DCE4B094A2287D8DCC7A9BE452B4777' has a wrong offset!");

}

