#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DebugMapMemo

#include "Basic.hpp"

#include "ST_MAP_DEBUG_MemoColor_structs.hpp"
#include "E_MAP_DebugMemo_structs.hpp"
#include "MapActorCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DebugMapMemo.DebugMapMemo_C
// 0x0038 (0x02B0 - 0x0278)
class ADebugMapMemo_C final : public AMapActorCore_C
{
public:
	class FText                                   Memo;                                              // 0x0278(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          NewVar_0;                                          // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E65[0x7];                                     // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FST_MAP_DEBUG_MemoColor>        StaffColor;                                        // 0x0298(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	E_MAP_DebugMemo                               Staff;                                             // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DebugMapMemo_C">();
	}
	static class ADebugMapMemo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADebugMapMemo_C>();
	}
};
static_assert(alignof(ADebugMapMemo_C) == 0x000008, "Wrong alignment on ADebugMapMemo_C");
static_assert(sizeof(ADebugMapMemo_C) == 0x0002B0, "Wrong size on ADebugMapMemo_C");
static_assert(offsetof(ADebugMapMemo_C, Memo) == 0x000278, "Member 'ADebugMapMemo_C::Memo' has a wrong offset!");
static_assert(offsetof(ADebugMapMemo_C, NewVar_0) == 0x000290, "Member 'ADebugMapMemo_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(ADebugMapMemo_C, StaffColor) == 0x000298, "Member 'ADebugMapMemo_C::StaffColor' has a wrong offset!");
static_assert(offsetof(ADebugMapMemo_C, Staff) == 0x0002A8, "Member 'ADebugMapMemo_C::Staff' has a wrong offset!");

}

