#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DebugMenuFuncObjStruct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct DebugMenuFuncObjStruct.DebugMenuFuncObjStruct
// 0x0048 (0x0048 - 0x0000)
struct FDebugMenuFuncObjStruct final
{
public:
	class FName                                   PathName_13_5959B0D74A68DC7391D4729069C96549;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   FuncObj_12_88CC869C43E695165180CAAC9CAB0B63;       // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          NoAddDebugMenuItem_11_39BA18974A633DF9006C87B98E276C1A; // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CA6[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DispName_JP_18_9FC46166432D45458314FE8065E2510A;   // 0x0034(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DispName_EN_19_1A3B58374EAB15F946B42887F4283D33;   // 0x003C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FDebugMenuFuncObjStruct) == 0x000008, "Wrong alignment on FDebugMenuFuncObjStruct");
static_assert(sizeof(FDebugMenuFuncObjStruct) == 0x000048, "Wrong size on FDebugMenuFuncObjStruct");
static_assert(offsetof(FDebugMenuFuncObjStruct, PathName_13_5959B0D74A68DC7391D4729069C96549) == 0x000000, "Member 'FDebugMenuFuncObjStruct::PathName_13_5959B0D74A68DC7391D4729069C96549' has a wrong offset!");
static_assert(offsetof(FDebugMenuFuncObjStruct, FuncObj_12_88CC869C43E695165180CAAC9CAB0B63) == 0x000008, "Member 'FDebugMenuFuncObjStruct::FuncObj_12_88CC869C43E695165180CAAC9CAB0B63' has a wrong offset!");
static_assert(offsetof(FDebugMenuFuncObjStruct, NoAddDebugMenuItem_11_39BA18974A633DF9006C87B98E276C1A) == 0x000030, "Member 'FDebugMenuFuncObjStruct::NoAddDebugMenuItem_11_39BA18974A633DF9006C87B98E276C1A' has a wrong offset!");
static_assert(offsetof(FDebugMenuFuncObjStruct, DispName_JP_18_9FC46166432D45458314FE8065E2510A) == 0x000034, "Member 'FDebugMenuFuncObjStruct::DispName_JP_18_9FC46166432D45458314FE8065E2510A' has a wrong offset!");
static_assert(offsetof(FDebugMenuFuncObjStruct, DispName_EN_19_1A3B58374EAB15F946B42887F4283D33) == 0x00003C, "Member 'FDebugMenuFuncObjStruct::DispName_EN_19_1A3B58374EAB15F946B42887F4283D33' has a wrong offset!");

}

