#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DebugMapMemo

#include "Basic.hpp"

#include "ST_MAP_DEBUG_MemoColor_structs.hpp"


namespace SDK::Params
{

// Function DebugMapMemo.DebugMapMemo_C.UserConstructionScript
// 0x000C (0x000C - 0x0000)
struct DebugMapMemo_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_MAP_DEBUG_MemoColor                CallFunc_Array_Get_Item;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DebugMapMemo_C_UserConstructionScript) == 0x000004, "Wrong alignment on DebugMapMemo_C_UserConstructionScript");
static_assert(sizeof(DebugMapMemo_C_UserConstructionScript) == 0x00000C, "Wrong size on DebugMapMemo_C_UserConstructionScript");
static_assert(offsetof(DebugMapMemo_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'DebugMapMemo_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DebugMapMemo_C_UserConstructionScript, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'DebugMapMemo_C_UserConstructionScript::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DebugMapMemo_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000008, "Member 'DebugMapMemo_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");

}

