#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DebugPartySkillLIb_t

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct DebugPartySkillLIb_t.DebugPartySkillLIb_t
// 0x0008 (0x0008 - 0x0000)
struct FDebugPartySkillLIb_t final
{
public:
	int32                                         SkillID_8_C8CA1C824A6958B068420F9917994DF4;        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LibEntry_14_B3F16FB942D7B1FA8A4F0BBA14C741F2;      // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Master_16_1F93EB7B411B823D5AFF0999B8B784D7;        // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FDebugPartySkillLIb_t) == 0x000004, "Wrong alignment on FDebugPartySkillLIb_t");
static_assert(sizeof(FDebugPartySkillLIb_t) == 0x000008, "Wrong size on FDebugPartySkillLIb_t");
static_assert(offsetof(FDebugPartySkillLIb_t, SkillID_8_C8CA1C824A6958B068420F9917994DF4) == 0x000000, "Member 'FDebugPartySkillLIb_t::SkillID_8_C8CA1C824A6958B068420F9917994DF4' has a wrong offset!");
static_assert(offsetof(FDebugPartySkillLIb_t, LibEntry_14_B3F16FB942D7B1FA8A4F0BBA14C741F2) == 0x000004, "Member 'FDebugPartySkillLIb_t::LibEntry_14_B3F16FB942D7B1FA8A4F0BBA14C741F2' has a wrong offset!");
static_assert(offsetof(FDebugPartySkillLIb_t, Master_16_1F93EB7B411B823D5AFF0999B8B784D7) == 0x000005, "Member 'FDebugPartySkillLIb_t::Master_16_1F93EB7B411B823D5AFF0999B8B784D7' has a wrong offset!");

}

