#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dev094_Simple

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DevilBaseLight_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Dev094_Simple.Dev094_Simple_C
// 0x0060 (0x0AE0 - 0x0A80)
class ADev094_Simple_C final : public ADevilBaseLight_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Dev094_Simple_C;                    // 0x0A80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpringArmComponent*                    SpringArm_Up;                                      // 0x0A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ParentRotationScene_C*              BP_ParentRotationScene;                            // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Dv_094_00_neck;                                    // 0x0A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Dv_094_01R_arm;                                    // 0x0AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Dv_094_01L_arm;                                    // 0x0AA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Dv_094_01L_leg;                                    // 0x0AB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Dv_094_01R_leg;                                    // 0x0AB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Dv_094_02;                                         // 0x0AC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Dv_094_00;                                         // 0x0AC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaHeadComponent_C*                  Head;                                              // 0x0AD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaFloatingComponent_C*              Floating;                                          // 0x0AD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Dev094_Simple(int32 EntryPoint);
	void BndEvt__DevilMovement_K2Node_ComponentBoundEvent_0_CharaMovementUpdatedSignature__DelegateSignature();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Dev094_Simple_C">();
	}
	static class ADev094_Simple_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADev094_Simple_C>();
	}
};
static_assert(alignof(ADev094_Simple_C) == 0x000008, "Wrong alignment on ADev094_Simple_C");
static_assert(sizeof(ADev094_Simple_C) == 0x000AE0, "Wrong size on ADev094_Simple_C");
static_assert(offsetof(ADev094_Simple_C, UberGraphFrame_Dev094_Simple_C) == 0x000A80, "Member 'ADev094_Simple_C::UberGraphFrame_Dev094_Simple_C' has a wrong offset!");
static_assert(offsetof(ADev094_Simple_C, SpringArm_Up) == 0x000A88, "Member 'ADev094_Simple_C::SpringArm_Up' has a wrong offset!");
static_assert(offsetof(ADev094_Simple_C, BP_ParentRotationScene) == 0x000A90, "Member 'ADev094_Simple_C::BP_ParentRotationScene' has a wrong offset!");
static_assert(offsetof(ADev094_Simple_C, Dv_094_00_neck) == 0x000A98, "Member 'ADev094_Simple_C::Dv_094_00_neck' has a wrong offset!");
static_assert(offsetof(ADev094_Simple_C, Dv_094_01R_arm) == 0x000AA0, "Member 'ADev094_Simple_C::Dv_094_01R_arm' has a wrong offset!");
static_assert(offsetof(ADev094_Simple_C, Dv_094_01L_arm) == 0x000AA8, "Member 'ADev094_Simple_C::Dv_094_01L_arm' has a wrong offset!");
static_assert(offsetof(ADev094_Simple_C, Dv_094_01L_leg) == 0x000AB0, "Member 'ADev094_Simple_C::Dv_094_01L_leg' has a wrong offset!");
static_assert(offsetof(ADev094_Simple_C, Dv_094_01R_leg) == 0x000AB8, "Member 'ADev094_Simple_C::Dv_094_01R_leg' has a wrong offset!");
static_assert(offsetof(ADev094_Simple_C, Dv_094_02) == 0x000AC0, "Member 'ADev094_Simple_C::Dv_094_02' has a wrong offset!");
static_assert(offsetof(ADev094_Simple_C, Dv_094_00) == 0x000AC8, "Member 'ADev094_Simple_C::Dv_094_00' has a wrong offset!");
static_assert(offsetof(ADev094_Simple_C, Head) == 0x000AD0, "Member 'ADev094_Simple_C::Head' has a wrong offset!");
static_assert(offsetof(ADev094_Simple_C, Floating) == 0x000AD8, "Member 'ADev094_Simple_C::Floating' has a wrong offset!");

}

