#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dev096

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DevilBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Dev096.Dev096_C
// 0x0030 (0x0A80 - 0x0A50)
class ADev096_C final : public ADevilBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Dev096_C;                           // 0x0A50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpringArmComponent*                    SpringArm_Dummy;                                   // 0x0A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm_Up;                                      // 0x0A60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ParentRotationScene_C*              BP_ParentRotationScene;                            // 0x0A68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaHeadComponent_C*                  Head;                                              // 0x0A70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaFloatingComponent_C*              Floating;                                          // 0x0A78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Dev096(int32 EntryPoint);
	void BndEvt__DevilMovement_K2Node_ComponentBoundEvent_0_CharaMovementUpdatedSignature__DelegateSignature();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Dev096_C">();
	}
	static class ADev096_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADev096_C>();
	}
};
static_assert(alignof(ADev096_C) == 0x000008, "Wrong alignment on ADev096_C");
static_assert(sizeof(ADev096_C) == 0x000A80, "Wrong size on ADev096_C");
static_assert(offsetof(ADev096_C, UberGraphFrame_Dev096_C) == 0x000A50, "Member 'ADev096_C::UberGraphFrame_Dev096_C' has a wrong offset!");
static_assert(offsetof(ADev096_C, SpringArm_Dummy) == 0x000A58, "Member 'ADev096_C::SpringArm_Dummy' has a wrong offset!");
static_assert(offsetof(ADev096_C, SpringArm_Up) == 0x000A60, "Member 'ADev096_C::SpringArm_Up' has a wrong offset!");
static_assert(offsetof(ADev096_C, BP_ParentRotationScene) == 0x000A68, "Member 'ADev096_C::BP_ParentRotationScene' has a wrong offset!");
static_assert(offsetof(ADev096_C, Head) == 0x000A70, "Member 'ADev096_C::Head' has a wrong offset!");
static_assert(offsetof(ADev096_C, Floating) == 0x000A78, "Member 'ADev096_C::Floating' has a wrong offset!");

}

