#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dev038_AnimBP

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Dev038_AnimBP.Dev038_AnimBP_C.ExecuteUbergraph_Dev038_AnimBP
// 0x0220 (0x0220 - 0x0000)
struct Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewSpeed;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enable_9;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Immediately_3;                        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EAF[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Index_5;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Location_1;                           // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Alpha;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             K2Node_Event_Trans;                                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_BlendAlpha;                           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_4;                              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Location;                             // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Event_DeltaRotation_1;                      // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsEnable;                             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EB0[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     K2Node_Event_Transes;                              // 0x0078(0x0010)(ConstParm, ReferenceParm)
	TArray<float>                                 K2Node_Event_TransAlphas;                          // 0x0088(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_Event_Invalid;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EB1[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Index_6;                              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EB2[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_7;                              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Event_Rotation_2;                           // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaTime;                            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EB3[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaAnimation_C> K2Node_DynamicCast_AsBPI_Chara_Animation;          // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EB4[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaAnimation_C> K2Node_DynamicCast_AsBPI_Chara_Animation_1;        // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EB5[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaAnimation_C> K2Node_DynamicCast_AsBPI_Chara_Animation_2;        // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Invalid_1;                            // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EB6[0x2];                                     // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Index_8;                              // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CHARA_ANIMATION_MODE                        K2Node_Event_Mode;                                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EB7[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_BlendTime;                            // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Event_Animation_2;                          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enable_8;                             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EB8[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      K2Node_Event_Animation_1;                          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EB9[0x3];                                     // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enable_7;                             // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Immediately_2;                        // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EBA[0x2];                                     // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enable_6;                             // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Enable_5;                             // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EBB[0x2];                                     // 0x0146(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Offset;                               // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Event_DeltaRotation;                        // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_StartSpeed;                           // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_EndSpeed;                             // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enable_4;                             // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Enable_3;                             // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Immediately_1;                        // 0x016E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EBC[0x1];                                     // 0x016F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Index_3;                              // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Event_Rotation_1;                           // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EBD[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      K2Node_Event_RotateIdle;                           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EBE[0x3];                                     // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_2;           // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EBF[0x3];                                     // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_3;           // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enable_2;                             // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EC0[0x3];                                     // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Val;                                  // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace1D*                          K2Node_Event_BlendSpace;                           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_1;                  // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enable_1;                             // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Immediately;                          // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EC1[0x2];                                     // 0x01B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Index_2;                              // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Event_Rotation;                             // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EC2[0x3];                                     // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_4;           // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EC3[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      K2Node_Event_Animation;                            // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomPoseWeightTable*                 K2Node_Event_PoseWeightTable;                      // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EC4[0x3];                                     // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_5;           // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_1;                              // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enable;                               // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EC5[0x3];                                     // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FInterpTo_ReturnValue_2;                  // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_2;                 // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EC6[0x3];                                     // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Index;                                // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_LidExpressionAttenuate;               // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_LipExpressionAttenuate;               // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_BlendFlag;                            // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_3;                 // 0x020D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EC7[0x2];                                     // 0x020E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_6;           // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_3;                  // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP) == 0x000010, "Wrong alignment on Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP");
static_assert(sizeof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP) == 0x000220, "Wrong size on Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, EntryPoint) == 0x000000, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_NewSpeed) == 0x000004, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_NewSpeed' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Enable_9) == 0x000008, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Enable_9' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Immediately_3) == 0x000009, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Immediately_3' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Index_5) == 0x00000C, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Index_5' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Location_1) == 0x000010, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Location_1' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Alpha) == 0x00001C, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Alpha' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Trans) == 0x000020, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Trans' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_BlendAlpha) == 0x000050, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_BlendAlpha' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Index_4) == 0x000054, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Index_4' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Location) == 0x000058, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Location' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_DeltaRotation_1) == 0x000064, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_DeltaRotation_1' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_IsEnable) == 0x000070, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_IsEnable' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Transes) == 0x000078, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Transes' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_TransAlphas) == 0x000088, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_TransAlphas' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Invalid) == 0x000098, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Invalid' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Index_6) == 0x00009C, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Index_6' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_DeltaTimeX) == 0x0000A0, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x0000A8, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Index_7) == 0x0000B0, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Index_7' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Rotation_2) == 0x0000B4, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Rotation_2' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_DeltaTime) == 0x0000C0, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_DynamicCast_AsBPI_Chara_Animation) == 0x0000C8, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_DynamicCast_AsBPI_Chara_Animation' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_DynamicCast_AsBPI_Chara_Animation_1) == 0x0000E0, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_DynamicCast_AsBPI_Chara_Animation_1' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_DynamicCast_AsBPI_Chara_Animation_2) == 0x0000F8, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_DynamicCast_AsBPI_Chara_Animation_2' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_DynamicCast_bSuccess_2) == 0x000108, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Invalid_1) == 0x000109, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Invalid_1' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Index_8) == 0x00010C, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Index_8' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Mode) == 0x000110, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Mode' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_BlendTime) == 0x000114, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_BlendTime' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Animation_2) == 0x000118, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Animation_2' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Enable_8) == 0x000120, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Enable_8' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Animation_1) == 0x000128, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Animation_1' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000130, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, CallFunc_IsValid_ReturnValue) == 0x000134, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, CallFunc_FInterpTo_ReturnValue) == 0x000138, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Enable_7) == 0x00013C, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Enable_7' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Immediately_2) == 0x00013D, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Immediately_2' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, CallFunc_SelectFloat_ReturnValue) == 0x000140, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Enable_6) == 0x000144, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Enable_6' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Enable_5) == 0x000145, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Enable_5' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Offset) == 0x000148, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Offset' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_DeltaRotation) == 0x000154, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_DeltaRotation' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, CallFunc_Conv_BoolToFloat_ReturnValue_1) == 0x000160, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::CallFunc_Conv_BoolToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_StartSpeed) == 0x000164, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_StartSpeed' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_EndSpeed) == 0x000168, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_EndSpeed' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Enable_4) == 0x00016C, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Enable_4' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Enable_3) == 0x00016D, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Enable_3' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Immediately_1) == 0x00016E, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Immediately_1' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Index_3) == 0x000170, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Index_3' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Rotation_1) == 0x000174, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Rotation_1' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_SwitchInteger_CmpSuccess) == 0x000180, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_RotateIdle) == 0x000188, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_RotateIdle' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, CallFunc_BooleanAND_ReturnValue) == 0x000190, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, CallFunc_Conv_BoolToFloat_ReturnValue_2) == 0x000194, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::CallFunc_Conv_BoolToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, CallFunc_BooleanAND_ReturnValue_1) == 0x000198, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, CallFunc_Conv_BoolToFloat_ReturnValue_3) == 0x00019C, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::CallFunc_Conv_BoolToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Enable_2) == 0x0001A0, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Enable_2' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Val) == 0x0001A4, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Val' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_BlendSpace) == 0x0001A8, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_BlendSpace' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, CallFunc_FInterpTo_ReturnValue_1) == 0x0001B0, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Enable_1) == 0x0001B4, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Enable_1' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Immediately) == 0x0001B5, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Immediately' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Index_2) == 0x0001B8, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Index_2' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Rotation) == 0x0001BC, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Rotation' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, CallFunc_BooleanAND_ReturnValue_2) == 0x0001C8, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, CallFunc_Conv_BoolToFloat_ReturnValue_4) == 0x0001CC, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::CallFunc_Conv_BoolToFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_SwitchInteger_CmpSuccess_1) == 0x0001D0, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Animation) == 0x0001D8, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_PoseWeightTable) == 0x0001E0, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_PoseWeightTable' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, CallFunc_BooleanAND_ReturnValue_3) == 0x0001E8, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, CallFunc_Conv_BoolToFloat_ReturnValue_5) == 0x0001EC, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::CallFunc_Conv_BoolToFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Index_1) == 0x0001F0, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Index_1' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Enable) == 0x0001F4, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Enable' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, CallFunc_FInterpTo_ReturnValue_2) == 0x0001F8, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::CallFunc_FInterpTo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_SwitchInteger_CmpSuccess_2) == 0x0001FC, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_SwitchInteger_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_Index) == 0x000200, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_LidExpressionAttenuate) == 0x000204, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_LidExpressionAttenuate' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_LipExpressionAttenuate) == 0x000208, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_LipExpressionAttenuate' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_Event_BlendFlag) == 0x00020C, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_Event_BlendFlag' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, K2Node_SwitchInteger_CmpSuccess_3) == 0x00020D, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::K2Node_SwitchInteger_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, CallFunc_Conv_BoolToFloat_ReturnValue_6) == 0x000210, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::CallFunc_Conv_BoolToFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP, CallFunc_FInterpTo_ReturnValue_3) == 0x000214, "Member 'Dev038_AnimBP_C_ExecuteUbergraph_Dev038_AnimBP::CallFunc_FInterpTo_ReturnValue_3' has a wrong offset!");

// Function Dev038_AnimBP.Dev038_AnimBP_C.SetHeadBlendFlag
// 0x0001 (0x0001 - 0x0000)
struct Dev038_AnimBP_C_SetHeadBlendFlag final
{
public:
	bool                                          BlendFlag;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev038_AnimBP_C_SetHeadBlendFlag) == 0x000001, "Wrong alignment on Dev038_AnimBP_C_SetHeadBlendFlag");
static_assert(sizeof(Dev038_AnimBP_C_SetHeadBlendFlag) == 0x000001, "Wrong size on Dev038_AnimBP_C_SetHeadBlendFlag");
static_assert(offsetof(Dev038_AnimBP_C_SetHeadBlendFlag, BlendFlag) == 0x000000, "Member 'Dev038_AnimBP_C_SetHeadBlendFlag::BlendFlag' has a wrong offset!");

// Function Dev038_AnimBP.Dev038_AnimBP_C.SetExpressionAttenuate
// 0x000C (0x000C - 0x0000)
struct Dev038_AnimBP_C_SetExpressionAttenuate final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_LidExpressionAttenuate;                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_LipExpressionAttenuate;                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev038_AnimBP_C_SetExpressionAttenuate) == 0x000004, "Wrong alignment on Dev038_AnimBP_C_SetExpressionAttenuate");
static_assert(sizeof(Dev038_AnimBP_C_SetExpressionAttenuate) == 0x00000C, "Wrong size on Dev038_AnimBP_C_SetExpressionAttenuate");
static_assert(offsetof(Dev038_AnimBP_C_SetExpressionAttenuate, Param_Index) == 0x000000, "Member 'Dev038_AnimBP_C_SetExpressionAttenuate::Param_Index' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_SetExpressionAttenuate, Param_LidExpressionAttenuate) == 0x000004, "Member 'Dev038_AnimBP_C_SetExpressionAttenuate::Param_LidExpressionAttenuate' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_SetExpressionAttenuate, Param_LipExpressionAttenuate) == 0x000008, "Member 'Dev038_AnimBP_C_SetExpressionAttenuate::Param_LipExpressionAttenuate' has a wrong offset!");

// Function Dev038_AnimBP.Dev038_AnimBP_C.SetExpressionEnable
// 0x0008 (0x0008 - 0x0000)
struct Dev038_AnimBP_C_SetExpressionEnable final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev038_AnimBP_C_SetExpressionEnable) == 0x000004, "Wrong alignment on Dev038_AnimBP_C_SetExpressionEnable");
static_assert(sizeof(Dev038_AnimBP_C_SetExpressionEnable) == 0x000008, "Wrong size on Dev038_AnimBP_C_SetExpressionEnable");
static_assert(offsetof(Dev038_AnimBP_C_SetExpressionEnable, Param_Index) == 0x000000, "Member 'Dev038_AnimBP_C_SetExpressionEnable::Param_Index' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_SetExpressionEnable, Enable) == 0x000004, "Member 'Dev038_AnimBP_C_SetExpressionEnable::Enable' has a wrong offset!");

// Function Dev038_AnimBP.Dev038_AnimBP_C.SetPoseWeightTable
// 0x0008 (0x0008 - 0x0000)
struct Dev038_AnimBP_C_SetPoseWeightTable final
{
public:
	class UCustomPoseWeightTable*                 Param_PoseWeightTable;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev038_AnimBP_C_SetPoseWeightTable) == 0x000008, "Wrong alignment on Dev038_AnimBP_C_SetPoseWeightTable");
static_assert(sizeof(Dev038_AnimBP_C_SetPoseWeightTable) == 0x000008, "Wrong size on Dev038_AnimBP_C_SetPoseWeightTable");
static_assert(offsetof(Dev038_AnimBP_C_SetPoseWeightTable, Param_PoseWeightTable) == 0x000000, "Member 'Dev038_AnimBP_C_SetPoseWeightTable::Param_PoseWeightTable' has a wrong offset!");

// Function Dev038_AnimBP.Dev038_AnimBP_C.SetHeadBlendAnimation
// 0x0008 (0x0008 - 0x0000)
struct Dev038_AnimBP_C_SetHeadBlendAnimation final
{
public:
	class UAnimSequenceBase*                      Animation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev038_AnimBP_C_SetHeadBlendAnimation) == 0x000008, "Wrong alignment on Dev038_AnimBP_C_SetHeadBlendAnimation");
static_assert(sizeof(Dev038_AnimBP_C_SetHeadBlendAnimation) == 0x000008, "Wrong size on Dev038_AnimBP_C_SetHeadBlendAnimation");
static_assert(offsetof(Dev038_AnimBP_C_SetHeadBlendAnimation, Animation) == 0x000000, "Member 'Dev038_AnimBP_C_SetHeadBlendAnimation::Animation' has a wrong offset!");

// Function Dev038_AnimBP.Dev038_AnimBP_C.SetEyeIKRotation
// 0x0010 (0x0010 - 0x0000)
struct Dev038_AnimBP_C_SetEyeIKRotation final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev038_AnimBP_C_SetEyeIKRotation) == 0x000004, "Wrong alignment on Dev038_AnimBP_C_SetEyeIKRotation");
static_assert(sizeof(Dev038_AnimBP_C_SetEyeIKRotation) == 0x000010, "Wrong size on Dev038_AnimBP_C_SetEyeIKRotation");
static_assert(offsetof(Dev038_AnimBP_C_SetEyeIKRotation, Param_Index) == 0x000000, "Member 'Dev038_AnimBP_C_SetEyeIKRotation::Param_Index' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_SetEyeIKRotation, Rotation) == 0x000004, "Member 'Dev038_AnimBP_C_SetEyeIKRotation::Rotation' has a wrong offset!");

// Function Dev038_AnimBP.Dev038_AnimBP_C.SetEyeIKEnable
// 0x0002 (0x0002 - 0x0000)
struct Dev038_AnimBP_C_SetEyeIKEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Immediately;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev038_AnimBP_C_SetEyeIKEnable) == 0x000001, "Wrong alignment on Dev038_AnimBP_C_SetEyeIKEnable");
static_assert(sizeof(Dev038_AnimBP_C_SetEyeIKEnable) == 0x000002, "Wrong size on Dev038_AnimBP_C_SetEyeIKEnable");
static_assert(offsetof(Dev038_AnimBP_C_SetEyeIKEnable, Enable) == 0x000000, "Member 'Dev038_AnimBP_C_SetEyeIKEnable::Enable' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_SetEyeIKEnable, Immediately) == 0x000001, "Member 'Dev038_AnimBP_C_SetEyeIKEnable::Immediately' has a wrong offset!");

// Function Dev038_AnimBP.Dev038_AnimBP_C.SetRotateBlend
// 0x0010 (0x0010 - 0x0000)
struct Dev038_AnimBP_C_SetRotateBlend final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EC8[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Val;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace1D*                          BlendSpace;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev038_AnimBP_C_SetRotateBlend) == 0x000008, "Wrong alignment on Dev038_AnimBP_C_SetRotateBlend");
static_assert(sizeof(Dev038_AnimBP_C_SetRotateBlend) == 0x000010, "Wrong size on Dev038_AnimBP_C_SetRotateBlend");
static_assert(offsetof(Dev038_AnimBP_C_SetRotateBlend, Enable) == 0x000000, "Member 'Dev038_AnimBP_C_SetRotateBlend::Enable' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_SetRotateBlend, Val) == 0x000004, "Member 'Dev038_AnimBP_C_SetRotateBlend::Val' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_SetRotateBlend, BlendSpace) == 0x000008, "Member 'Dev038_AnimBP_C_SetRotateBlend::BlendSpace' has a wrong offset!");

// Function Dev038_AnimBP.Dev038_AnimBP_C.SetRotateIdleAnimation
// 0x0008 (0x0008 - 0x0000)
struct Dev038_AnimBP_C_SetRotateIdleAnimation final
{
public:
	class UAnimSequenceBase*                      RotateIdle;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev038_AnimBP_C_SetRotateIdleAnimation) == 0x000008, "Wrong alignment on Dev038_AnimBP_C_SetRotateIdleAnimation");
static_assert(sizeof(Dev038_AnimBP_C_SetRotateIdleAnimation) == 0x000008, "Wrong size on Dev038_AnimBP_C_SetRotateIdleAnimation");
static_assert(offsetof(Dev038_AnimBP_C_SetRotateIdleAnimation, RotateIdle) == 0x000000, "Member 'Dev038_AnimBP_C_SetRotateIdleAnimation::RotateIdle' has a wrong offset!");

// Function Dev038_AnimBP.Dev038_AnimBP_C.SetHeadIKRotation
// 0x0010 (0x0010 - 0x0000)
struct Dev038_AnimBP_C_SetHeadIKRotation final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev038_AnimBP_C_SetHeadIKRotation) == 0x000004, "Wrong alignment on Dev038_AnimBP_C_SetHeadIKRotation");
static_assert(sizeof(Dev038_AnimBP_C_SetHeadIKRotation) == 0x000010, "Wrong size on Dev038_AnimBP_C_SetHeadIKRotation");
static_assert(offsetof(Dev038_AnimBP_C_SetHeadIKRotation, Param_Index) == 0x000000, "Member 'Dev038_AnimBP_C_SetHeadIKRotation::Param_Index' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_SetHeadIKRotation, Rotation) == 0x000004, "Member 'Dev038_AnimBP_C_SetHeadIKRotation::Rotation' has a wrong offset!");

// Function Dev038_AnimBP.Dev038_AnimBP_C.SetHeadIKEnable
// 0x0002 (0x0002 - 0x0000)
struct Dev038_AnimBP_C_SetHeadIKEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Immediately;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev038_AnimBP_C_SetHeadIKEnable) == 0x000001, "Wrong alignment on Dev038_AnimBP_C_SetHeadIKEnable");
static_assert(sizeof(Dev038_AnimBP_C_SetHeadIKEnable) == 0x000002, "Wrong size on Dev038_AnimBP_C_SetHeadIKEnable");
static_assert(offsetof(Dev038_AnimBP_C_SetHeadIKEnable, Enable) == 0x000000, "Member 'Dev038_AnimBP_C_SetHeadIKEnable::Enable' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_SetHeadIKEnable, Immediately) == 0x000001, "Member 'Dev038_AnimBP_C_SetHeadIKEnable::Immediately' has a wrong offset!");

// Function Dev038_AnimBP.Dev038_AnimBP_C.SetLookAtEnable
// 0x0001 (0x0001 - 0x0000)
struct Dev038_AnimBP_C_SetLookAtEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev038_AnimBP_C_SetLookAtEnable) == 0x000001, "Wrong alignment on Dev038_AnimBP_C_SetLookAtEnable");
static_assert(sizeof(Dev038_AnimBP_C_SetLookAtEnable) == 0x000001, "Wrong size on Dev038_AnimBP_C_SetLookAtEnable");
static_assert(offsetof(Dev038_AnimBP_C_SetLookAtEnable, Enable) == 0x000000, "Member 'Dev038_AnimBP_C_SetLookAtEnable::Enable' has a wrong offset!");

// Function Dev038_AnimBP.Dev038_AnimBP_C.SetRotateAlphaInterpSpeed
// 0x0008 (0x0008 - 0x0000)
struct Dev038_AnimBP_C_SetRotateAlphaInterpSpeed final
{
public:
	float                                         StartSpeed;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndSpeed;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev038_AnimBP_C_SetRotateAlphaInterpSpeed) == 0x000004, "Wrong alignment on Dev038_AnimBP_C_SetRotateAlphaInterpSpeed");
static_assert(sizeof(Dev038_AnimBP_C_SetRotateAlphaInterpSpeed) == 0x000008, "Wrong size on Dev038_AnimBP_C_SetRotateAlphaInterpSpeed");
static_assert(offsetof(Dev038_AnimBP_C_SetRotateAlphaInterpSpeed, StartSpeed) == 0x000000, "Member 'Dev038_AnimBP_C_SetRotateAlphaInterpSpeed::StartSpeed' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_SetRotateAlphaInterpSpeed, EndSpeed) == 0x000004, "Member 'Dev038_AnimBP_C_SetRotateAlphaInterpSpeed::EndSpeed' has a wrong offset!");

// Function Dev038_AnimBP.Dev038_AnimBP_C.SetRootOffset
// 0x0018 (0x0018 - 0x0000)
struct Dev038_AnimBP_C_SetRootOffset final
{
public:
	struct FVector                                Offset;                                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DeltaRotation;                                     // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev038_AnimBP_C_SetRootOffset) == 0x000004, "Wrong alignment on Dev038_AnimBP_C_SetRootOffset");
static_assert(sizeof(Dev038_AnimBP_C_SetRootOffset) == 0x000018, "Wrong size on Dev038_AnimBP_C_SetRootOffset");
static_assert(offsetof(Dev038_AnimBP_C_SetRootOffset, Offset) == 0x000000, "Member 'Dev038_AnimBP_C_SetRootOffset::Offset' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_SetRootOffset, DeltaRotation) == 0x00000C, "Member 'Dev038_AnimBP_C_SetRootOffset::DeltaRotation' has a wrong offset!");

// Function Dev038_AnimBP.Dev038_AnimBP_C.SetRootOffsetEnable
// 0x0001 (0x0001 - 0x0000)
struct Dev038_AnimBP_C_SetRootOffsetEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev038_AnimBP_C_SetRootOffsetEnable) == 0x000001, "Wrong alignment on Dev038_AnimBP_C_SetRootOffsetEnable");
static_assert(sizeof(Dev038_AnimBP_C_SetRootOffsetEnable) == 0x000001, "Wrong size on Dev038_AnimBP_C_SetRootOffsetEnable");
static_assert(offsetof(Dev038_AnimBP_C_SetRootOffsetEnable, Enable) == 0x000000, "Member 'Dev038_AnimBP_C_SetRootOffsetEnable::Enable' has a wrong offset!");

// Function Dev038_AnimBP.Dev038_AnimBP_C.SetBoneMotionEnable
// 0x0001 (0x0001 - 0x0000)
struct Dev038_AnimBP_C_SetBoneMotionEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev038_AnimBP_C_SetBoneMotionEnable) == 0x000001, "Wrong alignment on Dev038_AnimBP_C_SetBoneMotionEnable");
static_assert(sizeof(Dev038_AnimBP_C_SetBoneMotionEnable) == 0x000001, "Wrong size on Dev038_AnimBP_C_SetBoneMotionEnable");
static_assert(offsetof(Dev038_AnimBP_C_SetBoneMotionEnable, Enable) == 0x000000, "Member 'Dev038_AnimBP_C_SetBoneMotionEnable::Enable' has a wrong offset!");

// Function Dev038_AnimBP.Dev038_AnimBP_C.SetLegIKEnable
// 0x0002 (0x0002 - 0x0000)
struct Dev038_AnimBP_C_SetLegIKEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Immediately;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev038_AnimBP_C_SetLegIKEnable) == 0x000001, "Wrong alignment on Dev038_AnimBP_C_SetLegIKEnable");
static_assert(sizeof(Dev038_AnimBP_C_SetLegIKEnable) == 0x000002, "Wrong size on Dev038_AnimBP_C_SetLegIKEnable");
static_assert(offsetof(Dev038_AnimBP_C_SetLegIKEnable, Enable) == 0x000000, "Member 'Dev038_AnimBP_C_SetLegIKEnable::Enable' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_SetLegIKEnable, Immediately) == 0x000001, "Member 'Dev038_AnimBP_C_SetLegIKEnable::Immediately' has a wrong offset!");

// Function Dev038_AnimBP.Dev038_AnimBP_C.SetMumbleAnimation
// 0x0008 (0x0008 - 0x0000)
struct Dev038_AnimBP_C_SetMumbleAnimation final
{
public:
	class UAnimSequenceBase*                      Animation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev038_AnimBP_C_SetMumbleAnimation) == 0x000008, "Wrong alignment on Dev038_AnimBP_C_SetMumbleAnimation");
static_assert(sizeof(Dev038_AnimBP_C_SetMumbleAnimation) == 0x000008, "Wrong size on Dev038_AnimBP_C_SetMumbleAnimation");
static_assert(offsetof(Dev038_AnimBP_C_SetMumbleAnimation, Animation) == 0x000000, "Member 'Dev038_AnimBP_C_SetMumbleAnimation::Animation' has a wrong offset!");

// Function Dev038_AnimBP.Dev038_AnimBP_C.SetMumbleEnable
// 0x0001 (0x0001 - 0x0000)
struct Dev038_AnimBP_C_SetMumbleEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev038_AnimBP_C_SetMumbleEnable) == 0x000001, "Wrong alignment on Dev038_AnimBP_C_SetMumbleEnable");
static_assert(sizeof(Dev038_AnimBP_C_SetMumbleEnable) == 0x000001, "Wrong size on Dev038_AnimBP_C_SetMumbleEnable");
static_assert(offsetof(Dev038_AnimBP_C_SetMumbleEnable, Enable) == 0x000000, "Member 'Dev038_AnimBP_C_SetMumbleEnable::Enable' has a wrong offset!");

// Function Dev038_AnimBP.Dev038_AnimBP_C.SetDefaultAnimation
// 0x0008 (0x0008 - 0x0000)
struct Dev038_AnimBP_C_SetDefaultAnimation final
{
public:
	class UAnimSequenceBase*                      Animation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev038_AnimBP_C_SetDefaultAnimation) == 0x000008, "Wrong alignment on Dev038_AnimBP_C_SetDefaultAnimation");
static_assert(sizeof(Dev038_AnimBP_C_SetDefaultAnimation) == 0x000008, "Wrong size on Dev038_AnimBP_C_SetDefaultAnimation");
static_assert(offsetof(Dev038_AnimBP_C_SetDefaultAnimation, Animation) == 0x000000, "Member 'Dev038_AnimBP_C_SetDefaultAnimation::Animation' has a wrong offset!");

// Function Dev038_AnimBP.Dev038_AnimBP_C.SetAnimationMode
// 0x0008 (0x0008 - 0x0000)
struct Dev038_AnimBP_C_SetAnimationMode final
{
public:
	E_CHARA_ANIMATION_MODE                        Mode;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EC9[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendTime;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev038_AnimBP_C_SetAnimationMode) == 0x000004, "Wrong alignment on Dev038_AnimBP_C_SetAnimationMode");
static_assert(sizeof(Dev038_AnimBP_C_SetAnimationMode) == 0x000008, "Wrong size on Dev038_AnimBP_C_SetAnimationMode");
static_assert(offsetof(Dev038_AnimBP_C_SetAnimationMode, Mode) == 0x000000, "Member 'Dev038_AnimBP_C_SetAnimationMode::Mode' has a wrong offset!");
static_assert(offsetof(Dev038_AnimBP_C_SetAnimationMode, BlendTime) == 0x000004, "Member 'Dev038_AnimBP_C_SetAnimationMode::BlendTime' has a wrong offset!");

// Function Dev038_AnimBP.Dev038_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
