#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dev045

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DevilBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Dev045.Dev045_C
// 0x0038 (0x0A88 - 0x0A50)
class ADev045_C final : public ADevilBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Dev045_C;                           // 0x0A50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpringArmComponent*                    SpringArm_Up;                                      // 0x0A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ParentRotationScene_C*              BP_ParentRotationScene;                            // 0x0A60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaStepSmootherComponent_C*          StepSmoother;                                      // 0x0A68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaHeadComponent_C*                  Head;                                              // 0x0A70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaLegComponent_C*                   RightLeg;                                          // 0x0A78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaLegComponent_C*                   LeftLeg;                                           // 0x0A80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void BndEvt__DevilMovement_K2Node_ComponentBoundEvent_0_CharaMovementUpdatedSignature__DelegateSignature();
	void ExecuteUbergraph_Dev045(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Dev045_C">();
	}
	static class ADev045_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADev045_C>();
	}
};
static_assert(alignof(ADev045_C) == 0x000008, "Wrong alignment on ADev045_C");
static_assert(sizeof(ADev045_C) == 0x000A88, "Wrong size on ADev045_C");
static_assert(offsetof(ADev045_C, UberGraphFrame_Dev045_C) == 0x000A50, "Member 'ADev045_C::UberGraphFrame_Dev045_C' has a wrong offset!");
static_assert(offsetof(ADev045_C, SpringArm_Up) == 0x000A58, "Member 'ADev045_C::SpringArm_Up' has a wrong offset!");
static_assert(offsetof(ADev045_C, BP_ParentRotationScene) == 0x000A60, "Member 'ADev045_C::BP_ParentRotationScene' has a wrong offset!");
static_assert(offsetof(ADev045_C, StepSmoother) == 0x000A68, "Member 'ADev045_C::StepSmoother' has a wrong offset!");
static_assert(offsetof(ADev045_C, Head) == 0x000A70, "Member 'ADev045_C::Head' has a wrong offset!");
static_assert(offsetof(ADev045_C, RightLeg) == 0x000A78, "Member 'ADev045_C::RightLeg' has a wrong offset!");
static_assert(offsetof(ADev045_C, LeftLeg) == 0x000A80, "Member 'ADev045_C::LeftLeg' has a wrong offset!");

}

