#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dev173

#include "Basic.hpp"


namespace SDK::Params
{

// Function Dev173.Dev173_C.ExecuteUbergraph_Dev173
// 0x0004 (0x0004 - 0x0000)
struct Dev173_C_ExecuteUbergraph_Dev173 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev173_C_ExecuteUbergraph_Dev173) == 0x000004, "Wrong alignment on Dev173_C_ExecuteUbergraph_Dev173");
static_assert(sizeof(Dev173_C_ExecuteUbergraph_Dev173) == 0x000004, "Wrong size on Dev173_C_ExecuteUbergraph_Dev173");
static_assert(offsetof(Dev173_C_ExecuteUbergraph_Dev173, EntryPoint) == 0x000000, "Member 'Dev173_C_ExecuteUbergraph_Dev173::EntryPoint' has a wrong offset!");

// Function Dev173.Dev173_C.BI_GetForceRotate
// 0x0001 (0x0001 - 0x0000)
struct Dev173_C_BI_GetForceRotate final
{
public:
	bool                                          Ret;                                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev173_C_BI_GetForceRotate) == 0x000001, "Wrong alignment on Dev173_C_BI_GetForceRotate");
static_assert(sizeof(Dev173_C_BI_GetForceRotate) == 0x000001, "Wrong size on Dev173_C_BI_GetForceRotate");
static_assert(offsetof(Dev173_C_BI_GetForceRotate, Ret) == 0x000000, "Member 'Dev173_C_BI_GetForceRotate::Ret' has a wrong offset!");

}

