#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dev126

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DevilBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Dev126.Dev126_C
// 0x0058 (0x0AA8 - 0x0A50)
class ADev126_C final : public ADevilBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Dev126_C;                           // 0x0A50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpringArmComponent*                    SpringArm_Up;                                      // 0x0A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ParentRotationScene_C*              BP_ParentRotationScene;                            // 0x0A60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaStepSmootherComponent_C*          StepSmoother;                                      // 0x0A68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaEyeComponent_C*                   RightEye;                                          // 0x0A70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaEyeComponent_C*                   LeftEye;                                           // 0x0A78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaHeadComponent_C*                  Head;                                              // 0x0A80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaLegComponent_C*                   HindRightLeg;                                      // 0x0A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaLegComponent_C*                   HindLeftLeg;                                       // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaLegComponent_C*                   ForeRightLeg;                                      // 0x0A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaLegComponent_C*                   ForeLeftLeg;                                       // 0x0AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Dev126(int32 EntryPoint);
	void BndEvt__DevilMovement_K2Node_ComponentBoundEvent_0_CharaMovementUpdatedSignature__DelegateSignature();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Dev126_C">();
	}
	static class ADev126_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADev126_C>();
	}
};
static_assert(alignof(ADev126_C) == 0x000008, "Wrong alignment on ADev126_C");
static_assert(sizeof(ADev126_C) == 0x000AA8, "Wrong size on ADev126_C");
static_assert(offsetof(ADev126_C, UberGraphFrame_Dev126_C) == 0x000A50, "Member 'ADev126_C::UberGraphFrame_Dev126_C' has a wrong offset!");
static_assert(offsetof(ADev126_C, SpringArm_Up) == 0x000A58, "Member 'ADev126_C::SpringArm_Up' has a wrong offset!");
static_assert(offsetof(ADev126_C, BP_ParentRotationScene) == 0x000A60, "Member 'ADev126_C::BP_ParentRotationScene' has a wrong offset!");
static_assert(offsetof(ADev126_C, StepSmoother) == 0x000A68, "Member 'ADev126_C::StepSmoother' has a wrong offset!");
static_assert(offsetof(ADev126_C, RightEye) == 0x000A70, "Member 'ADev126_C::RightEye' has a wrong offset!");
static_assert(offsetof(ADev126_C, LeftEye) == 0x000A78, "Member 'ADev126_C::LeftEye' has a wrong offset!");
static_assert(offsetof(ADev126_C, Head) == 0x000A80, "Member 'ADev126_C::Head' has a wrong offset!");
static_assert(offsetof(ADev126_C, HindRightLeg) == 0x000A88, "Member 'ADev126_C::HindRightLeg' has a wrong offset!");
static_assert(offsetof(ADev126_C, HindLeftLeg) == 0x000A90, "Member 'ADev126_C::HindLeftLeg' has a wrong offset!");
static_assert(offsetof(ADev126_C, ForeRightLeg) == 0x000A98, "Member 'ADev126_C::ForeRightLeg' has a wrong offset!");
static_assert(offsetof(ADev126_C, ForeLeftLeg) == 0x000AA0, "Member 'ADev126_C::ForeLeftLeg' has a wrong offset!");

}

