#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dev138_Simple

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DevilBaseLight_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Dev138_Simple.Dev138_Simple_C
// 0x0030 (0x0AB0 - 0x0A80)
class ADev138_Simple_C final : public ADevilBaseLight_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Dev138_Simple_C;                    // 0x0A80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpringArmComponent*                    SpringArm_Up;                                      // 0x0A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ParentRotationScene_C*              BP_ParentRotationScene;                            // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaHeadComponent_C*                  Head;                                              // 0x0A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaFloatingComponent_C*              Floating;                                          // 0x0AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         CapculeRadius;                                     // 0x0AA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CapsuleHalfHeight;                                 // 0x0AAC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Dev138_Simple(int32 EntryPoint);
	void BndEvt__DevilMovement_K2Node_ComponentBoundEvent_0_CharaMovementUpdatedSignature__DelegateSignature();
	void ReceiveBeginPlay();
	void BI_SetNPCCollision(bool* Ret);
	void SetNpcCollision();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Dev138_Simple_C">();
	}
	static class ADev138_Simple_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADev138_Simple_C>();
	}
};
static_assert(alignof(ADev138_Simple_C) == 0x000008, "Wrong alignment on ADev138_Simple_C");
static_assert(sizeof(ADev138_Simple_C) == 0x000AB0, "Wrong size on ADev138_Simple_C");
static_assert(offsetof(ADev138_Simple_C, UberGraphFrame_Dev138_Simple_C) == 0x000A80, "Member 'ADev138_Simple_C::UberGraphFrame_Dev138_Simple_C' has a wrong offset!");
static_assert(offsetof(ADev138_Simple_C, SpringArm_Up) == 0x000A88, "Member 'ADev138_Simple_C::SpringArm_Up' has a wrong offset!");
static_assert(offsetof(ADev138_Simple_C, BP_ParentRotationScene) == 0x000A90, "Member 'ADev138_Simple_C::BP_ParentRotationScene' has a wrong offset!");
static_assert(offsetof(ADev138_Simple_C, Head) == 0x000A98, "Member 'ADev138_Simple_C::Head' has a wrong offset!");
static_assert(offsetof(ADev138_Simple_C, Floating) == 0x000AA0, "Member 'ADev138_Simple_C::Floating' has a wrong offset!");
static_assert(offsetof(ADev138_Simple_C, CapculeRadius) == 0x000AA8, "Member 'ADev138_Simple_C::CapculeRadius' has a wrong offset!");
static_assert(offsetof(ADev138_Simple_C, CapsuleHalfHeight) == 0x000AAC, "Member 'ADev138_Simple_C::CapsuleHalfHeight' has a wrong offset!");

}

