#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dev140

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DevilBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Dev140.Dev140_C
// 0x0058 (0x0AA8 - 0x0A50)
class ADev140_C final : public ADevilBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Dev140_C;                           // 0x0A50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCharaBodyComponent_C*                  Body;                                              // 0x0A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm_Dummy;                                   // 0x0A60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm_Up;                                      // 0x0A68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ParentRotationScene_C*              BP_ParentRotationScene;                            // 0x0A70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaStepSmootherComponent_C*          StepSmoother;                                      // 0x0A78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaEyeComponent_C*                   RightEye;                                          // 0x0A80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaEyeComponent_C*                   LeftEye;                                           // 0x0A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaHeadComponent_C*                  Head;                                              // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaLegComponent_C*                   RightLeg;                                          // 0x0A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaLegComponent_C*                   LeftLeg;                                           // 0x0AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void BndEvt__DevilMovement_K2Node_ComponentBoundEvent_0_CharaMovementUpdatedSignature__DelegateSignature();
	void ExecuteUbergraph_Dev140(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Dev140_C">();
	}
	static class ADev140_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADev140_C>();
	}
};
static_assert(alignof(ADev140_C) == 0x000008, "Wrong alignment on ADev140_C");
static_assert(sizeof(ADev140_C) == 0x000AA8, "Wrong size on ADev140_C");
static_assert(offsetof(ADev140_C, UberGraphFrame_Dev140_C) == 0x000A50, "Member 'ADev140_C::UberGraphFrame_Dev140_C' has a wrong offset!");
static_assert(offsetof(ADev140_C, Body) == 0x000A58, "Member 'ADev140_C::Body' has a wrong offset!");
static_assert(offsetof(ADev140_C, SpringArm_Dummy) == 0x000A60, "Member 'ADev140_C::SpringArm_Dummy' has a wrong offset!");
static_assert(offsetof(ADev140_C, SpringArm_Up) == 0x000A68, "Member 'ADev140_C::SpringArm_Up' has a wrong offset!");
static_assert(offsetof(ADev140_C, BP_ParentRotationScene) == 0x000A70, "Member 'ADev140_C::BP_ParentRotationScene' has a wrong offset!");
static_assert(offsetof(ADev140_C, StepSmoother) == 0x000A78, "Member 'ADev140_C::StepSmoother' has a wrong offset!");
static_assert(offsetof(ADev140_C, RightEye) == 0x000A80, "Member 'ADev140_C::RightEye' has a wrong offset!");
static_assert(offsetof(ADev140_C, LeftEye) == 0x000A88, "Member 'ADev140_C::LeftEye' has a wrong offset!");
static_assert(offsetof(ADev140_C, Head) == 0x000A90, "Member 'ADev140_C::Head' has a wrong offset!");
static_assert(offsetof(ADev140_C, RightLeg) == 0x000A98, "Member 'ADev140_C::RightLeg' has a wrong offset!");
static_assert(offsetof(ADev140_C, LeftLeg) == 0x000AA0, "Member 'ADev140_C::LeftLeg' has a wrong offset!");

}

