#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dev173

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DevilBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Dev173.Dev173_C
// 0x0020 (0x0A70 - 0x0A50)
class ADev173_C final : public ADevilBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Dev173_C;                           // 0x0A50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpringArmComponent*                    SpringArm_Up;                                      // 0x0A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ParentRotationScene_C*              BP_ParentRotationScene;                            // 0x0A60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaSlopeAdapterComponent_C*          SlopeAdapter;                                      // 0x0A68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Dev173(int32 EntryPoint);
	void BndEvt__DevilMovement_K2Node_ComponentBoundEvent_0_CharaMovementUpdatedSignature__DelegateSignature();
	void ReceiveBeginPlay();
	void BI_GetForceRotate(bool* Ret);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Dev173_C">();
	}
	static class ADev173_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADev173_C>();
	}
};
static_assert(alignof(ADev173_C) == 0x000008, "Wrong alignment on ADev173_C");
static_assert(sizeof(ADev173_C) == 0x000A70, "Wrong size on ADev173_C");
static_assert(offsetof(ADev173_C, UberGraphFrame_Dev173_C) == 0x000A50, "Member 'ADev173_C::UberGraphFrame_Dev173_C' has a wrong offset!");
static_assert(offsetof(ADev173_C, SpringArm_Up) == 0x000A58, "Member 'ADev173_C::SpringArm_Up' has a wrong offset!");
static_assert(offsetof(ADev173_C, BP_ParentRotationScene) == 0x000A60, "Member 'ADev173_C::BP_ParentRotationScene' has a wrong offset!");
static_assert(offsetof(ADev173_C, SlopeAdapter) == 0x000A68, "Member 'ADev173_C::SlopeAdapter' has a wrong offset!");

}

