#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dev138_Simple

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Dev138_Simple.Dev138_Simple_C.ExecuteUbergraph_Dev138_Simple
// 0x0004 (0x0004 - 0x0000)
struct Dev138_Simple_C_ExecuteUbergraph_Dev138_Simple final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev138_Simple_C_ExecuteUbergraph_Dev138_Simple) == 0x000004, "Wrong alignment on Dev138_Simple_C_ExecuteUbergraph_Dev138_Simple");
static_assert(sizeof(Dev138_Simple_C_ExecuteUbergraph_Dev138_Simple) == 0x000004, "Wrong size on Dev138_Simple_C_ExecuteUbergraph_Dev138_Simple");
static_assert(offsetof(Dev138_Simple_C_ExecuteUbergraph_Dev138_Simple, EntryPoint) == 0x000000, "Member 'Dev138_Simple_C_ExecuteUbergraph_Dev138_Simple::EntryPoint' has a wrong offset!");

// Function Dev138_Simple.Dev138_Simple_C.BI_SetNPCCollision
// 0x0001 (0x0001 - 0x0000)
struct Dev138_Simple_C_BI_SetNPCCollision final
{
public:
	bool                                          Ret;                                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev138_Simple_C_BI_SetNPCCollision) == 0x000001, "Wrong alignment on Dev138_Simple_C_BI_SetNPCCollision");
static_assert(sizeof(Dev138_Simple_C_BI_SetNPCCollision) == 0x000001, "Wrong size on Dev138_Simple_C_BI_SetNPCCollision");
static_assert(offsetof(Dev138_Simple_C_BI_SetNPCCollision, Ret) == 0x000000, "Member 'Dev138_Simple_C_BI_SetNPCCollision::Ret' has a wrong offset!");

// Function Dev138_Simple.Dev138_Simple_C.SetNpcCollision
// 0x0050 (0x0050 - 0x0000)
struct Dev138_Simple_C_SetNpcCollision final
{
public:
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BA5[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANPCOnlyCollision_C*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev138_Simple_C_SetNpcCollision) == 0x000010, "Wrong alignment on Dev138_Simple_C_SetNpcCollision");
static_assert(sizeof(Dev138_Simple_C_SetNpcCollision) == 0x000050, "Wrong size on Dev138_Simple_C_SetNpcCollision");
static_assert(offsetof(Dev138_Simple_C_SetNpcCollision, CallFunc_MakeVector_ReturnValue) == 0x000000, "Member 'Dev138_Simple_C_SetNpcCollision::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dev138_Simple_C_SetNpcCollision, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'Dev138_Simple_C_SetNpcCollision::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dev138_Simple_C_SetNpcCollision, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'Dev138_Simple_C_SetNpcCollision::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dev138_Simple_C_SetNpcCollision, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'Dev138_Simple_C_SetNpcCollision::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

