#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dev331

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DevilBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Dev331.Dev331_C
// 0x0080 (0x0AD0 - 0x0A50)
class ADev331_C final : public ADevilBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Dev331_C;                           // 0x0A50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCharaBodyComponent_C*                  Body;                                              // 0x0A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm_Up;                                      // 0x0A60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ParentRotationScene_C*              BP_ParentRotationScene;                            // 0x0A68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaLegComponent_C*                   RightLeg3;                                         // 0x0A70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaLegComponent_C*                   LeftLeg3;                                          // 0x0A78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaLegComponent_C*                   RightLeg2;                                         // 0x0A80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaLegComponent_C*                   LeftLeg2;                                          // 0x0A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaLegComponent_C*                   RightLeg1;                                         // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaLegComponent_C*                   LeftLeg1;                                          // 0x0A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaStepSmootherComponent_C*          StepSmoother;                                      // 0x0AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaEyeComponent_C*                   RightEye;                                          // 0x0AA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaEyeComponent_C*                   LeftEye;                                           // 0x0AB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaHeadComponent_C*                  Head;                                              // 0x0AB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaLegComponent_C*                   RightLeg;                                          // 0x0AC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaLegComponent_C*                   LeftLeg;                                           // 0x0AC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Dev331(int32 EntryPoint);
	void BndEvt__DevilMovement_K2Node_ComponentBoundEvent_0_CharaMovementUpdatedSignature__DelegateSignature();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Dev331_C">();
	}
	static class ADev331_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADev331_C>();
	}
};
static_assert(alignof(ADev331_C) == 0x000008, "Wrong alignment on ADev331_C");
static_assert(sizeof(ADev331_C) == 0x000AD0, "Wrong size on ADev331_C");
static_assert(offsetof(ADev331_C, UberGraphFrame_Dev331_C) == 0x000A50, "Member 'ADev331_C::UberGraphFrame_Dev331_C' has a wrong offset!");
static_assert(offsetof(ADev331_C, Body) == 0x000A58, "Member 'ADev331_C::Body' has a wrong offset!");
static_assert(offsetof(ADev331_C, SpringArm_Up) == 0x000A60, "Member 'ADev331_C::SpringArm_Up' has a wrong offset!");
static_assert(offsetof(ADev331_C, BP_ParentRotationScene) == 0x000A68, "Member 'ADev331_C::BP_ParentRotationScene' has a wrong offset!");
static_assert(offsetof(ADev331_C, RightLeg3) == 0x000A70, "Member 'ADev331_C::RightLeg3' has a wrong offset!");
static_assert(offsetof(ADev331_C, LeftLeg3) == 0x000A78, "Member 'ADev331_C::LeftLeg3' has a wrong offset!");
static_assert(offsetof(ADev331_C, RightLeg2) == 0x000A80, "Member 'ADev331_C::RightLeg2' has a wrong offset!");
static_assert(offsetof(ADev331_C, LeftLeg2) == 0x000A88, "Member 'ADev331_C::LeftLeg2' has a wrong offset!");
static_assert(offsetof(ADev331_C, RightLeg1) == 0x000A90, "Member 'ADev331_C::RightLeg1' has a wrong offset!");
static_assert(offsetof(ADev331_C, LeftLeg1) == 0x000A98, "Member 'ADev331_C::LeftLeg1' has a wrong offset!");
static_assert(offsetof(ADev331_C, StepSmoother) == 0x000AA0, "Member 'ADev331_C::StepSmoother' has a wrong offset!");
static_assert(offsetof(ADev331_C, RightEye) == 0x000AA8, "Member 'ADev331_C::RightEye' has a wrong offset!");
static_assert(offsetof(ADev331_C, LeftEye) == 0x000AB0, "Member 'ADev331_C::LeftEye' has a wrong offset!");
static_assert(offsetof(ADev331_C, Head) == 0x000AB8, "Member 'ADev331_C::Head' has a wrong offset!");
static_assert(offsetof(ADev331_C, RightLeg) == 0x000AC0, "Member 'ADev331_C::RightLeg' has a wrong offset!");
static_assert(offsetof(ADev331_C, LeftLeg) == 0x000AC8, "Member 'ADev331_C::LeftLeg' has a wrong offset!");

}

