#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dev316_AnimBP

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Dev316_AnimBP.Dev316_AnimBP_C.ExecuteUbergraph_Dev316_AnimBP
// 0x01B0 (0x01B0 - 0x0000)
struct Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enable_7;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Immediately_3;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D4B[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Alpha;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D4C[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Event_Trans;                                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_BlendAlpha;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsEnable;                             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D4D[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     K2Node_Event_Transes;                              // 0x0048(0x0010)(ConstParm, ReferenceParm)
	TArray<float>                                 K2Node_Event_TransAlphas;                          // 0x0058(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_Event_Invalid;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D4E[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Index_4;                              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_5;                              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Event_Rotation_2;                           // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaTime;                            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_6;                              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D4F[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaAnimation_C> K2Node_DynamicCast_AsBPI_Chara_Animation;          // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D50[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaAnimation_C> K2Node_DynamicCast_AsBPI_Chara_Animation_1;        // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D51[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaAnimation_C> K2Node_DynamicCast_AsBPI_Chara_Animation_2;        // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D52[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_NewSpeed;                             // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Invalid_1;                            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D53[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Offset;                               // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Event_DeltaRotation_1;                      // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Event_Index_3;                              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Location_1;                           // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Event_DeltaRotation;                        // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D54[0x3];                                     // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Index_2;                              // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Location;                             // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_1;                              // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Event_Rotation_1;                           // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_2;                 // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_CHARA_ANIMATION_MODE                        K2Node_Event_Mode;                                 // 0x013E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D55[0x1];                                     // 0x013F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_BlendTime;                            // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enable_6;                             // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Enable_5;                             // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Immediately_2;                        // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D56[0x1];                                     // 0x0147(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enable_4;                             // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Immediately_1;                        // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D57[0x2];                                     // 0x014E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_2;           // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Event_Rotation;                             // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Enable_3;                             // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Immediately;                          // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Enable_2;                             // 0x016E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D58[0x1];                                     // 0x016F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      K2Node_Event_Animation_1;                          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enable_1;                             // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D59[0x1];                                     // 0x017B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_3;           // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_4;           // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_1;                  // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Event_Animation;                            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enable;                               // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D5A[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomPoseWeightTable*                 K2Node_Event_PoseWeightTable;                      // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_5;           // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D5B[0x3];                                     // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FInterpTo_ReturnValue_2;                  // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP) == 0x000010, "Wrong alignment on Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP");
static_assert(sizeof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP) == 0x0001B0, "Wrong size on Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, EntryPoint) == 0x000000, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Enable_7) == 0x000004, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Enable_7' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Immediately_3) == 0x000005, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Immediately_3' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Alpha) == 0x000008, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Alpha' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Trans) == 0x000010, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Trans' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_BlendAlpha) == 0x000040, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_BlendAlpha' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_IsEnable) == 0x000044, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_IsEnable' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Transes) == 0x000048, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Transes' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_TransAlphas) == 0x000058, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_TransAlphas' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Invalid) == 0x000068, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Invalid' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Index_4) == 0x00006C, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Index_4' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Index_5) == 0x000070, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Index_5' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Rotation_2) == 0x000074, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Rotation_2' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_DeltaTime) == 0x000080, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_DeltaTimeX) == 0x000084, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000088, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Index_6) == 0x000090, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Index_6' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_DynamicCast_AsBPI_Chara_Animation) == 0x000098, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_DynamicCast_AsBPI_Chara_Animation' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_DynamicCast_AsBPI_Chara_Animation_1) == 0x0000B0, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_DynamicCast_AsBPI_Chara_Animation_1' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_DynamicCast_AsBPI_Chara_Animation_2) == 0x0000C8, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_DynamicCast_AsBPI_Chara_Animation_2' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_DynamicCast_bSuccess_2) == 0x0000D8, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_NewSpeed) == 0x0000DC, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_NewSpeed' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Invalid_1) == 0x0000E0, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Invalid_1' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Offset) == 0x0000E4, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Offset' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_DeltaRotation_1) == 0x0000F0, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_DeltaRotation_1' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Index_3) == 0x0000FC, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Index_3' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Location_1) == 0x000100, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Location_1' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_DeltaRotation) == 0x00010C, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_DeltaRotation' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_SwitchInteger_CmpSuccess) == 0x000118, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Index_2) == 0x00011C, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Index_2' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Location) == 0x000120, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Location' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Index_1) == 0x00012C, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Index_1' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Rotation_1) == 0x000130, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Rotation_1' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_SwitchInteger_CmpSuccess_1) == 0x00013C, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_SwitchInteger_CmpSuccess_2) == 0x00013D, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_SwitchInteger_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Mode) == 0x00013E, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Mode' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_BlendTime) == 0x000140, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_BlendTime' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Enable_6) == 0x000144, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Enable_6' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Enable_5) == 0x000145, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Enable_5' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Immediately_2) == 0x000146, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Immediately_2' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000148, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Enable_4) == 0x00014C, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Enable_4' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Immediately_1) == 0x00014D, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Immediately_1' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, CallFunc_Conv_BoolToFloat_ReturnValue_1) == 0x000150, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::CallFunc_Conv_BoolToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, CallFunc_Conv_BoolToFloat_ReturnValue_2) == 0x000154, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::CallFunc_Conv_BoolToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, CallFunc_FInterpTo_ReturnValue) == 0x000158, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Index) == 0x00015C, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Rotation) == 0x000160, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Rotation' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Enable_3) == 0x00016C, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Enable_3' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Immediately) == 0x00016D, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Immediately' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Enable_2) == 0x00016E, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Enable_2' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Animation_1) == 0x000170, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Animation_1' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Enable_1) == 0x000178, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Enable_1' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, CallFunc_BooleanAND_ReturnValue) == 0x000179, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, CallFunc_BooleanAND_ReturnValue_1) == 0x00017A, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, CallFunc_Conv_BoolToFloat_ReturnValue_3) == 0x00017C, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::CallFunc_Conv_BoolToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, CallFunc_Conv_BoolToFloat_ReturnValue_4) == 0x000180, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::CallFunc_Conv_BoolToFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, CallFunc_FInterpTo_ReturnValue_1) == 0x000184, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Animation) == 0x000188, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_Enable) == 0x000190, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_Enable' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, K2Node_Event_PoseWeightTable) == 0x000198, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::K2Node_Event_PoseWeightTable' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, CallFunc_Conv_BoolToFloat_ReturnValue_5) == 0x0001A0, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::CallFunc_Conv_BoolToFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, CallFunc_IsValid_ReturnValue) == 0x0001A4, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, CallFunc_FInterpTo_ReturnValue_2) == 0x0001A8, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::CallFunc_FInterpTo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP, CallFunc_SelectFloat_ReturnValue) == 0x0001AC, "Member 'Dev316_AnimBP_C_ExecuteUbergraph_Dev316_AnimBP::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetPoseWeightTable
// 0x0008 (0x0008 - 0x0000)
struct Dev316_AnimBP_C_SetPoseWeightTable final
{
public:
	class UCustomPoseWeightTable*                 PoseWeightTable;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev316_AnimBP_C_SetPoseWeightTable) == 0x000008, "Wrong alignment on Dev316_AnimBP_C_SetPoseWeightTable");
static_assert(sizeof(Dev316_AnimBP_C_SetPoseWeightTable) == 0x000008, "Wrong size on Dev316_AnimBP_C_SetPoseWeightTable");
static_assert(offsetof(Dev316_AnimBP_C_SetPoseWeightTable, PoseWeightTable) == 0x000000, "Member 'Dev316_AnimBP_C_SetPoseWeightTable::PoseWeightTable' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetMumbleEnable
// 0x0001 (0x0001 - 0x0000)
struct Dev316_AnimBP_C_SetMumbleEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev316_AnimBP_C_SetMumbleEnable) == 0x000001, "Wrong alignment on Dev316_AnimBP_C_SetMumbleEnable");
static_assert(sizeof(Dev316_AnimBP_C_SetMumbleEnable) == 0x000001, "Wrong size on Dev316_AnimBP_C_SetMumbleEnable");
static_assert(offsetof(Dev316_AnimBP_C_SetMumbleEnable, Enable) == 0x000000, "Member 'Dev316_AnimBP_C_SetMumbleEnable::Enable' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetMumbleAnimation
// 0x0008 (0x0008 - 0x0000)
struct Dev316_AnimBP_C_SetMumbleAnimation final
{
public:
	class UAnimSequenceBase*                      Animation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev316_AnimBP_C_SetMumbleAnimation) == 0x000008, "Wrong alignment on Dev316_AnimBP_C_SetMumbleAnimation");
static_assert(sizeof(Dev316_AnimBP_C_SetMumbleAnimation) == 0x000008, "Wrong size on Dev316_AnimBP_C_SetMumbleAnimation");
static_assert(offsetof(Dev316_AnimBP_C_SetMumbleAnimation, Animation) == 0x000000, "Member 'Dev316_AnimBP_C_SetMumbleAnimation::Animation' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetLookAtEnable
// 0x0001 (0x0001 - 0x0000)
struct Dev316_AnimBP_C_SetLookAtEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev316_AnimBP_C_SetLookAtEnable) == 0x000001, "Wrong alignment on Dev316_AnimBP_C_SetLookAtEnable");
static_assert(sizeof(Dev316_AnimBP_C_SetLookAtEnable) == 0x000001, "Wrong size on Dev316_AnimBP_C_SetLookAtEnable");
static_assert(offsetof(Dev316_AnimBP_C_SetLookAtEnable, Enable) == 0x000000, "Member 'Dev316_AnimBP_C_SetLookAtEnable::Enable' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetDefaultAnimation
// 0x0008 (0x0008 - 0x0000)
struct Dev316_AnimBP_C_SetDefaultAnimation final
{
public:
	class UAnimSequenceBase*                      Animation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev316_AnimBP_C_SetDefaultAnimation) == 0x000008, "Wrong alignment on Dev316_AnimBP_C_SetDefaultAnimation");
static_assert(sizeof(Dev316_AnimBP_C_SetDefaultAnimation) == 0x000008, "Wrong size on Dev316_AnimBP_C_SetDefaultAnimation");
static_assert(offsetof(Dev316_AnimBP_C_SetDefaultAnimation, Animation) == 0x000000, "Member 'Dev316_AnimBP_C_SetDefaultAnimation::Animation' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetBoneMotionEnable
// 0x0001 (0x0001 - 0x0000)
struct Dev316_AnimBP_C_SetBoneMotionEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev316_AnimBP_C_SetBoneMotionEnable) == 0x000001, "Wrong alignment on Dev316_AnimBP_C_SetBoneMotionEnable");
static_assert(sizeof(Dev316_AnimBP_C_SetBoneMotionEnable) == 0x000001, "Wrong size on Dev316_AnimBP_C_SetBoneMotionEnable");
static_assert(offsetof(Dev316_AnimBP_C_SetBoneMotionEnable, Enable) == 0x000000, "Member 'Dev316_AnimBP_C_SetBoneMotionEnable::Enable' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetEyeIKEnable
// 0x0002 (0x0002 - 0x0000)
struct Dev316_AnimBP_C_SetEyeIKEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Immediately;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev316_AnimBP_C_SetEyeIKEnable) == 0x000001, "Wrong alignment on Dev316_AnimBP_C_SetEyeIKEnable");
static_assert(sizeof(Dev316_AnimBP_C_SetEyeIKEnable) == 0x000002, "Wrong size on Dev316_AnimBP_C_SetEyeIKEnable");
static_assert(offsetof(Dev316_AnimBP_C_SetEyeIKEnable, Enable) == 0x000000, "Member 'Dev316_AnimBP_C_SetEyeIKEnable::Enable' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_SetEyeIKEnable, Immediately) == 0x000001, "Member 'Dev316_AnimBP_C_SetEyeIKEnable::Immediately' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetEyeIKRotation
// 0x0010 (0x0010 - 0x0000)
struct Dev316_AnimBP_C_SetEyeIKRotation final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev316_AnimBP_C_SetEyeIKRotation) == 0x000004, "Wrong alignment on Dev316_AnimBP_C_SetEyeIKRotation");
static_assert(sizeof(Dev316_AnimBP_C_SetEyeIKRotation) == 0x000010, "Wrong size on Dev316_AnimBP_C_SetEyeIKRotation");
static_assert(offsetof(Dev316_AnimBP_C_SetEyeIKRotation, Param_Index) == 0x000000, "Member 'Dev316_AnimBP_C_SetEyeIKRotation::Param_Index' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_SetEyeIKRotation, Rotation) == 0x000004, "Member 'Dev316_AnimBP_C_SetEyeIKRotation::Rotation' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetHeadIKEnable
// 0x0002 (0x0002 - 0x0000)
struct Dev316_AnimBP_C_SetHeadIKEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Immediately;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev316_AnimBP_C_SetHeadIKEnable) == 0x000001, "Wrong alignment on Dev316_AnimBP_C_SetHeadIKEnable");
static_assert(sizeof(Dev316_AnimBP_C_SetHeadIKEnable) == 0x000002, "Wrong size on Dev316_AnimBP_C_SetHeadIKEnable");
static_assert(offsetof(Dev316_AnimBP_C_SetHeadIKEnable, Enable) == 0x000000, "Member 'Dev316_AnimBP_C_SetHeadIKEnable::Enable' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_SetHeadIKEnable, Immediately) == 0x000001, "Member 'Dev316_AnimBP_C_SetHeadIKEnable::Immediately' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetLegIKEnable
// 0x0002 (0x0002 - 0x0000)
struct Dev316_AnimBP_C_SetLegIKEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Immediately;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev316_AnimBP_C_SetLegIKEnable) == 0x000001, "Wrong alignment on Dev316_AnimBP_C_SetLegIKEnable");
static_assert(sizeof(Dev316_AnimBP_C_SetLegIKEnable) == 0x000002, "Wrong size on Dev316_AnimBP_C_SetLegIKEnable");
static_assert(offsetof(Dev316_AnimBP_C_SetLegIKEnable, Enable) == 0x000000, "Member 'Dev316_AnimBP_C_SetLegIKEnable::Enable' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_SetLegIKEnable, Immediately) == 0x000001, "Member 'Dev316_AnimBP_C_SetLegIKEnable::Immediately' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetRootOffsetEnable
// 0x0001 (0x0001 - 0x0000)
struct Dev316_AnimBP_C_SetRootOffsetEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev316_AnimBP_C_SetRootOffsetEnable) == 0x000001, "Wrong alignment on Dev316_AnimBP_C_SetRootOffsetEnable");
static_assert(sizeof(Dev316_AnimBP_C_SetRootOffsetEnable) == 0x000001, "Wrong size on Dev316_AnimBP_C_SetRootOffsetEnable");
static_assert(offsetof(Dev316_AnimBP_C_SetRootOffsetEnable, Enable) == 0x000000, "Member 'Dev316_AnimBP_C_SetRootOffsetEnable::Enable' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetAnimationMode
// 0x0008 (0x0008 - 0x0000)
struct Dev316_AnimBP_C_SetAnimationMode final
{
public:
	E_CHARA_ANIMATION_MODE                        Mode;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D5C[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendTime;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev316_AnimBP_C_SetAnimationMode) == 0x000004, "Wrong alignment on Dev316_AnimBP_C_SetAnimationMode");
static_assert(sizeof(Dev316_AnimBP_C_SetAnimationMode) == 0x000008, "Wrong size on Dev316_AnimBP_C_SetAnimationMode");
static_assert(offsetof(Dev316_AnimBP_C_SetAnimationMode, Mode) == 0x000000, "Member 'Dev316_AnimBP_C_SetAnimationMode::Mode' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_SetAnimationMode, BlendTime) == 0x000004, "Member 'Dev316_AnimBP_C_SetAnimationMode::BlendTime' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetHeadIKRotation
// 0x0010 (0x0010 - 0x0000)
struct Dev316_AnimBP_C_SetHeadIKRotation final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev316_AnimBP_C_SetHeadIKRotation) == 0x000004, "Wrong alignment on Dev316_AnimBP_C_SetHeadIKRotation");
static_assert(sizeof(Dev316_AnimBP_C_SetHeadIKRotation) == 0x000010, "Wrong size on Dev316_AnimBP_C_SetHeadIKRotation");
static_assert(offsetof(Dev316_AnimBP_C_SetHeadIKRotation, Param_Index) == 0x000000, "Member 'Dev316_AnimBP_C_SetHeadIKRotation::Param_Index' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_SetHeadIKRotation, Rotation) == 0x000004, "Member 'Dev316_AnimBP_C_SetHeadIKRotation::Rotation' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetLegIKTarget
// 0x0010 (0x0010 - 0x0000)
struct Dev316_AnimBP_C_SetLegIKTarget final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev316_AnimBP_C_SetLegIKTarget) == 0x000004, "Wrong alignment on Dev316_AnimBP_C_SetLegIKTarget");
static_assert(sizeof(Dev316_AnimBP_C_SetLegIKTarget) == 0x000010, "Wrong size on Dev316_AnimBP_C_SetLegIKTarget");
static_assert(offsetof(Dev316_AnimBP_C_SetLegIKTarget, Param_Index) == 0x000000, "Member 'Dev316_AnimBP_C_SetLegIKTarget::Param_Index' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_SetLegIKTarget, Location) == 0x000004, "Member 'Dev316_AnimBP_C_SetLegIKTarget::Location' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetLegIKEffector
// 0x001C (0x001C - 0x0000)
struct Dev316_AnimBP_C_SetLegIKEffector final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DeltaRotation;                                     // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev316_AnimBP_C_SetLegIKEffector) == 0x000004, "Wrong alignment on Dev316_AnimBP_C_SetLegIKEffector");
static_assert(sizeof(Dev316_AnimBP_C_SetLegIKEffector) == 0x00001C, "Wrong size on Dev316_AnimBP_C_SetLegIKEffector");
static_assert(offsetof(Dev316_AnimBP_C_SetLegIKEffector, Param_Index) == 0x000000, "Member 'Dev316_AnimBP_C_SetLegIKEffector::Param_Index' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_SetLegIKEffector, Location) == 0x000004, "Member 'Dev316_AnimBP_C_SetLegIKEffector::Location' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_SetLegIKEffector, DeltaRotation) == 0x000010, "Member 'Dev316_AnimBP_C_SetLegIKEffector::DeltaRotation' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetRootOffset
// 0x0018 (0x0018 - 0x0000)
struct Dev316_AnimBP_C_SetRootOffset final
{
public:
	struct FVector                                Offset;                                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DeltaRotation;                                     // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev316_AnimBP_C_SetRootOffset) == 0x000004, "Wrong alignment on Dev316_AnimBP_C_SetRootOffset");
static_assert(sizeof(Dev316_AnimBP_C_SetRootOffset) == 0x000018, "Wrong size on Dev316_AnimBP_C_SetRootOffset");
static_assert(offsetof(Dev316_AnimBP_C_SetRootOffset, Offset) == 0x000000, "Member 'Dev316_AnimBP_C_SetRootOffset::Offset' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_SetRootOffset, DeltaRotation) == 0x00000C, "Member 'Dev316_AnimBP_C_SetRootOffset::DeltaRotation' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Dev316_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev316_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Dev316_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(Dev316_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Dev316_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(Dev316_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Dev316_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetBodyIKEnable
// 0x0002 (0x0002 - 0x0000)
struct Dev316_AnimBP_C_SetBodyIKEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Immediately;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev316_AnimBP_C_SetBodyIKEnable) == 0x000001, "Wrong alignment on Dev316_AnimBP_C_SetBodyIKEnable");
static_assert(sizeof(Dev316_AnimBP_C_SetBodyIKEnable) == 0x000002, "Wrong size on Dev316_AnimBP_C_SetBodyIKEnable");
static_assert(offsetof(Dev316_AnimBP_C_SetBodyIKEnable, Enable) == 0x000000, "Member 'Dev316_AnimBP_C_SetBodyIKEnable::Enable' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_SetBodyIKEnable, Immediately) == 0x000001, "Member 'Dev316_AnimBP_C_SetBodyIKEnable::Immediately' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetFloatingIKPerch
// 0x0004 (0x0004 - 0x0000)
struct Dev316_AnimBP_C_SetFloatingIKPerch final
{
public:
	float                                         Alpha;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev316_AnimBP_C_SetFloatingIKPerch) == 0x000004, "Wrong alignment on Dev316_AnimBP_C_SetFloatingIKPerch");
static_assert(sizeof(Dev316_AnimBP_C_SetFloatingIKPerch) == 0x000004, "Wrong size on Dev316_AnimBP_C_SetFloatingIKPerch");
static_assert(offsetof(Dev316_AnimBP_C_SetFloatingIKPerch, Alpha) == 0x000000, "Member 'Dev316_AnimBP_C_SetFloatingIKPerch::Alpha' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetPrimaryWorldOffsetBoneTrans
// 0x0040 (0x0040 - 0x0000)
struct Dev316_AnimBP_C_SetPrimaryWorldOffsetBoneTrans final
{
public:
	struct FTransform                             Trans;                                             // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         BlendAlpha;                                        // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev316_AnimBP_C_SetPrimaryWorldOffsetBoneTrans) == 0x000010, "Wrong alignment on Dev316_AnimBP_C_SetPrimaryWorldOffsetBoneTrans");
static_assert(sizeof(Dev316_AnimBP_C_SetPrimaryWorldOffsetBoneTrans) == 0x000040, "Wrong size on Dev316_AnimBP_C_SetPrimaryWorldOffsetBoneTrans");
static_assert(offsetof(Dev316_AnimBP_C_SetPrimaryWorldOffsetBoneTrans, Trans) == 0x000000, "Member 'Dev316_AnimBP_C_SetPrimaryWorldOffsetBoneTrans::Trans' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_SetPrimaryWorldOffsetBoneTrans, BlendAlpha) == 0x000030, "Member 'Dev316_AnimBP_C_SetPrimaryWorldOffsetBoneTrans::BlendAlpha' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetEnableBoneTrans
// 0x0001 (0x0001 - 0x0000)
struct Dev316_AnimBP_C_SetEnableBoneTrans final
{
public:
	bool                                          IsEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev316_AnimBP_C_SetEnableBoneTrans) == 0x000001, "Wrong alignment on Dev316_AnimBP_C_SetEnableBoneTrans");
static_assert(sizeof(Dev316_AnimBP_C_SetEnableBoneTrans) == 0x000001, "Wrong size on Dev316_AnimBP_C_SetEnableBoneTrans");
static_assert(offsetof(Dev316_AnimBP_C_SetEnableBoneTrans, IsEnable) == 0x000000, "Member 'Dev316_AnimBP_C_SetEnableBoneTrans::IsEnable' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetWorldOffsetBoneTranses
// 0x0020 (0x0020 - 0x0000)
struct Dev316_AnimBP_C_SetWorldOffsetBoneTranses final
{
public:
	TArray<struct FTransform>                     Transes;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<float>                                 TransAlphas;                                       // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Dev316_AnimBP_C_SetWorldOffsetBoneTranses) == 0x000008, "Wrong alignment on Dev316_AnimBP_C_SetWorldOffsetBoneTranses");
static_assert(sizeof(Dev316_AnimBP_C_SetWorldOffsetBoneTranses) == 0x000020, "Wrong size on Dev316_AnimBP_C_SetWorldOffsetBoneTranses");
static_assert(offsetof(Dev316_AnimBP_C_SetWorldOffsetBoneTranses, Transes) == 0x000000, "Member 'Dev316_AnimBP_C_SetWorldOffsetBoneTranses::Transes' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_SetWorldOffsetBoneTranses, TransAlphas) == 0x000010, "Member 'Dev316_AnimBP_C_SetWorldOffsetBoneTranses::TransAlphas' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetInvalidLegIK
// 0x0008 (0x0008 - 0x0000)
struct Dev316_AnimBP_C_SetInvalidLegIK final
{
public:
	bool                                          Invalid;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D5D[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param_Index;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev316_AnimBP_C_SetInvalidLegIK) == 0x000004, "Wrong alignment on Dev316_AnimBP_C_SetInvalidLegIK");
static_assert(sizeof(Dev316_AnimBP_C_SetInvalidLegIK) == 0x000008, "Wrong size on Dev316_AnimBP_C_SetInvalidLegIK");
static_assert(offsetof(Dev316_AnimBP_C_SetInvalidLegIK, Invalid) == 0x000000, "Member 'Dev316_AnimBP_C_SetInvalidLegIK::Invalid' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_SetInvalidLegIK, Param_Index) == 0x000004, "Member 'Dev316_AnimBP_C_SetInvalidLegIK::Param_Index' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetHeadIKRotationTick
// 0x0014 (0x0014 - 0x0000)
struct Dev316_AnimBP_C_SetHeadIKRotationTick final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         DeltaTime;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev316_AnimBP_C_SetHeadIKRotationTick) == 0x000004, "Wrong alignment on Dev316_AnimBP_C_SetHeadIKRotationTick");
static_assert(sizeof(Dev316_AnimBP_C_SetHeadIKRotationTick) == 0x000014, "Wrong size on Dev316_AnimBP_C_SetHeadIKRotationTick");
static_assert(offsetof(Dev316_AnimBP_C_SetHeadIKRotationTick, Param_Index) == 0x000000, "Member 'Dev316_AnimBP_C_SetHeadIKRotationTick::Param_Index' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_SetHeadIKRotationTick, Rotation) == 0x000004, "Member 'Dev316_AnimBP_C_SetHeadIKRotationTick::Rotation' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_SetHeadIKRotationTick, DeltaTime) == 0x000010, "Member 'Dev316_AnimBP_C_SetHeadIKRotationTick::DeltaTime' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.InvalidLookAt
// 0x0001 (0x0001 - 0x0000)
struct Dev316_AnimBP_C_InvalidLookAt final
{
public:
	bool                                          Invalid;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dev316_AnimBP_C_InvalidLookAt) == 0x000001, "Wrong alignment on Dev316_AnimBP_C_InvalidLookAt");
static_assert(sizeof(Dev316_AnimBP_C_InvalidLookAt) == 0x000001, "Wrong size on Dev316_AnimBP_C_InvalidLookAt");
static_assert(offsetof(Dev316_AnimBP_C_InvalidLookAt, Invalid) == 0x000000, "Member 'Dev316_AnimBP_C_InvalidLookAt::Invalid' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.ChangeTwistAsset
// 0x0004 (0x0004 - 0x0000)
struct Dev316_AnimBP_C_ChangeTwistAsset final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev316_AnimBP_C_ChangeTwistAsset) == 0x000004, "Wrong alignment on Dev316_AnimBP_C_ChangeTwistAsset");
static_assert(sizeof(Dev316_AnimBP_C_ChangeTwistAsset) == 0x000004, "Wrong size on Dev316_AnimBP_C_ChangeTwistAsset");
static_assert(offsetof(Dev316_AnimBP_C_ChangeTwistAsset, Param_Index) == 0x000000, "Member 'Dev316_AnimBP_C_ChangeTwistAsset::Param_Index' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.SetHeadIKInterpSpeed
// 0x0004 (0x0004 - 0x0000)
struct Dev316_AnimBP_C_SetHeadIKInterpSpeed final
{
public:
	float                                         NewSpeed;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev316_AnimBP_C_SetHeadIKInterpSpeed) == 0x000004, "Wrong alignment on Dev316_AnimBP_C_SetHeadIKInterpSpeed");
static_assert(sizeof(Dev316_AnimBP_C_SetHeadIKInterpSpeed) == 0x000004, "Wrong size on Dev316_AnimBP_C_SetHeadIKInterpSpeed");
static_assert(offsetof(Dev316_AnimBP_C_SetHeadIKInterpSpeed, NewSpeed) == 0x000000, "Member 'Dev316_AnimBP_C_SetHeadIKInterpSpeed::NewSpeed' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Dev316_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Dev316_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Dev316_AnimBP_C_AnimGraph");
static_assert(sizeof(Dev316_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on Dev316_AnimBP_C_AnimGraph");
static_assert(offsetof(Dev316_AnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'Dev316_AnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.GetDefaultAnimation
// 0x0008 (0x0008 - 0x0000)
struct Dev316_AnimBP_C_GetDefaultAnimation final
{
public:
	class UAnimSequenceBase*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev316_AnimBP_C_GetDefaultAnimation) == 0x000008, "Wrong alignment on Dev316_AnimBP_C_GetDefaultAnimation");
static_assert(sizeof(Dev316_AnimBP_C_GetDefaultAnimation) == 0x000008, "Wrong size on Dev316_AnimBP_C_GetDefaultAnimation");
static_assert(offsetof(Dev316_AnimBP_C_GetDefaultAnimation, ReturnValue) == 0x000000, "Member 'Dev316_AnimBP_C_GetDefaultAnimation::ReturnValue' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.GetAnimationMode
// 0x0002 (0x0002 - 0x0000)
struct Dev316_AnimBP_C_GetAnimationMode final
{
public:
	E_CHARA_ANIMATION_MODE                        Param_ModeCurrent;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CHARA_ANIMATION_MODE                        Param_ModePrevious;                                // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dev316_AnimBP_C_GetAnimationMode) == 0x000001, "Wrong alignment on Dev316_AnimBP_C_GetAnimationMode");
static_assert(sizeof(Dev316_AnimBP_C_GetAnimationMode) == 0x000002, "Wrong size on Dev316_AnimBP_C_GetAnimationMode");
static_assert(offsetof(Dev316_AnimBP_C_GetAnimationMode, Param_ModeCurrent) == 0x000000, "Member 'Dev316_AnimBP_C_GetAnimationMode::Param_ModeCurrent' has a wrong offset!");
static_assert(offsetof(Dev316_AnimBP_C_GetAnimationMode, Param_ModePrevious) == 0x000001, "Member 'Dev316_AnimBP_C_GetAnimationMode::Param_ModePrevious' has a wrong offset!");

// Function Dev316_AnimBP.Dev316_AnimBP_C.GetMumbleAnimation
// 0x0008 (0x0008 - 0x0000)
struct Dev316_AnimBP_C_GetMumbleAnimation final
{
public:
	class UAnimSequenceBase*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
