#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dev317

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DevilBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Dev317.Dev317_C
// 0x0038 (0x0A88 - 0x0A50)
class ADev317_C final : public ADevilBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Dev317_C;                           // 0x0A50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpringArmComponent*                    SpringArm_Up;                                      // 0x0A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ParentRotationScene_C*              BP_ParentRotationScene;                            // 0x0A60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaEyeComponent_C*                   RightEye;                                          // 0x0A68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaEyeComponent_C*                   LeftEye;                                           // 0x0A70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaHeadComponent_C*                  Head;                                              // 0x0A78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaFloatingComponent_C*              Floating;                                          // 0x0A80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void BndEvt__DevilMovement_K2Node_ComponentBoundEvent_0_CharaMovementUpdatedSignature__DelegateSignature();
	void ExecuteUbergraph_Dev317(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Dev317_C">();
	}
	static class ADev317_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADev317_C>();
	}
};
static_assert(alignof(ADev317_C) == 0x000008, "Wrong alignment on ADev317_C");
static_assert(sizeof(ADev317_C) == 0x000A88, "Wrong size on ADev317_C");
static_assert(offsetof(ADev317_C, UberGraphFrame_Dev317_C) == 0x000A50, "Member 'ADev317_C::UberGraphFrame_Dev317_C' has a wrong offset!");
static_assert(offsetof(ADev317_C, SpringArm_Up) == 0x000A58, "Member 'ADev317_C::SpringArm_Up' has a wrong offset!");
static_assert(offsetof(ADev317_C, BP_ParentRotationScene) == 0x000A60, "Member 'ADev317_C::BP_ParentRotationScene' has a wrong offset!");
static_assert(offsetof(ADev317_C, RightEye) == 0x000A68, "Member 'ADev317_C::RightEye' has a wrong offset!");
static_assert(offsetof(ADev317_C, LeftEye) == 0x000A70, "Member 'ADev317_C::LeftEye' has a wrong offset!");
static_assert(offsetof(ADev317_C, Head) == 0x000A78, "Member 'ADev317_C::Head' has a wrong offset!");
static_assert(offsetof(ADev317_C, Floating) == 0x000A80, "Member 'ADev317_C::Floating' has a wrong offset!");

}

