#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dev304_AnimBP

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Dev304_AnimBP.Dev304_AnimBP_C
// 0x06C0 (0x0980 - 0x02C0)
class UDev304_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_A36C[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x02F8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0318(0x0020)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x0338(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x03E8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0430(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x04B0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0608(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0630(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0658(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x06D8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0708(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x07B8(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0838(0x00C8)()
	E_CHARA_ANIMATION_MODE                        ModeCurrent;                                       // 0x0900(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	E_CHARA_ANIMATION_MODE                        ModePrevious;                                      // 0x0901(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_A36D[0x2];                                     // 0x0902(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ModeBlendTime;                                     // 0x0904(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UAnimSequenceBase*                      DefaultAnimation;                                  // 0x0908(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      MumbleAnimation;                                   // 0x0910(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MumbleEnable;                                      // 0x0918(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A36E[0x3];                                     // 0x0919(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MumbleAlpha;                                       // 0x091C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FTransform                             PrimayBoneOffset;                                  // 0x0920(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FName                                   PrimaryBoneName;                                   // 0x0950(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PrimayBoneOffsetT;                                 // 0x0958(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               PrimayBoneOffsetR;                                 // 0x0964(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                PrimayBoneOffsetS;                                 // 0x0970(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Dev304_AnimBP(int32 EntryPoint);
	void SetPoseWeightTable(class UCustomPoseWeightTable* PoseWeightTable);
	void SetBoneMotionEnable(bool Enable);
	void SetMumbleAnimation(class UAnimSequenceBase* Animation);
	void SetMumbleEnable(bool Enable);
	void SetDefaultAnimation(class UAnimSequenceBase* Animation);
	void SetAnimationMode(E_CHARA_ANIMATION_MODE Mode, float BlendTime);
	void BlueprintPostEvaluateAnimation();
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void SetRootOffsetEnable(bool Enable);
	void SetRootOffset(const struct FVector& Offset, const struct FRotator& DeltaRotation);
	void SetLegIKEnable(bool Enable, bool Immediately);
	void SetLegIKEffector(int32 Param_Index, const struct FVector& Location, const struct FRotator& DeltaRotation);
	void SetLegIKTarget(int32 Param_Index, const struct FVector& Location);
	void SetHeadIKEnable(bool Enable, bool Immediately);
	void SetHeadIKRotation(int32 Param_Index, const struct FRotator& Rotation);
	void SetEyeIKEnable(bool Enable, bool Immediately);
	void SetHeadIKInterpSpeed(float NewSpeed);
	void ChangeTwistAsset(int32 Param_Index);
	void InvalidLookAt(bool Invalid);
	void SetHeadIKRotationTick(int32 Param_Index, const struct FRotator& Rotation, float DeltaTime);
	void SetInvalidLegIK(bool Invalid, int32 Param_Index);
	void SetWorldOffsetBoneTranses(const TArray<struct FTransform>& Transes, const TArray<float>& TransAlphas);
	void SetEnableBoneTrans(bool IsEnable);
	void SetPrimaryWorldOffsetBoneTrans(const struct FTransform& Trans, float BlendAlpha);
	void SetFloatingIKPerch(float Alpha);
	void SetBodyIKEnable(bool Enable, bool Immediately);
	void SetLookAtEnable(bool Enable);
	void SetEyeIKRotation(int32 Param_Index, const struct FRotator& Rotation);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

	class UAnimSequenceBase* GetDefaultAnimation() const;
	void GetAnimationMode(E_CHARA_ANIMATION_MODE* Param_ModeCurrent, E_CHARA_ANIMATION_MODE* Param_ModePrevious) const;
	class UAnimSequenceBase* GetMumbleAnimation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Dev304_AnimBP_C">();
	}
	static class UDev304_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDev304_AnimBP_C>();
	}
};
static_assert(alignof(UDev304_AnimBP_C) == 0x000010, "Wrong alignment on UDev304_AnimBP_C");
static_assert(sizeof(UDev304_AnimBP_C) == 0x000980, "Wrong size on UDev304_AnimBP_C");
static_assert(offsetof(UDev304_AnimBP_C, UberGraphFrame) == 0x0002C0, "Member 'UDev304_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UDev304_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0002F8, "Member 'UDev304_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000318, "Member 'UDev304_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, AnimGraphNode_BlendListByEnum) == 0x000338, "Member 'UDev304_AnimBP_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, AnimGraphNode_Slot) == 0x0003E8, "Member 'UDev304_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x000430, "Member 'UDev304_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x0004B0, "Member 'UDev304_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x000608, "Member 'UDev304_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x000630, "Member 'UDev304_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000658, "Member 'UDev304_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, AnimGraphNode_StateResult) == 0x0006D8, "Member 'UDev304_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, AnimGraphNode_StateMachine) == 0x000708, "Member 'UDev304_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x0007B8, "Member 'UDev304_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, AnimGraphNode_ApplyAdditive) == 0x000838, "Member 'UDev304_AnimBP_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, ModeCurrent) == 0x000900, "Member 'UDev304_AnimBP_C::ModeCurrent' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, ModePrevious) == 0x000901, "Member 'UDev304_AnimBP_C::ModePrevious' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, ModeBlendTime) == 0x000904, "Member 'UDev304_AnimBP_C::ModeBlendTime' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, DefaultAnimation) == 0x000908, "Member 'UDev304_AnimBP_C::DefaultAnimation' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, MumbleAnimation) == 0x000910, "Member 'UDev304_AnimBP_C::MumbleAnimation' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, MumbleEnable) == 0x000918, "Member 'UDev304_AnimBP_C::MumbleEnable' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, MumbleAlpha) == 0x00091C, "Member 'UDev304_AnimBP_C::MumbleAlpha' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, PrimayBoneOffset) == 0x000920, "Member 'UDev304_AnimBP_C::PrimayBoneOffset' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, PrimaryBoneName) == 0x000950, "Member 'UDev304_AnimBP_C::PrimaryBoneName' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, PrimayBoneOffsetT) == 0x000958, "Member 'UDev304_AnimBP_C::PrimayBoneOffsetT' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, PrimayBoneOffsetR) == 0x000964, "Member 'UDev304_AnimBP_C::PrimayBoneOffsetR' has a wrong offset!");
static_assert(offsetof(UDev304_AnimBP_C, PrimayBoneOffsetS) == 0x000970, "Member 'UDev304_AnimBP_C::PrimayBoneOffsetS' has a wrong offset!");

}

