#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dev318_AnimBP

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Dev318_AnimBP.Dev318_AnimBP_C
// 0x1070 (0x1330 - 0x02C0)
class UDev318_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_9FD1[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x02F8(0x0020)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_1;                          // 0x0318(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x0408(0x00F0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x04F8(0x0108)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0x0600(0x01E0)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x07E0(0x01E0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x09C0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0AC8(0x0108)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x0BD0(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0C80(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0CC8(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0D48(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0EA0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0EC8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0EF0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0F70(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0FA0(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1050(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x10D0(0x00C8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1198(0x0020)()
	struct FAnimNode_CustomPoseBlendNode          AnimGraphNode_CustomPoseBlendNode;                 // 0x11B8(0x00C0)()
	E_CHARA_ANIMATION_MODE                        ModeCurrent;                                       // 0x1278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	E_CHARA_ANIMATION_MODE                        ModePrevious;                                      // 0x1279(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_9FD2[0x2];                                     // 0x127A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ModeBlendTime;                                     // 0x127C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UAnimSequenceBase*                      DefaultAnimation;                                  // 0x1280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RootOffsetEnable;                                  // 0x1288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RootOffset;                                        // 0x128C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LegIKEnable;                                       // 0x1298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9FD3[0x3];                                     // 0x1299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LegIKAlpha;                                        // 0x129C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FVector                                LeftLegIKEffectorLocation;                         // 0x12A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RightLegIKEffectorLocation;                        // 0x12AC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LeftLegIKTargetLocation;                           // 0x12B8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RightLegIKTargetLocation;                          // 0x12C4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LeftLegIKEffectorRotation;                         // 0x12D0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               RightLegIKEffectorRotation;                        // 0x12DC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               RootDeltaRotation;                                 // 0x12E8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          LookAtEnable;                                      // 0x12F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9FD4[0x3];                                     // 0x12F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      MumbleAnimation;                                   // 0x12F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MumbleEnable;                                      // 0x1300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9FD5[0x3];                                     // 0x1301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MumbleAlpha;                                       // 0x1304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          BodyIKEnable;                                      // 0x1308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9FD6[0x3];                                     // 0x1309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BodyIKAlpha;                                       // 0x130C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UCustomPoseWeightTable*                 PoseWeightTable;                                   // 0x1310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPoseAsset*                             TwistPoseAsset;                                    // 0x1318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPoseAsset*>                     TwistPoseList;                                     // 0x1320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Dev318_AnimBP(int32 EntryPoint);
	void ChangeTwistAsset(int32 Param_Index);
	void SetPoseWeightTable(class UCustomPoseWeightTable* Param_PoseWeightTable);
	void SetBodyIKEnable(bool Enable, bool Immediately);
	void SetBoneMotionEnable(bool Enable);
	void SetHeadIKEnable(bool Enable, bool Immediately);
	void SetMumbleEnable(bool Enable);
	void SetMumbleAnimation(class UAnimSequenceBase* Animation);
	void SetLookAtEnable(bool Enable);
	void SetDefaultAnimation(class UAnimSequenceBase* Animation);
	void SetHeadIKRotation(int32 Param_Index, const struct FRotator& Rotation);
	void SetEyeIKEnable(bool Enable, bool Immediately);
	void SetLegIKEnable(bool Enable, bool Immediately);
	void SetRootOffsetEnable(bool Enable);
	void SetAnimationMode(E_CHARA_ANIMATION_MODE Mode, float BlendTime);
	void SetLegIKTarget(int32 Param_Index, const struct FVector& Location);
	void SetLegIKEffector(int32 Param_Index, const struct FVector& Location, const struct FRotator& DeltaRotation);
	void SetRootOffset(const struct FVector& Offset, const struct FRotator& DeltaRotation);
	void BlueprintPostEvaluateAnimation();
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void SetEyeIKRotation(int32 Param_Index, const struct FRotator& Rotation);
	void SetFloatingIKPerch(float Alpha);
	void SetPrimaryWorldOffsetBoneTrans(const struct FTransform& Trans, float BlendAlpha);
	void SetEnableBoneTrans(bool IsEnable);
	void SetWorldOffsetBoneTranses(const TArray<struct FTransform>& Transes, const TArray<float>& TransAlphas);
	void SetInvalidLegIK(bool Invalid, int32 Param_Index);
	void SetHeadIKRotationTick(int32 Param_Index, const struct FRotator& Rotation, float DeltaTime);
	void InvalidLookAt(bool Invalid);
	void SetHeadIKInterpSpeed(float NewSpeed);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

	class UAnimSequenceBase* GetDefaultAnimation() const;
	void GetAnimationMode(E_CHARA_ANIMATION_MODE* Param_ModeCurrent, E_CHARA_ANIMATION_MODE* Param_ModePrevious) const;
	class UAnimSequenceBase* GetMumbleAnimation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Dev318_AnimBP_C">();
	}
	static class UDev318_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDev318_AnimBP_C>();
	}
};
static_assert(alignof(UDev318_AnimBP_C) == 0x000010, "Wrong alignment on UDev318_AnimBP_C");
static_assert(sizeof(UDev318_AnimBP_C) == 0x001330, "Wrong size on UDev318_AnimBP_C");
static_assert(offsetof(UDev318_AnimBP_C, UberGraphFrame) == 0x0002C0, "Member 'UDev318_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UDev318_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0002F8, "Member 'UDev318_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, AnimGraphNode_CopyBone_1) == 0x000318, "Member 'UDev318_AnimBP_C::AnimGraphNode_CopyBone_1' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, AnimGraphNode_CopyBone) == 0x000408, "Member 'UDev318_AnimBP_C::AnimGraphNode_CopyBone' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x0004F8, "Member 'UDev318_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, AnimGraphNode_TwoBoneIK_1) == 0x000600, "Member 'UDev318_AnimBP_C::AnimGraphNode_TwoBoneIK_1' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, AnimGraphNode_TwoBoneIK) == 0x0007E0, "Member 'UDev318_AnimBP_C::AnimGraphNode_TwoBoneIK' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x0009C0, "Member 'UDev318_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000AC8, "Member 'UDev318_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, AnimGraphNode_BlendListByEnum) == 0x000BD0, "Member 'UDev318_AnimBP_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, AnimGraphNode_Slot) == 0x000C80, "Member 'UDev318_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x000CC8, "Member 'UDev318_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x000D48, "Member 'UDev318_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x000EA0, "Member 'UDev318_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x000EC8, "Member 'UDev318_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000EF0, "Member 'UDev318_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, AnimGraphNode_StateResult) == 0x000F70, "Member 'UDev318_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, AnimGraphNode_StateMachine) == 0x000FA0, "Member 'UDev318_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x001050, "Member 'UDev318_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, AnimGraphNode_ApplyAdditive) == 0x0010D0, "Member 'UDev318_AnimBP_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x001198, "Member 'UDev318_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, AnimGraphNode_CustomPoseBlendNode) == 0x0011B8, "Member 'UDev318_AnimBP_C::AnimGraphNode_CustomPoseBlendNode' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, ModeCurrent) == 0x001278, "Member 'UDev318_AnimBP_C::ModeCurrent' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, ModePrevious) == 0x001279, "Member 'UDev318_AnimBP_C::ModePrevious' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, ModeBlendTime) == 0x00127C, "Member 'UDev318_AnimBP_C::ModeBlendTime' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, DefaultAnimation) == 0x001280, "Member 'UDev318_AnimBP_C::DefaultAnimation' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, RootOffsetEnable) == 0x001288, "Member 'UDev318_AnimBP_C::RootOffsetEnable' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, RootOffset) == 0x00128C, "Member 'UDev318_AnimBP_C::RootOffset' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, LegIKEnable) == 0x001298, "Member 'UDev318_AnimBP_C::LegIKEnable' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, LegIKAlpha) == 0x00129C, "Member 'UDev318_AnimBP_C::LegIKAlpha' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, LeftLegIKEffectorLocation) == 0x0012A0, "Member 'UDev318_AnimBP_C::LeftLegIKEffectorLocation' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, RightLegIKEffectorLocation) == 0x0012AC, "Member 'UDev318_AnimBP_C::RightLegIKEffectorLocation' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, LeftLegIKTargetLocation) == 0x0012B8, "Member 'UDev318_AnimBP_C::LeftLegIKTargetLocation' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, RightLegIKTargetLocation) == 0x0012C4, "Member 'UDev318_AnimBP_C::RightLegIKTargetLocation' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, LeftLegIKEffectorRotation) == 0x0012D0, "Member 'UDev318_AnimBP_C::LeftLegIKEffectorRotation' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, RightLegIKEffectorRotation) == 0x0012DC, "Member 'UDev318_AnimBP_C::RightLegIKEffectorRotation' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, RootDeltaRotation) == 0x0012E8, "Member 'UDev318_AnimBP_C::RootDeltaRotation' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, LookAtEnable) == 0x0012F4, "Member 'UDev318_AnimBP_C::LookAtEnable' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, MumbleAnimation) == 0x0012F8, "Member 'UDev318_AnimBP_C::MumbleAnimation' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, MumbleEnable) == 0x001300, "Member 'UDev318_AnimBP_C::MumbleEnable' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, MumbleAlpha) == 0x001304, "Member 'UDev318_AnimBP_C::MumbleAlpha' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, BodyIKEnable) == 0x001308, "Member 'UDev318_AnimBP_C::BodyIKEnable' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, BodyIKAlpha) == 0x00130C, "Member 'UDev318_AnimBP_C::BodyIKAlpha' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, PoseWeightTable) == 0x001310, "Member 'UDev318_AnimBP_C::PoseWeightTable' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, TwistPoseAsset) == 0x001318, "Member 'UDev318_AnimBP_C::TwistPoseAsset' has a wrong offset!");
static_assert(offsetof(UDev318_AnimBP_C, TwistPoseList) == 0x001320, "Member 'UDev318_AnimBP_C::TwistPoseList' has a wrong offset!");

}

