#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DevilBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Project_structs.hpp"
#include "E_DEVIL_PERFORMANCE_TYPE_structs.hpp"
#include "CharaBase_classes.hpp"
#include "EncountData_st_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DevilBase.DevilBase_C
// 0x0188 (0x0A50 - 0x08C8)
class ADevilBase_C : public ACharaBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_DevilBase_C;                        // 0x08C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDestructibleComponent*                 Destructible;                                      // 0x08D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDevilMovementComponent*                DevilMovement;                                     // 0x08D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MagatsuhiDevilSEVolumeCtrl_Volume_2163FD89494E02F58095039523C5C4EC; // 0x08E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MagatsuhiDevilSEVolumeCtrl__Direction_2163FD89494E02F58095039523C5C4EC; // 0x08E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7051[0x3];                                     // 0x08E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MagatsuhiDevilSEVolumeCtrl;                        // 0x08E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _____value_ADD175AE4EB40BAB104B93BF5FABE7A5;       // 0x08F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ______Direction_ADD175AE4EB40BAB104B93BF5FABE7A5;  // 0x08F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7052[0x3];                                     // 0x08F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     U___;                                              // 0x08F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ______value_E69E77F04CFD3C2677B4429BA33D94D8;      // 0x0900(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______Direction_E69E77F04CFD3C2677B4429BA33D94D8; // 0x0904(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7053[0x3];                                     // 0x0905(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _T___;                                             // 0x0908(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____________WeightValue_2ADED19C45B04EBCC2A779B21BA8DF6F; // 0x0910(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____________Direction_2ADED19C45B04EBCC2A779B21BA8DF6F; // 0x0914(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7054[0x3];                                     // 0x0915(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ____________DevilBase_C_0;                         // 0x0918(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __________________Weight_Value_22D50494435FA1F31BA015A334EAB588; // 0x0920(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ___________________Direction_22D50494435FA1F31BA015A334EAB588; // 0x0924(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7055[0x3];                                     // 0x0925(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Zero________________;                              // 0x0928(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ________________WeightValue_DF6E0CF24CAAA5439F51FF803AFC2472; // 0x0930(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _________________Direction_DF6E0CF24CAAA5439F51FF803AFC2472; // 0x0934(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7056[0x3];                                     // 0x0935(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______________;                                   // 0x0938(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _____________DM_DitherRate_2E6BA62F4788B679599CE9ABB40FD9B4; // 0x0940(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _____________StateMaterialValue_2E6BA62F4788B679599CE9ABB40FD9B4; // 0x0944(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _____________DeadMaterialValue_2E6BA62F4788B679599CE9ABB40FD9B4; // 0x0948(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ______________Direction_2E6BA62F4788B679599CE9ABB40FD9B4; // 0x094C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7057[0x3];                                     // 0x094D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     __cf________;                                      // 0x0950(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___________StateMaterialValue_7D88AEF64AEBD14EBB2880A6A6EE0B55; // 0x0958(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___________DeadMaterialValue_7D88AEF64AEBD14EBB2880A6A6EE0B55; // 0x095C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____________Direction_7D88AEF64AEBD14EBB2880A6A6EE0B55; // 0x0960(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7058[0x7];                                     // 0x0961(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     I_________;                                        // 0x0968(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___________StateMaterialValue_55D7DDB240A30DAB07882A894BC3E676; // 0x0970(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___________DeadMaterialValue_55D7DDB240A30DAB07882A894BC3E676; // 0x0974(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____________Direction_55D7DDB240A30DAB07882A894BC3E676; // 0x0978(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7059[0x7];                                     // 0x0979(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     N_________;                                        // 0x0980(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEncountData_st                        EncountData;                                       // 0x0988(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsSymbol;                                          // 0x09B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsBattle;                                          // 0x09B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_705A[0x6];                                     // 0x09B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             CallBattle;                                        // 0x09B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         NkmSize;                                           // 0x09C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         M_DeadOption;                                      // 0x09CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEBase;                                           // 0x09CD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_705B[0x2];                                     // 0x09CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimSequence>           M_SpawnMotion;                                     // 0x09D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsForce;                                           // 0x09F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          IsMapAttackEncount;                                // 0x09F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	E_DEVIL_PERFORMANCE_TYPE                      M_ReturnPerformance;                               // 0x09FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_DEVIL_PERFORMANCE_TYPE                      M_SummonPerformance;                               // 0x09FB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_DEVIL_PERFORMANCE_TYPE                      M_SpawnPerformance;                                // 0x09FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          M_Spawn1xEffectScale;                              // 0x09FD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_705C[0x2];                                     // 0x09FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         M_WaitDeadSec;                                     // 0x0A00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_705D[0x4];                                     // 0x0A04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimComposite>          M_SpawnCompositeMotion;                            // 0x0A08(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UDevilPerformanceComponent_C*           DevilPerormance;                                   // 0x0A30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPaused;                                           // 0x0A38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bExcludeFromGazeTarget;                            // 0x0A39(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NPC_Collision;                                     // 0x0A3A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          NaviDevil;                                         // 0x0A3B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         NPCCollisionOffset;                                // 0x0A3C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ANPCOnlyCollision_C*                    NpcCollisionActor;                                 // 0x0A40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          M_SummonIsInBattle;                                // 0x0A48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void CallBattle__DelegateSignature();
	void ExecuteUbergraph_DevilBase(int32 EntryPoint);
	void Evt_IncreaseMagatsuhiDevilSE();
	void Evt_ReduceMagatsuhiDevilSE();
	void BI_AdjustMeshScale(bool IsReset);
	void BI_SetDevilRootMotion(bool Enable);
	void SetMeshRelativeScale(float NewScale, float NewBoundScale);
	void BPI_DestroyComponents_ForMapSymbol();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void StopSpeakingMotion();
	void PlaySpeakingMotion();
	void SetCharaPlayRate(float CharaPlayRate);
	void ResetAllMaterialParam();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void BPI_CallEncount_ForAttack();
	void Dead_Physics_TL_PlayStart();
	void Dead_Freeze_TL_SetTime(float Sec);
	void Dead_Freeze_TL_PlayStart();
	void Dead_Freeze_TL_Play();
	void Dead_General_TL_PlayStart();
	void PlayStartEffect();
	void DeathAction(uint8 InOption, bool DeadTimingOverride, float DeadTiming);
	void Revive_Nakama_TL_PlayStart();
	void Revive_Enemy_TL_PlayStart();
	void ReviveAction();
	void Spawn_TL_PlayStart();
	void SpawnAction(bool Param_PlayMotion, bool IsInstantEvent);
	void RapidReturnAction();
	void RapidSummonAction(int32 CurrentStatus, bool Immediately);
	void Return_TL_PlayStart();
	void Summon_TL_PlayStart();
	void ReturnAction(float PlayRate, bool IsInstantEvent);
	void SummonAction(int32 CurrentStatus, bool Immediately, bool IsInstantEvent, bool IsInBattle);
	void BI_PlayStartEffect();
	void MagatsuhiDevilSEVolumeCtrl__UpdateFunc();
	void MagatsuhiDevilSEVolumeCtrl__FinishedFunc();
	void __cf__________StopMotion__EventFunc();
	void __cf__________BreakDown__EventFunc();
	void __cf__________Dead__EventFunc();
	void __cf__________CharaEffectDeactivate__EventFunc();
	void __cf__________UpdateFunc();
	void __cf__________FinishedFunc();
	void I___________SpawnParticle__EventFunc();
	void I___________StopMotion__EventFunc();
	void I___________Dead__EventFunc();
	void I___________CharaEffectDeactivate__EventFunc();
	void I___________UpdateFunc();
	void I___________FinishedFunc();
	void _____________SpawnDecal__EventFunc();
	void _____________SpawnEffect__EventFunc();
	void _____________SpawnMotion__EventFunc();
	void _____________SpawnParticleVisibleOn__EventFunc();
	void _____________UpdateFunc_0();
	void _____________FinishedFunc_0();
	void N___________Spawn_Particle__EventFunc();
	void N___________StopMotion__EventFunc();
	void N___________Dead__EventFunc();
	void N___________CharaEffectDeactivate__EventFunc();
	void N___________UpdateFunc();
	void N___________FinishedFunc();
	void _T_____ParticleOn__EventFunc();
	void _T_____UpdateFunc();
	void _T_____FinishedFunc();
	void U_____ParticleOn__EventFunc();
	void U_____UpdateFunc();
	void U_____FinishedFunc();
	void Zero__________________ParticleOff__EventFunc();
	void Zero__________________UpdateFunc();
	void Zero__________________FinishedFunc();
	void _________________ApplyBadStatus__EventFunc();
	void _________________EndOfSummon__EventFunc();
	void _________________UpdateFunc();
	void _________________FinishedFunc();
	void GetFloor(struct FVector* Location);
	void AdjustMeshScale(bool IsReset);
	void ResetDeadMaterial();
	void InitializeDevilPerformanceComp();
	class UDevilPerformanceComponent_C* CreateDevilPerformanceComp();
	void GetDevilPerformanceComp(class UDevilPerformanceComponent_C** Comp);
	void SetPauseDevil(bool Pause);
	void BI_GetTimeLineComponent(E_BTL_DEAD_EFFECT DeadEffect, class UTimelineComponent** Comp);
	void SetNpcCollision();
	void BI_SetNPCCollision(bool* Ret);
	void IsOnWaterSurface(bool* Result);
	void SetSpawnPerformance(E_DEVIL_PERFORMANCE_TYPE Performance);
	void BI_FloatNoRotation(bool NoRotation, bool* NoUse);
	void CheckNaviDevil(bool* Param_NaviDevil);
	void PhysicsDeadPlayStart(bool* NoUse);
	void FreezeDeadSetTime(float Sec, bool* NoUse);
	void FreezeDeadPlayStart(bool* NoUse);
	void FreezeDeadPlay(bool* NoUse);
	void GeneralDeadPlayStart(bool* NoUse);
	void SummonPlayStart(bool* NoUse);
	void ReturnPlayStart(bool* NoUse);
	void ReviveEnemyPlayStart(bool* NoUse);
	void ReviveNakamaPlayStart(bool* NoUse);
	void SpawnPlayStart(bool* NoUse);
	void BI_GetNpcCollisionActor(class AActor** Param_NpcCollisionActor);
	void BPI_GetSymbolComponent(class UActorComponent** Component);
	void BPI_SymbolOnWater(bool* OnWater);

	bool CheckPlayAnimNotifyDevilVoice(EDevilVoiceType DevilVoiceType) const;
	EGazeTargetType GetGazeTargetType() const;
	struct FVector GetGazeTargetLocation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DevilBase_C">();
	}
	static class ADevilBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADevilBase_C>();
	}
};
static_assert(alignof(ADevilBase_C) == 0x000008, "Wrong alignment on ADevilBase_C");
static_assert(sizeof(ADevilBase_C) == 0x000A50, "Wrong size on ADevilBase_C");
static_assert(offsetof(ADevilBase_C, UberGraphFrame_DevilBase_C) == 0x0008C8, "Member 'ADevilBase_C::UberGraphFrame_DevilBase_C' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, Destructible) == 0x0008D0, "Member 'ADevilBase_C::Destructible' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, DevilMovement) == 0x0008D8, "Member 'ADevilBase_C::DevilMovement' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, MagatsuhiDevilSEVolumeCtrl_Volume_2163FD89494E02F58095039523C5C4EC) == 0x0008E0, "Member 'ADevilBase_C::MagatsuhiDevilSEVolumeCtrl_Volume_2163FD89494E02F58095039523C5C4EC' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, MagatsuhiDevilSEVolumeCtrl__Direction_2163FD89494E02F58095039523C5C4EC) == 0x0008E4, "Member 'ADevilBase_C::MagatsuhiDevilSEVolumeCtrl__Direction_2163FD89494E02F58095039523C5C4EC' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, MagatsuhiDevilSEVolumeCtrl) == 0x0008E8, "Member 'ADevilBase_C::MagatsuhiDevilSEVolumeCtrl' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, _____value_ADD175AE4EB40BAB104B93BF5FABE7A5) == 0x0008F0, "Member 'ADevilBase_C::_____value_ADD175AE4EB40BAB104B93BF5FABE7A5' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, ______Direction_ADD175AE4EB40BAB104B93BF5FABE7A5) == 0x0008F4, "Member 'ADevilBase_C::______Direction_ADD175AE4EB40BAB104B93BF5FABE7A5' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, U___) == 0x0008F8, "Member 'ADevilBase_C::U___' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, ______value_E69E77F04CFD3C2677B4429BA33D94D8) == 0x000900, "Member 'ADevilBase_C::______value_E69E77F04CFD3C2677B4429BA33D94D8' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, _______Direction_E69E77F04CFD3C2677B4429BA33D94D8) == 0x000904, "Member 'ADevilBase_C::_______Direction_E69E77F04CFD3C2677B4429BA33D94D8' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, _T___) == 0x000908, "Member 'ADevilBase_C::_T___' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, ____________WeightValue_2ADED19C45B04EBCC2A779B21BA8DF6F) == 0x000910, "Member 'ADevilBase_C::____________WeightValue_2ADED19C45B04EBCC2A779B21BA8DF6F' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, _____________Direction_2ADED19C45B04EBCC2A779B21BA8DF6F) == 0x000914, "Member 'ADevilBase_C::_____________Direction_2ADED19C45B04EBCC2A779B21BA8DF6F' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, ____________DevilBase_C_0) == 0x000918, "Member 'ADevilBase_C::____________DevilBase_C_0' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, __________________Weight_Value_22D50494435FA1F31BA015A334EAB588) == 0x000920, "Member 'ADevilBase_C::__________________Weight_Value_22D50494435FA1F31BA015A334EAB588' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, ___________________Direction_22D50494435FA1F31BA015A334EAB588) == 0x000924, "Member 'ADevilBase_C::___________________Direction_22D50494435FA1F31BA015A334EAB588' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, Zero________________) == 0x000928, "Member 'ADevilBase_C::Zero________________' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, ________________WeightValue_DF6E0CF24CAAA5439F51FF803AFC2472) == 0x000930, "Member 'ADevilBase_C::________________WeightValue_DF6E0CF24CAAA5439F51FF803AFC2472' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, _________________Direction_DF6E0CF24CAAA5439F51FF803AFC2472) == 0x000934, "Member 'ADevilBase_C::_________________Direction_DF6E0CF24CAAA5439F51FF803AFC2472' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, _______________) == 0x000938, "Member 'ADevilBase_C::_______________' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, _____________DM_DitherRate_2E6BA62F4788B679599CE9ABB40FD9B4) == 0x000940, "Member 'ADevilBase_C::_____________DM_DitherRate_2E6BA62F4788B679599CE9ABB40FD9B4' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, _____________StateMaterialValue_2E6BA62F4788B679599CE9ABB40FD9B4) == 0x000944, "Member 'ADevilBase_C::_____________StateMaterialValue_2E6BA62F4788B679599CE9ABB40FD9B4' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, _____________DeadMaterialValue_2E6BA62F4788B679599CE9ABB40FD9B4) == 0x000948, "Member 'ADevilBase_C::_____________DeadMaterialValue_2E6BA62F4788B679599CE9ABB40FD9B4' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, ______________Direction_2E6BA62F4788B679599CE9ABB40FD9B4) == 0x00094C, "Member 'ADevilBase_C::______________Direction_2E6BA62F4788B679599CE9ABB40FD9B4' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, __cf________) == 0x000950, "Member 'ADevilBase_C::__cf________' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, ___________StateMaterialValue_7D88AEF64AEBD14EBB2880A6A6EE0B55) == 0x000958, "Member 'ADevilBase_C::___________StateMaterialValue_7D88AEF64AEBD14EBB2880A6A6EE0B55' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, ___________DeadMaterialValue_7D88AEF64AEBD14EBB2880A6A6EE0B55) == 0x00095C, "Member 'ADevilBase_C::___________DeadMaterialValue_7D88AEF64AEBD14EBB2880A6A6EE0B55' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, ____________Direction_7D88AEF64AEBD14EBB2880A6A6EE0B55) == 0x000960, "Member 'ADevilBase_C::____________Direction_7D88AEF64AEBD14EBB2880A6A6EE0B55' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, I_________) == 0x000968, "Member 'ADevilBase_C::I_________' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, ___________StateMaterialValue_55D7DDB240A30DAB07882A894BC3E676) == 0x000970, "Member 'ADevilBase_C::___________StateMaterialValue_55D7DDB240A30DAB07882A894BC3E676' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, ___________DeadMaterialValue_55D7DDB240A30DAB07882A894BC3E676) == 0x000974, "Member 'ADevilBase_C::___________DeadMaterialValue_55D7DDB240A30DAB07882A894BC3E676' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, ____________Direction_55D7DDB240A30DAB07882A894BC3E676) == 0x000978, "Member 'ADevilBase_C::____________Direction_55D7DDB240A30DAB07882A894BC3E676' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, N_________) == 0x000980, "Member 'ADevilBase_C::N_________' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, EncountData) == 0x000988, "Member 'ADevilBase_C::EncountData' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, IsSymbol) == 0x0009B0, "Member 'ADevilBase_C::IsSymbol' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, IsBattle) == 0x0009B1, "Member 'ADevilBase_C::IsBattle' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, CallBattle) == 0x0009B8, "Member 'ADevilBase_C::CallBattle' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, NkmSize) == 0x0009C8, "Member 'ADevilBase_C::NkmSize' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, M_DeadOption) == 0x0009CC, "Member 'ADevilBase_C::M_DeadOption' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, IsEBase) == 0x0009CD, "Member 'ADevilBase_C::IsEBase' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, M_SpawnMotion) == 0x0009D0, "Member 'ADevilBase_C::M_SpawnMotion' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, IsForce) == 0x0009F8, "Member 'ADevilBase_C::IsForce' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, IsMapAttackEncount) == 0x0009F9, "Member 'ADevilBase_C::IsMapAttackEncount' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, M_ReturnPerformance) == 0x0009FA, "Member 'ADevilBase_C::M_ReturnPerformance' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, M_SummonPerformance) == 0x0009FB, "Member 'ADevilBase_C::M_SummonPerformance' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, M_SpawnPerformance) == 0x0009FC, "Member 'ADevilBase_C::M_SpawnPerformance' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, M_Spawn1xEffectScale) == 0x0009FD, "Member 'ADevilBase_C::M_Spawn1xEffectScale' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, M_WaitDeadSec) == 0x000A00, "Member 'ADevilBase_C::M_WaitDeadSec' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, M_SpawnCompositeMotion) == 0x000A08, "Member 'ADevilBase_C::M_SpawnCompositeMotion' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, DevilPerormance) == 0x000A30, "Member 'ADevilBase_C::DevilPerormance' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, bPaused) == 0x000A38, "Member 'ADevilBase_C::bPaused' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, bExcludeFromGazeTarget) == 0x000A39, "Member 'ADevilBase_C::bExcludeFromGazeTarget' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, NPC_Collision) == 0x000A3A, "Member 'ADevilBase_C::NPC_Collision' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, NaviDevil) == 0x000A3B, "Member 'ADevilBase_C::NaviDevil' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, NPCCollisionOffset) == 0x000A3C, "Member 'ADevilBase_C::NPCCollisionOffset' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, NpcCollisionActor) == 0x000A40, "Member 'ADevilBase_C::NpcCollisionActor' has a wrong offset!");
static_assert(offsetof(ADevilBase_C, M_SummonIsInBattle) == 0x000A48, "Member 'ADevilBase_C::M_SummonIsInBattle' has a wrong offset!");

}

