#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DevilAssetTableInstance

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function DevilAssetTableInstance.DevilAssetTableInstance_C.ExecuteUbergraph_DevilAssetTableInstance
// 0x0004 (0x0004 - 0x0000)
struct DevilAssetTableInstance_C_ExecuteUbergraph_DevilAssetTableInstance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DevilAssetTableInstance_C_ExecuteUbergraph_DevilAssetTableInstance) == 0x000004, "Wrong alignment on DevilAssetTableInstance_C_ExecuteUbergraph_DevilAssetTableInstance");
static_assert(sizeof(DevilAssetTableInstance_C_ExecuteUbergraph_DevilAssetTableInstance) == 0x000004, "Wrong size on DevilAssetTableInstance_C_ExecuteUbergraph_DevilAssetTableInstance");
static_assert(offsetof(DevilAssetTableInstance_C_ExecuteUbergraph_DevilAssetTableInstance, EntryPoint) == 0x000000, "Member 'DevilAssetTableInstance_C_ExecuteUbergraph_DevilAssetTableInstance::EntryPoint' has a wrong offset!");

// Function DevilAssetTableInstance.DevilAssetTableInstance_C.Load_DevilAsset
// 0x0001 (0x0001 - 0x0000)
struct DevilAssetTableInstance_C_Load_DevilAsset final
{
public:
	bool                                          CallFunc_LoadDevilAssetTableRawData_ReturnValue;   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DevilAssetTableInstance_C_Load_DevilAsset) == 0x000001, "Wrong alignment on DevilAssetTableInstance_C_Load_DevilAsset");
static_assert(sizeof(DevilAssetTableInstance_C_Load_DevilAsset) == 0x000001, "Wrong size on DevilAssetTableInstance_C_Load_DevilAsset");
static_assert(offsetof(DevilAssetTableInstance_C_Load_DevilAsset, CallFunc_LoadDevilAssetTableRawData_ReturnValue) == 0x000000, "Member 'DevilAssetTableInstance_C_Load_DevilAsset::CallFunc_LoadDevilAssetTableRawData_ReturnValue' has a wrong offset!");

// Function DevilAssetTableInstance.DevilAssetTableInstance_C.Get_DevilAssetRaw
// 0x0360 (0x0360 - 0x0000)
struct DevilAssetTableInstance_C_Get_DevilAssetRaw final
{
public:
	int32                                         DevilAssetID;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3055[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDevilAssetTable_Raw                   AssetData;                                         // 0x0008(0x00B0)(Parm, OutParm)
	bool                                          IsValid;                                           // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsFound;                                           // 0x00B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3056[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDevilAssetTable_Raw                   Lo_found;                                          // 0x00C0(0x00B0)(Edit, BlueprintVisible)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_LeftPad_ReturnValue;                      // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x01A0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FDevilPosData_Raw                      K2Node_MakeStruct_DevilPosData_Raw;                // 0x01C0(0x0028)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FDevilAssetTable_Raw                   K2Node_MakeStruct_DevilAssetTable_Raw;             // 0x01F8(0x00B0)()
	struct FDevilAssetTable_Raw                   CallFunc_Map_Find_Value;                           // 0x02A8(0x00B0)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftClassRef_ReturnValue;          // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DevilAssetTableInstance_C_Get_DevilAssetRaw) == 0x000008, "Wrong alignment on DevilAssetTableInstance_C_Get_DevilAssetRaw");
static_assert(sizeof(DevilAssetTableInstance_C_Get_DevilAssetRaw) == 0x000360, "Wrong size on DevilAssetTableInstance_C_Get_DevilAssetRaw");
static_assert(offsetof(DevilAssetTableInstance_C_Get_DevilAssetRaw, DevilAssetID) == 0x000000, "Member 'DevilAssetTableInstance_C_Get_DevilAssetRaw::DevilAssetID' has a wrong offset!");
static_assert(offsetof(DevilAssetTableInstance_C_Get_DevilAssetRaw, AssetData) == 0x000008, "Member 'DevilAssetTableInstance_C_Get_DevilAssetRaw::AssetData' has a wrong offset!");
static_assert(offsetof(DevilAssetTableInstance_C_Get_DevilAssetRaw, IsValid) == 0x0000B8, "Member 'DevilAssetTableInstance_C_Get_DevilAssetRaw::IsValid' has a wrong offset!");
static_assert(offsetof(DevilAssetTableInstance_C_Get_DevilAssetRaw, IsFound) == 0x0000B9, "Member 'DevilAssetTableInstance_C_Get_DevilAssetRaw::IsFound' has a wrong offset!");
static_assert(offsetof(DevilAssetTableInstance_C_Get_DevilAssetRaw, Lo_found) == 0x0000C0, "Member 'DevilAssetTableInstance_C_Get_DevilAssetRaw::Lo_found' has a wrong offset!");
static_assert(offsetof(DevilAssetTableInstance_C_Get_DevilAssetRaw, CallFunc_Conv_IntToString_ReturnValue) == 0x000170, "Member 'DevilAssetTableInstance_C_Get_DevilAssetRaw::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilAssetTableInstance_C_Get_DevilAssetRaw, CallFunc_LeftPad_ReturnValue) == 0x000180, "Member 'DevilAssetTableInstance_C_Get_DevilAssetRaw::CallFunc_LeftPad_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilAssetTableInstance_C_Get_DevilAssetRaw, CallFunc_Replace_ReturnValue) == 0x000190, "Member 'DevilAssetTableInstance_C_Get_DevilAssetRaw::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilAssetTableInstance_C_Get_DevilAssetRaw, K2Node_MakeArray_Array) == 0x0001A0, "Member 'DevilAssetTableInstance_C_Get_DevilAssetRaw::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(DevilAssetTableInstance_C_Get_DevilAssetRaw, CallFunc_Concat_StrStr_ReturnValue) == 0x0001B0, "Member 'DevilAssetTableInstance_C_Get_DevilAssetRaw::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilAssetTableInstance_C_Get_DevilAssetRaw, K2Node_MakeStruct_DevilPosData_Raw) == 0x0001C0, "Member 'DevilAssetTableInstance_C_Get_DevilAssetRaw::K2Node_MakeStruct_DevilPosData_Raw' has a wrong offset!");
static_assert(offsetof(DevilAssetTableInstance_C_Get_DevilAssetRaw, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0001E8, "Member 'DevilAssetTableInstance_C_Get_DevilAssetRaw::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DevilAssetTableInstance_C_Get_DevilAssetRaw, K2Node_MakeStruct_DevilAssetTable_Raw) == 0x0001F8, "Member 'DevilAssetTableInstance_C_Get_DevilAssetRaw::K2Node_MakeStruct_DevilAssetTable_Raw' has a wrong offset!");
static_assert(offsetof(DevilAssetTableInstance_C_Get_DevilAssetRaw, CallFunc_Map_Find_Value) == 0x0002A8, "Member 'DevilAssetTableInstance_C_Get_DevilAssetRaw::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(DevilAssetTableInstance_C_Get_DevilAssetRaw, CallFunc_Map_Find_ReturnValue) == 0x000358, "Member 'DevilAssetTableInstance_C_Get_DevilAssetRaw::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilAssetTableInstance_C_Get_DevilAssetRaw, CallFunc_IsValidSoftClassRef_ReturnValue) == 0x000359, "Member 'DevilAssetTableInstance_C_Get_DevilAssetRaw::CallFunc_IsValidSoftClassRef_ReturnValue' has a wrong offset!");

// Function DevilAssetTableInstance.DevilAssetTableInstance_C.BI_GetDevilAsset
// 0x0178 (0x0178 - 0x0000)
struct DevilAssetTableInstance_C_BI_GetDevilAsset final
{
public:
	int32                                         DevilAssetID;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3057[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDevilAssetTable_Raw                   AssetData;                                         // 0x0008(0x00B0)(Parm, OutParm)
	bool                                          IsValid;                                           // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3058[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDevilAssetTable_Raw                   CallFunc_Get_DevilAssetRaw_AssetData;              // 0x00C0(0x00B0)()
	bool                                          CallFunc_Get_DevilAssetRaw_IsValid;                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DevilAssetTableInstance_C_BI_GetDevilAsset) == 0x000008, "Wrong alignment on DevilAssetTableInstance_C_BI_GetDevilAsset");
static_assert(sizeof(DevilAssetTableInstance_C_BI_GetDevilAsset) == 0x000178, "Wrong size on DevilAssetTableInstance_C_BI_GetDevilAsset");
static_assert(offsetof(DevilAssetTableInstance_C_BI_GetDevilAsset, DevilAssetID) == 0x000000, "Member 'DevilAssetTableInstance_C_BI_GetDevilAsset::DevilAssetID' has a wrong offset!");
static_assert(offsetof(DevilAssetTableInstance_C_BI_GetDevilAsset, AssetData) == 0x000008, "Member 'DevilAssetTableInstance_C_BI_GetDevilAsset::AssetData' has a wrong offset!");
static_assert(offsetof(DevilAssetTableInstance_C_BI_GetDevilAsset, IsValid) == 0x0000B8, "Member 'DevilAssetTableInstance_C_BI_GetDevilAsset::IsValid' has a wrong offset!");
static_assert(offsetof(DevilAssetTableInstance_C_BI_GetDevilAsset, CallFunc_Get_DevilAssetRaw_AssetData) == 0x0000C0, "Member 'DevilAssetTableInstance_C_BI_GetDevilAsset::CallFunc_Get_DevilAssetRaw_AssetData' has a wrong offset!");
static_assert(offsetof(DevilAssetTableInstance_C_BI_GetDevilAsset, CallFunc_Get_DevilAssetRaw_IsValid) == 0x000170, "Member 'DevilAssetTableInstance_C_BI_GetDevilAsset::CallFunc_Get_DevilAssetRaw_IsValid' has a wrong offset!");

// Function DevilAssetTableInstance.DevilAssetTableInstance_C.BI_GetDevilAssetMapValue
// 0x0020 (0x0020 - 0x0000)
struct DevilAssetTableInstance_C_BI_GetDevilAssetMapValue final
{
public:
	TArray<struct FDevilAssetTable_Raw>           Value;                                             // 0x0000(0x0010)(Parm, OutParm)
	TArray<struct FDevilAssetTable_Raw>           CallFunc_Map_Values_Values;                        // 0x0010(0x0010)(ReferenceParm)
};
static_assert(alignof(DevilAssetTableInstance_C_BI_GetDevilAssetMapValue) == 0x000008, "Wrong alignment on DevilAssetTableInstance_C_BI_GetDevilAssetMapValue");
static_assert(sizeof(DevilAssetTableInstance_C_BI_GetDevilAssetMapValue) == 0x000020, "Wrong size on DevilAssetTableInstance_C_BI_GetDevilAssetMapValue");
static_assert(offsetof(DevilAssetTableInstance_C_BI_GetDevilAssetMapValue, Value) == 0x000000, "Member 'DevilAssetTableInstance_C_BI_GetDevilAssetMapValue::Value' has a wrong offset!");
static_assert(offsetof(DevilAssetTableInstance_C_BI_GetDevilAssetMapValue, CallFunc_Map_Values_Values) == 0x000010, "Member 'DevilAssetTableInstance_C_BI_GetDevilAssetMapValue::CallFunc_Map_Values_Values' has a wrong offset!");

}

