#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DevilSpawnDecal

#include "Basic.hpp"

#include "MaterialAnimSetting_T_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function DevilSpawnDecal.DevilSpawnDecal_C.ExecuteUbergraph_DevilSpawnDecal
// 0x00C8 (0x00C8 - 0x0000)
struct DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_PlayRate;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9C[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetDecalMaterial_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMaterialAnimSetting_T                 CallFunc_Array_Get_Item;                           // 0x0038(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue;          // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMaterialAnimSetting_T                 CallFunc_Array_Get_Item_1;                         // 0x0070(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxTimeRange_MaxRange;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9D[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVectorValue_ReturnValue;               // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9E[0x2];                                     // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal) == 0x000008, "Wrong alignment on DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal");
static_assert(sizeof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal) == 0x0000C8, "Wrong size on DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, EntryPoint) == 0x000000, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::EntryPoint' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, K2Node_CustomEvent_PlayRate) == 0x000020, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::K2Node_CustomEvent_PlayRate' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, CallFunc_GetDecalMaterial_ReturnValue) == 0x000028, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::CallFunc_GetDecalMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000030, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, CallFunc_Array_Get_Item) == 0x000038, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, CallFunc_IsValid_ReturnValue) == 0x00005D, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, CallFunc_IsValid_ReturnValue_1) == 0x00005E, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, CallFunc_IsValid_ReturnValue_2) == 0x00005F, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, CallFunc_GetLinearColorValue_ReturnValue) == 0x000060, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::CallFunc_GetLinearColorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, CallFunc_GetMaxTimeRange_MaxRange) == 0x000090, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::CallFunc_GetMaxTimeRange_MaxRange' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, CallFunc_Array_Length_ReturnValue_1) == 0x000094, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, CallFunc_Less_IntInt_ReturnValue_1) == 0x000098, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, CallFunc_GetVectorValue_ReturnValue) == 0x00009C, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::CallFunc_GetVectorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x0000A8, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, CallFunc_GetFloatValue_ReturnValue) == 0x0000B8, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000BC, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000BD, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000C0, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000C4, "Member 'DevilSpawnDecal_C_ExecuteUbergraph_DevilSpawnDecal::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function DevilSpawnDecal.DevilSpawnDecal_C.StartDecalAnim
// 0x0004 (0x0004 - 0x0000)
struct DevilSpawnDecal_C_StartDecalAnim final
{
public:
	float                                         PlayRate;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DevilSpawnDecal_C_StartDecalAnim) == 0x000004, "Wrong alignment on DevilSpawnDecal_C_StartDecalAnim");
static_assert(sizeof(DevilSpawnDecal_C_StartDecalAnim) == 0x000004, "Wrong size on DevilSpawnDecal_C_StartDecalAnim");
static_assert(offsetof(DevilSpawnDecal_C_StartDecalAnim, PlayRate) == 0x000000, "Member 'DevilSpawnDecal_C_StartDecalAnim::PlayRate' has a wrong offset!");

// Function DevilSpawnDecal.DevilSpawnDecal_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct DevilSpawnDecal_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DevilSpawnDecal_C_ReceiveTick) == 0x000004, "Wrong alignment on DevilSpawnDecal_C_ReceiveTick");
static_assert(sizeof(DevilSpawnDecal_C_ReceiveTick) == 0x000004, "Wrong size on DevilSpawnDecal_C_ReceiveTick");
static_assert(offsetof(DevilSpawnDecal_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'DevilSpawnDecal_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function DevilSpawnDecal.DevilSpawnDecal_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct DevilSpawnDecal_C_UserConstructionScript final
{
public:
	float                                         CallFunc_BreakVector_X;                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DevilSpawnDecal_C_UserConstructionScript) == 0x000004, "Wrong alignment on DevilSpawnDecal_C_UserConstructionScript");
static_assert(sizeof(DevilSpawnDecal_C_UserConstructionScript) == 0x000030, "Wrong size on DevilSpawnDecal_C_UserConstructionScript");
static_assert(offsetof(DevilSpawnDecal_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000000, "Member 'DevilSpawnDecal_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000004, "Member 'DevilSpawnDecal_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000008, "Member 'DevilSpawnDecal_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_UserConstructionScript, CallFunc_BreakVector_X_1) == 0x00000C, "Member 'DevilSpawnDecal_C_UserConstructionScript::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_UserConstructionScript, CallFunc_BreakVector_Y_1) == 0x000010, "Member 'DevilSpawnDecal_C_UserConstructionScript::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_UserConstructionScript, CallFunc_BreakVector_Z_1) == 0x000014, "Member 'DevilSpawnDecal_C_UserConstructionScript::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'DevilSpawnDecal_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'DevilSpawnDecal_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000020, "Member 'DevilSpawnDecal_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000024, "Member 'DevilSpawnDecal_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function DevilSpawnDecal.DevilSpawnDecal_C.GetMaxTimeRange
// 0x0050 (0x0050 - 0x0000)
struct DevilSpawnDecal_C_GetMaxTimeRange final
{
public:
	struct FMaterialAnimSetting_T                 Param;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxRange;                                          // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lo_Max;                                            // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9F[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeRange_MinTime;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeRange_MaxTime;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DA0[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeRange_MinTime_1;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeRange_MaxTime_1;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DA1[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeRange_MinTime_2;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeRange_MaxTime_2;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DevilSpawnDecal_C_GetMaxTimeRange) == 0x000008, "Wrong alignment on DevilSpawnDecal_C_GetMaxTimeRange");
static_assert(sizeof(DevilSpawnDecal_C_GetMaxTimeRange) == 0x000050, "Wrong size on DevilSpawnDecal_C_GetMaxTimeRange");
static_assert(offsetof(DevilSpawnDecal_C_GetMaxTimeRange, Param) == 0x000000, "Member 'DevilSpawnDecal_C_GetMaxTimeRange::Param' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_GetMaxTimeRange, MaxRange) == 0x000020, "Member 'DevilSpawnDecal_C_GetMaxTimeRange::MaxRange' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_GetMaxTimeRange, Lo_Max) == 0x000024, "Member 'DevilSpawnDecal_C_GetMaxTimeRange::Lo_Max' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_GetMaxTimeRange, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'DevilSpawnDecal_C_GetMaxTimeRange::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_GetMaxTimeRange, CallFunc_GetTimeRange_MinTime) == 0x00002C, "Member 'DevilSpawnDecal_C_GetMaxTimeRange::CallFunc_GetTimeRange_MinTime' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_GetMaxTimeRange, CallFunc_GetTimeRange_MaxTime) == 0x000030, "Member 'DevilSpawnDecal_C_GetMaxTimeRange::CallFunc_GetTimeRange_MaxTime' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_GetMaxTimeRange, CallFunc_IsValid_ReturnValue_1) == 0x000034, "Member 'DevilSpawnDecal_C_GetMaxTimeRange::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_GetMaxTimeRange, CallFunc_GetTimeRange_MinTime_1) == 0x000038, "Member 'DevilSpawnDecal_C_GetMaxTimeRange::CallFunc_GetTimeRange_MinTime_1' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_GetMaxTimeRange, CallFunc_GetTimeRange_MaxTime_1) == 0x00003C, "Member 'DevilSpawnDecal_C_GetMaxTimeRange::CallFunc_GetTimeRange_MaxTime_1' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_GetMaxTimeRange, CallFunc_IsValid_ReturnValue_2) == 0x000040, "Member 'DevilSpawnDecal_C_GetMaxTimeRange::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_GetMaxTimeRange, CallFunc_GetTimeRange_MinTime_2) == 0x000044, "Member 'DevilSpawnDecal_C_GetMaxTimeRange::CallFunc_GetTimeRange_MinTime_2' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_GetMaxTimeRange, CallFunc_GetTimeRange_MaxTime_2) == 0x000048, "Member 'DevilSpawnDecal_C_GetMaxTimeRange::CallFunc_GetTimeRange_MaxTime_2' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_GetMaxTimeRange, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00004C, "Member 'DevilSpawnDecal_C_GetMaxTimeRange::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_GetMaxTimeRange, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00004D, "Member 'DevilSpawnDecal_C_GetMaxTimeRange::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DevilSpawnDecal_C_GetMaxTimeRange, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x00004E, "Member 'DevilSpawnDecal_C_GetMaxTimeRange::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");

}

