#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DevilBaseLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Project_structs.hpp"
#include "E_DEVIL_PERFORMANCE_TYPE_structs.hpp"
#include "CharaBase_classes.hpp"
#include "EncountData_st_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DevilBaseLight.DevilBaseLight_C
// 0x01B8 (0x0A80 - 0x08C8)
class ADevilBaseLight_C : public ACharaBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_DevilBaseLight_C;                   // 0x08C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDestructibleComponent*                 Destructible;                                      // 0x08D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDevilMovementComponent*                DevilMovement;                                     // 0x08D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MagatsuhiDevilSEVolumeCtrl_Volume_19BDA4764BF007A3BE568583E26E1CDB; // 0x08E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MagatsuhiDevilSEVolumeCtrl__Direction_19BDA4764BF007A3BE568583E26E1CDB; // 0x08E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD98[0x3];                                     // 0x08E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MagatsuhiDevilSEVolumeCtrl;                        // 0x08E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _____value_231A044E42D2CAF94383E1A119FA641A;       // 0x08F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ______Direction_231A044E42D2CAF94383E1A119FA641A;  // 0x08F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD99[0x3];                                     // 0x08F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     U___;                                              // 0x08F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ______value_012365CA4D23D56F20D360954ED23E3A;      // 0x0900(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______Direction_012365CA4D23D56F20D360954ED23E3A; // 0x0904(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD9A[0x3];                                     // 0x0905(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _T___;                                             // 0x0908(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____________WeightValue_D355527B4A2FF31DF016F3B6291FBC20; // 0x0910(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____________Direction_D355527B4A2FF31DF016F3B6291FBC20; // 0x0914(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD9B[0x3];                                     // 0x0915(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ____________DevilBaseLight_C_0;                    // 0x0918(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __________________Weight_Value_C5F43CB444552052AFF0D6A14D12F6C1; // 0x0920(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ___________________Direction_C5F43CB444552052AFF0D6A14D12F6C1; // 0x0924(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD9C[0x3];                                     // 0x0925(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Zero________________;                              // 0x0928(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ________________WeightValue_5D65FB7746A6F30EDAF7A68A5093FDAF; // 0x0930(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _________________Direction_5D65FB7746A6F30EDAF7A68A5093FDAF; // 0x0934(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD9D[0x3];                                     // 0x0935(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______________;                                   // 0x0938(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _____________DM_DitherRate_6E9DED734018A46959D0DCA022A65429; // 0x0940(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _____________StateMaterialValue_6E9DED734018A46959D0DCA022A65429; // 0x0944(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _____________DeadMaterialValue_6E9DED734018A46959D0DCA022A65429; // 0x0948(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ______________Direction_6E9DED734018A46959D0DCA022A65429; // 0x094C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD9E[0x3];                                     // 0x094D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     __cf________;                                      // 0x0950(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___________StateMaterialValue_6080DCC6442515AD19F3B3B7B3DC7E41; // 0x0958(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___________DeadMaterialValue_6080DCC6442515AD19F3B3B7B3DC7E41; // 0x095C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____________Direction_6080DCC6442515AD19F3B3B7B3DC7E41; // 0x0960(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD9F[0x7];                                     // 0x0961(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     I_________;                                        // 0x0968(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___________StateMaterialValue_CF4B8A4D4AFFE215587DF792E18077C1; // 0x0970(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___________DeadMaterialValue_CF4B8A4D4AFFE215587DF792E18077C1; // 0x0974(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____________Direction_CF4B8A4D4AFFE215587DF792E18077C1; // 0x0978(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BDA0[0x7];                                     // 0x0979(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     N_________;                                        // 0x0980(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEncountData_st                        EncountData;                                       // 0x0988(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsSymbol;                                          // 0x09B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsBattle;                                          // 0x09B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDA1[0x6];                                     // 0x09B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             CallBattle;                                        // 0x09B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         NkmSize;                                           // 0x09C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         M_DeadOption;                                      // 0x09CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEBase;                                           // 0x09CD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDA2[0x2];                                     // 0x09CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimSequence>           M_SpawnMotion;                                     // 0x09D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsForce;                                           // 0x09F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          IsMapAttackEncount;                                // 0x09F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	E_DEVIL_PERFORMANCE_TYPE                      M_ReturnPerformance;                               // 0x09FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_DEVIL_PERFORMANCE_TYPE                      M_SummonPerformance;                               // 0x09FB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_DEVIL_PERFORMANCE_TYPE                      M_SpawnPerformance;                                // 0x09FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          M_Spawn1xEffectScale;                              // 0x09FD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDA3[0x2];                                     // 0x09FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         M_WaitDeadSec;                                     // 0x0A00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BDA4[0x4];                                     // 0x0A04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimComposite>          M_SpawnCompositeMotion;                            // 0x0A08(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UDevilPerformanceComponent_C*           DevilPerormance;                                   // 0x0A30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPaused;                                           // 0x0A38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bExcludeFromGazeTarget;                            // 0x0A39(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NPC_Collision;                                     // 0x0A3A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          NaviDevil;                                         // 0x0A3B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         NPCCollisionOffset;                                // 0x0A3C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ANPCOnlyCollision_C*                    NpcCollisionActor;                                 // 0x0A40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          M_SummonIsInBattle;                                // 0x0A48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDA5[0x7];                                     // 0x0A49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCharaMotionTable>       MotionTableRef;                                    // 0x0A50(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsMotionTableLoaded;                               // 0x0A78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bNoDistCheck_CamCollision;                         // 0x0A79(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void CallBattle__DelegateSignature();
	void ExecuteUbergraph_DevilBaseLight(int32 EntryPoint);
	void DeleteMotionTable();
	void LoadMotionTable();
	void Evt_IncreaseMagatsuhiDevilSE();
	void Evt_ReduceMagatsuhiDevilSE();
	void BI_AdjustMeshScale(bool IsReset);
	void BI_SetDevilRootMotion(bool Enable);
	void SetMeshRelativeScale(float NewScale, float NewBoundScale);
	void BPI_DestroyComponents_ForMapSymbol();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void StopSpeakingMotion();
	void PlaySpeakingMotion();
	void SetCharaPlayRate(float CharaPlayRate);
	void ResetAllMaterialParam();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void Dead_Physics_TL_PlayStart();
	void Dead_Freeze_TL_SetTime(float Sec);
	void Dead_Freeze_TL_PlayStart();
	void Dead_Freeze_TL_Play();
	void Dead_General_TL_PlayStart();
	void BPI_CallEncount_ForAttack();
