#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DevilBaseLight

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_DEVIL_PERFORMANCE_TYPE_structs.hpp"
#include "Project_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DevilBaseLight.DevilBaseLight_C.ExecuteUbergraph_DevilBaseLight
// 0x0420 (0x0420 - 0x0000)
struct DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_BDA6[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharaMotionTable*                      K2Node_DynamicCast_AsChara_Motion_Table;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDA7[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Spawn_SpawnEffectVisibleOn_self_CastInput; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Spawn_SpawnEffectVisibleOn_NoUse; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDA8[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Spawn_SpawnMotion_self_CastInput; // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Spawn_SpawnMotion_NoUse;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDA9[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Spawn_SpawnEffect_self_CastInput; // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Spawn_SpawnEffect_NoUse;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDAA[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Spawn_SpawnDecal_self_CastInput; // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Spawn_SpawnDecal_NoUse;       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDAB[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Spawn_Finished_self_CastInput; // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Spawn_Finished_NoUse;         // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDAC[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Spawn_Update_self_CastInput;  // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Spawn_Update_NoUse;           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDAD[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_CurrentStatus_1;                      // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Immediately_1;                        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsInstantEvent_2;                     // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsInBattle;                           // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDAE[0x1];                                     // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_PlayRate;                             // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsInstantEvent_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_PlayMotion;                           // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsInstantEvent;                       // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDAF[0x5];                                     // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_BeginSpawn_self_CastInput;             // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_BeginSpawn_NoUse;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDB0[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Summon_EndOfSummon_self_CastInput; // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Summon_EndOfSummon_NoUse;     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDB1[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_BeginRapidReturnAction_self_CastInput; // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_BeginRapidReturnAction_NoUse;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDB2[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Return_ParticleOff_self_CastInput; // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Return_ParticleOff_NoUse;     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDB3[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Return_Finished_self_CastInput; // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Return_Finished_NoUse;        // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDB4[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Return_Update_self_CastInput; // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Return_Update_NoUse;          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDB5[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_BeginReturnAction_self_CastInput;      // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_BeginReturnAction_NoUse;               // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDB6[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Summon_ApplyBadStatus_self_CastInput; // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Summon_ApplyBadStatus_NoUse;  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDB7[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Summon_Finished_self_CastInput; // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Summon_Finished_NoUse;        // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDB8[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Summon_Update_self_CastInput; // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Summon_Update_NoUse;          // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDB9[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_BeginSummonAction_self_CastInput;      // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_BeginSummonAction_NoUse;               // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDBA[0x3];                                     // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCharaPlayRate_PlayRate;                // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCharaPlayRate_PlayRate_1;              // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_CurrentStatus;                        // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Immediately;                          // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDBB[0x3];                                     // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_BeginRapidSummonAction_self_CastInput; // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_BeginRapidSummonAction_NoUse;          // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDBC[0x3];                                     // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCharaPlayRate_PlayRate_2;              // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCharaPlayRate_PlayRate_3;              // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_BeginSpawn_self_CastInput_1;           // 0x0210(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_BeginSpawn_NoUse_1;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDBD[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_BeginReviveAction_self_CastInput;      // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_BeginReviveAction_NoUse;               // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDBE[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Revive_ParticleOn_Enemy_self_CastInput; // 0x0240(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Revive_ParticleOn_Enemy_NoUse; // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDBF[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Revive_Finished_Enemy_self_CastInput; // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Revive_Finished_Enemy_NoUse;  // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDC0[0x7];                                     // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Revive_Update_Enemy_self_CastInput; // 0x0270(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Revive_Update_Enemy_NewParam1; // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDC1[0x7];                                     // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Revive_ParticleOn_Nakama_self_CastInput; // 0x0288(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Revive_ParticleOn_Nakama_NoUse; // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDC2[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Revive_Finished_Nakama_self_CastInput; // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Revive_Finished_Nakama_NoUse; // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDC3[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Revive_Update_Nakama_self_CastInput; // 0x02B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Revive_Update_Nakama_NoUse;   // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         K2Node_Event_InOption;                             // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_DeadTimingOverride;                   // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDC4[0x1];                                     // 0x02CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeadTiming;                           // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Sec;                            // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BDC5[0x4];                                     // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_BeginDeathAction_self_CastInput;       // 0x02D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_BeginDeathAction_NoUse;                // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDC6[0x7];                                     // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Dead_CharaEffectDeactivate_self_CastInput; // 0x02F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Dead_CharaEffectDeactivate_NoUse; // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDC7[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Dead_Update_Freeze_DMDither_self_CastInput; // 0x0308(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Dead_Update_Freeze_DMDither_NewParam1; // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDC8[0x7];                                     // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Dead_Dead_self_CastInput;     // 0x0320(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Dead_Dead_NoUse;              // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDC9[0x7];                                     // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Dead_StopMotion_self_CastInput; // 0x0338(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Dead_StopMotion_NoUse;        // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDCA[0x7];                                     // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Dead_SpawnParticle_self_CastInput; // 0x0350(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Dead_SpawnParticle_NoUse;     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDCB[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Dead_Finished_self_CastInput; // 0x0368(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Dead_Finished_NoUse;          // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDCC[0x7];                                     // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Dead_Update_self_CastInput;   // 0x0380(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Dead_Update_NoUse;            // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDCD[0x7];                                     // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Dead_BreakDown_self_CastInput; // 0x0398(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Dead_BreakDown_NoUse;         // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDCE[0x7];                                     // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Dead_Update_Freeze_self_CastInput; // 0x03B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Dead_Update_Freeze_NoUse;     // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDCF[0x7];                                     // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DevilPerformanceCore_C> CallFunc_BI_TimeLine_Dead_Update_self_CastInput_1; // 0x03C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_TimeLine_Dead_Update_NoUse_1;          // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDD0[0x3];                                     // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_CharaPlayRate;                        // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BDD1[0x4];                                     // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGazeTargetHolder*                      CallFunc_GetGazeTargetHolder_ReturnValue;          // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDD2[0x7];                                     // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGazeTarget>           CallFunc_UnregisterGazeTarget_InTarget_CastInput;  // 0x03F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BDD3[0x3];                                     // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_NewScale;                             // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewBoundScale;                        // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enable;                               // 0x0414(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsReset;                              // 0x0415(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0416(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0417(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight) == 0x000008, "Wrong alignment on DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight");
static_assert(sizeof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight) == 0x000420, "Wrong size on DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, EntryPoint) == 0x000000, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::EntryPoint' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_CustomEvent_Loaded) == 0x000018, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, Temp_object_Variable) == 0x000020, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_DynamicCast_AsChara_Motion_Table) == 0x000028, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_DynamicCast_AsChara_Motion_Table' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Spawn_SpawnEffectVisibleOn_self_CastInput) == 0x000038, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Spawn_SpawnEffectVisibleOn_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Spawn_SpawnEffectVisibleOn_NoUse) == 0x000048, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Spawn_SpawnEffectVisibleOn_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Spawn_SpawnMotion_self_CastInput) == 0x000050, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Spawn_SpawnMotion_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Spawn_SpawnMotion_NoUse) == 0x000060, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Spawn_SpawnMotion_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Spawn_SpawnEffect_self_CastInput) == 0x000068, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Spawn_SpawnEffect_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Spawn_SpawnEffect_NoUse) == 0x000078, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Spawn_SpawnEffect_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Spawn_SpawnDecal_self_CastInput) == 0x000080, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Spawn_SpawnDecal_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Spawn_SpawnDecal_NoUse) == 0x000090, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Spawn_SpawnDecal_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Spawn_Finished_self_CastInput) == 0x000098, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Spawn_Finished_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Spawn_Finished_NoUse) == 0x0000A8, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Spawn_Finished_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Spawn_Update_self_CastInput) == 0x0000B0, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Spawn_Update_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Spawn_Update_NoUse) == 0x0000C0, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Spawn_Update_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_Event_CurrentStatus_1) == 0x0000C4, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_Event_CurrentStatus_1' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_Event_Immediately_1) == 0x0000C8, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_Event_Immediately_1' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_Event_IsInstantEvent_2) == 0x0000C9, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_Event_IsInstantEvent_2' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_Event_IsInBattle) == 0x0000CA, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_Event_IsInBattle' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_Event_PlayRate) == 0x0000CC, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_Event_PlayRate' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_Event_IsInstantEvent_1) == 0x0000D0, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_Event_IsInstantEvent_1' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_Event_PlayMotion) == 0x0000D1, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_Event_PlayMotion' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_Event_IsInstantEvent) == 0x0000D2, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_Event_IsInstantEvent' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_BeginSpawn_self_CastInput) == 0x0000D8, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_BeginSpawn_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_BeginSpawn_NoUse) == 0x0000E8, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_BeginSpawn_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Summon_EndOfSummon_self_CastInput) == 0x0000F0, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Summon_EndOfSummon_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Summon_EndOfSummon_NoUse) == 0x000100, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Summon_EndOfSummon_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_BeginRapidReturnAction_self_CastInput) == 0x000108, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_BeginRapidReturnAction_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_BeginRapidReturnAction_NoUse) == 0x000118, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_BeginRapidReturnAction_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Return_ParticleOff_self_CastInput) == 0x000120, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Return_ParticleOff_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Return_ParticleOff_NoUse) == 0x000130, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Return_ParticleOff_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Return_Finished_self_CastInput) == 0x000138, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Return_Finished_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Return_Finished_NoUse) == 0x000148, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Return_Finished_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Return_Update_self_CastInput) == 0x000150, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Return_Update_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Return_Update_NoUse) == 0x000160, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Return_Update_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_BeginReturnAction_self_CastInput) == 0x000168, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_BeginReturnAction_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_BeginReturnAction_NoUse) == 0x000178, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_BeginReturnAction_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Summon_ApplyBadStatus_self_CastInput) == 0x000180, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Summon_ApplyBadStatus_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Summon_ApplyBadStatus_NoUse) == 0x000190, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Summon_ApplyBadStatus_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Summon_Finished_self_CastInput) == 0x000198, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Summon_Finished_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Summon_Finished_NoUse) == 0x0001A8, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Summon_Finished_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Summon_Update_self_CastInput) == 0x0001B0, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Summon_Update_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Summon_Update_NoUse) == 0x0001C0, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Summon_Update_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_BeginSummonAction_self_CastInput) == 0x0001C8, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_BeginSummonAction_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_BeginSummonAction_NoUse) == 0x0001D8, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_BeginSummonAction_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_GetCharaPlayRate_PlayRate) == 0x0001DC, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_GetCharaPlayRate_PlayRate' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001E0, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_GetCharaPlayRate_PlayRate_1) == 0x0001E4, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_GetCharaPlayRate_PlayRate_1' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_Event_CurrentStatus) == 0x0001E8, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_Event_CurrentStatus' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_Event_Immediately) == 0x0001EC, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_Event_Immediately' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_BeginRapidSummonAction_self_CastInput) == 0x0001F0, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_BeginRapidSummonAction_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_BeginRapidSummonAction_NoUse) == 0x000200, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_BeginRapidSummonAction_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_GetCharaPlayRate_PlayRate_2) == 0x000204, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_GetCharaPlayRate_PlayRate_2' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_GetCharaPlayRate_PlayRate_3) == 0x000208, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_GetCharaPlayRate_PlayRate_3' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00020C, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_BeginSpawn_self_CastInput_1) == 0x000210, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_BeginSpawn_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_BeginSpawn_NoUse_1) == 0x000220, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_BeginSpawn_NoUse_1' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_BeginReviveAction_self_CastInput) == 0x000228, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_BeginReviveAction_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_BeginReviveAction_NoUse) == 0x000238, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_BeginReviveAction_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Revive_ParticleOn_Enemy_self_CastInput) == 0x000240, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Revive_ParticleOn_Enemy_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Revive_ParticleOn_Enemy_NoUse) == 0x000250, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Revive_ParticleOn_Enemy_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Revive_Finished_Enemy_self_CastInput) == 0x000258, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Revive_Finished_Enemy_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Revive_Finished_Enemy_NoUse) == 0x000268, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Revive_Finished_Enemy_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Revive_Update_Enemy_self_CastInput) == 0x000270, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Revive_Update_Enemy_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Revive_Update_Enemy_NewParam1) == 0x000280, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Revive_Update_Enemy_NewParam1' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Revive_ParticleOn_Nakama_self_CastInput) == 0x000288, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Revive_ParticleOn_Nakama_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Revive_ParticleOn_Nakama_NoUse) == 0x000298, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Revive_ParticleOn_Nakama_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Revive_Finished_Nakama_self_CastInput) == 0x0002A0, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Revive_Finished_Nakama_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Revive_Finished_Nakama_NoUse) == 0x0002B0, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Revive_Finished_Nakama_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Revive_Update_Nakama_self_CastInput) == 0x0002B8, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Revive_Update_Nakama_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Revive_Update_Nakama_NoUse) == 0x0002C8, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Revive_Update_Nakama_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_Event_InOption) == 0x0002C9, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_Event_InOption' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_Event_DeadTimingOverride) == 0x0002CA, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_Event_DeadTimingOverride' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_Event_DeadTiming) == 0x0002CC, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_Event_DeadTiming' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_CustomEvent_Sec) == 0x0002D0, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_CustomEvent_Sec' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_BeginDeathAction_self_CastInput) == 0x0002D8, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_BeginDeathAction_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_BeginDeathAction_NoUse) == 0x0002E8, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_BeginDeathAction_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Dead_CharaEffectDeactivate_self_CastInput) == 0x0002F0, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Dead_CharaEffectDeactivate_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Dead_CharaEffectDeactivate_NoUse) == 0x000300, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Dead_CharaEffectDeactivate_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Dead_Update_Freeze_DMDither_self_CastInput) == 0x000308, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Dead_Update_Freeze_DMDither_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Dead_Update_Freeze_DMDither_NewParam1) == 0x000318, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Dead_Update_Freeze_DMDither_NewParam1' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Dead_Dead_self_CastInput) == 0x000320, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Dead_Dead_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Dead_Dead_NoUse) == 0x000330, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Dead_Dead_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Dead_StopMotion_self_CastInput) == 0x000338, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Dead_StopMotion_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Dead_StopMotion_NoUse) == 0x000348, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Dead_StopMotion_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Dead_SpawnParticle_self_CastInput) == 0x000350, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Dead_SpawnParticle_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Dead_SpawnParticle_NoUse) == 0x000360, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Dead_SpawnParticle_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Dead_Finished_self_CastInput) == 0x000368, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Dead_Finished_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Dead_Finished_NoUse) == 0x000378, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Dead_Finished_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Dead_Update_self_CastInput) == 0x000380, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Dead_Update_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Dead_Update_NoUse) == 0x000390, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Dead_Update_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Dead_BreakDown_self_CastInput) == 0x000398, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Dead_BreakDown_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Dead_BreakDown_NoUse) == 0x0003A8, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Dead_BreakDown_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Dead_Update_Freeze_self_CastInput) == 0x0003B0, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Dead_Update_Freeze_self_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Dead_Update_Freeze_NoUse) == 0x0003C0, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Dead_Update_Freeze_NoUse' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Dead_Update_self_CastInput_1) == 0x0003C8, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Dead_Update_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_BI_TimeLine_Dead_Update_NoUse_1) == 0x0003D8, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_BI_TimeLine_Dead_Update_NoUse_1' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_Event_DeltaSeconds) == 0x0003DC, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_Event_CharaPlayRate) == 0x0003E0, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_Event_CharaPlayRate' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_GetGazeTargetHolder_ReturnValue) == 0x0003E8, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_GetGazeTargetHolder_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_IsValid_ReturnValue) == 0x0003F0, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_UnregisterGazeTarget_InTarget_CastInput) == 0x0003F8, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_UnregisterGazeTarget_InTarget_CastInput' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_Event_EndPlayReason) == 0x000408, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_Event_NewScale) == 0x00040C, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_Event_NewScale' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_Event_NewBoundScale) == 0x000410, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_Event_NewBoundScale' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_Event_Enable) == 0x000414, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_Event_Enable' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, K2Node_Event_IsReset) == 0x000415, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::K2Node_Event_IsReset' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_IsValid_ReturnValue_1) == 0x000416, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_IsValid_ReturnValue_2) == 0x000417, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight, CallFunc_IsValid_ReturnValue_3) == 0x000418, "Member 'DevilBaseLight_C_ExecuteUbergraph_DevilBaseLight::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function DevilBaseLight.DevilBaseLight_C.BI_AdjustMeshScale
// 0x0001 (0x0001 - 0x0000)
struct DevilBaseLight_C_BI_AdjustMeshScale final
{
public:
	bool                                          IsReset;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DevilBaseLight_C_BI_AdjustMeshScale) == 0x000001, "Wrong alignment on DevilBaseLight_C_BI_AdjustMeshScale");
static_assert(sizeof(DevilBaseLight_C_BI_AdjustMeshScale) == 0x000001, "Wrong size on DevilBaseLight_C_BI_AdjustMeshScale");
static_assert(offsetof(DevilBaseLight_C_BI_AdjustMeshScale, IsReset) == 0x000000, "Member 'DevilBaseLight_C_BI_AdjustMeshScale::IsReset' has a wrong offset!");

// Function DevilBaseLight.DevilBaseLight_C.BI_SetDevilRootMotion
// 0x0001 (0x0001 - 0x0000)
struct DevilBaseLight_C_BI_SetDevilRootMotion final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DevilBaseLight_C_BI_SetDevilRootMotion) == 0x000001, "Wrong alignment on DevilBaseLight_C_BI_SetDevilRootMotion");
static_assert(sizeof(DevilBaseLight_C_BI_SetDevilRootMotion) == 0x000001, "Wrong size on DevilBaseLight_C_BI_SetDevilRootMotion");
static_assert(offsetof(DevilBaseLight_C_BI_SetDevilRootMotion, Enable) == 0x000000, "Member 'DevilBaseLight_C_BI_SetDevilRootMotion::Enable' has a wrong offset!");

// Function DevilBaseLight.DevilBaseLight_C.SetMeshRelativeScale
// 0x0008 (0x0008 - 0x0000)
struct DevilBaseLight_C_SetMeshRelativeScale final
{
public:
	float                                         NewScale;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewBoundScale;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DevilBaseLight_C_SetMeshRelativeScale) == 0x000004, "Wrong alignment on DevilBaseLight_C_SetMeshRelativeScale");
static_assert(sizeof(DevilBaseLight_C_SetMeshRelativeScale) == 0x000008, "Wrong size on DevilBaseLight_C_SetMeshRelativeScale");
static_assert(offsetof(DevilBaseLight_C_SetMeshRelativeScale, NewScale) == 0x000000, "Member 'DevilBaseLight_C_SetMeshRelativeScale::NewScale' has a wrong offset!");
static_assert(offsetof(DevilBaseLight_C_SetMeshRelativeScale, NewBoundScale) == 0x000004, "Member 'DevilBaseLight_C_SetMeshRelativeScale::NewBoundScale' has a wrong offset!");

// Function DevilBaseLight.DevilBaseLight_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct DevilBaseLight_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DevilBaseLight_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on DevilBaseLight_C_ReceiveEndPlay");
static_assert(sizeof(DevilBaseLight_C_ReceiveEndPlay) == 0x000001, "Wrong size on DevilBaseLight_C_ReceiveEndPlay");
static_assert(offsetof(DevilBaseLight_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'DevilBaseLight_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function DevilBaseLight.DevilBaseLight_C.SetCharaPlayRate
// 0x0004 (0x0004 - 0x0000)
struct DevilBaseLight_C_SetCharaPlayRate final
{
public:
