#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EM_M061_TutorialUniqueSymbol

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EM_M061_TutorialUniqueSymbol.EM_M061_TutorialUniqueSymbol_C.ExecuteUbergraph_EM_M061_TutorialUniqueSymbol
// 0x05F0 (0x05F0 - 0x0000)
struct EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C764[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C765[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C766[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_1;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C767[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_3;              // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C768[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_1;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl;                 // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd;             // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C769[0x6];                                     // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_1;               // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1;           // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C76A[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_2;               // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C76B[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_3;               // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_2;               // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPL_TutorialWIndow2_IsClickedByMouse_IsClicked; // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C76C[0x1];                                     // 0x00F7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_4;              // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C76D[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_5;              // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C76E[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_2;             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_3;             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_6;              // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C76F[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_7;              // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C770[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_2;                // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_3;                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_4;               // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C771[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_5;               // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C772[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_6;               // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_2;           // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C773[0x6];                                     // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_7;               // 0x01D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C774[0x7];                                     // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_8;               // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetActive_IsActive;                       // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartMapEvent_Dummy;                      // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C775[0x5];                                     // 0x01FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerBase_C*                          K2Node_DynamicCast_AsPlayer_Base;                  // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C776[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0220(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C777[0x4];                                     // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATargetPoint*                           CallFunc_Array_Get_Item;                           // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_REase_ReturnValue;                        // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x02B8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0340(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraBlend_C*                 CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FadeOutMapEvent_Delay;                    // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C778[0x4];                                     // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           CallFunc_Array_Get_Item_1;                         // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FadeInMapEvent_Delay;                     // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FadeOutMapEvent_Delay_1;                  // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FadeInMapEvent_Delay_1;                   // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EndMapEvent_Dummy;                        // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C779[0x3];                                     // 0x03AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           CallFunc_Array_Get_Item_2;                         // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CallFunc_Array_Get_Item_3;                         // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CallFunc_Array_Get_Item_4;                         // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerBase_C*                          K2Node_DynamicCast_AsPlayer_Base_1;                // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C77A[0x7];                                     // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATargetPoint*                           CallFunc_Array_Get_Item_5;                         // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_4;            // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x03F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C77B[0x4];                                     // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_8;              // 0x0400(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_19;                    // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C77C[0x3];                                     // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0414(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_4;             // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_9;              // 0x0428(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_20;                    // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C77D[0x7];                                     // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_4;                // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_9;               // 0x0448(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_21;                    // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C77E[0x7];                                     // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_10;              // 0x0460(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_22;                    // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IIsFinishedWindowOut_OutFinished;         // 0x0471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C77F[0x6];                                     // 0x0472(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_11;              // 0x0478(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_23;                    // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C780[0x7];                                     // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_12;              // 0x0490(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_24;                    // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMapEventActivateFlags_ReturnValue;      // 0x04A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMapEventActivateFlags_ReturnValue_1;    // 0x04A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C781[0x1];                                     // 0x04A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDefaultPlayerCameraFOV_DefaultFOV;     // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x04B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C782[0x6];                                     // 0x04B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_5;            // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_10;             // 0x04C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_25;                    // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C783[0x7];                                     // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_5;             // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_11;             // 0x04E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_26;                    // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C784[0x7];                                     // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_5;                // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_13;              // 0x0500(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_27;                    // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C785[0x7];                                     // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_14;              // 0x0518(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_28;                    // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IIsFinishedWindowOut_OutFinished_1;       // 0x0529(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C786[0x6];                                     // 0x052A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_15;              // 0x0530(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_29;                    // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C787[0x7];                                     // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_16;              // 0x0548(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_30;                    // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C788[0x7];                                     // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_6;            // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_12;             // 0x0568(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_31;                    // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C789[0x7];                                     // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_6;             // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_13;             // 0x0588(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_32;                    // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C78A[0x7];                                     // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_6;                // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_17;              // 0x05A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_33;                    // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C78B[0x7];                                     // 0x05B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_18;              // 0x05C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_34;                    // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C78C[0x7];                                     // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_19;              // 0x05D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_35;                    // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol) == 0x000010, "Wrong alignment on EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol");
static_assert(sizeof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol) == 0x0005F0, "Wrong size on EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, EntryPoint) == 0x000000, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::EntryPoint' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_AsBPI_UIManager) == 0x000010, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_GetGameInstance_ReturnValue_1) == 0x000028, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_BPI_GetUIManager_UIManager_1) == 0x000050, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_BPI_GetUIManager_UIManager_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_AsBPI_UIManager_2) == 0x000058, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_AsBPI_UIManager_2' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_BPI_GetMsgCtrl_OutActor) == 0x000070, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_BPI_GetMsgCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_AsBPI_UIManager_3) == 0x000078, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_AsBPI_UIManager_3' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_bSuccess_3) == 0x000088, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_BPI_GetMsgCtrl_OutActor_1) == 0x000090, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_BPI_GetMsgCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_AsBPI_Msg_Ctrl) == 0x000098, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_AsBPI_Msg_Ctrl' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_bSuccess_4) == 0x0000A8, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd) == 0x0000A9, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_AsBPI_Msg_Ctrl_1) == 0x0000B0, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_AsBPI_Msg_Ctrl_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_bSuccess_5) == 0x0000C0, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1) == 0x0000C1, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_AsBPI_Msg_Ctrl_2) == 0x0000C8, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_AsBPI_Msg_Ctrl_2' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_bSuccess_6) == 0x0000D8, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_AsBPI_Msg_Ctrl_3) == 0x0000E0, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_AsBPI_Msg_Ctrl_3' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_bSuccess_7) == 0x0000F0, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_IsActionPadCheck_Success) == 0x0000F1, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_IsActionPadCheck_Success_1) == 0x0000F2, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_IsActionPadCheck_Success_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_IsActionPadCheck_Success_2) == 0x0000F3, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_IsActionPadCheck_Success_2' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_BPL_TutorialWIndow2_IsClickedByMouse_IsClicked) == 0x0000F4, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_BPL_TutorialWIndow2_IsClickedByMouse_IsClicked' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_BooleanOR_ReturnValue) == 0x0000F5, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_BooleanOR_ReturnValue_1) == 0x0000F6, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_GetGameInstance_ReturnValue_2) == 0x0000F8, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_GetGameInstance_ReturnValue_3) == 0x000100, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_GetGameInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_AsBPI_UIManager_4) == 0x000108, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_AsBPI_UIManager_4' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_bSuccess_8) == 0x000118, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_AsBPI_UIManager_5) == 0x000120, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_AsBPI_UIManager_5' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_bSuccess_9) == 0x000130, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_BPI_GetUIManager_UIManager_2) == 0x000138, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_BPI_GetUIManager_UIManager_2' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_BPI_GetUIManager_UIManager_3) == 0x000140, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_BPI_GetUIManager_UIManager_3' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_AsBPI_UIManager_6) == 0x000148, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_AsBPI_UIManager_6' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_bSuccess_10) == 0x000158, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_AsBPI_UIManager_7) == 0x000160, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_AsBPI_UIManager_7' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_bSuccess_11) == 0x000170, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_BPI_GetMsgCtrl_OutActor_2) == 0x000178, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_BPI_GetMsgCtrl_OutActor_2' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_BPI_GetMsgCtrl_OutActor_3) == 0x000180, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_BPI_GetMsgCtrl_OutActor_3' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_AsBPI_Msg_Ctrl_4) == 0x000188, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_AsBPI_Msg_Ctrl_4' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_bSuccess_12) == 0x000198, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_AsBPI_Msg_Ctrl_5) == 0x0001A0, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_AsBPI_Msg_Ctrl_5' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_bSuccess_13) == 0x0001B0, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_AsBPI_Msg_Ctrl_6) == 0x0001B8, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_AsBPI_Msg_Ctrl_6' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_bSuccess_14) == 0x0001C8, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_2) == 0x0001C9, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_2' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_AsBPI_Msg_Ctrl_7) == 0x0001D0, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_AsBPI_Msg_Ctrl_7' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_bSuccess_15) == 0x0001E0, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_bSuccess_15' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_AsBPI_Msg_Ctrl_8) == 0x0001E8, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_AsBPI_Msg_Ctrl_8' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_bSuccess_16) == 0x0001F8, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_bSuccess_16' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_GetActive_IsActive) == 0x0001F9, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_GetActive_IsActive' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_StartMapEvent_Dummy) == 0x0001FA, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_StartMapEvent_Dummy' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_GetPlayerPawn_ReturnValue) == 0x000200, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_GetPlayerController_ReturnValue) == 0x000208, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_AsPlayer_Base) == 0x000210, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_AsPlayer_Base' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_bSuccess_17) == 0x000218, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_bSuccess_17' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000220, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000250, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_FinishSpawningActor_ReturnValue) == 0x000258, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000260, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000268, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_Array_Get_Item) == 0x000278, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000280, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_FindLookAtRotation_ReturnValue) == 0x00028C, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000298, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_REase_ReturnValue) == 0x0002A4, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_REase_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x0002B0, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0002B8, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_MakeTransform_ReturnValue) == 0x000340, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000370, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000378, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_GetPlayerController_ReturnValue_1) == 0x000380, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_GetViewTarget_ReturnValue) == 0x000388, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_FadeOutMapEvent_Delay) == 0x000390, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_FadeOutMapEvent_Delay' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_Array_Get_Item_1) == 0x000398, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_FadeInMapEvent_Delay) == 0x0003A0, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_FadeInMapEvent_Delay' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_FadeOutMapEvent_Delay_1) == 0x0003A4, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_FadeOutMapEvent_Delay_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_FadeInMapEvent_Delay_1) == 0x0003A8, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_FadeInMapEvent_Delay_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_EndMapEvent_Dummy) == 0x0003AC, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_EndMapEvent_Dummy' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_Array_Get_Item_2) == 0x0003B0, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_Array_Get_Item_3) == 0x0003B8, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_Array_Get_Item_4) == 0x0003C0, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x0003C8, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_AsPlayer_Base_1) == 0x0003D0, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_AsPlayer_Base_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, K2Node_DynamicCast_bSuccess_18) == 0x0003D8, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::K2Node_DynamicCast_bSuccess_18' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol, CallFunc_Array_Get_Item_5) == 0x0003E0, "Member 'EM_M061_TutorialUniqueSymbol_C_ExecuteUbergraph_EM_M061_TutorialUniqueSymbol::CallFunc_Array_Get_Item_5' has a wrong offset!");
