#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EM_M061_TutorialNavi01

#include "Basic.hpp"


namespace SDK::Params
{

// Function EM_M061_TutorialNavi01.EM_M061_TutorialNavi01_C.ExecuteUbergraph_EM_M061_TutorialNavi01
// 0x000C (0x000C - 0x0000)
struct EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPL_TutorialWIndow2_IsClickedByMouse_IsClicked; // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartMapEvent_Dummy;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EndMapEvent_Dummy;                        // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_2;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01) == 0x000004, "Wrong alignment on EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01");
static_assert(sizeof(EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01) == 0x00000C, "Wrong size on EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01");
static_assert(offsetof(EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01, EntryPoint) == 0x000000, "Member 'EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01::EntryPoint' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01, CallFunc_IsActionPadCheck_Success) == 0x000004, "Member 'EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01, CallFunc_BPL_TutorialWIndow2_IsClickedByMouse_IsClicked) == 0x000005, "Member 'EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01::CallFunc_BPL_TutorialWIndow2_IsClickedByMouse_IsClicked' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01, CallFunc_StartMapEvent_Dummy) == 0x000006, "Member 'EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01::CallFunc_StartMapEvent_Dummy' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01, CallFunc_EndMapEvent_Dummy) == 0x000007, "Member 'EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01::CallFunc_EndMapEvent_Dummy' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01, CallFunc_IsActionPadCheck_Success_1) == 0x000008, "Member 'EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01::CallFunc_IsActionPadCheck_Success_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01, CallFunc_BooleanOR_ReturnValue) == 0x000009, "Member 'EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01, CallFunc_IsActionPadCheck_Success_2) == 0x00000A, "Member 'EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01::CallFunc_IsActionPadCheck_Success_2' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01, CallFunc_BooleanOR_ReturnValue_1) == 0x00000B, "Member 'EM_M061_TutorialNavi01_C_ExecuteUbergraph_EM_M061_TutorialNavi01::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

}

