#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EM_M061_GenericTutorial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EM_M061_GenericTutorial.EM_M061_GenericTutorial_C.ExecuteUbergraph_EM_M061_GenericTutorial
// 0x03C0 (0x03C0 - 0x0000)
struct EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29E4[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_2;               // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPL_TutorialWIndow2_IsClickedByMouse_IsClicked; // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29E5[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActive_IsActive;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29E6[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29E7[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29E8[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl;                 // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29E9[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_1;               // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd;             // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartMapEvent_Dummy;                      // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EndMapEvent_Dummy;                        // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29EA[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerBase_C*                          K2Node_DynamicCast_AsPlayer_Base;                  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29EB[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29EC[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATargetPoint*                           CallFunc_Array_Get_Item;                           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_REase_ReturnValue;                        // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x014C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29ED[0x4];                                     // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01E0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraBlend_C*                 CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29EE[0x4];                                     // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29EF[0x7];                                     // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_1;             // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_3;              // 0x0268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29F0[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_1;                // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_2;               // 0x0288(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29F1[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_3;               // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IIsFinishedWindowOut_OutFinished;         // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29F2[0x6];                                     // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_4;               // 0x02B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29F3[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_5;               // 0x02D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMapEventActivateFlags_ReturnValue;      // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMapEventActivateFlags_ReturnValue_1;    // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29F4[0x1];                                     // 0x02E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDefaultPlayerCameraFOV_DefaultFOV;     // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29F5[0x3];                                     // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29F6[0x3];                                     // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_4;              // 0x0300(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29F7[0x3];                                     // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_2;             // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_5;              // 0x0320(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29F8[0x7];                                     // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_2;                // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_6;               // 0x0340(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29F9[0x7];                                     // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_7;               // 0x0358(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29FA[0x7];                                     // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_8;               // 0x0370(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29FB[0x7];                                     // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_EventScriptArea_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0388(0x0010)(ReferenceParm)
	class ABP_EventScriptArea_C*                  CallFunc_Array_Get_Item_1;                         // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29FC[0x4];                                     // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EventScript_C>    K2Node_DynamicCast_AsBPI_Event_Script;             // 0x03A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SpawnReflesh_NoUse;                       // 0x03BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial) == 0x000010, "Wrong alignment on EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial");
static_assert(sizeof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial) == 0x0003C0, "Wrong size on EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, EntryPoint) == 0x000000, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::EntryPoint' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_IsActionPadCheck_Success) == 0x000004, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_IsActionPadCheck_Success_1) == 0x000005, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_IsActionPadCheck_Success_1' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000008, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_Greater_IntInt_ReturnValue) == 0x000014, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_IsActionPadCheck_Success_2) == 0x000015, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_IsActionPadCheck_Success_2' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_BPL_TutorialWIndow2_IsClickedByMouse_IsClicked) == 0x000016, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_BPL_TutorialWIndow2_IsClickedByMouse_IsClicked' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_BooleanOR_ReturnValue) == 0x000017, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_BooleanOR_ReturnValue_1) == 0x000018, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_GetGameInstance_ReturnValue) == 0x000020, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_GetActive_IsActive) == 0x000028, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_GetActive_IsActive' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_AsBPI_UIManager) == 0x000030, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_BPI_GetUIManager_UIManager) == 0x000048, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000050, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_BPI_GetMsgCtrl_OutActor) == 0x000068, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_BPI_GetMsgCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_AsBPI_Msg_Ctrl) == 0x000070, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_AsBPI_Msg_Ctrl' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_AsBPI_Msg_Ctrl_1) == 0x000088, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_AsBPI_Msg_Ctrl_1' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_bSuccess_3) == 0x000098, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd) == 0x000099, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_StartMapEvent_Dummy) == 0x00009A, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_StartMapEvent_Dummy' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_EndMapEvent_Dummy) == 0x00009B, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_EndMapEvent_Dummy' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000A0, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_GetPlayerController_ReturnValue) == 0x0000A8, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_AsPlayer_Base) == 0x0000B0, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_AsPlayer_Base' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_bSuccess_4) == 0x0000B8, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0000C0, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000F0, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000F8, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000100, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000108, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_Array_Get_Item) == 0x000118, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000120, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_FindLookAtRotation_ReturnValue) == 0x00012C, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000138, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_REase_ReturnValue) == 0x000140, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_REase_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x00014C, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, Temp_int_Loop_Counter_Variable) == 0x0001D4, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_Add_IntInt_ReturnValue) == 0x0001D8, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_MakeTransform_ReturnValue) == 0x0001E0, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000210, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000218, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_GetPlayerController_ReturnValue_1) == 0x000220, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_GetViewTarget_ReturnValue) == 0x000228, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_Array_Length_ReturnValue) == 0x000230, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_Subtract_IntInt_ReturnValue) == 0x000234, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_GetGameInstance_ReturnValue_1) == 0x000238, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_Add_IntInt_ReturnValue_1) == 0x000240, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_AsBPI_UIManager_2) == 0x000248, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_AsBPI_UIManager_2' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_bSuccess_5) == 0x000258, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_BPI_GetUIManager_UIManager_1) == 0x000260, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_BPI_GetUIManager_UIManager_1' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_AsBPI_UIManager_3) == 0x000268, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_AsBPI_UIManager_3' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_bSuccess_6) == 0x000278, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_BPI_GetMsgCtrl_OutActor_1) == 0x000280, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_BPI_GetMsgCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_AsBPI_Msg_Ctrl_2) == 0x000288, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_AsBPI_Msg_Ctrl_2' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_bSuccess_7) == 0x000298, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_AsBPI_Msg_Ctrl_3) == 0x0002A0, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_AsBPI_Msg_Ctrl_3' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_bSuccess_8) == 0x0002B0, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_IIsFinishedWindowOut_OutFinished) == 0x0002B1, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_IIsFinishedWindowOut_OutFinished' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_AsBPI_Msg_Ctrl_4) == 0x0002B8, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_AsBPI_Msg_Ctrl_4' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_bSuccess_9) == 0x0002C8, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_AsBPI_Msg_Ctrl_5) == 0x0002D0, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_AsBPI_Msg_Ctrl_5' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_bSuccess_10) == 0x0002E0, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_IsMapEventActivateFlags_ReturnValue) == 0x0002E1, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_IsMapEventActivateFlags_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_IsMapEventActivateFlags_ReturnValue_1) == 0x0002E2, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_IsMapEventActivateFlags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_GetDefaultPlayerCameraFOV_DefaultFOV) == 0x0002E4, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_GetDefaultPlayerCameraFOV_DefaultFOV' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_Event_EndPlayReason) == 0x0002E8, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0002EC, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_Ease_ReturnValue) == 0x0002F0, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_IsValid_ReturnValue) == 0x0002F4, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_GetGameInstance_ReturnValue_2) == 0x0002F8, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_AsBPI_UIManager_4) == 0x000300, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_AsBPI_UIManager_4' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_bSuccess_11) == 0x000310, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, Temp_int_Array_Index_Variable) == 0x000314, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_BPI_GetUIManager_UIManager_2) == 0x000318, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_BPI_GetUIManager_UIManager_2' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_AsBPI_UIManager_5) == 0x000320, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_AsBPI_UIManager_5' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_bSuccess_12) == 0x000330, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_BPI_GetMsgCtrl_OutActor_2) == 0x000338, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_BPI_GetMsgCtrl_OutActor_2' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_AsBPI_Msg_Ctrl_6) == 0x000340, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_AsBPI_Msg_Ctrl_6' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_bSuccess_13) == 0x000350, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_AsBPI_Msg_Ctrl_7) == 0x000358, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_AsBPI_Msg_Ctrl_7' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_bSuccess_14) == 0x000368, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_AsBPI_Msg_Ctrl_8) == 0x000370, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_AsBPI_Msg_Ctrl_8' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_bSuccess_15) == 0x000380, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_bSuccess_15' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_GetAllActorsOfClass_OutActors) == 0x000388, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_Array_Get_Item_1) == 0x000398, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_Array_Length_ReturnValue_1) == 0x0003A0, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_AsBPI_Event_Script) == 0x0003A8, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_AsBPI_Event_Script' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, K2Node_DynamicCast_bSuccess_16) == 0x0003B8, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::K2Node_DynamicCast_bSuccess_16' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_Less_IntInt_ReturnValue) == 0x0003B9, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial, CallFunc_SpawnReflesh_NoUse) == 0x0003BA, "Member 'EM_M061_GenericTutorial_C_ExecuteUbergraph_EM_M061_GenericTutorial::CallFunc_SpawnReflesh_NoUse' has a wrong offset!");

// Function EM_M061_GenericTutorial.EM_M061_GenericTutorial_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct EM_M061_GenericTutorial_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EM_M061_GenericTutorial_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on EM_M061_GenericTutorial_C_ReceiveEndPlay");
static_assert(sizeof(EM_M061_GenericTutorial_C_ReceiveEndPlay) == 0x000001, "Wrong size on EM_M061_GenericTutorial_C_ReceiveEndPlay");
static_assert(offsetof(EM_M061_GenericTutorial_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'EM_M061_GenericTutorial_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

