#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EM_M061_MimanTutorial

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_EventMissionBase_Hit_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass EM_M061_MimanTutorial.EM_M061_MimanTutorial_C
// 0x0098 (0x0360 - 0x02C8)
class AEM_M061_MimanTutorial_C final : public ABP_EventMissionBase_Hit_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_EM_M061_MimanTutorial_C;            // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         _______1_Rot_EDDB361B4C949D08534400BC81323345;     // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______1__Direction_EDDB361B4C949D08534400BC81323345; // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C85F[0x3];                                     // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______1;                                          // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______0_FOV_9F2B9900469FADBD79DD8BB0F73FC13F;     // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______0__Direction_9F2B9900469FADBD79DD8BB0F73FC13F; // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C860[0x3];                                     // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______0;                                          // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectIndex;                                       // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C861[0x4];                                     // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 Mission_Event;                                     // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ACameraActor*                           InstantCamera;                                     // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DefInstantCameraRot;                               // 0x0338(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         DefFOV;                                            // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewFOV;                                            // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C862[0x4];                                     // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventCameraBlend_C*                 CameraBlender;                                     // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DefCamera;                                         // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EM_M061_MimanTutorial(int32 EntryPoint);
	void EvtDis_FinishComplete();
	void EvtDis_Finish();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void CallDeactivate();
	void QuestExecute();
	void ReceiveBeginPlay();
	void _______1__UpdateFunc();
	void _______1__FinishedFunc();
	void _______0__UpdateFunc();
	void _______0__FinishedFunc();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EM_M061_MimanTutorial_C">();
	}
	static class AEM_M061_MimanTutorial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEM_M061_MimanTutorial_C>();
	}
};
static_assert(alignof(AEM_M061_MimanTutorial_C) == 0x000008, "Wrong alignment on AEM_M061_MimanTutorial_C");
static_assert(sizeof(AEM_M061_MimanTutorial_C) == 0x000360, "Wrong size on AEM_M061_MimanTutorial_C");
static_assert(offsetof(AEM_M061_MimanTutorial_C, UberGraphFrame_EM_M061_MimanTutorial_C) == 0x0002C8, "Member 'AEM_M061_MimanTutorial_C::UberGraphFrame_EM_M061_MimanTutorial_C' has a wrong offset!");
static_assert(offsetof(AEM_M061_MimanTutorial_C, _______1_Rot_EDDB361B4C949D08534400BC81323345) == 0x0002D0, "Member 'AEM_M061_MimanTutorial_C::_______1_Rot_EDDB361B4C949D08534400BC81323345' has a wrong offset!");
static_assert(offsetof(AEM_M061_MimanTutorial_C, _______1__Direction_EDDB361B4C949D08534400BC81323345) == 0x0002D4, "Member 'AEM_M061_MimanTutorial_C::_______1__Direction_EDDB361B4C949D08534400BC81323345' has a wrong offset!");
static_assert(offsetof(AEM_M061_MimanTutorial_C, _______1) == 0x0002D8, "Member 'AEM_M061_MimanTutorial_C::_______1' has a wrong offset!");
static_assert(offsetof(AEM_M061_MimanTutorial_C, _______0_FOV_9F2B9900469FADBD79DD8BB0F73FC13F) == 0x0002E0, "Member 'AEM_M061_MimanTutorial_C::_______0_FOV_9F2B9900469FADBD79DD8BB0F73FC13F' has a wrong offset!");
static_assert(offsetof(AEM_M061_MimanTutorial_C, _______0__Direction_9F2B9900469FADBD79DD8BB0F73FC13F) == 0x0002E4, "Member 'AEM_M061_MimanTutorial_C::_______0__Direction_9F2B9900469FADBD79DD8BB0F73FC13F' has a wrong offset!");
static_assert(offsetof(AEM_M061_MimanTutorial_C, _______0) == 0x0002E8, "Member 'AEM_M061_MimanTutorial_C::_______0' has a wrong offset!");
static_assert(offsetof(AEM_M061_MimanTutorial_C, SelectIndex) == 0x0002F0, "Member 'AEM_M061_MimanTutorial_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AEM_M061_MimanTutorial_C, SystemMessageAsset) == 0x0002F8, "Member 'AEM_M061_MimanTutorial_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AEM_M061_MimanTutorial_C, MissionMessageAsset) == 0x000300, "Member 'AEM_M061_MimanTutorial_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AEM_M061_MimanTutorial_C, Mission_Event) == 0x000308, "Member 'AEM_M061_MimanTutorial_C::Mission_Event' has a wrong offset!");
static_assert(offsetof(AEM_M061_MimanTutorial_C, Camera) == 0x000310, "Member 'AEM_M061_MimanTutorial_C::Camera' has a wrong offset!");
static_assert(offsetof(AEM_M061_MimanTutorial_C, Target) == 0x000320, "Member 'AEM_M061_MimanTutorial_C::Target' has a wrong offset!");
static_assert(offsetof(AEM_M061_MimanTutorial_C, InstantCamera) == 0x000330, "Member 'AEM_M061_MimanTutorial_C::InstantCamera' has a wrong offset!");
static_assert(offsetof(AEM_M061_MimanTutorial_C, DefInstantCameraRot) == 0x000338, "Member 'AEM_M061_MimanTutorial_C::DefInstantCameraRot' has a wrong offset!");
static_assert(offsetof(AEM_M061_MimanTutorial_C, DefFOV) == 0x000344, "Member 'AEM_M061_MimanTutorial_C::DefFOV' has a wrong offset!");
static_assert(offsetof(AEM_M061_MimanTutorial_C, NewFOV) == 0x000348, "Member 'AEM_M061_MimanTutorial_C::NewFOV' has a wrong offset!");
static_assert(offsetof(AEM_M061_MimanTutorial_C, CameraBlender) == 0x000350, "Member 'AEM_M061_MimanTutorial_C::CameraBlender' has a wrong offset!");
static_assert(offsetof(AEM_M061_MimanTutorial_C, DefCamera) == 0x000358, "Member 'AEM_M061_MimanTutorial_C::DefCamera' has a wrong offset!");

}

