#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EM_M061_TutorialSlash

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EM_M061_TutorialSlash.EM_M061_TutorialSlash_C.ExecuteUbergraph_EM_M061_TutorialSlash
// 0x0540 (0x0540 - 0x0000)
struct EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraBlend_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPL_TutorialWIndow2_IsClickedByMouse_IsClicked; // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5657[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5658[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5659[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_565A[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_1;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor;                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl;                 // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_565B[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_1;               // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd;             // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_565C[0x6];                                     // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_3;              // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_565D[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_1;                // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_2;               // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_565E[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_3;               // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_565F[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_4;               // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5660[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_4;              // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5661[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_2;             // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_5;              // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5662[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_2;                // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_6;              // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5663[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_3;             // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_5;               // 0x01D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1;           // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5664[0x6];                                     // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_7;              // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5665[0x7];                                     // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_3;                // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_6;               // 0x0208(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5666[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_7;               // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_2;           // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5667[0x6];                                     // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_8;               // 0x0238(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5668[0x7];                                     // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_4;            // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_8;              // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5669[0x7];                                     // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_4;             // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_9;              // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_566A[0x7];                                     // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_4;                // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_9;               // 0x0298(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_19;                    // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_566B[0x7];                                     // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_10;              // 0x02B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_20;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_3;           // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetActive_IsActive;                       // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_566C[0x1];                                     // 0x02C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartMapEvent_Dummy;                      // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_2;               // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EndMapEvent_Dummy;                        // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x02CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_566D[0x2];                                     // 0x02CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerBase_C*                          K2Node_DynamicCast_AsPlayer_Base;                  // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_21;                    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_566E[0x7];                                     // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x02F0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0338(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_566F[0x4];                                     // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATargetPoint*                           CallFunc_Array_Get_Item;                           // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0350(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5670[0x4];                                     // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0360(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0368(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_REase_ReturnValue;                        // 0x0374(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0380(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_EventScriptArea_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0418(0x0010)(ReferenceParm)
	class ABP_EventScriptArea_C*                  CallFunc_Array_Get_Item_1;                         // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5671[0x4];                                     // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EventScript_C>    K2Node_DynamicCast_AsBPI_Event_Script;             // 0x0438(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_22;                    // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SpawnReflesh_NoUse;                       // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5672[0x2];                                     // 0x044A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5673[0x3];                                     // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_2;              // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APla603_C*                              K2Node_DynamicCast_AsPla_603;                      // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_23;                    // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5674[0x7];                                     // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APla603_C*                              K2Node_DynamicCast_AsPla_603_1;                    // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_24;                    // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMapEventActivateFlags_ReturnValue;      // 0x0481(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMapEventActivateFlags_ReturnValue_1;    // 0x0482(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5675[0x1];                                     // 0x0483(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDefaultPlayerCameraFOV_DefaultFOV;     // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5676[0x3];                                     // 0x0489(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0494(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5677[0x3];                                     // 0x0495(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_5;            // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_10;             // 0x04A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_25;                    // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5678[0x7];                                     // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_5;             // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_11;             // 0x04C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_26;                    // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5679[0x7];                                     // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_5;                // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_11;              // 0x04E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_27;                    // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_567A[0x7];                                     // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_12;              // 0x04F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_28;                    // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IIsFinishedWindowOut_OutFinished;         // 0x0509(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_567B[0x6];                                     // 0x050A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_13;              // 0x0510(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_29;                    // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_567C[0x7];                                     // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_14;              // 0x0528(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_30;                    // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash) == 0x000010, "Wrong alignment on EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash");
static_assert(sizeof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash) == 0x000540, "Wrong size on EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, EntryPoint) == 0x000000, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::EntryPoint' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000004, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_IsActionPadCheck_Success) == 0x000050, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_BPL_TutorialWIndow2_IsClickedByMouse_IsClicked) == 0x000051, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_BPL_TutorialWIndow2_IsClickedByMouse_IsClicked' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_GetGameInstance_ReturnValue) == 0x000058, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsBPI_UIManager) == 0x000060, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_BPI_GetUIManager_UIManager) == 0x000078, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_GetGameInstance_ReturnValue_1) == 0x000080, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000088, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsBPI_UIManager_2) == 0x0000A0, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsBPI_UIManager_2' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_BPI_GetUIManager_UIManager_1) == 0x0000B8, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_BPI_GetUIManager_UIManager_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_BPI_GetMsgCtrl_OutActor) == 0x0000C0, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_BPI_GetMsgCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsBPI_Msg_Ctrl) == 0x0000C8, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsBPI_Msg_Ctrl' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_3) == 0x0000D8, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsBPI_Msg_Ctrl_1) == 0x0000E0, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsBPI_Msg_Ctrl_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_4) == 0x0000F0, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd) == 0x0000F1, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsBPI_UIManager_3) == 0x0000F8, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsBPI_UIManager_3' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_5) == 0x000108, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_BPI_GetMsgCtrl_OutActor_1) == 0x000110, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_BPI_GetMsgCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsBPI_Msg_Ctrl_2) == 0x000118, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsBPI_Msg_Ctrl_2' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_6) == 0x000128, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsBPI_Msg_Ctrl_3) == 0x000130, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsBPI_Msg_Ctrl_3' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_7) == 0x000140, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsBPI_Msg_Ctrl_4) == 0x000148, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsBPI_Msg_Ctrl_4' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_8) == 0x000158, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_GetGameInstance_ReturnValue_2) == 0x000160, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsBPI_UIManager_4) == 0x000168, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsBPI_UIManager_4' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_9) == 0x000178, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_BPI_GetUIManager_UIManager_2) == 0x000180, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_BPI_GetUIManager_UIManager_2' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsBPI_UIManager_5) == 0x000188, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsBPI_UIManager_5' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_10) == 0x000198, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_GetGameInstance_ReturnValue_3) == 0x0001A0, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_GetGameInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_BPI_GetMsgCtrl_OutActor_2) == 0x0001A8, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_BPI_GetMsgCtrl_OutActor_2' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsBPI_UIManager_6) == 0x0001B0, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsBPI_UIManager_6' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_11) == 0x0001C0, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_BPI_GetUIManager_UIManager_3) == 0x0001C8, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_BPI_GetUIManager_UIManager_3' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsBPI_Msg_Ctrl_5) == 0x0001D0, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsBPI_Msg_Ctrl_5' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_12) == 0x0001E0, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1) == 0x0001E1, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsBPI_UIManager_7) == 0x0001E8, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsBPI_UIManager_7' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_13) == 0x0001F8, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_BPI_GetMsgCtrl_OutActor_3) == 0x000200, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_BPI_GetMsgCtrl_OutActor_3' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsBPI_Msg_Ctrl_6) == 0x000208, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsBPI_Msg_Ctrl_6' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_14) == 0x000218, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsBPI_Msg_Ctrl_7) == 0x000220, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsBPI_Msg_Ctrl_7' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_15) == 0x000230, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_15' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_2) == 0x000231, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_2' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsBPI_Msg_Ctrl_8) == 0x000238, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsBPI_Msg_Ctrl_8' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_16) == 0x000248, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_16' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_GetGameInstance_ReturnValue_4) == 0x000250, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_GetGameInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsBPI_UIManager_8) == 0x000258, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsBPI_UIManager_8' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_17) == 0x000268, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_17' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_BPI_GetUIManager_UIManager_4) == 0x000270, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_BPI_GetUIManager_UIManager_4' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsBPI_UIManager_9) == 0x000278, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsBPI_UIManager_9' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_18) == 0x000288, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_18' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_BPI_GetMsgCtrl_OutActor_4) == 0x000290, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_BPI_GetMsgCtrl_OutActor_4' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsBPI_Msg_Ctrl_9) == 0x000298, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsBPI_Msg_Ctrl_9' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_19) == 0x0002A8, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_19' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsBPI_Msg_Ctrl_10) == 0x0002B0, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsBPI_Msg_Ctrl_10' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_20) == 0x0002C0, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_20' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_3) == 0x0002C1, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_3' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_GetActive_IsActive) == 0x0002C2, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_GetActive_IsActive' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, Temp_int_Array_Index_Variable) == 0x0002C4, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_IsActionPadCheck_Success_1) == 0x0002C8, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_IsActionPadCheck_Success_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_StartMapEvent_Dummy) == 0x0002C9, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_StartMapEvent_Dummy' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_IsActionPadCheck_Success_2) == 0x0002CA, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_IsActionPadCheck_Success_2' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_BooleanOR_ReturnValue) == 0x0002CB, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_EndMapEvent_Dummy) == 0x0002CC, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_EndMapEvent_Dummy' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_BooleanOR_ReturnValue_1) == 0x0002CD, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_GetPlayerPawn_ReturnValue) == 0x0002D0, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsPlayer_Base) == 0x0002D8, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsPlayer_Base' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_21) == 0x0002E0, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_21' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_GetPlayerController_ReturnValue) == 0x0002E8, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0002F0, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000320, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000328, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000330, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000338, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_Array_Get_Item) == 0x000348, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000350, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000360, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_FindLookAtRotation_ReturnValue) == 0x000368, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_REase_ReturnValue) == 0x000374, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_REase_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000380, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_GetPlayerController_ReturnValue_1) == 0x000408, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_GetViewTarget_ReturnValue) == 0x000410, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_GetAllActorsOfClass_OutActors) == 0x000418, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_Array_Get_Item_1) == 0x000428, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_Array_Length_ReturnValue) == 0x000430, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsBPI_Event_Script) == 0x000438, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsBPI_Event_Script' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_22) == 0x000448, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_22' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_SpawnReflesh_NoUse) == 0x000449, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_SpawnReflesh_NoUse' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, Temp_int_Loop_Counter_Variable) == 0x00044C, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_Less_IntInt_ReturnValue) == 0x000450, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_Add_IntInt_ReturnValue) == 0x000454, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000458, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_GetPlayerPawn_ReturnValue_2) == 0x000460, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_GetPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsPla_603) == 0x000468, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsPla_603' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_23) == 0x000470, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_23' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_AsPla_603_1) == 0x000478, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_AsPla_603_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_DynamicCast_bSuccess_24) == 0x000480, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_DynamicCast_bSuccess_24' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_IsMapEventActivateFlags_ReturnValue) == 0x000481, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_IsMapEventActivateFlags_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_IsMapEventActivateFlags_ReturnValue_1) == 0x000482, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_IsMapEventActivateFlags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_GetDefaultPlayerCameraFOV_DefaultFOV) == 0x000484, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_GetDefaultPlayerCameraFOV_DefaultFOV' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, K2Node_Event_EndPlayReason) == 0x000488, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00048C, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash, CallFunc_Ease_ReturnValue) == 0x000490, "Member 'EM_M061_TutorialSlash_C_ExecuteUbergraph_EM_M061_TutorialSlash::CallFunc_Ease_ReturnValue' has a wrong offset!");
