#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EM_M061_Q0010

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_EventMissionBase_Hit_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass EM_M061_Q0010.EM_M061_Q0010_C
// 0x00B0 (0x0378 - 0x02C8)
class AEM_M061_Q0010_C final : public ABP_EventMissionBase_Hit_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_EM_M061_Q0010_C;                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SelectIndex;                                       // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7DA3[0x4];                                     // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target;                                            // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AActor*                                 DefaultViewTarget;                                 // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 MissionEvent;                                      // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MissionId;                                         // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NkmIndex;                                          // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Def_pos;                                           // 0x0318(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EaseInOut_BlendExp;                                // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  Spawn_Actor;                                       // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           InstantCamera;                                     // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Def_FOV;                                           // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Def_Instant_Camera_Rot;                            // 0x033C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         New_FOV;                                           // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DefDevRot;                                         // 0x034C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               PLRot;                                             // 0x0358(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DA4[0x4];                                     // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventCameraBlend_C*                 CameraBlender;                                     // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADevilBase_C*                           SpawnDevilBase;                                    // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EM_M061_Q0010(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void MoveEnd2();
	void MoveEnd();
	void EvtDis_Finish______0();
	void StartMission();
	void EndMission();
	void CallDeactivate();
	void QuestExecute();
	void ReceiveBeginPlay();
	void OnLoaded_DE960BD0440397DE61A238A50C2220AF(TSubclassOf<class UObject> Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD70F3FC3B(class UObject* Loaded);
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EM_M061_Q0010_C">();
	}
	static class AEM_M061_Q0010_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEM_M061_Q0010_C>();
	}
};
static_assert(alignof(AEM_M061_Q0010_C) == 0x000008, "Wrong alignment on AEM_M061_Q0010_C");
static_assert(sizeof(AEM_M061_Q0010_C) == 0x000378, "Wrong size on AEM_M061_Q0010_C");
static_assert(offsetof(AEM_M061_Q0010_C, UberGraphFrame_EM_M061_Q0010_C) == 0x0002C8, "Member 'AEM_M061_Q0010_C::UberGraphFrame_EM_M061_Q0010_C' has a wrong offset!");
static_assert(offsetof(AEM_M061_Q0010_C, SelectIndex) == 0x0002D0, "Member 'AEM_M061_Q0010_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AEM_M061_Q0010_C, MissionMessageAsset) == 0x0002D8, "Member 'AEM_M061_Q0010_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AEM_M061_Q0010_C, Camera) == 0x0002E0, "Member 'AEM_M061_Q0010_C::Camera' has a wrong offset!");
static_assert(offsetof(AEM_M061_Q0010_C, Target) == 0x0002F0, "Member 'AEM_M061_Q0010_C::Target' has a wrong offset!");
static_assert(offsetof(AEM_M061_Q0010_C, DefaultViewTarget) == 0x000300, "Member 'AEM_M061_Q0010_C::DefaultViewTarget' has a wrong offset!");
static_assert(offsetof(AEM_M061_Q0010_C, MissionEvent) == 0x000308, "Member 'AEM_M061_Q0010_C::MissionEvent' has a wrong offset!");
static_assert(offsetof(AEM_M061_Q0010_C, MissionId) == 0x000310, "Member 'AEM_M061_Q0010_C::MissionId' has a wrong offset!");
static_assert(offsetof(AEM_M061_Q0010_C, NkmIndex) == 0x000314, "Member 'AEM_M061_Q0010_C::NkmIndex' has a wrong offset!");
static_assert(offsetof(AEM_M061_Q0010_C, Def_pos) == 0x000318, "Member 'AEM_M061_Q0010_C::Def_pos' has a wrong offset!");
static_assert(offsetof(AEM_M061_Q0010_C, EaseInOut_BlendExp) == 0x000324, "Member 'AEM_M061_Q0010_C::EaseInOut_BlendExp' has a wrong offset!");
static_assert(offsetof(AEM_M061_Q0010_C, Spawn_Actor) == 0x000328, "Member 'AEM_M061_Q0010_C::Spawn_Actor' has a wrong offset!");
static_assert(offsetof(AEM_M061_Q0010_C, InstantCamera) == 0x000330, "Member 'AEM_M061_Q0010_C::InstantCamera' has a wrong offset!");
static_assert(offsetof(AEM_M061_Q0010_C, Def_FOV) == 0x000338, "Member 'AEM_M061_Q0010_C::Def_FOV' has a wrong offset!");
static_assert(offsetof(AEM_M061_Q0010_C, Def_Instant_Camera_Rot) == 0x00033C, "Member 'AEM_M061_Q0010_C::Def_Instant_Camera_Rot' has a wrong offset!");
static_assert(offsetof(AEM_M061_Q0010_C, New_FOV) == 0x000348, "Member 'AEM_M061_Q0010_C::New_FOV' has a wrong offset!");
static_assert(offsetof(AEM_M061_Q0010_C, DefDevRot) == 0x00034C, "Member 'AEM_M061_Q0010_C::DefDevRot' has a wrong offset!");
static_assert(offsetof(AEM_M061_Q0010_C, PLRot) == 0x000358, "Member 'AEM_M061_Q0010_C::PLRot' has a wrong offset!");
static_assert(offsetof(AEM_M061_Q0010_C, CameraBlender) == 0x000368, "Member 'AEM_M061_Q0010_C::CameraBlender' has a wrong offset!");
static_assert(offsetof(AEM_M061_Q0010_C, SpawnDevilBase) == 0x000370, "Member 'AEM_M061_Q0010_C::SpawnDevilBase' has a wrong offset!");

}

