#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EM_M061_DevilTalk

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_EventMissionBase_Hit_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass EM_M061_DevilTalk.EM_M061_DevilTalk_C
// 0x0158 (0x0420 - 0x02C8)
class AEM_M061_DevilTalk_C final : public ABP_EventMissionBase_Hit_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_EM_M061_DevilTalk_C;                // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         _______11_move_4EB13EBA41FE16ADBD8BA98C255250AD;   // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______11__Direction_4EB13EBA41FE16ADBD8BA98C255250AD; // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C87E[0x3];                                     // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______11;                                         // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______10_move_06E28D3D4B44BA25FA289CBA573F4A86;   // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______10__Direction_06E28D3D4B44BA25FA289CBA573F4A86; // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C87F[0x3];                                     // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______10;                                         // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______9_move_AC6CE5EB491E11DF06D9ECAC2B258ECF;    // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______9__Direction_AC6CE5EB491E11DF06D9ECAC2B258ECF; // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C880[0x3];                                     // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______9;                                          // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______8_move_D2B12A2D488E8E060A506CBBDB0F3FB4;    // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______8__Direction_D2B12A2D488E8E060A506CBBDB0F3FB4; // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C881[0x3];                                     // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______8;                                          // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______7_move_D8A2CD5246B993FC9715DCBBA870B64D;    // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______7__Direction_D8A2CD5246B993FC9715DCBBA870B64D; // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C882[0x3];                                     // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______7;                                          // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______4_move_3799FD594C793383DB6C0B96F9F59641;    // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______4__Direction_3799FD594C793383DB6C0B96F9F59641; // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C883[0x3];                                     // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______4;                                          // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______6_move_E78086F042834868F086629AC49949E8;    // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______6__Direction_E78086F042834868F086629AC49949E8; // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C884[0x3];                                     // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______6;                                          // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______5_move_A7457EB0429FC064B25470B4C599D7B7;    // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______5__Direction_A7457EB0429FC064B25470B4C599D7B7; // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C885[0x3];                                     // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______5;                                          // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______1_FOV_82CFB2DC40DC8CB542AAC996DE526323;     // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______1__Direction_82CFB2DC40DC8CB542AAC996DE526323; // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C886[0x3];                                     // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______1;                                          // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______3_Rot_74EB345645605F2C729141BBBD20DA68;     // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______3__Direction_74EB345645605F2C729141BBBD20DA68; // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C887[0x3];                                     // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______3;                                          // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______2_FOV_47BD9AE34E9D37C6B2464ABC4531A85C;     // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______2__Direction_47BD9AE34E9D37C6B2464ABC4531A85C; // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C888[0x3];                                     // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______2;                                          // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectIndex;                                       // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C889[0x4];                                     // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 Mission_Event;                                     // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x03A0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target;                                            // 0x03B0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ACharaBase_C*                           SpawnActor;                                        // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DefaultViewTarget;                                 // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           InstantCamera;                                     // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefFOV;                                            // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DefInstantCameraRot;                               // 0x03DC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               DefDevRot;                                         // 0x03E8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               PLRot;                                             // 0x03F4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         NewFOV;                                            // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C88A[0x4];                                     // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  NaviDevil;                                         // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraBlend_C*                 CameraBlendr;                                      // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTimelineComponent*                     AutoMove;                                          // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EM_M061_DevilTalk(int32 EntryPoint);
	void BattleEnd();
	void OnDestroyed______0(class AActor* DestroyedActor);
	void CameraMove();
	void Dev059_Move1();
	void EvtDis_FinishComplete();
	void EvtDis_Finish();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void MoveFinish();
	void Dev059_Move2();
	void PL_Move();
	void CallDeactivate();
	void QuestExecute();
	void ReceiveBeginPlay();
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDF36BE550(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD758E8AD5(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD651128BF(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD31DDEC77(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDEC2476D4(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD2DC2ABB2(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD208F13AD(class UObject* Loaded);
	void _______5__UpdateFunc();
	void _______5__FinishedFunc();
	void _______6__UpdateFunc();
	void _______6__FinishedFunc();
	void _______4__UpdateFunc();
	void _______4__FinishedFunc();
	void _______7__UpdateFunc();
	void _______7__FinishedFunc();
	void _______10__UpdateFunc();
	void _______10__FinishedFunc();
	void _______11__UpdateFunc();
	void _______11__FinishedFunc();
	void _______2__UpdateFunc();
	void _______2__FinishedFunc();
	void _______3__UpdateFunc();
	void _______3__FinishedFunc();
	void _______8__UpdateFunc();
	void _______8__FinishedFunc();
	void _______9__UpdateFunc();
	void _______9__FinishedFunc();
	void _______1__UpdateFunc();
	void _______1__FinishedFunc();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EM_M061_DevilTalk_C">();
	}
	static class AEM_M061_DevilTalk_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEM_M061_DevilTalk_C>();
	}
};
static_assert(alignof(AEM_M061_DevilTalk_C) == 0x000008, "Wrong alignment on AEM_M061_DevilTalk_C");
static_assert(sizeof(AEM_M061_DevilTalk_C) == 0x000420, "Wrong size on AEM_M061_DevilTalk_C");
static_assert(offsetof(AEM_M061_DevilTalk_C, UberGraphFrame_EM_M061_DevilTalk_C) == 0x0002C8, "Member 'AEM_M061_DevilTalk_C::UberGraphFrame_EM_M061_DevilTalk_C' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______11_move_4EB13EBA41FE16ADBD8BA98C255250AD) == 0x0002D0, "Member 'AEM_M061_DevilTalk_C::_______11_move_4EB13EBA41FE16ADBD8BA98C255250AD' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______11__Direction_4EB13EBA41FE16ADBD8BA98C255250AD) == 0x0002D4, "Member 'AEM_M061_DevilTalk_C::_______11__Direction_4EB13EBA41FE16ADBD8BA98C255250AD' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______11) == 0x0002D8, "Member 'AEM_M061_DevilTalk_C::_______11' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______10_move_06E28D3D4B44BA25FA289CBA573F4A86) == 0x0002E0, "Member 'AEM_M061_DevilTalk_C::_______10_move_06E28D3D4B44BA25FA289CBA573F4A86' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______10__Direction_06E28D3D4B44BA25FA289CBA573F4A86) == 0x0002E4, "Member 'AEM_M061_DevilTalk_C::_______10__Direction_06E28D3D4B44BA25FA289CBA573F4A86' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______10) == 0x0002E8, "Member 'AEM_M061_DevilTalk_C::_______10' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______9_move_AC6CE5EB491E11DF06D9ECAC2B258ECF) == 0x0002F0, "Member 'AEM_M061_DevilTalk_C::_______9_move_AC6CE5EB491E11DF06D9ECAC2B258ECF' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______9__Direction_AC6CE5EB491E11DF06D9ECAC2B258ECF) == 0x0002F4, "Member 'AEM_M061_DevilTalk_C::_______9__Direction_AC6CE5EB491E11DF06D9ECAC2B258ECF' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______9) == 0x0002F8, "Member 'AEM_M061_DevilTalk_C::_______9' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______8_move_D2B12A2D488E8E060A506CBBDB0F3FB4) == 0x000300, "Member 'AEM_M061_DevilTalk_C::_______8_move_D2B12A2D488E8E060A506CBBDB0F3FB4' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______8__Direction_D2B12A2D488E8E060A506CBBDB0F3FB4) == 0x000304, "Member 'AEM_M061_DevilTalk_C::_______8__Direction_D2B12A2D488E8E060A506CBBDB0F3FB4' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______8) == 0x000308, "Member 'AEM_M061_DevilTalk_C::_______8' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______7_move_D8A2CD5246B993FC9715DCBBA870B64D) == 0x000310, "Member 'AEM_M061_DevilTalk_C::_______7_move_D8A2CD5246B993FC9715DCBBA870B64D' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______7__Direction_D8A2CD5246B993FC9715DCBBA870B64D) == 0x000314, "Member 'AEM_M061_DevilTalk_C::_______7__Direction_D8A2CD5246B993FC9715DCBBA870B64D' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______7) == 0x000318, "Member 'AEM_M061_DevilTalk_C::_______7' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______4_move_3799FD594C793383DB6C0B96F9F59641) == 0x000320, "Member 'AEM_M061_DevilTalk_C::_______4_move_3799FD594C793383DB6C0B96F9F59641' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______4__Direction_3799FD594C793383DB6C0B96F9F59641) == 0x000324, "Member 'AEM_M061_DevilTalk_C::_______4__Direction_3799FD594C793383DB6C0B96F9F59641' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______4) == 0x000328, "Member 'AEM_M061_DevilTalk_C::_______4' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______6_move_E78086F042834868F086629AC49949E8) == 0x000330, "Member 'AEM_M061_DevilTalk_C::_______6_move_E78086F042834868F086629AC49949E8' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______6__Direction_E78086F042834868F086629AC49949E8) == 0x000334, "Member 'AEM_M061_DevilTalk_C::_______6__Direction_E78086F042834868F086629AC49949E8' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______6) == 0x000338, "Member 'AEM_M061_DevilTalk_C::_______6' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______5_move_A7457EB0429FC064B25470B4C599D7B7) == 0x000340, "Member 'AEM_M061_DevilTalk_C::_______5_move_A7457EB0429FC064B25470B4C599D7B7' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______5__Direction_A7457EB0429FC064B25470B4C599D7B7) == 0x000344, "Member 'AEM_M061_DevilTalk_C::_______5__Direction_A7457EB0429FC064B25470B4C599D7B7' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______5) == 0x000348, "Member 'AEM_M061_DevilTalk_C::_______5' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______1_FOV_82CFB2DC40DC8CB542AAC996DE526323) == 0x000350, "Member 'AEM_M061_DevilTalk_C::_______1_FOV_82CFB2DC40DC8CB542AAC996DE526323' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______1__Direction_82CFB2DC40DC8CB542AAC996DE526323) == 0x000354, "Member 'AEM_M061_DevilTalk_C::_______1__Direction_82CFB2DC40DC8CB542AAC996DE526323' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______1) == 0x000358, "Member 'AEM_M061_DevilTalk_C::_______1' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______3_Rot_74EB345645605F2C729141BBBD20DA68) == 0x000360, "Member 'AEM_M061_DevilTalk_C::_______3_Rot_74EB345645605F2C729141BBBD20DA68' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______3__Direction_74EB345645605F2C729141BBBD20DA68) == 0x000364, "Member 'AEM_M061_DevilTalk_C::_______3__Direction_74EB345645605F2C729141BBBD20DA68' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______3) == 0x000368, "Member 'AEM_M061_DevilTalk_C::_______3' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______2_FOV_47BD9AE34E9D37C6B2464ABC4531A85C) == 0x000370, "Member 'AEM_M061_DevilTalk_C::_______2_FOV_47BD9AE34E9D37C6B2464ABC4531A85C' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______2__Direction_47BD9AE34E9D37C6B2464ABC4531A85C) == 0x000374, "Member 'AEM_M061_DevilTalk_C::_______2__Direction_47BD9AE34E9D37C6B2464ABC4531A85C' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, _______2) == 0x000378, "Member 'AEM_M061_DevilTalk_C::_______2' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, SelectIndex) == 0x000380, "Member 'AEM_M061_DevilTalk_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, SystemMessageAsset) == 0x000388, "Member 'AEM_M061_DevilTalk_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, MissionMessageAsset) == 0x000390, "Member 'AEM_M061_DevilTalk_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, Mission_Event) == 0x000398, "Member 'AEM_M061_DevilTalk_C::Mission_Event' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, Camera) == 0x0003A0, "Member 'AEM_M061_DevilTalk_C::Camera' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, Target) == 0x0003B0, "Member 'AEM_M061_DevilTalk_C::Target' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, SpawnActor) == 0x0003C0, "Member 'AEM_M061_DevilTalk_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, DefaultViewTarget) == 0x0003C8, "Member 'AEM_M061_DevilTalk_C::DefaultViewTarget' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, InstantCamera) == 0x0003D0, "Member 'AEM_M061_DevilTalk_C::InstantCamera' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, DefFOV) == 0x0003D8, "Member 'AEM_M061_DevilTalk_C::DefFOV' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, DefInstantCameraRot) == 0x0003DC, "Member 'AEM_M061_DevilTalk_C::DefInstantCameraRot' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, DefDevRot) == 0x0003E8, "Member 'AEM_M061_DevilTalk_C::DefDevRot' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, PLRot) == 0x0003F4, "Member 'AEM_M061_DevilTalk_C::PLRot' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, NewFOV) == 0x000400, "Member 'AEM_M061_DevilTalk_C::NewFOV' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, NaviDevil) == 0x000408, "Member 'AEM_M061_DevilTalk_C::NaviDevil' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, CameraBlendr) == 0x000410, "Member 'AEM_M061_DevilTalk_C::CameraBlendr' has a wrong offset!");
static_assert(offsetof(AEM_M061_DevilTalk_C, AutoMove) == 0x000418, "Member 'AEM_M061_DevilTalk_C::AutoMove' has a wrong offset!");

}

