#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EM_M061_Foothold

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EM_M061_Foothold.EM_M061_Foothold_C.ExecuteUbergraph_EM_M061_Foothold
// 0x03C0 (0x03C0 - 0x0000)
struct EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C706[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraBlend_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C707[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C708[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl;                 // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C709[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_1;               // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C70A[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_2;               // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C70B[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_3;               // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IIsFinishedWindowOut_OutFinished;         // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetActive_IsActive;                       // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C70C[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartMapEvent_Dummy;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C70D[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C70E[0x3];                                     // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FadeOutMapEvent_Delay;                    // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_1;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_3;              // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C70F[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_1;                // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FadeInMapEvent_Delay;                     // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C710[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_4;               // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C711[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_5;               // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C712[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_6;               // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EndMapEvent_Dummy;                        // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C713[0x2];                                     // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetPoint*                           CallFunc_Array_Get_Item;                           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x01A0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetPoint*                           CallFunc_Array_Get_Item_1;                         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADev258_Simple_C*                       CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C714[0x8];                                     // 0x01E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x01F0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C715[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADev258_Simple_C*                       CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGazeTarget>           K2Node_DynamicCast_AsGaze_Target;                  // 0x0238(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C716[0x6];                                     // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGazeTarget>           K2Node_DynamicCast_AsGaze_Target_1;                // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C717[0x3];                                     // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C718[0x4];                                     // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_4;              // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C719[0x3];                                     // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_2;             // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_5;              // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C71A[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_2;                // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C71B[0x7];                                     // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_7;               // 0x02C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C71C[0x7];                                     // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_8;               // 0x02E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd;             // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C71D[0x6];                                     // 0x02F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CallFunc_Array_Get_Item_3;                         // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerBase_C*                          K2Node_DynamicCast_AsPlayer_Base;                  // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C71E[0x7];                                     // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATargetPoint*                           CallFunc_Array_Get_Item_4;                         // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0330(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x033C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CallFunc_Array_Get_Item_5;                         // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FadeOutMapEvent_Delay_1;                  // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FadeInMapEvent_Delay_1;                   // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerBase_C*                          K2Node_DynamicCast_AsPlayer_Base_1;                // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C71F[0x7];                                     // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATargetPoint*                           CallFunc_Array_Get_Item_6;                         // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetPoint*                           CallFunc_Array_Get_Item_7;                         // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x038C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGazeTargetHolder*                      CallFunc_GetGazeTargetHolder_ReturnValue;          // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_1;             // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_2;             // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_3;             // 0x03A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_4;             // 0x03A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x03A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C720[0x2];                                     // 0x03A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C721[0x4];                                     // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGazeTargetHolder*                      CallFunc_GetGazeTargetHolder_ReturnValue_1;        // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C722[0x3];                                     // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold) == 0x000010, "Wrong alignment on EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold");
static_assert(sizeof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold) == 0x0003C0, "Wrong size on EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, EntryPoint) == 0x000000, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::EntryPoint' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_GetGameInstance_ReturnValue) == 0x000048, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_FinishSpawningActor_ReturnValue) == 0x000050, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_AsBPI_UIManager) == 0x000058, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_BPI_GetUIManager_UIManager) == 0x000070, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000078, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_BPI_GetMsgCtrl_OutActor) == 0x000090, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_BPI_GetMsgCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_AsBPI_Msg_Ctrl) == 0x000098, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_AsBPI_Msg_Ctrl' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_AsBPI_Msg_Ctrl_1) == 0x0000B0, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_AsBPI_Msg_Ctrl_1' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_bSuccess_3) == 0x0000C0, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_AsBPI_Msg_Ctrl_2) == 0x0000C8, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_AsBPI_Msg_Ctrl_2' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_bSuccess_4) == 0x0000D8, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_AsBPI_Msg_Ctrl_3) == 0x0000E0, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_AsBPI_Msg_Ctrl_3' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_bSuccess_5) == 0x0000F0, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_IIsFinishedWindowOut_OutFinished) == 0x0000F1, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_IIsFinishedWindowOut_OutFinished' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_CheckEventFlag_ReturnValue) == 0x0000F2, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_GetActive_IsActive) == 0x0000F3, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_GetActive_IsActive' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_GetGameInstance_ReturnValue_1) == 0x0000F8, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_StartMapEvent_Dummy) == 0x000100, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_StartMapEvent_Dummy' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_AsBPI_UIManager_2) == 0x000108, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_AsBPI_UIManager_2' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_bSuccess_6) == 0x000118, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_FadeOutMapEvent_Delay) == 0x00011C, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_FadeOutMapEvent_Delay' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_BPI_GetUIManager_UIManager_1) == 0x000120, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_BPI_GetUIManager_UIManager_1' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_AsBPI_UIManager_3) == 0x000128, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_AsBPI_UIManager_3' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_bSuccess_7) == 0x000138, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_BPI_GetMsgCtrl_OutActor_1) == 0x000140, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_BPI_GetMsgCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_FadeInMapEvent_Delay) == 0x000148, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_FadeInMapEvent_Delay' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_AsBPI_Msg_Ctrl_4) == 0x000150, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_AsBPI_Msg_Ctrl_4' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_bSuccess_8) == 0x000160, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_AsBPI_Msg_Ctrl_5) == 0x000168, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_AsBPI_Msg_Ctrl_5' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_bSuccess_9) == 0x000178, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_AsBPI_Msg_Ctrl_6) == 0x000180, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_AsBPI_Msg_Ctrl_6' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_bSuccess_10) == 0x000190, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_EndMapEvent_Dummy) == 0x000191, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_EndMapEvent_Dummy' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_Array_Length_ReturnValue) == 0x000194, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_Array_Get_Item) == 0x000198, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_GetTransform_ReturnValue) == 0x0001A0, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0001D0, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_Array_Get_Item_1) == 0x0001D8, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0001E0, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_GetTransform_ReturnValue_1) == 0x0001F0, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_IsValid_ReturnValue) == 0x000220, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000228, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000230, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_AsGaze_Target) == 0x000238, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_AsGaze_Target' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_bSuccess_11) == 0x000248, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_IsValid_ReturnValue_1) == 0x000249, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_AsGaze_Target_1) == 0x000250, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_AsGaze_Target_1' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_bSuccess_12) == 0x000260, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_Array_Add_ReturnValue) == 0x000264, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_GetGameInstance_ReturnValue_2) == 0x000268, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_Array_Add_ReturnValue_1) == 0x000270, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_AsBPI_UIManager_4) == 0x000278, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_AsBPI_UIManager_4' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_bSuccess_13) == 0x000288, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, Temp_int_Array_Index_Variable) == 0x00028C, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_BPI_GetUIManager_UIManager_2) == 0x000290, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_BPI_GetUIManager_UIManager_2' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_Array_Get_Item_2) == 0x000298, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_AsBPI_UIManager_5) == 0x0002A0, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_AsBPI_UIManager_5' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_bSuccess_14) == 0x0002B0, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_BPI_GetMsgCtrl_OutActor_2) == 0x0002B8, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_BPI_GetMsgCtrl_OutActor_2' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_IsValid_ReturnValue_2) == 0x0002C0, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_AsBPI_Msg_Ctrl_7) == 0x0002C8, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_AsBPI_Msg_Ctrl_7' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_bSuccess_15) == 0x0002D8, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_bSuccess_15' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_AsBPI_Msg_Ctrl_8) == 0x0002E0, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_AsBPI_Msg_Ctrl_8' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_bSuccess_16) == 0x0002F0, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_bSuccess_16' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd) == 0x0002F1, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_GetPlayerController_ReturnValue) == 0x0002F8, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_GetViewTarget_ReturnValue) == 0x000300, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_Array_Get_Item_3) == 0x000308, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_GetPlayerPawn_ReturnValue) == 0x000310, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_AsPlayer_Base) == 0x000318, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_AsPlayer_Base' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_bSuccess_17) == 0x000320, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_bSuccess_17' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_Array_Get_Item_4) == 0x000328, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000330, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00033C, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_Array_Get_Item_5) == 0x000348, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_FadeOutMapEvent_Delay_1) == 0x000350, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_FadeOutMapEvent_Delay_1' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_FadeInMapEvent_Delay_1) == 0x000354, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_FadeInMapEvent_Delay_1' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000358, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_AsPlayer_Base_1) == 0x000360, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_AsPlayer_Base_1' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_DynamicCast_bSuccess_18) == 0x000368, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_DynamicCast_bSuccess_18' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_Array_Get_Item_6) == 0x000370, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_Array_Get_Item_7) == 0x000378, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x000380, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00038C, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_GetGazeTargetHolder_ReturnValue) == 0x000398, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_GetGazeTargetHolder_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_CheckEventFlag_ReturnValue_1) == 0x0003A0, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_CheckEventFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_CheckEventFlag_ReturnValue_2) == 0x0003A1, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_CheckEventFlag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_CheckEventFlag_ReturnValue_3) == 0x0003A2, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_CheckEventFlag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_CheckEventFlag_ReturnValue_4) == 0x0003A3, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_CheckEventFlag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, K2Node_Event_EndPlayReason) == 0x0003A4, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_IsValid_ReturnValue_3) == 0x0003A5, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, Temp_int_Loop_Counter_Variable) == 0x0003A8, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_GetGazeTargetHolder_ReturnValue_1) == 0x0003B0, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_GetGazeTargetHolder_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_Less_IntInt_ReturnValue) == 0x0003B8, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold, CallFunc_Add_IntInt_ReturnValue) == 0x0003BC, "Member 'EM_M061_Foothold_C_ExecuteUbergraph_EM_M061_Foothold::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function EM_M061_Foothold.EM_M061_Foothold_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct EM_M061_Foothold_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EM_M061_Foothold_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on EM_M061_Foothold_C_ReceiveEndPlay");
static_assert(sizeof(EM_M061_Foothold_C_ReceiveEndPlay) == 0x000001, "Wrong size on EM_M061_Foothold_C_ReceiveEndPlay");
static_assert(offsetof(EM_M061_Foothold_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'EM_M061_Foothold_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

