#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EM_M061_TutorialMagatsuka2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_EventMissionBase_Direct_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass EM_M061_TutorialMagatsuka2.EM_M061_TutorialMagatsuka2_C
// 0x0048 (0x0308 - 0x02C0)
class AEM_M061_TutorialMagatsuka2_C final : public ABP_EventMissionBase_Direct_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_EM_M061_TutorialMagatsuka2_C;       // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SelectIndex;                                       // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BEAE[0x4];                                     // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target;                                            // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         DBaseID;                                           // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EM_M061_TutorialMagatsuka2(int32 EntryPoint);
	void QuestExecute();
	void CallDeactivate();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EM_M061_TutorialMagatsuka2_C">();
	}
	static class AEM_M061_TutorialMagatsuka2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEM_M061_TutorialMagatsuka2_C>();
	}
};
static_assert(alignof(AEM_M061_TutorialMagatsuka2_C) == 0x000008, "Wrong alignment on AEM_M061_TutorialMagatsuka2_C");
static_assert(sizeof(AEM_M061_TutorialMagatsuka2_C) == 0x000308, "Wrong size on AEM_M061_TutorialMagatsuka2_C");
static_assert(offsetof(AEM_M061_TutorialMagatsuka2_C, UberGraphFrame_EM_M061_TutorialMagatsuka2_C) == 0x0002C0, "Member 'AEM_M061_TutorialMagatsuka2_C::UberGraphFrame_EM_M061_TutorialMagatsuka2_C' has a wrong offset!");
static_assert(offsetof(AEM_M061_TutorialMagatsuka2_C, SelectIndex) == 0x0002C8, "Member 'AEM_M061_TutorialMagatsuka2_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AEM_M061_TutorialMagatsuka2_C, SystemMessageAsset) == 0x0002D0, "Member 'AEM_M061_TutorialMagatsuka2_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AEM_M061_TutorialMagatsuka2_C, MissionMessageAsset) == 0x0002D8, "Member 'AEM_M061_TutorialMagatsuka2_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AEM_M061_TutorialMagatsuka2_C, Camera) == 0x0002E0, "Member 'AEM_M061_TutorialMagatsuka2_C::Camera' has a wrong offset!");
static_assert(offsetof(AEM_M061_TutorialMagatsuka2_C, Target) == 0x0002F0, "Member 'AEM_M061_TutorialMagatsuka2_C::Target' has a wrong offset!");
static_assert(offsetof(AEM_M061_TutorialMagatsuka2_C, DBaseID) == 0x000300, "Member 'AEM_M061_TutorialMagatsuka2_C::DBaseID' has a wrong offset!");

}

