#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EM_M061_EM0021

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_EventMissionBase_Hit_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass EM_M061_EM0021.EM_M061_EM0021_C
// 0x00D0 (0x0398 - 0x02C8)
class AEM_M061_EM0021_C final : public ABP_EventMissionBase_Hit_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_EM_M061_EM0021_C;                   // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         _______3_rot_7EA2CCFE418D6B6BF287F9AF6BFA9816;     // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______3__Direction_7EA2CCFE418D6B6BF287F9AF6BFA9816; // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B1A[0x3];                                     // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______3;                                          // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______2__Direction_1C34506042E8C5026306AAAF925D27B4; // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B1B[0x7];                                     // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______2;                                          // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______1_FOV_37EA4A10483666B34036BE8EDA4E13D2;     // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______1__Direction_37EA4A10483666B34036BE8EDA4E13D2; // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B1C[0x3];                                     // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______1;                                          // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______0_rot_494949484F860ED95857C783D0E0BD54;     // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______0__Direction_494949484F860ED95857C783D0E0BD54; // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B1D[0x3];                                     // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______0;                                          // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectIndex;                                       // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B1E[0x4];                                     // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 Mission_Event;                                     // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ABP_EventCameraBlend_C*                 CameraBlender;                                     // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DefCamera;                                         // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           InstantCamera;                                     // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefFOV;                                            // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DefInstatCameraRoll;                               // 0x036C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class APawn*                                  NaviDevil;                                         // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Emitter;                                           // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetPoint*                           EffectTarget;                                      // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewFOV;                                            // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EM_M061_EM0021(int32 EntryPoint);
	void EvtDis_FinishComplete();
	void EvtDis_Finish();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void StopShake();
	void CameraShake();
	void CallDeactivate();
	void CheckActive();
	void QuestExecute();
	void ReceiveBeginPlay();
	void StartEffect();
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD647CFD7F(class UObject* Loaded);
	void _______3__UpdateFunc();
	void _______3__FinishedFunc();
	void _______2__UpdateFunc();
	void _______2__FinishedFunc();
	void _______1__UpdateFunc();
	void _______1__FinishedFunc();
	void _______0__UpdateFunc();
	void _______0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EM_M061_EM0021_C">();
	}
	static class AEM_M061_EM0021_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEM_M061_EM0021_C>();
	}
};
static_assert(alignof(AEM_M061_EM0021_C) == 0x000008, "Wrong alignment on AEM_M061_EM0021_C");
static_assert(sizeof(AEM_M061_EM0021_C) == 0x000398, "Wrong size on AEM_M061_EM0021_C");
static_assert(offsetof(AEM_M061_EM0021_C, UberGraphFrame_EM_M061_EM0021_C) == 0x0002C8, "Member 'AEM_M061_EM0021_C::UberGraphFrame_EM_M061_EM0021_C' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, _______3_rot_7EA2CCFE418D6B6BF287F9AF6BFA9816) == 0x0002D0, "Member 'AEM_M061_EM0021_C::_______3_rot_7EA2CCFE418D6B6BF287F9AF6BFA9816' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, _______3__Direction_7EA2CCFE418D6B6BF287F9AF6BFA9816) == 0x0002D4, "Member 'AEM_M061_EM0021_C::_______3__Direction_7EA2CCFE418D6B6BF287F9AF6BFA9816' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, _______3) == 0x0002D8, "Member 'AEM_M061_EM0021_C::_______3' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, _______2__Direction_1C34506042E8C5026306AAAF925D27B4) == 0x0002E0, "Member 'AEM_M061_EM0021_C::_______2__Direction_1C34506042E8C5026306AAAF925D27B4' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, _______2) == 0x0002E8, "Member 'AEM_M061_EM0021_C::_______2' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, _______1_FOV_37EA4A10483666B34036BE8EDA4E13D2) == 0x0002F0, "Member 'AEM_M061_EM0021_C::_______1_FOV_37EA4A10483666B34036BE8EDA4E13D2' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, _______1__Direction_37EA4A10483666B34036BE8EDA4E13D2) == 0x0002F4, "Member 'AEM_M061_EM0021_C::_______1__Direction_37EA4A10483666B34036BE8EDA4E13D2' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, _______1) == 0x0002F8, "Member 'AEM_M061_EM0021_C::_______1' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, _______0_rot_494949484F860ED95857C783D0E0BD54) == 0x000300, "Member 'AEM_M061_EM0021_C::_______0_rot_494949484F860ED95857C783D0E0BD54' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, _______0__Direction_494949484F860ED95857C783D0E0BD54) == 0x000304, "Member 'AEM_M061_EM0021_C::_______0__Direction_494949484F860ED95857C783D0E0BD54' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, _______0) == 0x000308, "Member 'AEM_M061_EM0021_C::_______0' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, SelectIndex) == 0x000310, "Member 'AEM_M061_EM0021_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, SystemMessageAsset) == 0x000318, "Member 'AEM_M061_EM0021_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, MissionMessageAsset) == 0x000320, "Member 'AEM_M061_EM0021_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, Mission_Event) == 0x000328, "Member 'AEM_M061_EM0021_C::Mission_Event' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, Camera) == 0x000330, "Member 'AEM_M061_EM0021_C::Camera' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, Target) == 0x000340, "Member 'AEM_M061_EM0021_C::Target' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, CameraBlender) == 0x000350, "Member 'AEM_M061_EM0021_C::CameraBlender' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, DefCamera) == 0x000358, "Member 'AEM_M061_EM0021_C::DefCamera' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, InstantCamera) == 0x000360, "Member 'AEM_M061_EM0021_C::InstantCamera' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, DefFOV) == 0x000368, "Member 'AEM_M061_EM0021_C::DefFOV' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, DefInstatCameraRoll) == 0x00036C, "Member 'AEM_M061_EM0021_C::DefInstatCameraRoll' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, NaviDevil) == 0x000378, "Member 'AEM_M061_EM0021_C::NaviDevil' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, Emitter) == 0x000380, "Member 'AEM_M061_EM0021_C::Emitter' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, EffectTarget) == 0x000388, "Member 'AEM_M061_EM0021_C::EffectTarget' has a wrong offset!");
static_assert(offsetof(AEM_M061_EM0021_C, NewFOV) == 0x000390, "Member 'AEM_M061_EM0021_C::NewFOV' has a wrong offset!");

}

