#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EM_M061_MimanTutorial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EM_M061_MimanTutorial.EM_M061_MimanTutorial_C.ExecuteUbergraph_EM_M061_MimanTutorial
// 0x03D0 (0x03D0 - 0x0000)
struct EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C863[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraBlend_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActive_IsActive;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C864[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C865[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C866[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartMapEvent_Dummy;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C867[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C868[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_EventScriptArea_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x00B0(0x0010)(ReferenceParm)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl;                 // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C869[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventScriptArea_C*                  CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C86A[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EventScript_C>    K2Node_DynamicCast_AsBPI_Event_Script;             // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C86B[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_1;               // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SpawnReflesh_NoUse;                       // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd;             // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C86C[0x1];                                     // 0x0113(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EndMapEvent_Dummy;                        // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C86D[0x2];                                     // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C86E[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_1;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerBase_C*                          K2Node_DynamicCast_AsPlayer_Base;                  // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C86F[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_3;              // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C870[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_1;                // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_2;               // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C871[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_3;               // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C872[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_4;               // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C873[0xF];                                     // 0x01C1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x01D0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C874[0x4];                                     // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetPoint*                           CallFunc_Array_Get_Item_1;                         // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_REase_ReturnValue;                        // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0274(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsMapEventActivateFlags_ReturnValue;      // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMapEventActivateFlags_ReturnValue_1;    // 0x02FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C875[0x2];                                     // 0x02FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDefaultPlayerCameraFOV_DefaultFOV;     // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C876[0x3];                                     // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C877[0x7];                                     // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_4;              // 0x0320(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C878[0x7];                                     // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_2;             // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_5;              // 0x0340(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C879[0x7];                                     // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_2;                // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_5;               // 0x0360(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C87A[0x7];                                     // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_6;               // 0x0378(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IIsFinishedWindowOut_OutFinished;         // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C87B[0x6];                                     // 0x038A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_7;               // 0x0390(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C87C[0x7];                                     // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_8;               // 0x03A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C87D[0x3];                                     // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x03BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial) == 0x000010, "Wrong alignment on EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial");
static_assert(sizeof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial) == 0x0003D0, "Wrong size on EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, EntryPoint) == 0x000000, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::EntryPoint' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_GetActive_IsActive) == 0x000050, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_GetActive_IsActive' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_GetGameInstance_ReturnValue) == 0x000058, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, Temp_int_Array_Index_Variable) == 0x000060, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_AsBPI_UIManager) == 0x000068, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_BPI_GetUIManager_UIManager) == 0x000080, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_StartMapEvent_Dummy) == 0x000088, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_StartMapEvent_Dummy' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000090, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_BPI_GetMsgCtrl_OutActor) == 0x0000A8, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_BPI_GetMsgCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000B0, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_AsBPI_Msg_Ctrl) == 0x0000C0, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_AsBPI_Msg_Ctrl' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_bSuccess_2) == 0x0000D0, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_Array_Length_ReturnValue) == 0x0000E0, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_AsBPI_Event_Script) == 0x0000E8, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_AsBPI_Event_Script' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_bSuccess_3) == 0x0000F8, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_AsBPI_Msg_Ctrl_1) == 0x000100, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_AsBPI_Msg_Ctrl_1' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_bSuccess_4) == 0x000110, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_SpawnReflesh_NoUse) == 0x000111, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_SpawnReflesh_NoUse' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd) == 0x000112, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, Temp_int_Loop_Counter_Variable) == 0x000114, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_EndMapEvent_Dummy) == 0x000118, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_EndMapEvent_Dummy' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_Less_IntInt_ReturnValue) == 0x000119, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_Add_IntInt_ReturnValue) == 0x00011C, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_GetGameInstance_ReturnValue_1) == 0x000120, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_AsBPI_UIManager_2) == 0x000128, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_AsBPI_UIManager_2' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_bSuccess_5) == 0x000138, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_GetPlayerPawn_ReturnValue) == 0x000140, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_BPI_GetUIManager_UIManager_1) == 0x000148, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_BPI_GetUIManager_UIManager_1' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_AsPlayer_Base) == 0x000150, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_AsPlayer_Base' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_bSuccess_6) == 0x000158, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_AsBPI_UIManager_3) == 0x000160, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_AsBPI_UIManager_3' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_bSuccess_7) == 0x000170, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_BPI_GetMsgCtrl_OutActor_1) == 0x000178, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_BPI_GetMsgCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_AsBPI_Msg_Ctrl_2) == 0x000180, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_AsBPI_Msg_Ctrl_2' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_bSuccess_8) == 0x000190, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_AsBPI_Msg_Ctrl_3) == 0x000198, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_AsBPI_Msg_Ctrl_3' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_bSuccess_9) == 0x0001A8, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_AsBPI_Msg_Ctrl_4) == 0x0001B0, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_AsBPI_Msg_Ctrl_4' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_bSuccess_10) == 0x0001C0, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0001D0, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000200, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000208, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_GetPlayerController_ReturnValue) == 0x000210, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000218, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000220, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000230, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_GetPlayerController_ReturnValue_1) == 0x000238, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_Array_Get_Item_1) == 0x000240, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_GetViewTarget_ReturnValue) == 0x000248, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000250, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_FindLookAtRotation_ReturnValue) == 0x00025C, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_REase_ReturnValue) == 0x000268, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_REase_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000274, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_IsMapEventActivateFlags_ReturnValue) == 0x0002FC, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_IsMapEventActivateFlags_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_IsMapEventActivateFlags_ReturnValue_1) == 0x0002FD, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_IsMapEventActivateFlags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_GetDefaultPlayerCameraFOV_DefaultFOV) == 0x000300, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_GetDefaultPlayerCameraFOV_DefaultFOV' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_Event_EndPlayReason) == 0x000304, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000308, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_Ease_ReturnValue) == 0x00030C, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_IsValid_ReturnValue) == 0x000310, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_GetGameInstance_ReturnValue_2) == 0x000318, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_AsBPI_UIManager_4) == 0x000320, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_AsBPI_UIManager_4' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_bSuccess_11) == 0x000330, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_BPI_GetUIManager_UIManager_2) == 0x000338, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_BPI_GetUIManager_UIManager_2' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_AsBPI_UIManager_5) == 0x000340, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_AsBPI_UIManager_5' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_bSuccess_12) == 0x000350, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_BPI_GetMsgCtrl_OutActor_2) == 0x000358, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_BPI_GetMsgCtrl_OutActor_2' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_AsBPI_Msg_Ctrl_5) == 0x000360, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_AsBPI_Msg_Ctrl_5' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_bSuccess_13) == 0x000370, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_AsBPI_Msg_Ctrl_6) == 0x000378, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_AsBPI_Msg_Ctrl_6' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_bSuccess_14) == 0x000388, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_IIsFinishedWindowOut_OutFinished) == 0x000389, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_IIsFinishedWindowOut_OutFinished' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_AsBPI_Msg_Ctrl_7) == 0x000390, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_AsBPI_Msg_Ctrl_7' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_bSuccess_15) == 0x0003A0, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_bSuccess_15' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_AsBPI_Msg_Ctrl_8) == 0x0003A8, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_AsBPI_Msg_Ctrl_8' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, K2Node_DynamicCast_bSuccess_16) == 0x0003B8, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::K2Node_DynamicCast_bSuccess_16' has a wrong offset!");
static_assert(offsetof(EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x0003BC, "Member 'EM_M061_MimanTutorial_C_ExecuteUbergraph_EM_M061_MimanTutorial::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");

// Function EM_M061_MimanTutorial.EM_M061_MimanTutorial_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct EM_M061_MimanTutorial_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EM_M061_MimanTutorial_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on EM_M061_MimanTutorial_C_ReceiveEndPlay");
static_assert(sizeof(EM_M061_MimanTutorial_C_ReceiveEndPlay) == 0x000001, "Wrong size on EM_M061_MimanTutorial_C_ReceiveEndPlay");
static_assert(offsetof(EM_M061_MimanTutorial_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'EM_M061_MimanTutorial_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

