#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EncountArea_Default_DiscoveryPattern

#include "Basic.hpp"

#include "E_Symbol_Discovery_structs.hpp"


namespace SDK
{

// UserDefinedStruct EncountArea_Default_DiscoveryPattern.EncountArea_Default_DiscoveryPattern
// 0x0018 (0x0018 - 0x0000)
struct FEncountArea_Default_DiscoveryPattern final
{
public:
	E_Symbol_Discovery                            DiscoveryPattern_25_D8DA7D014E6AED09A0D34EB72ACA7972; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95CE[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EyeAngle_28_C243EC3D4DC53D5110BF26B6633215F6;      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EyeLength_30_E58C7B814CDD5BCC792FB08972520594;     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EyeWidth_32_13994C684C97A0D9EEDEF187C2754A94;      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EyeHeight_34_641D2E3C4D92B666E51715990A49C387;     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WallKantsu_37_1D9127AE44720C5B274270883730486A;    // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DiscoveryWhenSummon_39_0EA65724472267F079AFE19116A4E07E; // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FEncountArea_Default_DiscoveryPattern) == 0x000004, "Wrong alignment on FEncountArea_Default_DiscoveryPattern");
static_assert(sizeof(FEncountArea_Default_DiscoveryPattern) == 0x000018, "Wrong size on FEncountArea_Default_DiscoveryPattern");
static_assert(offsetof(FEncountArea_Default_DiscoveryPattern, DiscoveryPattern_25_D8DA7D014E6AED09A0D34EB72ACA7972) == 0x000000, "Member 'FEncountArea_Default_DiscoveryPattern::DiscoveryPattern_25_D8DA7D014E6AED09A0D34EB72ACA7972' has a wrong offset!");
static_assert(offsetof(FEncountArea_Default_DiscoveryPattern, EyeAngle_28_C243EC3D4DC53D5110BF26B6633215F6) == 0x000004, "Member 'FEncountArea_Default_DiscoveryPattern::EyeAngle_28_C243EC3D4DC53D5110BF26B6633215F6' has a wrong offset!");
static_assert(offsetof(FEncountArea_Default_DiscoveryPattern, EyeLength_30_E58C7B814CDD5BCC792FB08972520594) == 0x000008, "Member 'FEncountArea_Default_DiscoveryPattern::EyeLength_30_E58C7B814CDD5BCC792FB08972520594' has a wrong offset!");
static_assert(offsetof(FEncountArea_Default_DiscoveryPattern, EyeWidth_32_13994C684C97A0D9EEDEF187C2754A94) == 0x00000C, "Member 'FEncountArea_Default_DiscoveryPattern::EyeWidth_32_13994C684C97A0D9EEDEF187C2754A94' has a wrong offset!");
static_assert(offsetof(FEncountArea_Default_DiscoveryPattern, EyeHeight_34_641D2E3C4D92B666E51715990A49C387) == 0x000010, "Member 'FEncountArea_Default_DiscoveryPattern::EyeHeight_34_641D2E3C4D92B666E51715990A49C387' has a wrong offset!");
static_assert(offsetof(FEncountArea_Default_DiscoveryPattern, WallKantsu_37_1D9127AE44720C5B274270883730486A) == 0x000014, "Member 'FEncountArea_Default_DiscoveryPattern::WallKantsu_37_1D9127AE44720C5B274270883730486A' has a wrong offset!");
static_assert(offsetof(FEncountArea_Default_DiscoveryPattern, DiscoveryWhenSummon_39_0EA65724472267F079AFE19116A4E07E) == 0x000015, "Member 'FEncountArea_Default_DiscoveryPattern::DiscoveryWhenSummon_39_0EA65724472267F079AFE19116A4E07E' has a wrong offset!");

}

