#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EncountArea_Default_ComeRange

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct EncountArea_Default_ComeRange.EncountArea_Default_ComeRange
// 0x0028 (0x0028 - 0x0000)
struct FEncountArea_Default_ComeRange final
{
public:
	bool                                          ComeRange_View_1_EA04148C49B7169A9E6799A65205B0FA; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49BB[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ComeRange_LocalLocation_4_DCD5EEB848823DEDDAA181A49E89FA5E; // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ComeRange_LocalRotation_9_8124E36C4A7DF1D8E978A4BEDAE5180B; // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                ComeRange_Size_8_BE09331F47370934812EC9A031C9F196; // 0x001C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FEncountArea_Default_ComeRange) == 0x000004, "Wrong alignment on FEncountArea_Default_ComeRange");
static_assert(sizeof(FEncountArea_Default_ComeRange) == 0x000028, "Wrong size on FEncountArea_Default_ComeRange");
static_assert(offsetof(FEncountArea_Default_ComeRange, ComeRange_View_1_EA04148C49B7169A9E6799A65205B0FA) == 0x000000, "Member 'FEncountArea_Default_ComeRange::ComeRange_View_1_EA04148C49B7169A9E6799A65205B0FA' has a wrong offset!");
static_assert(offsetof(FEncountArea_Default_ComeRange, ComeRange_LocalLocation_4_DCD5EEB848823DEDDAA181A49E89FA5E) == 0x000004, "Member 'FEncountArea_Default_ComeRange::ComeRange_LocalLocation_4_DCD5EEB848823DEDDAA181A49E89FA5E' has a wrong offset!");
static_assert(offsetof(FEncountArea_Default_ComeRange, ComeRange_LocalRotation_9_8124E36C4A7DF1D8E978A4BEDAE5180B) == 0x000010, "Member 'FEncountArea_Default_ComeRange::ComeRange_LocalRotation_9_8124E36C4A7DF1D8E978A4BEDAE5180B' has a wrong offset!");
static_assert(offsetof(FEncountArea_Default_ComeRange, ComeRange_Size_8_BE09331F47370934812EC9A031C9F196) == 0x00001C, "Member 'FEncountArea_Default_ComeRange::ComeRange_Size_8_BE09331F47370934812EC9A031C9F196' has a wrong offset!");

}

