#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EncountPointStruct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct EncountPointStruct.EncountPointStruct
// 0x0008 (0x0008 - 0x0000)
struct FEncountPointStruct final
{
public:
	bool                                          Zero_9_5F3447054F0E4EFF589607B504037EFA;           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Four5_10_EF95B6024E52858260543CAC6680FA71;         // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Nine0_11_8271CCD944DF4ECCBEFBE1B342D45584;         // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          One35_12_2DF24DD94AF9D59349FC248540582613;         // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          One80_13_C2518B4F4A35EA608D2430BFAD7CACEF;         // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Two25_14_719FE0C844B09C781896DEA354C0BCC9;         // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Two70_16_3E9E9849467E4C5EDD907DBA9527DE65;         // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Three15_17_1ADD932F4E0C60098BA7EDA8CF09E54A;       // 0x0007(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FEncountPointStruct) == 0x000001, "Wrong alignment on FEncountPointStruct");
static_assert(sizeof(FEncountPointStruct) == 0x000008, "Wrong size on FEncountPointStruct");
static_assert(offsetof(FEncountPointStruct, Zero_9_5F3447054F0E4EFF589607B504037EFA) == 0x000000, "Member 'FEncountPointStruct::Zero_9_5F3447054F0E4EFF589607B504037EFA' has a wrong offset!");
static_assert(offsetof(FEncountPointStruct, Four5_10_EF95B6024E52858260543CAC6680FA71) == 0x000001, "Member 'FEncountPointStruct::Four5_10_EF95B6024E52858260543CAC6680FA71' has a wrong offset!");
static_assert(offsetof(FEncountPointStruct, Nine0_11_8271CCD944DF4ECCBEFBE1B342D45584) == 0x000002, "Member 'FEncountPointStruct::Nine0_11_8271CCD944DF4ECCBEFBE1B342D45584' has a wrong offset!");
static_assert(offsetof(FEncountPointStruct, One35_12_2DF24DD94AF9D59349FC248540582613) == 0x000003, "Member 'FEncountPointStruct::One35_12_2DF24DD94AF9D59349FC248540582613' has a wrong offset!");
static_assert(offsetof(FEncountPointStruct, One80_13_C2518B4F4A35EA608D2430BFAD7CACEF) == 0x000004, "Member 'FEncountPointStruct::One80_13_C2518B4F4A35EA608D2430BFAD7CACEF' has a wrong offset!");
static_assert(offsetof(FEncountPointStruct, Two25_14_719FE0C844B09C781896DEA354C0BCC9) == 0x000005, "Member 'FEncountPointStruct::Two25_14_719FE0C844B09C781896DEA354C0BCC9' has a wrong offset!");
static_assert(offsetof(FEncountPointStruct, Two70_16_3E9E9849467E4C5EDD907DBA9527DE65) == 0x000006, "Member 'FEncountPointStruct::Two70_16_3E9E9849467E4C5EDD907DBA9527DE65' has a wrong offset!");
static_assert(offsetof(FEncountPointStruct, Three15_17_1ADD932F4E0C60098BA7EDA8CF09E54A) == 0x000007, "Member 'FEncountPointStruct::Three15_17_1ADD932F4E0C60098BA7EDA8CF09E54A' has a wrong offset!");

}

