#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EncountArea_Default_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct EncountArea_Default_Base.EncountArea_Default_Base
// 0x0014 (0x0014 - 0x0000)
struct FEncountArea_Default_Base final
{
public:
	int32                                         SpawnNum_2_6F2EA49948221B3633F74D90636F43B4;       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitSize_5_6987E3A14605C3F7A93FCF95505C7BFD;        // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HitView_8_2D39C04F461E61370A535F9AFA66D5DC;        // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FEncountArea_Default_Base) == 0x000004, "Wrong alignment on FEncountArea_Default_Base");
static_assert(sizeof(FEncountArea_Default_Base) == 0x000014, "Wrong size on FEncountArea_Default_Base");
static_assert(offsetof(FEncountArea_Default_Base, SpawnNum_2_6F2EA49948221B3633F74D90636F43B4) == 0x000000, "Member 'FEncountArea_Default_Base::SpawnNum_2_6F2EA49948221B3633F74D90636F43B4' has a wrong offset!");
static_assert(offsetof(FEncountArea_Default_Base, HitSize_5_6987E3A14605C3F7A93FCF95505C7BFD) == 0x000004, "Member 'FEncountArea_Default_Base::HitSize_5_6987E3A14605C3F7A93FCF95505C7BFD' has a wrong offset!");
static_assert(offsetof(FEncountArea_Default_Base, HitView_8_2D39C04F461E61370A535F9AFA66D5DC) == 0x000010, "Member 'FEncountArea_Default_Base::HitView_8_2D39C04F461E61370A535F9AFA66D5DC' has a wrong offset!");

}

