#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EndOfBattle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Project_structs.hpp"


namespace SDK::Params
{

// Function EndOfBattle.EndOfBattle_C.ExecuteUbergraph_EndOfBattle
// 0x0160 (0x0160 - 0x0000)
struct EndOfBattle_C_ExecuteUbergraph_EndOfBattle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DBD[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleMain_C>     CallFunc_BIGetMainWork_NewParam;                   // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DBE[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleTaskModelManager_C> CallFunc_BI_GetTaskModelManager_Manager;           // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCameraAnimationAsset*                  Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BI_DestroyReserveUnits_NoUse;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5DBF[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraAnimationAsset*                  Temp_object_Variable_1;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraAnimationAsset*                  Temp_object_Variable_2;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC0[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraAnimationAsset*                  Temp_object_Variable_3;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraAnimationAsset*                  Temp_object_Variable_4;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraAnimationAsset*                  Temp_object_Variable_5;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5DC1[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Com_CallSkillPerformance_ComIndex;        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Step)>                   K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Com_CallSkillPerformance_ComIndex_1;      // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC2[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_BIGetPartySystem_retValue;                // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BI_GetHeroIndex_index;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC3[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaBase_C*                           CallFunc_FindUnit_Unit;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_BIGetPartySystem_retValue_1;              // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_BeHomeSideAll_NoUse;                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_UnitSetVisibilitySideAll_retValue;     // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5DC4[0x2];                                     // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Step;                           // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5DC5[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_BIGetPartySystem_retValue_2;              // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BI_UnitSetVisibilitySideAll_retValue_1;   // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5DC6[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_BAD_STATUS>                          K2Node_MakeArray_Array;                            // 0x00E8(0x0010)(ReferenceParm)
	class UCameraAnimationAsset*                  K2Node_Select_Default;                             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Com_MemberMotion_Com_Index;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC7[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleTaskFactory_C> CallFunc_BIGetTaskFactory_retValue;                // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckPrimeMinisterNahobino_ReturnValue;   // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5DC8[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraAnimationAsset*                  K2Node_Select_Default_1;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraAnimationAsset*                  K2Node_Select_Default_2;                           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Com_SetAnimCamActorRelative_ComIndex;     // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC9[0x4];                                     // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BI_GetTaskForPecID_ActionTask;            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleActionTask_C*                    K2Node_DynamicCast_AsBattle_Action_Task;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5DCA[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABTL_ADD_ANIM_CAM_TASK_OBJ_C*           K2Node_DynamicCast_AsBTL_ADD_ANIM_CAM_TASK_OBJ;    // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle) == 0x000008, "Wrong alignment on EndOfBattle_C_ExecuteUbergraph_EndOfBattle");
static_assert(sizeof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle) == 0x000160, "Wrong size on EndOfBattle_C_ExecuteUbergraph_EndOfBattle");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, EntryPoint) == 0x000000, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::EntryPoint' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, CallFunc_BIGetMainWork_NewParam) == 0x000008, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::CallFunc_BIGetMainWork_NewParam' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, Temp_int_Variable) == 0x000018, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, CallFunc_BI_GetTaskModelManager_Manager) == 0x000020, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::CallFunc_BI_GetTaskModelManager_Manager' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, Temp_object_Variable) == 0x000030, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, CallFunc_BI_DestroyReserveUnits_NoUse) == 0x000038, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::CallFunc_BI_DestroyReserveUnits_NoUse' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, Temp_object_Variable_1) == 0x000040, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, Temp_object_Variable_2) == 0x000048, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, Temp_int_Variable_1) == 0x000050, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, Temp_object_Variable_3) == 0x000058, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, Temp_object_Variable_4) == 0x000060, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, Temp_object_Variable_5) == 0x000068, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, Temp_bool_Variable) == 0x000070, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, CallFunc_Com_CallSkillPerformance_ComIndex) == 0x000074, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::CallFunc_Com_CallSkillPerformance_ComIndex' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, K2Node_CreateDelegate_OutputDelegate) == 0x000078, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, CallFunc_Com_CallSkillPerformance_ComIndex_1) == 0x000088, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::CallFunc_Com_CallSkillPerformance_ComIndex_1' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, CallFunc_BIGetPartySystem_retValue) == 0x000090, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::CallFunc_BIGetPartySystem_retValue' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, CallFunc_BI_GetHeroIndex_index) == 0x0000A0, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::CallFunc_BI_GetHeroIndex_index' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, K2Node_Event_EndPlayReason) == 0x0000A4, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, CallFunc_FindUnit_Unit) == 0x0000A8, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::CallFunc_FindUnit_Unit' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, CallFunc_BIGetPartySystem_retValue_1) == 0x0000B0, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::CallFunc_BIGetPartySystem_retValue_1' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, CallFunc_BI_BeHomeSideAll_NoUse) == 0x0000C0, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::CallFunc_BI_BeHomeSideAll_NoUse' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, CallFunc_BI_UnitSetVisibilitySideAll_retValue) == 0x0000C1, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::CallFunc_BI_UnitSetVisibilitySideAll_retValue' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, K2Node_CustomEvent_Step) == 0x0000C4, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::K2Node_CustomEvent_Step' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, K2Node_SwitchInteger_CmpSuccess) == 0x0000C8, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, CallFunc_BIGetPartySystem_retValue_2) == 0x0000D0, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::CallFunc_BIGetPartySystem_retValue_2' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0000E0, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, CallFunc_BI_UnitSetVisibilitySideAll_retValue_1) == 0x0000E4, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::CallFunc_BI_UnitSetVisibilitySideAll_retValue_1' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, K2Node_MakeArray_Array) == 0x0000E8, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, K2Node_Select_Default) == 0x0000F8, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, CallFunc_Com_MemberMotion_Com_Index) == 0x000100, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::CallFunc_Com_MemberMotion_Com_Index' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, CallFunc_BIGetTaskFactory_retValue) == 0x000108, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::CallFunc_BIGetTaskFactory_retValue' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, CallFunc_RandomIntegerInRange_ReturnValue_1) == 0x000118, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::CallFunc_RandomIntegerInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, CallFunc_CheckPrimeMinisterNahobino_ReturnValue) == 0x00011C, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::CallFunc_CheckPrimeMinisterNahobino_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, K2Node_Select_Default_1) == 0x000120, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, K2Node_Select_Default_2) == 0x000128, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, CallFunc_Com_SetAnimCamActorRelative_ComIndex) == 0x000130, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::CallFunc_Com_SetAnimCamActorRelative_ComIndex' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, CallFunc_BI_GetTaskForPecID_ActionTask) == 0x000138, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::CallFunc_BI_GetTaskForPecID_ActionTask' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, K2Node_DynamicCast_AsBattle_Action_Task) == 0x000140, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::K2Node_DynamicCast_AsBattle_Action_Task' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, K2Node_DynamicCast_bSuccess) == 0x000148, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, K2Node_DynamicCast_AsBTL_ADD_ANIM_CAM_TASK_OBJ) == 0x000150, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::K2Node_DynamicCast_AsBTL_ADD_ANIM_CAM_TASK_OBJ' has a wrong offset!");
static_assert(offsetof(EndOfBattle_C_ExecuteUbergraph_EndOfBattle, K2Node_DynamicCast_bSuccess_1) == 0x000158, "Member 'EndOfBattle_C_ExecuteUbergraph_EndOfBattle::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function EndOfBattle.EndOfBattle_C.Performe
// 0x0004 (0x0004 - 0x0000)
struct EndOfBattle_C_Performe final
{
public:
	int32                                         Step;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EndOfBattle_C_Performe) == 0x000004, "Wrong alignment on EndOfBattle_C_Performe");
static_assert(sizeof(EndOfBattle_C_Performe) == 0x000004, "Wrong size on EndOfBattle_C_Performe");
static_assert(offsetof(EndOfBattle_C_Performe, Step) == 0x000000, "Member 'EndOfBattle_C_Performe::Step' has a wrong offset!");

// Function EndOfBattle.EndOfBattle_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct EndOfBattle_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EndOfBattle_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on EndOfBattle_C_ReceiveEndPlay");
static_assert(sizeof(EndOfBattle_C_ReceiveEndPlay) == 0x000001, "Wrong size on EndOfBattle_C_ReceiveEndPlay");
static_assert(offsetof(EndOfBattle_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'EndOfBattle_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

