#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EndOfBattle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattleSkillActionBase_classes.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass EndOfBattle.EndOfBattle_C
// 0x0010 (0x0950 - 0x0940)
class AEndOfBattle_C final : public ABattleSkillActionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_EndOfBattle_C;                      // 0x0938(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         MagatukaPost_Alpha_A5233DA84F11634D375F40B3524C92E0; // 0x0940(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MagatukaPost__Direction_A5233DA84F11634D375F40B3524C92E0; // 0x0944(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DBC[0x3];                                     // 0x0945(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MagatukaPost;                                      // 0x0948(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EndOfBattle(int32 EntryPoint);
	void Performe(int32 Step);
	void MagatukaPost__UpdateFunc();
	void MagatukaPost__FinishedFunc();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void CounterFunc();
	void DeadFunc();
	void HitFunc();
	void IntroductionFunc();
	void FinishFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EndOfBattle_C">();
	}
	static class AEndOfBattle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEndOfBattle_C>();
	}
};
static_assert(alignof(AEndOfBattle_C) == 0x000010, "Wrong alignment on AEndOfBattle_C");
static_assert(sizeof(AEndOfBattle_C) == 0x000950, "Wrong size on AEndOfBattle_C");
static_assert(offsetof(AEndOfBattle_C, UberGraphFrame_EndOfBattle_C) == 0x000938, "Member 'AEndOfBattle_C::UberGraphFrame_EndOfBattle_C' has a wrong offset!");
static_assert(offsetof(AEndOfBattle_C, MagatukaPost_Alpha_A5233DA84F11634D375F40B3524C92E0) == 0x000940, "Member 'AEndOfBattle_C::MagatukaPost_Alpha_A5233DA84F11634D375F40B3524C92E0' has a wrong offset!");
static_assert(offsetof(AEndOfBattle_C, MagatukaPost__Direction_A5233DA84F11634D375F40B3524C92E0) == 0x000944, "Member 'AEndOfBattle_C::MagatukaPost__Direction_A5233DA84F11634D375F40B3524C92E0' has a wrong offset!");
static_assert(offsetof(AEndOfBattle_C, MagatukaPost) == 0x000948, "Member 'AEndOfBattle_C::MagatukaPost' has a wrong offset!");

}

