#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnemyFieldBase

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass EnemyFieldBase.EnemyFieldBase_C
// 0x0200 (0x0420 - 0x0220)
class AEnemyFieldBase_C : public AActor
{
public:
	class USceneComponent*                        AddPos4;                                           // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AddPos3;                                           // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Addpos2;                                           // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AddPos1;                                           // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AddPos;                                            // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos7;                                              // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos6;                                              // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos5;                                              // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos4;                                              // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos3;                                              // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos2;                                              // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos1;                                              // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos0;                                              // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ApplyPos;                                          // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos8_8;                                            // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos8_7;                                            // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos8_6;                                            // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos8_5;                                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos8_4;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos8_3;                                            // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos8_2;                                            // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos8_1;                                            // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultPos_8;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos7_7;                                            // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos7_6;                                            // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos7_5;                                            // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos7_4;                                            // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos7_3;                                            // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos7_2;                                            // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos7_1;                                            // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultPos_7;                                      // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos6_6;                                            // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos6_5;                                            // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos6_4;                                            // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos6_3;                                            // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos6_2;                                            // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos6_1;                                            // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultPos_6;                                      // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos5_5;                                            // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos5_4;                                            // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos5_3;                                            // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos5_2;                                            // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos5_1;                                            // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultPos_5;                                      // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos4_4;                                            // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos4_3;                                            // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos4_2;                                            // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos4_1;                                            // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultPos_4;                                      // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos3_3;                                            // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos3_2;                                            // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos3_1;                                            // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultPos_3;                                      // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos2_2;                                            // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos2_1;                                            // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultPos_2;                                      // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos1_1;                                            // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultPos_1;                                      // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        EnemyEndPoint;                                     // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        EnemyBufferField;                                  // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        EnemyField;                                        // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                M_ApplyPos;                                        // 0x0410(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void DisableMeshCollision();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EnemyFieldBase_C">();
	}
	static class AEnemyFieldBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEnemyFieldBase_C>();
	}
};
static_assert(alignof(AEnemyFieldBase_C) == 0x000008, "Wrong alignment on AEnemyFieldBase_C");
static_assert(sizeof(AEnemyFieldBase_C) == 0x000420, "Wrong size on AEnemyFieldBase_C");
static_assert(offsetof(AEnemyFieldBase_C, AddPos4) == 0x000220, "Member 'AEnemyFieldBase_C::AddPos4' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, AddPos3) == 0x000228, "Member 'AEnemyFieldBase_C::AddPos3' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Addpos2) == 0x000230, "Member 'AEnemyFieldBase_C::Addpos2' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, AddPos1) == 0x000238, "Member 'AEnemyFieldBase_C::AddPos1' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, AddPos) == 0x000240, "Member 'AEnemyFieldBase_C::AddPos' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos7) == 0x000248, "Member 'AEnemyFieldBase_C::Pos7' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos6) == 0x000250, "Member 'AEnemyFieldBase_C::Pos6' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos5) == 0x000258, "Member 'AEnemyFieldBase_C::Pos5' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos4) == 0x000260, "Member 'AEnemyFieldBase_C::Pos4' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos3) == 0x000268, "Member 'AEnemyFieldBase_C::Pos3' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos2) == 0x000270, "Member 'AEnemyFieldBase_C::Pos2' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos1) == 0x000278, "Member 'AEnemyFieldBase_C::Pos1' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos0) == 0x000280, "Member 'AEnemyFieldBase_C::Pos0' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, ApplyPos) == 0x000288, "Member 'AEnemyFieldBase_C::ApplyPos' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos8_8) == 0x000290, "Member 'AEnemyFieldBase_C::Pos8_8' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos8_7) == 0x000298, "Member 'AEnemyFieldBase_C::Pos8_7' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos8_6) == 0x0002A0, "Member 'AEnemyFieldBase_C::Pos8_6' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos8_5) == 0x0002A8, "Member 'AEnemyFieldBase_C::Pos8_5' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos8_4) == 0x0002B0, "Member 'AEnemyFieldBase_C::Pos8_4' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos8_3) == 0x0002B8, "Member 'AEnemyFieldBase_C::Pos8_3' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos8_2) == 0x0002C0, "Member 'AEnemyFieldBase_C::Pos8_2' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos8_1) == 0x0002C8, "Member 'AEnemyFieldBase_C::Pos8_1' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, DefaultPos_8) == 0x0002D0, "Member 'AEnemyFieldBase_C::DefaultPos_8' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos7_7) == 0x0002D8, "Member 'AEnemyFieldBase_C::Pos7_7' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos7_6) == 0x0002E0, "Member 'AEnemyFieldBase_C::Pos7_6' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos7_5) == 0x0002E8, "Member 'AEnemyFieldBase_C::Pos7_5' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos7_4) == 0x0002F0, "Member 'AEnemyFieldBase_C::Pos7_4' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos7_3) == 0x0002F8, "Member 'AEnemyFieldBase_C::Pos7_3' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos7_2) == 0x000300, "Member 'AEnemyFieldBase_C::Pos7_2' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos7_1) == 0x000308, "Member 'AEnemyFieldBase_C::Pos7_1' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, DefaultPos_7) == 0x000310, "Member 'AEnemyFieldBase_C::DefaultPos_7' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos6_6) == 0x000318, "Member 'AEnemyFieldBase_C::Pos6_6' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos6_5) == 0x000320, "Member 'AEnemyFieldBase_C::Pos6_5' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos6_4) == 0x000328, "Member 'AEnemyFieldBase_C::Pos6_4' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos6_3) == 0x000330, "Member 'AEnemyFieldBase_C::Pos6_3' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos6_2) == 0x000338, "Member 'AEnemyFieldBase_C::Pos6_2' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos6_1) == 0x000340, "Member 'AEnemyFieldBase_C::Pos6_1' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, DefaultPos_6) == 0x000348, "Member 'AEnemyFieldBase_C::DefaultPos_6' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos5_5) == 0x000350, "Member 'AEnemyFieldBase_C::Pos5_5' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos5_4) == 0x000358, "Member 'AEnemyFieldBase_C::Pos5_4' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos5_3) == 0x000360, "Member 'AEnemyFieldBase_C::Pos5_3' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos5_2) == 0x000368, "Member 'AEnemyFieldBase_C::Pos5_2' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos5_1) == 0x000370, "Member 'AEnemyFieldBase_C::Pos5_1' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, DefaultPos_5) == 0x000378, "Member 'AEnemyFieldBase_C::DefaultPos_5' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos4_4) == 0x000380, "Member 'AEnemyFieldBase_C::Pos4_4' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos4_3) == 0x000388, "Member 'AEnemyFieldBase_C::Pos4_3' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos4_2) == 0x000390, "Member 'AEnemyFieldBase_C::Pos4_2' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos4_1) == 0x000398, "Member 'AEnemyFieldBase_C::Pos4_1' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, DefaultPos_4) == 0x0003A0, "Member 'AEnemyFieldBase_C::DefaultPos_4' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos3_3) == 0x0003A8, "Member 'AEnemyFieldBase_C::Pos3_3' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos3_2) == 0x0003B0, "Member 'AEnemyFieldBase_C::Pos3_2' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos3_1) == 0x0003B8, "Member 'AEnemyFieldBase_C::Pos3_1' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, DefaultPos_3) == 0x0003C0, "Member 'AEnemyFieldBase_C::DefaultPos_3' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos2_2) == 0x0003C8, "Member 'AEnemyFieldBase_C::Pos2_2' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos2_1) == 0x0003D0, "Member 'AEnemyFieldBase_C::Pos2_1' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, DefaultPos_2) == 0x0003D8, "Member 'AEnemyFieldBase_C::DefaultPos_2' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, Pos1_1) == 0x0003E0, "Member 'AEnemyFieldBase_C::Pos1_1' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, DefaultPos_1) == 0x0003E8, "Member 'AEnemyFieldBase_C::DefaultPos_1' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, EnemyEndPoint) == 0x0003F0, "Member 'AEnemyFieldBase_C::EnemyEndPoint' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, EnemyBufferField) == 0x0003F8, "Member 'AEnemyFieldBase_C::EnemyBufferField' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, EnemyField) == 0x000400, "Member 'AEnemyFieldBase_C::EnemyField' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, DefaultSceneRoot) == 0x000408, "Member 'AEnemyFieldBase_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AEnemyFieldBase_C, M_ApplyPos) == 0x000410, "Member 'AEnemyFieldBase_C::M_ApplyPos' has a wrong offset!");

}

