#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnemyFieldBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function EnemyFieldBase.EnemyFieldBase_C.DisableMeshCollision
// 0x0040 (0x0040 - 0x0000)
struct EnemyFieldBase_C_DisableMeshCollision final
{
public:
	TArray<class UMeshComponent*>                 Lo_Meshes;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44B5[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EnemyFieldBase_C_DisableMeshCollision) == 0x000008, "Wrong alignment on EnemyFieldBase_C_DisableMeshCollision");
static_assert(sizeof(EnemyFieldBase_C_DisableMeshCollision) == 0x000040, "Wrong size on EnemyFieldBase_C_DisableMeshCollision");
static_assert(offsetof(EnemyFieldBase_C_DisableMeshCollision, Lo_Meshes) == 0x000000, "Member 'EnemyFieldBase_C_DisableMeshCollision::Lo_Meshes' has a wrong offset!");
static_assert(offsetof(EnemyFieldBase_C_DisableMeshCollision, Temp_int_Array_Index_Variable) == 0x000010, "Member 'EnemyFieldBase_C_DisableMeshCollision::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EnemyFieldBase_C_DisableMeshCollision, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'EnemyFieldBase_C_DisableMeshCollision::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EnemyFieldBase_C_DisableMeshCollision, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'EnemyFieldBase_C_DisableMeshCollision::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyFieldBase_C_DisableMeshCollision, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000020, "Member 'EnemyFieldBase_C_DisableMeshCollision::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyFieldBase_C_DisableMeshCollision, CallFunc_Array_Get_Item) == 0x000030, "Member 'EnemyFieldBase_C_DisableMeshCollision::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EnemyFieldBase_C_DisableMeshCollision, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'EnemyFieldBase_C_DisableMeshCollision::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyFieldBase_C_DisableMeshCollision, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'EnemyFieldBase_C_DisableMeshCollision::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

