#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnemySidePat

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass EnemySidePat.EnemySidePat_C
// 0x0028 (0x0248 - 0x0220)
class AEnemySidePat_C final : public AActor
{
public:
	class USceneComponent*                        Pattern_03;                                        // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pattern_02;                                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pattern_01;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EnemySidePat_C">();
	}
	static class AEnemySidePat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEnemySidePat_C>();
	}
};
static_assert(alignof(AEnemySidePat_C) == 0x000008, "Wrong alignment on AEnemySidePat_C");
static_assert(sizeof(AEnemySidePat_C) == 0x000248, "Wrong size on AEnemySidePat_C");
static_assert(offsetof(AEnemySidePat_C, Pattern_03) == 0x000220, "Member 'AEnemySidePat_C::Pattern_03' has a wrong offset!");
static_assert(offsetof(AEnemySidePat_C, Pattern_02) == 0x000228, "Member 'AEnemySidePat_C::Pattern_02' has a wrong offset!");
static_assert(offsetof(AEnemySidePat_C, Pattern_01) == 0x000230, "Member 'AEnemySidePat_C::Pattern_01' has a wrong offset!");
static_assert(offsetof(AEnemySidePat_C, DefaultSceneRoot) == 0x000238, "Member 'AEnemySidePat_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AEnemySidePat_C, NewVar_0) == 0x000240, "Member 'AEnemySidePat_C::NewVar_0' has a wrong offset!");

}

