#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EscapeFailed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Project_structs.hpp"


namespace SDK::Params
{

// Function EscapeFailed.EscapeFailed_C.ExecuteUbergraph_EscapeFailed
// 0x0070 (0x0070 - 0x0000)
struct EscapeFailed_C_ExecuteUbergraph_EscapeFailed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6489[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_BAD_STATUS>                          K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Com_EnemyMotion_Com_Index;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Step)>                   K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Com_WaitTime_ComIndex;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Com_MessageShowCommonMessage_ComIndex;    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Com_SetCamTargetRelative_ComIndex;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Step;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_648A[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_BIGetPartySystem_retValue;                // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_UnitSetVisibilitySideAll_retValue;     // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_648B[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Com_CallSkillPerformance_ComIndex;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_648C[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameVolume_ReturnValue;                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_1;                        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EscapeFailed_C_ExecuteUbergraph_EscapeFailed) == 0x000008, "Wrong alignment on EscapeFailed_C_ExecuteUbergraph_EscapeFailed");
static_assert(sizeof(EscapeFailed_C_ExecuteUbergraph_EscapeFailed) == 0x000070, "Wrong size on EscapeFailed_C_ExecuteUbergraph_EscapeFailed");
static_assert(offsetof(EscapeFailed_C_ExecuteUbergraph_EscapeFailed, EntryPoint) == 0x000000, "Member 'EscapeFailed_C_ExecuteUbergraph_EscapeFailed::EntryPoint' has a wrong offset!");
static_assert(offsetof(EscapeFailed_C_ExecuteUbergraph_EscapeFailed, K2Node_MakeArray_Array) == 0x000008, "Member 'EscapeFailed_C_ExecuteUbergraph_EscapeFailed::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(EscapeFailed_C_ExecuteUbergraph_EscapeFailed, CallFunc_Com_EnemyMotion_Com_Index) == 0x000018, "Member 'EscapeFailed_C_ExecuteUbergraph_EscapeFailed::CallFunc_Com_EnemyMotion_Com_Index' has a wrong offset!");
static_assert(offsetof(EscapeFailed_C_ExecuteUbergraph_EscapeFailed, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'EscapeFailed_C_ExecuteUbergraph_EscapeFailed::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EscapeFailed_C_ExecuteUbergraph_EscapeFailed, CallFunc_Com_WaitTime_ComIndex) == 0x00002C, "Member 'EscapeFailed_C_ExecuteUbergraph_EscapeFailed::CallFunc_Com_WaitTime_ComIndex' has a wrong offset!");
static_assert(offsetof(EscapeFailed_C_ExecuteUbergraph_EscapeFailed, CallFunc_Com_MessageShowCommonMessage_ComIndex) == 0x000030, "Member 'EscapeFailed_C_ExecuteUbergraph_EscapeFailed::CallFunc_Com_MessageShowCommonMessage_ComIndex' has a wrong offset!");
static_assert(offsetof(EscapeFailed_C_ExecuteUbergraph_EscapeFailed, CallFunc_Com_SetCamTargetRelative_ComIndex) == 0x000034, "Member 'EscapeFailed_C_ExecuteUbergraph_EscapeFailed::CallFunc_Com_SetCamTargetRelative_ComIndex' has a wrong offset!");
static_assert(offsetof(EscapeFailed_C_ExecuteUbergraph_EscapeFailed, K2Node_CustomEvent_Step) == 0x000038, "Member 'EscapeFailed_C_ExecuteUbergraph_EscapeFailed::K2Node_CustomEvent_Step' has a wrong offset!");
static_assert(offsetof(EscapeFailed_C_ExecuteUbergraph_EscapeFailed, CallFunc_BIGetPartySystem_retValue) == 0x000040, "Member 'EscapeFailed_C_ExecuteUbergraph_EscapeFailed::CallFunc_BIGetPartySystem_retValue' has a wrong offset!");
static_assert(offsetof(EscapeFailed_C_ExecuteUbergraph_EscapeFailed, K2Node_SwitchInteger_CmpSuccess) == 0x000050, "Member 'EscapeFailed_C_ExecuteUbergraph_EscapeFailed::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(EscapeFailed_C_ExecuteUbergraph_EscapeFailed, CallFunc_BI_UnitSetVisibilitySideAll_retValue) == 0x000051, "Member 'EscapeFailed_C_ExecuteUbergraph_EscapeFailed::CallFunc_BI_UnitSetVisibilitySideAll_retValue' has a wrong offset!");
static_assert(offsetof(EscapeFailed_C_ExecuteUbergraph_EscapeFailed, CallFunc_Com_CallSkillPerformance_ComIndex) == 0x000054, "Member 'EscapeFailed_C_ExecuteUbergraph_EscapeFailed::CallFunc_Com_CallSkillPerformance_ComIndex' has a wrong offset!");
static_assert(offsetof(EscapeFailed_C_ExecuteUbergraph_EscapeFailed, CallFunc_Get_ReturnValue) == 0x000058, "Member 'EscapeFailed_C_ExecuteUbergraph_EscapeFailed::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(EscapeFailed_C_ExecuteUbergraph_EscapeFailed, K2Node_Event_EndPlayReason) == 0x000060, "Member 'EscapeFailed_C_ExecuteUbergraph_EscapeFailed::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(EscapeFailed_C_ExecuteUbergraph_EscapeFailed, CallFunc_GetGameVolume_ReturnValue) == 0x000064, "Member 'EscapeFailed_C_ExecuteUbergraph_EscapeFailed::CallFunc_GetGameVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(EscapeFailed_C_ExecuteUbergraph_EscapeFailed, CallFunc_Get_ReturnValue_1) == 0x000068, "Member 'EscapeFailed_C_ExecuteUbergraph_EscapeFailed::CallFunc_Get_ReturnValue_1' has a wrong offset!");

// Function EscapeFailed.EscapeFailed_C.SkillPerform
// 0x0004 (0x0004 - 0x0000)
struct EscapeFailed_C_SkillPerform final
{
public:
	int32                                         Step;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EscapeFailed_C_SkillPerform) == 0x000004, "Wrong alignment on EscapeFailed_C_SkillPerform");
static_assert(sizeof(EscapeFailed_C_SkillPerform) == 0x000004, "Wrong size on EscapeFailed_C_SkillPerform");
static_assert(offsetof(EscapeFailed_C_SkillPerform, Step) == 0x000000, "Member 'EscapeFailed_C_SkillPerform::Step' has a wrong offset!");

// Function EscapeFailed.EscapeFailed_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct EscapeFailed_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EscapeFailed_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on EscapeFailed_C_ReceiveEndPlay");
static_assert(sizeof(EscapeFailed_C_ReceiveEndPlay) == 0x000001, "Wrong size on EscapeFailed_C_ReceiveEndPlay");
static_assert(offsetof(EscapeFailed_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'EscapeFailed_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

