#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EscapeSuccess

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EscapeSuccess.EscapeSuccess_C.ExecuteUbergraph_EscapeSuccess
// 0x0140 (0x0140 - 0x0000)
struct EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1064[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Com_SetAnimCamOriginRelative_ComIndex;    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Com_WaitTime_ComIndex;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Com_CallSkillPerformance_ComIndex;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Com_CallSkillPerformance_ComIndex_1;      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Step;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Com_WaitTime_ComIndex_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1065[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Com_CallSkillPerformance_ComIndex_2;      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1066[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_BIGetPartySystem_retValue;                // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<int32>                                 CallFunc_BI_GetSideIsTargetList_List;              // 0x0050(0x0010)(ReferenceParm)
	bool                                          CallFunc_BI_UnitSetVisibilitySideAll_retValue;     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1067[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1068[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaBase_C*                           CallFunc_FindUnit_Unit;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BI_BeHomeSideAll_NoUse;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1069[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Com_WaitTime_ComIndex_2;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Step)>                   K2Node_CreateDelegate_OutputDelegate;              // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Com_MemberAction_Com_Index;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_106A[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_BIGetPartySystem_retValue_1;              // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_BIGetPartySystem_retValue_2;              // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BI_GetHeroIndex_index;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BI_GetHeroIndex_index_1;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           CallFunc_FindUnit_Unit_1;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           CallFunc_FindUnit_Unit_2;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           CallFunc_FindUnit_Unit_3;                          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_106B[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleParty_C>    CallFunc_BIGetPartySystem_retValue_3;              // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BI_GetHeroIndex_index_2;                  // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_106C[0x4];                                     // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaBase_C*                           CallFunc_FindUnit_Unit_4;                          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess) == 0x000008, "Wrong alignment on EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess");
static_assert(sizeof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess) == 0x000140, "Wrong size on EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, EntryPoint) == 0x000000, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::EntryPoint' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, K2Node_MakeArray_Array) == 0x000008, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_Com_SetAnimCamOriginRelative_ComIndex) == 0x000018, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_Com_SetAnimCamOriginRelative_ComIndex' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_Com_WaitTime_ComIndex) == 0x00001C, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_Com_WaitTime_ComIndex' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_Com_CallSkillPerformance_ComIndex) == 0x000020, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_Com_CallSkillPerformance_ComIndex' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_Com_CallSkillPerformance_ComIndex_1) == 0x000024, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_Com_CallSkillPerformance_ComIndex_1' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, K2Node_CustomEvent_Step) == 0x000028, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::K2Node_CustomEvent_Step' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_Com_WaitTime_ComIndex_1) == 0x00002C, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_Com_WaitTime_ComIndex_1' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, K2Node_SwitchInteger_CmpSuccess) == 0x000030, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_Com_CallSkillPerformance_ComIndex_2) == 0x000034, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_Com_CallSkillPerformance_ComIndex_2' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, Temp_int_Array_Index_Variable) == 0x000038, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_BIGetPartySystem_retValue) == 0x000040, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_BIGetPartySystem_retValue' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_BI_GetSideIsTargetList_List) == 0x000050, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_BI_GetSideIsTargetList_List' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_BI_UnitSetVisibilitySideAll_retValue) == 0x000060, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_BI_UnitSetVisibilitySideAll_retValue' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_Array_Get_Item) == 0x000064, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_FindUnit_Unit) == 0x000070, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_FindUnit_Unit' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_BI_BeHomeSideAll_NoUse) == 0x000078, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_BI_BeHomeSideAll_NoUse' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_Com_WaitTime_ComIndex_2) == 0x00007C, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_Com_WaitTime_ComIndex_2' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_Com_MemberAction_Com_Index) == 0x000090, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_Com_MemberAction_Com_Index' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, Temp_int_Loop_Counter_Variable) == 0x000094, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_Add_IntInt_ReturnValue) == 0x00009C, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_BIGetPartySystem_retValue_1) == 0x0000A0, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_BIGetPartySystem_retValue_1' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_BIGetPartySystem_retValue_2) == 0x0000B0, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_BIGetPartySystem_retValue_2' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_BI_GetHeroIndex_index) == 0x0000C0, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_BI_GetHeroIndex_index' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_BI_GetHeroIndex_index_1) == 0x0000C4, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_BI_GetHeroIndex_index_1' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_FindUnit_Unit_1) == 0x0000C8, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_FindUnit_Unit_1' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_FindUnit_Unit_2) == 0x0000D0, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_FindUnit_Unit_2' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000D8, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_GetActorForwardVector_ReturnValue) == 0x0000E4, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_FindUnit_Unit_3) == 0x0000F0, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_FindUnit_Unit_3' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000F8, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_Add_VectorVector_ReturnValue) == 0x000104, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000110, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_BIGetPartySystem_retValue_3) == 0x000120, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_BIGetPartySystem_retValue_3' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_BI_GetHeroIndex_index_2) == 0x000130, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_BI_GetHeroIndex_index_2' has a wrong offset!");
static_assert(offsetof(EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess, CallFunc_FindUnit_Unit_4) == 0x000138, "Member 'EscapeSuccess_C_ExecuteUbergraph_EscapeSuccess::CallFunc_FindUnit_Unit_4' has a wrong offset!");

// Function EscapeSuccess.EscapeSuccess_C.EscapelPerformance
// 0x0004 (0x0004 - 0x0000)
struct EscapeSuccess_C_EscapelPerformance final
{
public:
	int32                                         Step;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EscapeSuccess_C_EscapelPerformance) == 0x000004, "Wrong alignment on EscapeSuccess_C_EscapelPerformance");
static_assert(sizeof(EscapeSuccess_C_EscapelPerformance) == 0x000004, "Wrong size on EscapeSuccess_C_EscapelPerformance");
static_assert(offsetof(EscapeSuccess_C_EscapelPerformance, Step) == 0x000000, "Member 'EscapeSuccess_C_EscapelPerformance::Step' has a wrong offset!");

}

