#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EsNPC_m061_34

#include "Basic.hpp"


namespace SDK::Params
{

// Function esNPC_m061_34.esNPC_m061_34_C.ExecuteUbergraph_esNPC_m061_34
// 0x0010 (0x0010 - 0x0000)
struct EsNPC_m061_34_C_ExecuteUbergraph_esNPC_m061_34 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActive_IsActive;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A13E[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Character_SpawnActor;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EsNPC_m061_34_C_ExecuteUbergraph_esNPC_m061_34) == 0x000008, "Wrong alignment on EsNPC_m061_34_C_ExecuteUbergraph_esNPC_m061_34");
static_assert(sizeof(EsNPC_m061_34_C_ExecuteUbergraph_esNPC_m061_34) == 0x000010, "Wrong size on EsNPC_m061_34_C_ExecuteUbergraph_esNPC_m061_34");
static_assert(offsetof(EsNPC_m061_34_C_ExecuteUbergraph_esNPC_m061_34, EntryPoint) == 0x000000, "Member 'EsNPC_m061_34_C_ExecuteUbergraph_esNPC_m061_34::EntryPoint' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_34_C_ExecuteUbergraph_esNPC_m061_34, CallFunc_GetActive_IsActive) == 0x000004, "Member 'EsNPC_m061_34_C_ExecuteUbergraph_esNPC_m061_34::CallFunc_GetActive_IsActive' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_34_C_ExecuteUbergraph_esNPC_m061_34, CallFunc_Character_SpawnActor) == 0x000008, "Member 'EsNPC_m061_34_C_ExecuteUbergraph_esNPC_m061_34::CallFunc_Character_SpawnActor' has a wrong offset!");

}

