#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EsNPC_m061_02

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function esNPC_m061_02.esNPC_m061_02_C.ExecuteUbergraph_esNPC_m061_02
// 0x0080 (0x0080 - 0x0000)
struct EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A221[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_DynamicCast_AsAnim_Sequence_Base;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A222[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Character_SpawnActor;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActive_IsActive;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A223[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor;      // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_StopMotion_NoUse;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A224[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1;    // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_EventPlayMotion_NoUse;                 // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A225[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_1;             // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_OldNewRoute                                 CallFunc_GetOldNewRoute_ReturnValue;               // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_OldNewRoute                                 CallFunc_GetOldNewRoute_ReturnValue_1;             // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02) == 0x000008, "Wrong alignment on EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02");
static_assert(sizeof(EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02) == 0x000080, "Wrong size on EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02");
static_assert(offsetof(EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02, EntryPoint) == 0x000000, "Member 'EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02::EntryPoint' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02, Temp_object_Variable) == 0x000008, "Member 'EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02, K2Node_DynamicCast_AsAnim_Sequence_Base) == 0x000010, "Member 'EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02::K2Node_DynamicCast_AsAnim_Sequence_Base' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02, K2Node_CustomEvent_Loaded) == 0x000020, "Member 'EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02, CallFunc_Character_SpawnActor) == 0x000028, "Member 'EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02::CallFunc_Character_SpawnActor' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02, CallFunc_GetActive_IsActive) == 0x000030, "Member 'EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02::CallFunc_GetActive_IsActive' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor) == 0x000038, "Member 'EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02, CallFunc_BI_StopMotion_NoUse) == 0x000049, "Member 'EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02::CallFunc_BI_StopMotion_NoUse' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1) == 0x000050, "Member 'EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02, CallFunc_BI_EventPlayMotion_NoUse) == 0x000061, "Member 'EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02::CallFunc_BI_EventPlayMotion_NoUse' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02, K2Node_CreateDelegate_OutputDelegate) == 0x000064, "Member 'EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02, CallFunc_CheckEventFlag_ReturnValue) == 0x000074, "Member 'EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02, CallFunc_CheckEventFlag_ReturnValue_1) == 0x000075, "Member 'EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02::CallFunc_CheckEventFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02, CallFunc_GetOldNewRoute_ReturnValue) == 0x000076, "Member 'EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02::CallFunc_GetOldNewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02, CallFunc_GetOldNewRoute_ReturnValue_1) == 0x000077, "Member 'EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02::CallFunc_GetOldNewRoute_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000078, "Member 'EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000079, "Member 'EsNPC_m061_02_C_ExecuteUbergraph_esNPC_m061_02::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function esNPC_m061_02.esNPC_m061_02_C.OnLoaded_0E38A2EA4724D2AEB4E20FBDD61DD367
// 0x0008 (0x0008 - 0x0000)
struct EsNPC_m061_02_C_OnLoaded_0E38A2EA4724D2AEB4E20FBDD61DD367 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EsNPC_m061_02_C_OnLoaded_0E38A2EA4724D2AEB4E20FBDD61DD367) == 0x000008, "Wrong alignment on EsNPC_m061_02_C_OnLoaded_0E38A2EA4724D2AEB4E20FBDD61DD367");
static_assert(sizeof(EsNPC_m061_02_C_OnLoaded_0E38A2EA4724D2AEB4E20FBDD61DD367) == 0x000008, "Wrong size on EsNPC_m061_02_C_OnLoaded_0E38A2EA4724D2AEB4E20FBDD61DD367");
static_assert(offsetof(EsNPC_m061_02_C_OnLoaded_0E38A2EA4724D2AEB4E20FBDD61DD367, Loaded) == 0x000000, "Member 'EsNPC_m061_02_C_OnLoaded_0E38A2EA4724D2AEB4E20FBDD61DD367::Loaded' has a wrong offset!");

}

