#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EsNPC_m061_33_Navi

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "BP_EventMissionBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass esNPC_m061_33_Navi.esNPC_m061_33_Navi_C
// 0x0048 (0x0368 - 0x0320)
class AEsNPC_m061_33_Navi_C final : public ABP_EventMissionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_EsNPC_m061_33_Navi_C;               // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectIndex;                                       // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8D6[0x4];                                     // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADevilBase_C*                           SpawnActor;                                        // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AutoRotateFocus_C*                  Auto_Rot_Ctrl;                                     // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CameraFocusEnd;                                    // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B8D7[0x3];                                     // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNaviDevilData                         NaviDevilData;                                     // 0x0354(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	E_NAVI_DEVIL                                  Navi_Devil_ID;                                     // 0x0364(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_esNPC_m061_33_Navi(int32 EntryPoint);
	void QuestExecute();
	void ReceiveBeginPlay();
	void CallDeactivate();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"esNPC_m061_33_Navi_C">();
	}
	static class AEsNPC_m061_33_Navi_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEsNPC_m061_33_Navi_C>();
	}
};
static_assert(alignof(AEsNPC_m061_33_Navi_C) == 0x000008, "Wrong alignment on AEsNPC_m061_33_Navi_C");
static_assert(sizeof(AEsNPC_m061_33_Navi_C) == 0x000368, "Wrong size on AEsNPC_m061_33_Navi_C");
static_assert(offsetof(AEsNPC_m061_33_Navi_C, UberGraphFrame_EsNPC_m061_33_Navi_C) == 0x000320, "Member 'AEsNPC_m061_33_Navi_C::UberGraphFrame_EsNPC_m061_33_Navi_C' has a wrong offset!");
static_assert(offsetof(AEsNPC_m061_33_Navi_C, Box) == 0x000328, "Member 'AEsNPC_m061_33_Navi_C::Box' has a wrong offset!");
static_assert(offsetof(AEsNPC_m061_33_Navi_C, SelectIndex) == 0x000330, "Member 'AEsNPC_m061_33_Navi_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AEsNPC_m061_33_Navi_C, SpawnActor) == 0x000338, "Member 'AEsNPC_m061_33_Navi_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(AEsNPC_m061_33_Navi_C, MissionMessageAsset) == 0x000340, "Member 'AEsNPC_m061_33_Navi_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AEsNPC_m061_33_Navi_C, Auto_Rot_Ctrl) == 0x000348, "Member 'AEsNPC_m061_33_Navi_C::Auto_Rot_Ctrl' has a wrong offset!");
static_assert(offsetof(AEsNPC_m061_33_Navi_C, CameraFocusEnd) == 0x000350, "Member 'AEsNPC_m061_33_Navi_C::CameraFocusEnd' has a wrong offset!");
static_assert(offsetof(AEsNPC_m061_33_Navi_C, NaviDevilData) == 0x000354, "Member 'AEsNPC_m061_33_Navi_C::NaviDevilData' has a wrong offset!");
static_assert(offsetof(AEsNPC_m061_33_Navi_C, Navi_Devil_ID) == 0x000364, "Member 'AEsNPC_m061_33_Navi_C::Navi_Devil_ID' has a wrong offset!");

}

