#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EsNPC_m061_15

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK::Params
{

// Function esNPC_m061_15.esNPC_m061_15_C.ExecuteUbergraph_esNPC_m061_15
// 0x0028 (0x0028 - 0x0000)
struct EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_267B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Character_SpawnActor;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetActive_IsActive;                       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_1;             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_2;             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_3;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_OldNewRoute                                 CallFunc_GetOldNewRoute_ReturnValue;               // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_4;             // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_Character_SpawnActor_1;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActive_IsActive_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_5;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15) == 0x000008, "Wrong alignment on EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15");
static_assert(sizeof(EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15) == 0x000028, "Wrong size on EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15");
static_assert(offsetof(EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15, EntryPoint) == 0x000000, "Member 'EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15::EntryPoint' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15, CallFunc_Character_SpawnActor) == 0x000008, "Member 'EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15::CallFunc_Character_SpawnActor' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15, CallFunc_CheckEventFlag_ReturnValue) == 0x000010, "Member 'EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15, CallFunc_GetActive_IsActive) == 0x000011, "Member 'EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15::CallFunc_GetActive_IsActive' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15, CallFunc_CheckEventFlag_ReturnValue_1) == 0x000012, "Member 'EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15::CallFunc_CheckEventFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15, CallFunc_CheckEventFlag_ReturnValue_2) == 0x000013, "Member 'EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15::CallFunc_CheckEventFlag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15, CallFunc_CheckEventFlag_ReturnValue_3) == 0x000014, "Member 'EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15::CallFunc_CheckEventFlag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15, CallFunc_GetOldNewRoute_ReturnValue) == 0x000015, "Member 'EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15::CallFunc_GetOldNewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000016, "Member 'EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15, CallFunc_CheckEventFlag_ReturnValue_4) == 0x000017, "Member 'EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15::CallFunc_CheckEventFlag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15, CallFunc_Character_SpawnActor_1) == 0x000018, "Member 'EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15::CallFunc_Character_SpawnActor_1' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15, CallFunc_GetActive_IsActive_1) == 0x000020, "Member 'EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15::CallFunc_GetActive_IsActive_1' has a wrong offset!");
static_assert(offsetof(EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15, CallFunc_CheckEventFlag_ReturnValue_5) == 0x000021, "Member 'EsNPC_m061_15_C_ExecuteUbergraph_esNPC_m061_15::CallFunc_CheckEventFlag_ReturnValue_5' has a wrong offset!");

}

