#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventVoiceFixData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct EventVoiceFixData.EventVoiceFixData
// 0x0028 (0x0028 - 0x0000)
struct FEventVoiceFixData final
{
public:
	int32                                         Index_11_1E1FD9B048CA3EE74A749AAE58DF1AC3;         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Label_12_DDD1CDD945C5AFB436F75BBC90ED72F0;         // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 VoiceName_13_27D37CB3489A00FFEF7B118D04B22A22;     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	float                                         Time_14_0B9BB1764FE90F90C80E8C87E6E76D25;          // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FEventVoiceFixData) == 0x000008, "Wrong alignment on FEventVoiceFixData");
static_assert(sizeof(FEventVoiceFixData) == 0x000028, "Wrong size on FEventVoiceFixData");
static_assert(offsetof(FEventVoiceFixData, Index_11_1E1FD9B048CA3EE74A749AAE58DF1AC3) == 0x000000, "Member 'FEventVoiceFixData::Index_11_1E1FD9B048CA3EE74A749AAE58DF1AC3' has a wrong offset!");
static_assert(offsetof(FEventVoiceFixData, Label_12_DDD1CDD945C5AFB436F75BBC90ED72F0) == 0x000004, "Member 'FEventVoiceFixData::Label_12_DDD1CDD945C5AFB436F75BBC90ED72F0' has a wrong offset!");
static_assert(offsetof(FEventVoiceFixData, VoiceName_13_27D37CB3489A00FFEF7B118D04B22A22) == 0x000010, "Member 'FEventVoiceFixData::VoiceName_13_27D37CB3489A00FFEF7B118D04B22A22' has a wrong offset!");
static_assert(offsetof(FEventVoiceFixData, Time_14_0B9BB1764FE90F90C80E8C87E6E76D25) == 0x000020, "Member 'FEventVoiceFixData::Time_14_0B9BB1764FE90F90C80E8C87E6E76D25' has a wrong offset!");

}

