#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventImportantSelectionLR

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK
{

// UserDefinedStruct EventImportantSelectionLR.EventImportantSelectionLR
// 0x0048 (0x0048 - 0x0000)
struct FEventImportantSelectionLR final
{
public:
	class ACharaBase_C*                           Chara_17_5F2B58034FD305FC86D3C3B40F49B017;         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 LeftImage_13_FE1800EF4D1208BB8C0730A547379835;     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 RightImage_14_AAA3942C4676323F2D0395B3FB635E9F;    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventLookAt_C*                      LeftLookAt_21_06A06AA6449752665F2F58B890E267B9;    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventLookAt_C*                      RightLookAt_22_13631FA9435AA7F815F66495BD487B89;   // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEmitter*                               LeftEffect_25_E42F1C074C5D2499337D7BA3D3AF4AF4;    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEmitter*                               RightEffect_27_3750A8BE450DC7C2848FC481610E5F3D;   // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LeftGoToStep_30_2FA71044401A1DCDD3D1C191AC18E8CE;  // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RightGoToStep_32_766027014842826B95609981E026C3C2; // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ACTION_MAPPING_TYPE                         LeftKey_38_FAE2ADC242D0C8A92D91BC995B8C4BFB;       // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ACTION_MAPPING_TYPE                         RightKey_39_93FBED714CDED2BFAF83F6A97D2CF543;      // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FEventImportantSelectionLR) == 0x000008, "Wrong alignment on FEventImportantSelectionLR");
static_assert(sizeof(FEventImportantSelectionLR) == 0x000048, "Wrong size on FEventImportantSelectionLR");
static_assert(offsetof(FEventImportantSelectionLR, Chara_17_5F2B58034FD305FC86D3C3B40F49B017) == 0x000000, "Member 'FEventImportantSelectionLR::Chara_17_5F2B58034FD305FC86D3C3B40F49B017' has a wrong offset!");
static_assert(offsetof(FEventImportantSelectionLR, LeftImage_13_FE1800EF4D1208BB8C0730A547379835) == 0x000008, "Member 'FEventImportantSelectionLR::LeftImage_13_FE1800EF4D1208BB8C0730A547379835' has a wrong offset!");
static_assert(offsetof(FEventImportantSelectionLR, RightImage_14_AAA3942C4676323F2D0395B3FB635E9F) == 0x000010, "Member 'FEventImportantSelectionLR::RightImage_14_AAA3942C4676323F2D0395B3FB635E9F' has a wrong offset!");
static_assert(offsetof(FEventImportantSelectionLR, LeftLookAt_21_06A06AA6449752665F2F58B890E267B9) == 0x000018, "Member 'FEventImportantSelectionLR::LeftLookAt_21_06A06AA6449752665F2F58B890E267B9' has a wrong offset!");
static_assert(offsetof(FEventImportantSelectionLR, RightLookAt_22_13631FA9435AA7F815F66495BD487B89) == 0x000020, "Member 'FEventImportantSelectionLR::RightLookAt_22_13631FA9435AA7F815F66495BD487B89' has a wrong offset!");
static_assert(offsetof(FEventImportantSelectionLR, LeftEffect_25_E42F1C074C5D2499337D7BA3D3AF4AF4) == 0x000028, "Member 'FEventImportantSelectionLR::LeftEffect_25_E42F1C074C5D2499337D7BA3D3AF4AF4' has a wrong offset!");
static_assert(offsetof(FEventImportantSelectionLR, RightEffect_27_3750A8BE450DC7C2848FC481610E5F3D) == 0x000030, "Member 'FEventImportantSelectionLR::RightEffect_27_3750A8BE450DC7C2848FC481610E5F3D' has a wrong offset!");
static_assert(offsetof(FEventImportantSelectionLR, LeftGoToStep_30_2FA71044401A1DCDD3D1C191AC18E8CE) == 0x000038, "Member 'FEventImportantSelectionLR::LeftGoToStep_30_2FA71044401A1DCDD3D1C191AC18E8CE' has a wrong offset!");
static_assert(offsetof(FEventImportantSelectionLR, RightGoToStep_32_766027014842826B95609981E026C3C2) == 0x00003C, "Member 'FEventImportantSelectionLR::RightGoToStep_32_766027014842826B95609981E026C3C2' has a wrong offset!");
static_assert(offsetof(FEventImportantSelectionLR, LeftKey_38_FAE2ADC242D0C8A92D91BC995B8C4BFB) == 0x000040, "Member 'FEventImportantSelectionLR::LeftKey_38_FAE2ADC242D0C8A92D91BC995B8C4BFB' has a wrong offset!");
static_assert(offsetof(FEventImportantSelectionLR, RightKey_39_93FBED714CDED2BFAF83F6A97D2CF543) == 0x000041, "Member 'FEventImportantSelectionLR::RightKey_39_93FBED714CDED2BFAF83F6A97D2CF543' has a wrong offset!");

}

