#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventBattleListStruct

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK
{

// UserDefinedStruct EventBattleListStruct.EventBattleListStruct
// 0x0018 (0x0018 - 0x0000)
struct FEventBattleListStruct final
{
public:
	int32                                         CharaID_2_27CE8DAD47F8F691C576EAB6BF1D5E7F;        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Chara_9_0C7C382342BF813C182B08840F8BE7EA;          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_CHAR_TYPE                               Type_12_DA1AC20D40671CE580ABA38A8A925E5C;          // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FEventBattleListStruct) == 0x000008, "Wrong alignment on FEventBattleListStruct");
static_assert(sizeof(FEventBattleListStruct) == 0x000018, "Wrong size on FEventBattleListStruct");
static_assert(offsetof(FEventBattleListStruct, CharaID_2_27CE8DAD47F8F691C576EAB6BF1D5E7F) == 0x000000, "Member 'FEventBattleListStruct::CharaID_2_27CE8DAD47F8F691C576EAB6BF1D5E7F' has a wrong offset!");
static_assert(offsetof(FEventBattleListStruct, Chara_9_0C7C382342BF813C182B08840F8BE7EA) == 0x000008, "Member 'FEventBattleListStruct::Chara_9_0C7C382342BF813C182B08840F8BE7EA' has a wrong offset!");
static_assert(offsetof(FEventBattleListStruct, Type_12_DA1AC20D40671CE580ABA38A8A925E5C) == 0x000010, "Member 'FEventBattleListStruct::Type_12_DA1AC20D40671CE580ABA38A8A925E5C' has a wrong offset!");

}

