#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lv_CampSub_LevelControl

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function Lv_CampSub_LevelControl.Lv_CampSub_LevelControl_C.GetFildData
// 0x0170 (0x0170 - 0x0000)
struct Lv_CampSub_LevelControl_C_GetFildData final
{
public:
	struct FTransform                             PlayerTransform;                                   // 0x0000(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
	struct FTransform                             PartySpawnTrns;                                    // 0x0030(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
	struct FTransform                             PlayerTrans;                                       // 0x0060(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FTransform                             PartyTrans;                                        // 0x0090(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue_1;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CampLevelMap_C>   K2Node_DynamicCast_AsBPI_Camp_Level_Map;           // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_533B[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CampLevelMap_C>   K2Node_DynamicCast_AsBPI_Camp_Level_Map_1;         // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_533C[0xF];                                     // 0x0101(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetPlayerSpawnTransform_Transform;        // 0x0110(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetPartySpawnTransform_Transform;         // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lv_CampSub_LevelControl_C_GetFildData) == 0x000010, "Wrong alignment on Lv_CampSub_LevelControl_C_GetFildData");
static_assert(sizeof(Lv_CampSub_LevelControl_C_GetFildData) == 0x000170, "Wrong size on Lv_CampSub_LevelControl_C_GetFildData");
static_assert(offsetof(Lv_CampSub_LevelControl_C_GetFildData, PlayerTransform) == 0x000000, "Member 'Lv_CampSub_LevelControl_C_GetFildData::PlayerTransform' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_GetFildData, PartySpawnTrns) == 0x000030, "Member 'Lv_CampSub_LevelControl_C_GetFildData::PartySpawnTrns' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_GetFildData, PlayerTrans) == 0x000060, "Member 'Lv_CampSub_LevelControl_C_GetFildData::PlayerTrans' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_GetFildData, PartyTrans) == 0x000090, "Member 'Lv_CampSub_LevelControl_C_GetFildData::PartyTrans' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_GetFildData, CallFunc_GetStreamingLevel_ReturnValue) == 0x0000C0, "Member 'Lv_CampSub_LevelControl_C_GetFildData::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_GetFildData, CallFunc_GetLevelScriptActor_ReturnValue) == 0x0000C8, "Member 'Lv_CampSub_LevelControl_C_GetFildData::CallFunc_GetLevelScriptActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_GetFildData, CallFunc_GetLevelScriptActor_ReturnValue_1) == 0x0000D0, "Member 'Lv_CampSub_LevelControl_C_GetFildData::CallFunc_GetLevelScriptActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_GetFildData, K2Node_DynamicCast_AsBPI_Camp_Level_Map) == 0x0000D8, "Member 'Lv_CampSub_LevelControl_C_GetFildData::K2Node_DynamicCast_AsBPI_Camp_Level_Map' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_GetFildData, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'Lv_CampSub_LevelControl_C_GetFildData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_GetFildData, K2Node_DynamicCast_AsBPI_Camp_Level_Map_1) == 0x0000F0, "Member 'Lv_CampSub_LevelControl_C_GetFildData::K2Node_DynamicCast_AsBPI_Camp_Level_Map_1' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_GetFildData, K2Node_DynamicCast_bSuccess_1) == 0x000100, "Member 'Lv_CampSub_LevelControl_C_GetFildData::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_GetFildData, CallFunc_GetPlayerSpawnTransform_Transform) == 0x000110, "Member 'Lv_CampSub_LevelControl_C_GetFildData::CallFunc_GetPlayerSpawnTransform_Transform' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_GetFildData, CallFunc_GetPartySpawnTransform_Transform) == 0x000140, "Member 'Lv_CampSub_LevelControl_C_GetFildData::CallFunc_GetPartySpawnTransform_Transform' has a wrong offset!");

// Function Lv_CampSub_LevelControl.Lv_CampSub_LevelControl_C.ActPadEvt_Map_CampOpen_K2Node_ActionPadEvent_0
// 0x0018 (0x0018 - 0x0000)
struct Lv_CampSub_LevelControl_C_ActPadEvt_Map_CampOpen_K2Node_ActionPadEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Lv_CampSub_LevelControl_C_ActPadEvt_Map_CampOpen_K2Node_ActionPadEvent_0) == 0x000008, "Wrong alignment on Lv_CampSub_LevelControl_C_ActPadEvt_Map_CampOpen_K2Node_ActionPadEvent_0");
static_assert(sizeof(Lv_CampSub_LevelControl_C_ActPadEvt_Map_CampOpen_K2Node_ActionPadEvent_0) == 0x000018, "Wrong size on Lv_CampSub_LevelControl_C_ActPadEvt_Map_CampOpen_K2Node_ActionPadEvent_0");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ActPadEvt_Map_CampOpen_K2Node_ActionPadEvent_0, Key) == 0x000000, "Member 'Lv_CampSub_LevelControl_C_ActPadEvt_Map_CampOpen_K2Node_ActionPadEvent_0::Key' has a wrong offset!");

// Function Lv_CampSub_LevelControl.Lv_CampSub_LevelControl_C.EndCamp2
// 0x0002 (0x0002 - 0x0000)
struct Lv_CampSub_LevelControl_C_EndCamp2 final
{
public:
	bool                                          InForceCloseCamp;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InReturnTitle;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lv_CampSub_LevelControl_C_EndCamp2) == 0x000001, "Wrong alignment on Lv_CampSub_LevelControl_C_EndCamp2");
static_assert(sizeof(Lv_CampSub_LevelControl_C_EndCamp2) == 0x000002, "Wrong size on Lv_CampSub_LevelControl_C_EndCamp2");
static_assert(offsetof(Lv_CampSub_LevelControl_C_EndCamp2, InForceCloseCamp) == 0x000000, "Member 'Lv_CampSub_LevelControl_C_EndCamp2::InForceCloseCamp' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_EndCamp2, InReturnTitle) == 0x000001, "Member 'Lv_CampSub_LevelControl_C_EndCamp2::InReturnTitle' has a wrong offset!");

// Function Lv_CampSub_LevelControl.Lv_CampSub_LevelControl_C.ExecuteUbergraph_Lv_CampSub_LevelControl
// 0x0190 (0x0190 - 0x0000)
struct Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_533D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckActionLoad_IsActionLoad;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_533E[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CheckActionLoad_SelSlotId;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn_1;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_533F[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_1;             // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5340[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5341[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_2;                    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_2;             // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_CheckMapPause_IsPause;                // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckActionSave_IsActionSave;             // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_CheckActionSave_SetSaveSlot;              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue_2;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5342[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Traport_C*                          CallFunc_FinishSpawningActor_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5343[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_ActionPadEvent_Key;                         // 0x0108(0x0018)(HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectIsMenuDisabled_ReturnValue;        // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5344[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_InForceCloseCamp;               // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_InReturnTitle;                  // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5345[0x1];                                     // 0x014B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool InForceCloseCamp, bool InReturnTitle)> K2Node_CreateDelegate_OutputDelegate;              // 0x014C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5346[0x4];                                     // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_3;                    // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsCampOpen_IsCampOpen;                 // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5347[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_3;             // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl) == 0x000010, "Wrong alignment on Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl");
static_assert(sizeof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl) == 0x000190, "Wrong size on Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, EntryPoint) == 0x000000, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::EntryPoint' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_Concat_StrStr_ReturnValue) == 0x000008, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_CheckActionLoad_IsActionLoad) == 0x000018, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_CheckActionLoad_IsActionLoad' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_CheckActionLoad_SelSlotId) == 0x00001C, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_CheckActionLoad_SelSlotId' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_GetMapCommon_rerutn) == 0x000040, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_GetMapCommon_rerutn_1) == 0x000048, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_GetMapCommon_rerutn_1' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, K2Node_DynamicCast_AsBPI_Map_Common) == 0x000050, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, K2Node_DynamicCast_AsBPI_Map_Common_1) == 0x000068, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::K2Node_DynamicCast_AsBPI_Map_Common_1' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_GetTimeSeconds_ReturnValue) == 0x00007C, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x000080, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_GetMapCommon_rerutn_2) == 0x000088, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_GetMapCommon_rerutn_2' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, K2Node_DynamicCast_AsBPI_Map_Common_2) == 0x000090, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::K2Node_DynamicCast_AsBPI_Map_Common_2' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_IsValid_ReturnValue) == 0x0000A1, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_BPI_CheckMapPause_IsPause) == 0x0000A2, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_BPI_CheckMapPause_IsPause' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_CheckActionSave_IsActionSave) == 0x0000A3, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_CheckActionSave_IsActionSave' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_CheckActionSave_SetSaveSlot) == 0x0000A4, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_CheckActionSave_SetSaveSlot' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_Conv_IntToString_ReturnValue_1) == 0x0000A8, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_GetTimeSeconds_ReturnValue_2) == 0x0000B8, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_GetTimeSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_MakeTransform_ReturnValue) == 0x0000C0, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000F0, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000F8, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_IsValid_ReturnValue_1) == 0x000100, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, K2Node_ActionPadEvent_Key) == 0x000108, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::K2Node_ActionPadEvent_Key' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000120, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_ProjectIsMenuDisabled_ReturnValue) == 0x000130, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_ProjectIsMenuDisabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000138, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_CheckEventFlag_ReturnValue) == 0x000148, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, K2Node_CustomEvent_InForceCloseCamp) == 0x000149, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::K2Node_CustomEvent_InForceCloseCamp' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, K2Node_CustomEvent_InReturnTitle) == 0x00014A, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::K2Node_CustomEvent_InReturnTitle' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, K2Node_CreateDelegate_OutputDelegate) == 0x00014C, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_GetMapCommon_rerutn_3) == 0x000160, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_GetMapCommon_rerutn_3' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, CallFunc_GetIsCampOpen_IsCampOpen) == 0x000168, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::CallFunc_GetIsCampOpen_IsCampOpen' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, K2Node_DynamicCast_AsBPI_Map_Common_3) == 0x000170, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::K2Node_DynamicCast_AsBPI_Map_Common_3' has a wrong offset!");
static_assert(offsetof(Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl, K2Node_DynamicCast_bSuccess_3) == 0x000180, "Member 'Lv_CampSub_LevelControl_C_ExecuteUbergraph_Lv_CampSub_LevelControl::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

}

