#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lv_CampSub_LevelControl

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Lv_CampSub_LevelControl.Lv_CampSub_LevelControl_C
// 0x0078 (0x02A0 - 0x0228)
class ALv_CampSub_LevelControl_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsCamp;                                            // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5338[0x3];                                     // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CampLevelName;                                     // 0x0234(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5339[0x4];                                     // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   M_SystemMenuAsset;                                 // 0x0240(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class ABP_SystemMenu_Base_C*                  M_SystemMenuActor;                                 // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         M_DebugTime_Start;                                 // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_533A[0x4];                                     // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APostProcessVolume*>             M_Post;                                            // 0x0278(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<bool>                                  M_PosrUnbound;                                     // 0x0288(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_CampCotrol_2_C*                     BP_CampCotrol_3_ExecuteUbergraph_Lv_CampSub_LevelControl_RefProperty; // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetFildData(struct FTransform* PlayerTransform, struct FTransform* PartySpawnTrns);
	void ActPadEvt_Map_CampOpen_K2Node_ActionPadEvent_0(const struct FKey& Key);
	void ReceiveBeginPlay();
	void CampSet();
	void CampReset();
	void CampResetPillar();
	void TestComment();
	void EndCamp2(bool InForceCloseCamp, bool InReturnTitle);
	void Evdis_EndMenu______0();
	void ExecuteUbergraph_Lv_CampSub_LevelControl(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Lv_CampSub_LevelControl_C">();
	}
	static class ALv_CampSub_LevelControl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALv_CampSub_LevelControl_C>();
	}
};
static_assert(alignof(ALv_CampSub_LevelControl_C) == 0x000008, "Wrong alignment on ALv_CampSub_LevelControl_C");
static_assert(sizeof(ALv_CampSub_LevelControl_C) == 0x0002A0, "Wrong size on ALv_CampSub_LevelControl_C");
static_assert(offsetof(ALv_CampSub_LevelControl_C, UberGraphFrame) == 0x000228, "Member 'ALv_CampSub_LevelControl_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALv_CampSub_LevelControl_C, IsCamp) == 0x000230, "Member 'ALv_CampSub_LevelControl_C::IsCamp' has a wrong offset!");
static_assert(offsetof(ALv_CampSub_LevelControl_C, CampLevelName) == 0x000234, "Member 'ALv_CampSub_LevelControl_C::CampLevelName' has a wrong offset!");
static_assert(offsetof(ALv_CampSub_LevelControl_C, M_SystemMenuAsset) == 0x000240, "Member 'ALv_CampSub_LevelControl_C::M_SystemMenuAsset' has a wrong offset!");
static_assert(offsetof(ALv_CampSub_LevelControl_C, M_SystemMenuActor) == 0x000268, "Member 'ALv_CampSub_LevelControl_C::M_SystemMenuActor' has a wrong offset!");
static_assert(offsetof(ALv_CampSub_LevelControl_C, M_DebugTime_Start) == 0x000270, "Member 'ALv_CampSub_LevelControl_C::M_DebugTime_Start' has a wrong offset!");
static_assert(offsetof(ALv_CampSub_LevelControl_C, M_Post) == 0x000278, "Member 'ALv_CampSub_LevelControl_C::M_Post' has a wrong offset!");
static_assert(offsetof(ALv_CampSub_LevelControl_C, M_PosrUnbound) == 0x000288, "Member 'ALv_CampSub_LevelControl_C::M_PosrUnbound' has a wrong offset!");
static_assert(offsetof(ALv_CampSub_LevelControl_C, BP_CampCotrol_3_ExecuteUbergraph_Lv_CampSub_LevelControl_RefProperty) == 0x000298, "Member 'ALv_CampSub_LevelControl_C::BP_CampCotrol_3_ExecuteUbergraph_Lv_CampSub_LevelControl_RefProperty' has a wrong offset!");

}

