#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LV_EventMission_M061

#include "Basic.hpp"


namespace SDK::Params
{

// Function LV_EventMission_M061.LV_EventMission_M061_C.ExecuteUbergraph_LV_EventMission_M061
// 0x0050 (0x0050 - 0x0000)
struct LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMapCommonCtrl_C*                       K2Node_DynamicCast_AsMap_Common_Ctrl;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckMapSymbolDeadFlag_ReturnValue;       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9D[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_1;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9E[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapCommonCtrl_C*                       K2Node_DynamicCast_AsMap_Common_Ctrl_1;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061) == 0x000008, "Wrong alignment on LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061");
static_assert(sizeof(LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061) == 0x000050, "Wrong size on LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061");
static_assert(offsetof(LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061, EntryPoint) == 0x000000, "Member 'LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061::EntryPoint' has a wrong offset!");
static_assert(offsetof(LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061, CallFunc_GetMapCommon_rerutn) == 0x000018, "Member 'LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061, K2Node_DynamicCast_AsMap_Common_Ctrl) == 0x000020, "Member 'LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061::K2Node_DynamicCast_AsMap_Common_Ctrl' has a wrong offset!");
static_assert(offsetof(LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061, CallFunc_CheckMapSymbolDeadFlag_ReturnValue) == 0x000029, "Member 'LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061::CallFunc_CheckMapSymbolDeadFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061, CallFunc_GetMapCommon_rerutn_1) == 0x000030, "Member 'LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061::CallFunc_GetMapCommon_rerutn_1' has a wrong offset!");
static_assert(offsetof(LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061, CallFunc_CheckEventFlag_ReturnValue) == 0x000038, "Member 'LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061, K2Node_DynamicCast_AsMap_Common_Ctrl_1) == 0x000040, "Member 'LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061::K2Node_DynamicCast_AsMap_Common_Ctrl_1' has a wrong offset!");
static_assert(offsetof(LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'LV_EventMission_M061_C_ExecuteUbergraph_LV_EventMission_M061::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function LV_EventMission_M061.LV_EventMission_M061_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct LV_EventMission_M061_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LV_EventMission_M061_C_ReceiveTick) == 0x000004, "Wrong alignment on LV_EventMission_M061_C_ReceiveTick");
static_assert(sizeof(LV_EventMission_M061_C_ReceiveTick) == 0x000004, "Wrong size on LV_EventMission_M061_C_ReceiveTick");
static_assert(offsetof(LV_EventMission_M061_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'LV_EventMission_M061_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

