#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LV_m061_ENV

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LV_m061_ENV.LV_m061_ENV_C.ExecuteUbergraph_LV_m061_ENV
// 0x0120 (0x0120 - 0x0000)
struct LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x0038(0x0010)(ReferenceParm)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A177[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EnvCtrl_C>        K2Node_DynamicCast_AsBPI_Env_Ctrl;                 // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A178[0x2];                                     // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0094(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV) == 0x000008, "Wrong alignment on LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV");
static_assert(sizeof(LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV) == 0x000120, "Wrong size on LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV");
static_assert(offsetof(LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV, EntryPoint) == 0x000000, "Member 'LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV::EntryPoint' has a wrong offset!");
static_assert(offsetof(LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV, Temp_int_Array_Index_Variable) == 0x000004, "Member 'LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV, CallFunc_GetActorForwardVector_ReturnValue) == 0x000014, "Member 'LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000020, "Member 'LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV, CallFunc_GetPlayerPawn_ReturnValue) == 0x000030, "Member 'LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV, CallFunc_GetAllActorsWithTag_OutActors) == 0x000038, "Member 'LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV, K2Node_MakeArray_Array) == 0x000048, "Member 'LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV, CallFunc_Array_Get_Item) == 0x000058, "Member 'LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV, K2Node_DynamicCast_AsBPI_Env_Ctrl) == 0x000068, "Member 'LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV::K2Node_DynamicCast_AsBPI_Env_Ctrl' has a wrong offset!");
static_assert(offsetof(LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV, CallFunc_Less_IntInt_ReturnValue) == 0x000079, "Member 'LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00007C, "Member 'LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV, CallFunc_Add_VectorVector_ReturnValue) == 0x000088, "Member 'LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV, CallFunc_LineTraceSingle_OutHit) == 0x000094, "Member 'LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV, CallFunc_LineTraceSingle_ReturnValue) == 0x00011C, "Member 'LV_m061_ENV_C_ExecuteUbergraph_LV_m061_ENV::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");

// Function LV_m061_ENV.LV_m061_ENV_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct LV_m061_ENV_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LV_m061_ENV_C_ReceiveTick) == 0x000004, "Wrong alignment on LV_m061_ENV_C_ReceiveTick");
static_assert(sizeof(LV_m061_ENV_C_ReceiveTick) == 0x000004, "Wrong size on LV_m061_ENV_C_ReceiveTick");
static_assert(offsetof(LV_m061_ENV_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'LV_m061_ENV_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

