#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LV_m061_Kakera

#include "Basic.hpp"


namespace SDK::Params
{

// Function LV_m061_Kakera.LV_m061_Kakera_C.ExecuteUbergraph_LV_m061_Kakera
// 0x0008 (0x0008 - 0x0000)
struct LV_m061_Kakera_C_ExecuteUbergraph_LV_m061_Kakera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LV_m061_Kakera_C_ExecuteUbergraph_LV_m061_Kakera) == 0x000004, "Wrong alignment on LV_m061_Kakera_C_ExecuteUbergraph_LV_m061_Kakera");
static_assert(sizeof(LV_m061_Kakera_C_ExecuteUbergraph_LV_m061_Kakera) == 0x000008, "Wrong size on LV_m061_Kakera_C_ExecuteUbergraph_LV_m061_Kakera");
static_assert(offsetof(LV_m061_Kakera_C_ExecuteUbergraph_LV_m061_Kakera, EntryPoint) == 0x000000, "Member 'LV_m061_Kakera_C_ExecuteUbergraph_LV_m061_Kakera::EntryPoint' has a wrong offset!");
static_assert(offsetof(LV_m061_Kakera_C_ExecuteUbergraph_LV_m061_Kakera, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'LV_m061_Kakera_C_ExecuteUbergraph_LV_m061_Kakera::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function LV_m061_Kakera.LV_m061_Kakera_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct LV_m061_Kakera_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LV_m061_Kakera_C_ReceiveTick) == 0x000004, "Wrong alignment on LV_m061_Kakera_C_ReceiveTick");
static_assert(sizeof(LV_m061_Kakera_C_ReceiveTick) == 0x000004, "Wrong size on LV_m061_Kakera_C_ReceiveTick");
static_assert(offsetof(LV_m061_Kakera_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'LV_m061_Kakera_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

