#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LV_m061_WarpPoint

#include "Basic.hpp"


namespace SDK::Params
{

// Function LV_m061_WarpPoint.LV_m061_WarpPoint_C.ExecuteUbergraph_LV_m061_WarpPoint
// 0x000C (0x000C - 0x0000)
struct LV_m061_WarpPoint_C_ExecuteUbergraph_LV_m061_WarpPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_1;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_2;             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_3;             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_4;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_5;             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LV_m061_WarpPoint_C_ExecuteUbergraph_LV_m061_WarpPoint) == 0x000004, "Wrong alignment on LV_m061_WarpPoint_C_ExecuteUbergraph_LV_m061_WarpPoint");
static_assert(sizeof(LV_m061_WarpPoint_C_ExecuteUbergraph_LV_m061_WarpPoint) == 0x00000C, "Wrong size on LV_m061_WarpPoint_C_ExecuteUbergraph_LV_m061_WarpPoint");
static_assert(offsetof(LV_m061_WarpPoint_C_ExecuteUbergraph_LV_m061_WarpPoint, EntryPoint) == 0x000000, "Member 'LV_m061_WarpPoint_C_ExecuteUbergraph_LV_m061_WarpPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(LV_m061_WarpPoint_C_ExecuteUbergraph_LV_m061_WarpPoint, CallFunc_CheckEventFlag_ReturnValue) == 0x000004, "Member 'LV_m061_WarpPoint_C_ExecuteUbergraph_LV_m061_WarpPoint::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(LV_m061_WarpPoint_C_ExecuteUbergraph_LV_m061_WarpPoint, CallFunc_CheckEventFlag_ReturnValue_1) == 0x000005, "Member 'LV_m061_WarpPoint_C_ExecuteUbergraph_LV_m061_WarpPoint::CallFunc_CheckEventFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LV_m061_WarpPoint_C_ExecuteUbergraph_LV_m061_WarpPoint, CallFunc_CheckEventFlag_ReturnValue_2) == 0x000006, "Member 'LV_m061_WarpPoint_C_ExecuteUbergraph_LV_m061_WarpPoint::CallFunc_CheckEventFlag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LV_m061_WarpPoint_C_ExecuteUbergraph_LV_m061_WarpPoint, CallFunc_CheckEventFlag_ReturnValue_3) == 0x000007, "Member 'LV_m061_WarpPoint_C_ExecuteUbergraph_LV_m061_WarpPoint::CallFunc_CheckEventFlag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LV_m061_WarpPoint_C_ExecuteUbergraph_LV_m061_WarpPoint, CallFunc_CheckEventFlag_ReturnValue_4) == 0x000008, "Member 'LV_m061_WarpPoint_C_ExecuteUbergraph_LV_m061_WarpPoint::CallFunc_CheckEventFlag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LV_m061_WarpPoint_C_ExecuteUbergraph_LV_m061_WarpPoint, CallFunc_CheckEventFlag_ReturnValue_5) == 0x000009, "Member 'LV_m061_WarpPoint_C_ExecuteUbergraph_LV_m061_WarpPoint::CallFunc_CheckEventFlag_ReturnValue_5' has a wrong offset!");

}

