#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LV_MainMission_M061_P

#include "Basic.hpp"


namespace SDK::Params
{

// Function LV_MainMission_M061_P.LV_MainMission_M061_P_C.ExecuteUbergraph_LV_MainMission_M061_P
// 0x00A0 (0x00A0 - 0x0000)
struct LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD17[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_1;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD18[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMapCommonCtrl_C*                       K2Node_DynamicCast_AsMap_Common_Ctrl;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMapEventActivateFlags_ReturnValue;      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD19[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_1;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMapCommonCtrl_C*                       K2Node_DynamicCast_AsMap_Common_Ctrl_1;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD1A[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_2;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD1B[0x2];                                     // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsMapEventActivateFlags_ReturnValue_1;    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_3;             // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD1C[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_2;                    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMapCommonCtrl_C*                       K2Node_DynamicCast_AsMap_Common_Ctrl_2;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMapEventActivateFlags_ReturnValue_2;    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P) == 0x000008, "Wrong alignment on LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P");
static_assert(sizeof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P) == 0x0000A0, "Wrong size on LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, EntryPoint) == 0x000000, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::EntryPoint' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, CallFunc_CheckEventFlag_ReturnValue) == 0x000004, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, CallFunc_CheckEventFlag_ReturnValue_1) == 0x000018, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::CallFunc_CheckEventFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, CallFunc_GetMapCommon_rerutn) == 0x000020, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, K2Node_DynamicCast_AsMap_Common_Ctrl) == 0x000028, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::K2Node_DynamicCast_AsMap_Common_Ctrl' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, CallFunc_IsMapEventActivateFlags_ReturnValue) == 0x000031, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::CallFunc_IsMapEventActivateFlags_ReturnValue' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, CallFunc_GetMapCommon_rerutn_1) == 0x000038, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::CallFunc_GetMapCommon_rerutn_1' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, K2Node_DynamicCast_AsMap_Common_Ctrl_1) == 0x000040, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::K2Node_DynamicCast_AsMap_Common_Ctrl_1' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, K2Node_CreateDelegate_OutputDelegate_1) == 0x00004C, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, CallFunc_CheckEventFlag_ReturnValue_2) == 0x00005C, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::CallFunc_CheckEventFlag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, CallFunc_IsValid_ReturnValue) == 0x00005D, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, K2Node_ActorBoundEvent_OverlappedActor) == 0x000060, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::K2Node_ActorBoundEvent_OverlappedActor' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, K2Node_ActorBoundEvent_OtherActor) == 0x000068, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::K2Node_ActorBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, K2Node_CreateDelegate_OutputDelegate_2) == 0x000070, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, CallFunc_IsMapEventActivateFlags_ReturnValue_1) == 0x000080, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::CallFunc_IsMapEventActivateFlags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, CallFunc_IsValid_ReturnValue_1) == 0x000081, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, CallFunc_IsValid_ReturnValue_2) == 0x000082, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, CallFunc_CheckEventFlag_ReturnValue_3) == 0x000083, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::CallFunc_CheckEventFlag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, CallFunc_GetMapCommon_rerutn_2) == 0x000088, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::CallFunc_GetMapCommon_rerutn_2' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, K2Node_DynamicCast_AsMap_Common_Ctrl_2) == 0x000090, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::K2Node_DynamicCast_AsMap_Common_Ctrl_2' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P, CallFunc_IsMapEventActivateFlags_ReturnValue_2) == 0x000099, "Member 'LV_MainMission_M061_P_C_ExecuteUbergraph_LV_MainMission_M061_P::CallFunc_IsMapEventActivateFlags_ReturnValue_2' has a wrong offset!");

// Function LV_MainMission_M061_P.LV_MainMission_M061_P_C.BndEvt__TriggerBox_2_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct LV_MainMission_M061_P_C_BndEvt__TriggerBox_2_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LV_MainMission_M061_P_C_BndEvt__TriggerBox_2_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on LV_MainMission_M061_P_C_BndEvt__TriggerBox_2_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(LV_MainMission_M061_P_C_BndEvt__TriggerBox_2_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature) == 0x000010, "Wrong size on LV_MainMission_M061_P_C_BndEvt__TriggerBox_2_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(LV_MainMission_M061_P_C_BndEvt__TriggerBox_2_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature, OverlappedActor) == 0x000000, "Member 'LV_MainMission_M061_P_C_BndEvt__TriggerBox_2_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature::OverlappedActor' has a wrong offset!");
static_assert(offsetof(LV_MainMission_M061_P_C_BndEvt__TriggerBox_2_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'LV_MainMission_M061_P_C_BndEvt__TriggerBox_2_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");

// Function LV_MainMission_M061_P.LV_MainMission_M061_P_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct LV_MainMission_M061_P_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LV_MainMission_M061_P_C_ReceiveTick) == 0x000004, "Wrong alignment on LV_MainMission_M061_P_C_ReceiveTick");
static_assert(sizeof(LV_MainMission_M061_P_C_ReceiveTick) == 0x000004, "Wrong size on LV_MainMission_M061_P_C_ReceiveTick");
static_assert(offsetof(LV_MainMission_M061_P_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'LV_MainMission_M061_P_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

