#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LV_m061_ENV

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LV_m061_ENV.LV_m061_ENV_C
// 0x0020 (0x0248 - 0x0228)
class ALV_m061_ENV_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         _______0_Rate_866FE15447B9C943E77176B3438C1826;    // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______0__Direction_866FE15447B9C943E77176B3438C1826; // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A176[0x3];                                     // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______0;                                          // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADirectionalLight*                      LightSource2_0_ExecuteUbergraph_LV_m061_ENV_RefProperty; // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LV_m061_ENV(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void _______0__UpdateFunc();
	void _______0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LV_m061_ENV_C">();
	}
	static class ALV_m061_ENV_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALV_m061_ENV_C>();
	}
};
static_assert(alignof(ALV_m061_ENV_C) == 0x000008, "Wrong alignment on ALV_m061_ENV_C");
static_assert(sizeof(ALV_m061_ENV_C) == 0x000248, "Wrong size on ALV_m061_ENV_C");
static_assert(offsetof(ALV_m061_ENV_C, UberGraphFrame) == 0x000228, "Member 'ALV_m061_ENV_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALV_m061_ENV_C, _______0_Rate_866FE15447B9C943E77176B3438C1826) == 0x000230, "Member 'ALV_m061_ENV_C::_______0_Rate_866FE15447B9C943E77176B3438C1826' has a wrong offset!");
static_assert(offsetof(ALV_m061_ENV_C, _______0__Direction_866FE15447B9C943E77176B3438C1826) == 0x000234, "Member 'ALV_m061_ENV_C::_______0__Direction_866FE15447B9C943E77176B3438C1826' has a wrong offset!");
static_assert(offsetof(ALV_m061_ENV_C, _______0) == 0x000238, "Member 'ALV_m061_ENV_C::_______0' has a wrong offset!");
static_assert(offsetof(ALV_m061_ENV_C, LightSource2_0_ExecuteUbergraph_LV_m061_ENV_RefProperty) == 0x000240, "Member 'ALV_m061_ENV_C::LightSource2_0_ExecuteUbergraph_LV_m061_ENV_RefProperty' has a wrong offset!");

}

