#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LV_m061_EventHit_P

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LV_m061_EventHit_P.LV_m061_EventHit_P_C
// 0x0060 (0x0288 - 0x0228)
class ALV_m061_EventHit_P_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AMEC_CALL_EVENT_IN_C*>           EventHit_StartOFF;                                 // 0x0230(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         Event_Checker;                                     // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD0D[0x4];                                     // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMM_M200_EN0100_C*                      MM_M200_EN0100_2_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMM_M061_E0262_C*                       MM_M061_E0262_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMM_M061_E0242_C*                       MM_M061_E0242_2_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty; // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMM_M061_EM0026_C*                      MM_M061_EM0026_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty; // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMM_M061_EM0027_C*                      MM_M061_EM0027_2_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMM_M061_E0250_2_C*                     MM_M061_E0250_3_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMM_M061_E0243_C*                       MM_M061_E0243_2_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty; // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BGMArea_C*                          BP_Daath_BGMBox35_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty; // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LV_m061_EventHit_P(int32 EntryPoint);
	void EN0070Start();
	void EntryMapEvent();
	void BGMCheck();
	void EndBattle______0();
	void Event_Check_Battle();
	void EndEvent______0();
	void Event_Check();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LV_m061_EventHit_P_C">();
	}
	static class ALV_m061_EventHit_P_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALV_m061_EventHit_P_C>();
	}
};
static_assert(alignof(ALV_m061_EventHit_P_C) == 0x000008, "Wrong alignment on ALV_m061_EventHit_P_C");
static_assert(sizeof(ALV_m061_EventHit_P_C) == 0x000288, "Wrong size on ALV_m061_EventHit_P_C");
static_assert(offsetof(ALV_m061_EventHit_P_C, UberGraphFrame) == 0x000228, "Member 'ALV_m061_EventHit_P_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALV_m061_EventHit_P_C, EventHit_StartOFF) == 0x000230, "Member 'ALV_m061_EventHit_P_C::EventHit_StartOFF' has a wrong offset!");
static_assert(offsetof(ALV_m061_EventHit_P_C, Event_Checker) == 0x000240, "Member 'ALV_m061_EventHit_P_C::Event_Checker' has a wrong offset!");
static_assert(offsetof(ALV_m061_EventHit_P_C, MM_M200_EN0100_2_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty) == 0x000248, "Member 'ALV_m061_EventHit_P_C::MM_M200_EN0100_2_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty' has a wrong offset!");
static_assert(offsetof(ALV_m061_EventHit_P_C, MM_M061_E0262_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty) == 0x000250, "Member 'ALV_m061_EventHit_P_C::MM_M061_E0262_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty' has a wrong offset!");
static_assert(offsetof(ALV_m061_EventHit_P_C, MM_M061_E0242_2_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty) == 0x000258, "Member 'ALV_m061_EventHit_P_C::MM_M061_E0242_2_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty' has a wrong offset!");
static_assert(offsetof(ALV_m061_EventHit_P_C, MM_M061_EM0026_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty) == 0x000260, "Member 'ALV_m061_EventHit_P_C::MM_M061_EM0026_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty' has a wrong offset!");
static_assert(offsetof(ALV_m061_EventHit_P_C, MM_M061_EM0027_2_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty) == 0x000268, "Member 'ALV_m061_EventHit_P_C::MM_M061_EM0027_2_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty' has a wrong offset!");
static_assert(offsetof(ALV_m061_EventHit_P_C, MM_M061_E0250_3_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty) == 0x000270, "Member 'ALV_m061_EventHit_P_C::MM_M061_E0250_3_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty' has a wrong offset!");
static_assert(offsetof(ALV_m061_EventHit_P_C, MM_M061_E0243_2_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty) == 0x000278, "Member 'ALV_m061_EventHit_P_C::MM_M061_E0243_2_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty' has a wrong offset!");
static_assert(offsetof(ALV_m061_EventHit_P_C, BP_Daath_BGMBox35_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty) == 0x000280, "Member 'ALV_m061_EventHit_P_C::BP_Daath_BGMBox35_ExecuteUbergraph_LV_m061_EventHit_P_RefProperty' has a wrong offset!");

}

