#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LV_m061_NaviDevil

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LV_m061_NaviDevil.LV_m061_NaviDevil_C
// 0x0018 (0x0240 - 0x0228)
class ALV_m061_NaviDevil_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AEM_M061_TutorialNavi01_C*              EM_M061_TutorialNavi01_4_ExecuteUbergraph_LV_m061_NaviDevil_RefProperty; // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEM_M061_TutorialNavi02_C*              EM_M061_TutorialNavi02_2_ExecuteUbergraph_LV_m061_NaviDevil_RefProperty; // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LV_m061_NaviDevil(int32 EntryPoint);
	void CallNaviGimmickTutorial_ForInner______0();
	void CallNaviGimmickTutorial_ForOuter______0();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LV_m061_NaviDevil_C">();
	}
	static class ALV_m061_NaviDevil_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALV_m061_NaviDevil_C>();
	}
};
static_assert(alignof(ALV_m061_NaviDevil_C) == 0x000008, "Wrong alignment on ALV_m061_NaviDevil_C");
static_assert(sizeof(ALV_m061_NaviDevil_C) == 0x000240, "Wrong size on ALV_m061_NaviDevil_C");
static_assert(offsetof(ALV_m061_NaviDevil_C, UberGraphFrame) == 0x000228, "Member 'ALV_m061_NaviDevil_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALV_m061_NaviDevil_C, EM_M061_TutorialNavi01_4_ExecuteUbergraph_LV_m061_NaviDevil_RefProperty) == 0x000230, "Member 'ALV_m061_NaviDevil_C::EM_M061_TutorialNavi01_4_ExecuteUbergraph_LV_m061_NaviDevil_RefProperty' has a wrong offset!");
static_assert(offsetof(ALV_m061_NaviDevil_C, EM_M061_TutorialNavi02_2_ExecuteUbergraph_LV_m061_NaviDevil_RefProperty) == 0x000238, "Member 'ALV_m061_NaviDevil_C::EM_M061_TutorialNavi02_2_ExecuteUbergraph_LV_m061_NaviDevil_RefProperty' has a wrong offset!");

}

