#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MagatsukaSymbolPoint

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct MagatsukaSymbolPoint.MagatsukaSymbolPoint
// 0x0018 (0x0018 - 0x0000)
struct FMagatsukaSymbolPoint final
{
public:
	class AActor*                                 SpawnPoint_5_EAE28CD34AE45F5D7A234B8E602F0A5F;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PackIndex_2_48C2E7B1487CE8F5661B819C8FD2B77C;      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ManualMapID_8_1F25A7C5468A3EF181BA129B75841F83;    // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ManualMapID_ON_12_DA235A9D446D8ADAFAFD0AB55F9E9C06; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Fly_14_5C0467D2484B8D5513223D8C4D71D5CB;           // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          FloatingIK_OFF_16_97C44F8B40327020BA08A9B2324B1057; // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ImmediateUpdateFloatingIK_WhenCameraIn_18_F4C9561C4E1CF60BBAFC9394E47F1100; // 0x0013(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FMagatsukaSymbolPoint) == 0x000008, "Wrong alignment on FMagatsukaSymbolPoint");
static_assert(sizeof(FMagatsukaSymbolPoint) == 0x000018, "Wrong size on FMagatsukaSymbolPoint");
static_assert(offsetof(FMagatsukaSymbolPoint, SpawnPoint_5_EAE28CD34AE45F5D7A234B8E602F0A5F) == 0x000000, "Member 'FMagatsukaSymbolPoint::SpawnPoint_5_EAE28CD34AE45F5D7A234B8E602F0A5F' has a wrong offset!");
static_assert(offsetof(FMagatsukaSymbolPoint, PackIndex_2_48C2E7B1487CE8F5661B819C8FD2B77C) == 0x000008, "Member 'FMagatsukaSymbolPoint::PackIndex_2_48C2E7B1487CE8F5661B819C8FD2B77C' has a wrong offset!");
static_assert(offsetof(FMagatsukaSymbolPoint, ManualMapID_8_1F25A7C5468A3EF181BA129B75841F83) == 0x00000C, "Member 'FMagatsukaSymbolPoint::ManualMapID_8_1F25A7C5468A3EF181BA129B75841F83' has a wrong offset!");
static_assert(offsetof(FMagatsukaSymbolPoint, ManualMapID_ON_12_DA235A9D446D8ADAFAFD0AB55F9E9C06) == 0x000010, "Member 'FMagatsukaSymbolPoint::ManualMapID_ON_12_DA235A9D446D8ADAFAFD0AB55F9E9C06' has a wrong offset!");
static_assert(offsetof(FMagatsukaSymbolPoint, Fly_14_5C0467D2484B8D5513223D8C4D71D5CB) == 0x000011, "Member 'FMagatsukaSymbolPoint::Fly_14_5C0467D2484B8D5513223D8C4D71D5CB' has a wrong offset!");
static_assert(offsetof(FMagatsukaSymbolPoint, FloatingIK_OFF_16_97C44F8B40327020BA08A9B2324B1057) == 0x000012, "Member 'FMagatsukaSymbolPoint::FloatingIK_OFF_16_97C44F8B40327020BA08A9B2324B1057' has a wrong offset!");
static_assert(offsetof(FMagatsukaSymbolPoint, ImmediateUpdateFloatingIK_WhenCameraIn_18_F4C9561C4E1CF60BBAFC9394E47F1100) == 0x000013, "Member 'FMagatsukaSymbolPoint::ImmediateUpdateFloatingIK_WhenCameraIn_18_F4C9561C4E1CF60BBAFC9394E47F1100' has a wrong offset!");

}

