#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapAreaResident_ST

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct MapAreaResident_ST.MapAreaResident_ST
// 0x00B0 (0x00B0 - 0x0000)
struct FMapAreaResident_ST final
{
public:
	TArray<struct FPrimaryAssetId>                Area00_26_8661D9574BB4036CE04254A417661E4D;        // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<struct FPrimaryAssetId>                Area01_27_8FAAF3854CCA5B3202C266AEF7C762B7;        // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<struct FPrimaryAssetId>                Area02_28_92F4359F43EA2604F64611ACB5FE7DB6;        // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<struct FPrimaryAssetId>                Area03_29_49ACD7504AE1B8E3497E199247E919A8;        // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<struct FPrimaryAssetId>                Area04_30_CDF31E8343BE703E1BD56E8CED61F002;        // 0x0040(0x0010)(Edit, BlueprintVisible)
	TArray<struct FPrimaryAssetId>                Area05_31_D8E6BAD94C6FC01E67D0F29BEDE66DCD;        // 0x0050(0x0010)(Edit, BlueprintVisible)
	TArray<struct FPrimaryAssetId>                Area06_32_B7F653A5463FEFAA682B16AAB3EA85A8;        // 0x0060(0x0010)(Edit, BlueprintVisible)
	TArray<struct FPrimaryAssetId>                Area07_33_C3D37EBA4F1B546E1723BDBB1FDDD703;        // 0x0070(0x0010)(Edit, BlueprintVisible)
	TArray<struct FPrimaryAssetId>                Area08_34_3BFAE22C4D2D072E14E7E484905F3A3D;        // 0x0080(0x0010)(Edit, BlueprintVisible)
	TArray<struct FPrimaryAssetId>                Area09_35_90F266A54A6637FB82AC86A9057599B3;        // 0x0090(0x0010)(Edit, BlueprintVisible)
	TArray<struct FPrimaryAssetId>                AreaTerminal_25_738D12D14A51FCC1BFF1B295F4AD03D7;  // 0x00A0(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FMapAreaResident_ST) == 0x000008, "Wrong alignment on FMapAreaResident_ST");
static_assert(sizeof(FMapAreaResident_ST) == 0x0000B0, "Wrong size on FMapAreaResident_ST");
static_assert(offsetof(FMapAreaResident_ST, Area00_26_8661D9574BB4036CE04254A417661E4D) == 0x000000, "Member 'FMapAreaResident_ST::Area00_26_8661D9574BB4036CE04254A417661E4D' has a wrong offset!");
static_assert(offsetof(FMapAreaResident_ST, Area01_27_8FAAF3854CCA5B3202C266AEF7C762B7) == 0x000010, "Member 'FMapAreaResident_ST::Area01_27_8FAAF3854CCA5B3202C266AEF7C762B7' has a wrong offset!");
static_assert(offsetof(FMapAreaResident_ST, Area02_28_92F4359F43EA2604F64611ACB5FE7DB6) == 0x000020, "Member 'FMapAreaResident_ST::Area02_28_92F4359F43EA2604F64611ACB5FE7DB6' has a wrong offset!");
static_assert(offsetof(FMapAreaResident_ST, Area03_29_49ACD7504AE1B8E3497E199247E919A8) == 0x000030, "Member 'FMapAreaResident_ST::Area03_29_49ACD7504AE1B8E3497E199247E919A8' has a wrong offset!");
static_assert(offsetof(FMapAreaResident_ST, Area04_30_CDF31E8343BE703E1BD56E8CED61F002) == 0x000040, "Member 'FMapAreaResident_ST::Area04_30_CDF31E8343BE703E1BD56E8CED61F002' has a wrong offset!");
static_assert(offsetof(FMapAreaResident_ST, Area05_31_D8E6BAD94C6FC01E67D0F29BEDE66DCD) == 0x000050, "Member 'FMapAreaResident_ST::Area05_31_D8E6BAD94C6FC01E67D0F29BEDE66DCD' has a wrong offset!");
static_assert(offsetof(FMapAreaResident_ST, Area06_32_B7F653A5463FEFAA682B16AAB3EA85A8) == 0x000060, "Member 'FMapAreaResident_ST::Area06_32_B7F653A5463FEFAA682B16AAB3EA85A8' has a wrong offset!");
static_assert(offsetof(FMapAreaResident_ST, Area07_33_C3D37EBA4F1B546E1723BDBB1FDDD703) == 0x000070, "Member 'FMapAreaResident_ST::Area07_33_C3D37EBA4F1B546E1723BDBB1FDDD703' has a wrong offset!");
static_assert(offsetof(FMapAreaResident_ST, Area08_34_3BFAE22C4D2D072E14E7E484905F3A3D) == 0x000080, "Member 'FMapAreaResident_ST::Area08_34_3BFAE22C4D2D072E14E7E484905F3A3D' has a wrong offset!");
static_assert(offsetof(FMapAreaResident_ST, Area09_35_90F266A54A6637FB82AC86A9057599B3) == 0x000090, "Member 'FMapAreaResident_ST::Area09_35_90F266A54A6637FB82AC86A9057599B3' has a wrong offset!");
static_assert(offsetof(FMapAreaResident_ST, AreaTerminal_25_738D12D14A51FCC1BFF1B295F4AD03D7) == 0x0000A0, "Member 'FMapAreaResident_ST::AreaTerminal_25_738D12D14A51FCC1BFF1B295F4AD03D7' has a wrong offset!");

}

