#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapActorCore

#include "Basic.hpp"


namespace SDK::Params
{

// Function MapActorCore.MapActorCore_C.ExecuteUbergraph_MapActorCore
// 0x0004 (0x0004 - 0x0000)
struct MapActorCore_C_ExecuteUbergraph_MapActorCore final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MapActorCore_C_ExecuteUbergraph_MapActorCore) == 0x000004, "Wrong alignment on MapActorCore_C_ExecuteUbergraph_MapActorCore");
static_assert(sizeof(MapActorCore_C_ExecuteUbergraph_MapActorCore) == 0x000004, "Wrong size on MapActorCore_C_ExecuteUbergraph_MapActorCore");
static_assert(offsetof(MapActorCore_C_ExecuteUbergraph_MapActorCore, EntryPoint) == 0x000000, "Member 'MapActorCore_C_ExecuteUbergraph_MapActorCore::EntryPoint' has a wrong offset!");

// Function MapActorCore.MapActorCore_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct MapActorCore_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MapActorCore_C_UserConstructionScript) == 0x000001, "Wrong alignment on MapActorCore_C_UserConstructionScript");
static_assert(sizeof(MapActorCore_C_UserConstructionScript) == 0x000001, "Wrong size on MapActorCore_C_UserConstructionScript");
static_assert(offsetof(MapActorCore_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'MapActorCore_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function MapActorCore.MapActorCore_C.GetPaused
// 0x0001 (0x0001 - 0x0000)
struct MapActorCore_C_GetPaused final
{
public:
	bool                                          Pause;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MapActorCore_C_GetPaused) == 0x000001, "Wrong alignment on MapActorCore_C_GetPaused");
static_assert(sizeof(MapActorCore_C_GetPaused) == 0x000001, "Wrong size on MapActorCore_C_GetPaused");
static_assert(offsetof(MapActorCore_C_GetPaused, Pause) == 0x000000, "Member 'MapActorCore_C_GetPaused::Pause' has a wrong offset!");

}

