#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapDevilSpawnerCtrl

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MapDevilSpawnerCtrl.MapDevilSpawnerCtrl_C.ExecuteUbergraph_MapDevilSpawnerCtrl
// 0x0150 (0x0150 - 0x0000)
struct MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E29[0x3];                                      // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2A[0x3];                                      // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2B[0x3];                                      // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2C[0x3];                                      // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_CHAR_TYPE                               CallFunc_Array_Get_Item_1;                         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2D[0x3];                                      // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2E[0x4];                                      // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaBase_C*                           CallFunc_GetPlayerUnit_retValue;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2F[0x3];                                      // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_CHAR_TYPE                               CallFunc_Array_Get_Item_2;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E30[0x3];                                      // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E31[0x6];                                      // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaBase_C*                           CallFunc_GetPlayerUnit_retValue_1;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E32[0x2];                                      // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E33[0x3];                                      // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E34[0x3];                                      // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable_3;                               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E35[0x4];                                      // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class ACharaBase_C*                     Temp_object_Variable;                              // 0x00C8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_CHAR_TYPE                               CallFunc_Array_Get_Item_3;                         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E36[0x7];                                      // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapPlayerSpawner_C*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BTL_CHAR_TYPE                               CallFunc_Array_Get_Item_4;                         // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BTL_CHAR_TYPE                               CallFunc_Array_Get_Item_5;                         // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x00EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E37[0x3];                                      // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E38[0x4];                                      // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0100(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E39[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapDevilSpawner_C*                     CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl) == 0x000010, "Wrong alignment on MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl");
static_assert(sizeof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl) == 0x000150, "Wrong size on MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, EntryPoint) == 0x000000, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::EntryPoint' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, Temp_int_Variable) == 0x000004, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, Temp_int_Array_Index_Variable) == 0x000014, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_Array_Get_Item) == 0x000018, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_Array_Length_ReturnValue_1) == 0x000024, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, Temp_int_Variable_1) == 0x000028, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002C, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_Array_Get_Item_1) == 0x00003C, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_GetPlayerUnit_retValue) == 0x000048, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_GetPlayerUnit_retValue' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_IsValid_ReturnValue_2) == 0x000050, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_Array_Add_ReturnValue) == 0x000054, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_Array_Get_Item_2) == 0x000058, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_Add_IntInt_ReturnValue_2) == 0x00005C, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000060, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000061, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_GetPlayerUnit_retValue_1) == 0x000068, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_GetPlayerUnit_retValue_1' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_BooleanOR_ReturnValue) == 0x000070, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_IsValid_ReturnValue_3) == 0x000071, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_Array_Add_ReturnValue_1) == 0x000074, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_IsValid_ReturnValue_4) == 0x000078, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, Temp_int_Variable_2) == 0x00007C, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_Add_IntInt_ReturnValue_3) == 0x000080, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_Array_Length_ReturnValue_2) == 0x000084, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_Subtract_IntInt_ReturnValue) == 0x000088, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00008C, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, Temp_int_Variable_3) == 0x0000C0, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, Temp_object_Variable) == 0x0000C8, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000D0, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_Array_Get_Item_3) == 0x0000D8, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000E0, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000E8, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x0000E9, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_BooleanOR_ReturnValue_1) == 0x0000EA, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_Array_Get_Item_4) == 0x0000EB, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x0000EC, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_Array_Get_Item_5) == 0x0000ED, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x0000EE, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x0000EF, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_BooleanOR_ReturnValue_2) == 0x0000F0, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_Not_PreBool_ReturnValue) == 0x0000F1, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x0000F2, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_BooleanOR_ReturnValue_3) == 0x0000F3, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x0000F4, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000F8, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_MakeTransform_ReturnValue_1) == 0x000100, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000130, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000138, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000140, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_Array_Add_ReturnValue_2) == 0x000148, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl, CallFunc_Add_IntInt_ReturnValue_4) == 0x00014C, "Member 'MapDevilSpawnerCtrl_C_ExecuteUbergraph_MapDevilSpawnerCtrl::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");

// Function MapDevilSpawnerCtrl.MapDevilSpawnerCtrl_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct MapDevilSpawnerCtrl_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MapDevilSpawnerCtrl_C_ReceiveTick) == 0x000004, "Wrong alignment on MapDevilSpawnerCtrl_C_ReceiveTick");
static_assert(sizeof(MapDevilSpawnerCtrl_C_ReceiveTick) == 0x000004, "Wrong size on MapDevilSpawnerCtrl_C_ReceiveTick");
static_assert(offsetof(MapDevilSpawnerCtrl_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'MapDevilSpawnerCtrl_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function MapDevilSpawnerCtrl.MapDevilSpawnerCtrl_C.GetPlayerUnit
// 0x0028 (0x0028 - 0x0000)
struct MapDevilSpawnerCtrl_C_GetPlayerUnit final
{
public:
	E_BTL_CHAR_TYPE                               Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3A[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaBase_C*                           RetValue;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_CHAR_TYPE                               Lo_Type;                                           // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3B[0x6];                                      // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerBase_C*                          CallFunc_GetPlayer_AsPlayer_Base;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerBase_C*                          CallFunc_GetPlayer_AsPlayer_Base_1;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MapDevilSpawnerCtrl_C_GetPlayerUnit) == 0x000008, "Wrong alignment on MapDevilSpawnerCtrl_C_GetPlayerUnit");
static_assert(sizeof(MapDevilSpawnerCtrl_C_GetPlayerUnit) == 0x000028, "Wrong size on MapDevilSpawnerCtrl_C_GetPlayerUnit");
static_assert(offsetof(MapDevilSpawnerCtrl_C_GetPlayerUnit, Type) == 0x000000, "Member 'MapDevilSpawnerCtrl_C_GetPlayerUnit::Type' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_GetPlayerUnit, RetValue) == 0x000008, "Member 'MapDevilSpawnerCtrl_C_GetPlayerUnit::RetValue' has a wrong offset!");
static_assert(offsetof(MapDevilSpawnerCtrl_C_GetPlayerUnit, Lo_Type) == 0x000010, "Member 'MapDevilSpawnerCtrl_C_GetPlayerUnit::Lo_Type' has a wrong offset!");
