#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapDebugWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MapDebugWindow.MapDebugWindow_C
// 0x0038 (0x0298 - 0x0260)
class UMapDebugWindow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_35;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_128;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FText>                           TextList;                                          // 0x0278(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<class UMapdebugWindowMesBase_C*>       Chaild;                                            // 0x0288(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_MapDebugWindow(int32 EntryPoint);
	void DeleteWindow();
	void UpdateWindow();
	void Construct();
	void MakeWindow();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MapDebugWindow_C">();
	}
	static class UMapDebugWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMapDebugWindow_C>();
	}
};
static_assert(alignof(UMapDebugWindow_C) == 0x000008, "Wrong alignment on UMapDebugWindow_C");
static_assert(sizeof(UMapDebugWindow_C) == 0x000298, "Wrong size on UMapDebugWindow_C");
static_assert(offsetof(UMapDebugWindow_C, UberGraphFrame) == 0x000260, "Member 'UMapDebugWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMapDebugWindow_C, Image_35) == 0x000268, "Member 'UMapDebugWindow_C::Image_35' has a wrong offset!");
static_assert(offsetof(UMapDebugWindow_C, ScrollBox_128) == 0x000270, "Member 'UMapDebugWindow_C::ScrollBox_128' has a wrong offset!");
static_assert(offsetof(UMapDebugWindow_C, TextList) == 0x000278, "Member 'UMapDebugWindow_C::TextList' has a wrong offset!");
static_assert(offsetof(UMapDebugWindow_C, Chaild) == 0x000288, "Member 'UMapDebugWindow_C::Chaild' has a wrong offset!");

}

