#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapEventHit_Type_Walk

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MapEventHit_Core_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MapEventHit_Type_Walk.MapEventHit_Type_Walk_C
// 0x0028 (0x03A8 - 0x0380)
class AMapEventHit_Type_Walk_C : public AMapEventHit_Core_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MapEventHit_Type_Walk_C;            // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         _______0___Track_0_B594B434495027C44983C1935D6238DD; // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______0__Direction_B594B434495027C44983C1935D6238DD; // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89AC[0x3];                                     // 0x0395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______0;                                          // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MoveEnable;                                        // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Walk_Manual;                                       // 0x03A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void FlagCh(bool* OK);
	void ReceiveBeginPlay();
	void _______0__FinishedFunc();
	void _______0__UpdateFunc();
	void BndEvt__Hit_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Play();
	void CallPlayWalkManual();
	void ExecuteUbergraph_MapEventHit_Type_Walk(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MapEventHit_Type_Walk_C">();
	}
	static class AMapEventHit_Type_Walk_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMapEventHit_Type_Walk_C>();
	}
};
static_assert(alignof(AMapEventHit_Type_Walk_C) == 0x000008, "Wrong alignment on AMapEventHit_Type_Walk_C");
static_assert(sizeof(AMapEventHit_Type_Walk_C) == 0x0003A8, "Wrong size on AMapEventHit_Type_Walk_C");
static_assert(offsetof(AMapEventHit_Type_Walk_C, UberGraphFrame_MapEventHit_Type_Walk_C) == 0x000380, "Member 'AMapEventHit_Type_Walk_C::UberGraphFrame_MapEventHit_Type_Walk_C' has a wrong offset!");
static_assert(offsetof(AMapEventHit_Type_Walk_C, Arrow) == 0x000388, "Member 'AMapEventHit_Type_Walk_C::Arrow' has a wrong offset!");
static_assert(offsetof(AMapEventHit_Type_Walk_C, _______0___Track_0_B594B434495027C44983C1935D6238DD) == 0x000390, "Member 'AMapEventHit_Type_Walk_C::_______0___Track_0_B594B434495027C44983C1935D6238DD' has a wrong offset!");
static_assert(offsetof(AMapEventHit_Type_Walk_C, _______0__Direction_B594B434495027C44983C1935D6238DD) == 0x000394, "Member 'AMapEventHit_Type_Walk_C::_______0__Direction_B594B434495027C44983C1935D6238DD' has a wrong offset!");
static_assert(offsetof(AMapEventHit_Type_Walk_C, _______0) == 0x000398, "Member 'AMapEventHit_Type_Walk_C::_______0' has a wrong offset!");
static_assert(offsetof(AMapEventHit_Type_Walk_C, MoveEnable) == 0x0003A0, "Member 'AMapEventHit_Type_Walk_C::MoveEnable' has a wrong offset!");
static_assert(offsetof(AMapEventHit_Type_Walk_C, Walk_Manual) == 0x0003A1, "Member 'AMapEventHit_Type_Walk_C::Walk_Manual' has a wrong offset!");

}

