#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapEventBattlePoint

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MapEventBattlePoint.MapEventBattlePoint_C
// 0x0040 (0x0260 - 0x0220)
class AMapEventBattlePoint_C final : public AActor
{
public:
	class UBoxComponent*                          Box;                                               // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    DebugEventName;                                    // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MapEventID;                                        // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MapEventBattlePoint_C">();
	}
	static class AMapEventBattlePoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMapEventBattlePoint_C>();
	}
};
static_assert(alignof(AMapEventBattlePoint_C) == 0x000008, "Wrong alignment on AMapEventBattlePoint_C");
static_assert(sizeof(AMapEventBattlePoint_C) == 0x000260, "Wrong size on AMapEventBattlePoint_C");
static_assert(offsetof(AMapEventBattlePoint_C, Box) == 0x000220, "Member 'AMapEventBattlePoint_C::Box' has a wrong offset!");
static_assert(offsetof(AMapEventBattlePoint_C, TextRender) == 0x000228, "Member 'AMapEventBattlePoint_C::TextRender' has a wrong offset!");
static_assert(offsetof(AMapEventBattlePoint_C, ChildActor) == 0x000230, "Member 'AMapEventBattlePoint_C::ChildActor' has a wrong offset!");
static_assert(offsetof(AMapEventBattlePoint_C, Cube) == 0x000238, "Member 'AMapEventBattlePoint_C::Cube' has a wrong offset!");
static_assert(offsetof(AMapEventBattlePoint_C, Arrow) == 0x000240, "Member 'AMapEventBattlePoint_C::Arrow' has a wrong offset!");
static_assert(offsetof(AMapEventBattlePoint_C, DefaultSceneRoot) == 0x000248, "Member 'AMapEventBattlePoint_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AMapEventBattlePoint_C, DebugEventName) == 0x000250, "Member 'AMapEventBattlePoint_C::DebugEventName' has a wrong offset!");
static_assert(offsetof(AMapEventBattlePoint_C, MapEventID) == 0x000258, "Member 'AMapEventBattlePoint_C::MapEventID' has a wrong offset!");

}

