#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapEventHit_Type_SHit

#include "Basic.hpp"

#include "ST_LightParam_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_MAP_PLAYER_TYPE_structs.hpp"
#include "Project_structs.hpp"
#include "EventBattleListStruct_structs.hpp"
#include "LoadOnlyResident_ST_structs.hpp"
#include "E_MAP_DEBUG_MES_TYPE_structs.hpp"
#include "E_MAP_SYSTEMRESIDENT_ID_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MapEventHit_Type_SHit.MapEventHit_Type_SHit_C.ExecuteUbergraph_MapEventHit_Type_SHit
// 0x0A80 (0x0A80 - 0x0000)
struct MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEventHitPaused_Paused;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5242[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_Event_EnemyIdList;                          // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_Event_EncountID_3;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5243[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Event_SpawnTransform_2;                     // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_EncountPawn;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_SYMBOL_ENCOUNT                          K2Node_Event_SymbolEncountType;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ManualWhenNotEscape_1;                // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_HitMapAttack_3;                       // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5244[0x5];                                     // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChainEncountInfo                      K2Node_Event_ChainEncountInfo_1;                   // 0x0060(0x0020)()
	bool                                          K2Node_Event_Magatsuhi_1;                          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Stop;                                 // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Hidden;                               // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_inFadeCancel;                         // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_MAP_PLAYER_TYPE                             K2Node_Event_Type;                                 // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MAP_DEBUG_MES_TYPE                          K2Node_Event_MesType;                              // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_PlayerMoveEnable;                     // 0x0087(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_PlayerCameraEnable;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_PlayerVisible;                        // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_MoonTimeEnable;                       // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_SymbolEnable;                         // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_AllMapStop;                           // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_AllObjectHidden;                      // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_TopCamera;                            // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_MissionCheckDisable;                  // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_StartSymbolAIDisable;                 // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_ReturnPlayerPosition_1;               // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_UI_Immediate_1;                       // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5245[0x1];                                     // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_EventEncountID_3;                     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5246[0x8];                                     // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Event_SpawnTransform_1;                     // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         K2Node_Event_NextEventID_1;                        // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NowEventID_1;                         // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Manual_1;                             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5247[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_EventId;                              // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_RestarPoint;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_BattlePoint_1;                        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enable_5;                             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Enable_4;                             // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5248[0x2];                                     // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MapEventID;                           // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsFade;                               // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_MAP_PLAYER_TYPE                             K2Node_Event_Hero;                                 // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5249[0x6];                                     // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPrimaryAssetId>                K2Node_Event_LevelList_1;                          // 0x0100(0x0010)(ConstParm, ReferenceParm)
	TArray<class FName>                           K2Node_Event_NameList;                             // 0x0110(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_Event_MapID_2;                              // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_AreaID_1;                             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enable_3;                             // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Enable_2;                             // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_524A[0x6];                                     // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPrimaryAssetId>                K2Node_Event_LevelList;                            // 0x0130(0x0010)(ConstParm, ReferenceParm)
	TArray<class FName>                           K2Node_Event_LevelNameList;                        // 0x0140(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_Event_MapID_1;                              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_AreaID;                               // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enable_1;                             // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Enable;                               // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_524B[0x6];                                     // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEventBattleListStruct>         K2Node_Event_BTLActor;                             // 0x0160(0x0010)(ConstParm, ReferenceParm)
	struct FTransform                             K2Node_Event_PlayerPos;                            // 0x0170(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_actor_2;                              // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsEnable;                             // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_524C[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJsonDataCtrl*                          K2Node_Event_Json_1;                               // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_Json;                                 // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_MapEventID_;                          // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524D[0x4];                                     // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_ReStartPoint;                         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_BattlePoint;                          // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InitFade;                             // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_WaitEvent;                            // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_524E[0x2];                                     // 0x01E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_EncountID_2;                          // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_Event_EnemyList_2;                          // 0x01E8(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_Event_SafeZoneID_2;                         // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ManualSafeZone_3;                     // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BTL_SYMBOL_ENCOUNT                          K2Node_Event_EncountType_2;                        // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_HitMapAttack_2;                       // 0x01FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_AutoSave;                             // 0x01FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_ReturnPlayerPosition;                 // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_UI_Immediate;                         // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_524F[0x2];                                     // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_EncountAdd;                           // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_MagatukaNum;                          // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsMapChange;                          // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5250[0x3];                                     // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_WarpPoint_2;                          // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_FromEvent;                            // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_OtherMapReturn;                       // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_LightParam                         K2Node_Event_Next;                                 // 0x021C(0x0318)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_LightParam                         K2Node_Event_Prev;                                 // 0x0534(0x0318)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NextAreaId_1;                         // 0x084C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_WarpPoint_1;                          // 0x0850(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_FadeInTime_2;                         // 0x0854(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_EncountID_1;                          // 0x0858(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5251[0x4];                                     // 0x085C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_Event_EnemyList_1;                          // 0x0860(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_Event_SafeZoneID_1;                         // 0x0870(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ManualSafeZone_2;                     // 0x0874(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5252[0x3];                                     // 0x0875(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChainEncountInfo                      K2Node_Event_ChainEncountInfo;                     // 0x0878(0x0020)()
	bool                                          K2Node_Event_Magatsuhi;                            // 0x0898(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_PlayerFirst;                          // 0x0899(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5253[0x6];                                     // 0x089A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Alpha_1;                              // 0x08A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_TakaraID;                             // 0x08AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x08B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Alpha;                                // 0x08B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_ActorLocation_1;                      // 0x08B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_InactiveFlag;                         // 0x08C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5254[0x4];                                     // 0x08CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_2;                              // 0x08D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Owner_1;                              // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_EncountID;                            // 0x08E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5255[0x4];                                     // 0x08E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_Event_EnemyList;                            // 0x08E8(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_Event_SafeZoneID;                           // 0x08F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ManualSafeZone_1;                     // 0x08FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BTL_SYMBOL_ENCOUNT                          K2Node_Event_EncountType_1;                        // 0x08FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5256[0x2];                                     // 0x08FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_EventEncountID_2;                     // 0x0900(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5257[0xC];                                     // 0x0904(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Event_SpawnTransform;                       // 0x0910(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_ManualWhenNotEscape;                  // 0x0940(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_HitMapAttack_1;                       // 0x0941(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BTL_SYMBOL_ENCOUNT                          K2Node_Event_EncountType;                          // 0x0942(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5258[0x1];                                     // 0x0943(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_EventEncountID_1;                     // 0x0944(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SafeZoeID;                            // 0x0948(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ManualSafeZone;                       // 0x094C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_HitMapAttack;                         // 0x094D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5259[0x2];                                     // 0x094E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MapID;                                // 0x0950(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MAP_SYSTEMRESIDENT_ID                       K2Node_Event_Enum;                                 // 0x0954(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_525A[0x3];                                     // 0x0955(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_DataId_1;                             // 0x0958(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_DataId;                               // 0x095C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_WarpPoint;                            // 0x0960(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_FadeInTime_1;                         // 0x0964(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_FadeInTime;                           // 0x0968(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_ActorLocation;                        // 0x096C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_MissionId;                            // 0x0978(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_525B[0x4];                                     // 0x097C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner;                                // 0x0980(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_EventEncountID;                       // 0x0988(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NextEventID;                          // 0x098C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NowEventID;                           // 0x0990(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Manual;                               // 0x0994(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_ChallengeMode;                        // 0x0995(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Visible;                              // 0x0996(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_525C[0x1];                                     // 0x0997(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_NextMapId;                            // 0x0998(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NextAreaId;                           // 0x099C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_FadeCancel;                           // 0x09A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_525D[0x7];                                     // 0x09A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x09A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x09B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x09B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x09C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x09C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_525E[0x3];                                     // 0x09C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x09C8(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_FlagCh_OK;                                // 0x0A50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_525F[0x7];                                     // 0x0A51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0A58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_actor;                                // 0x0A60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0A68(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0A78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEventHitOff_Enable;                     // 0x0A79(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMyArea_IsMyArea;                        // 0x0A7A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0A7B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FlagCh_OK_1;                              // 0x0A7C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMyArea_IsMyArea_1;                      // 0x0A7D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0A7E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit) == 0x000010, "Wrong alignment on MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit");
static_assert(sizeof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit) == 0x000A80, "Wrong size on MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, EntryPoint) == 0x000000, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::EntryPoint' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, CallFunc_IsEventHitPaused_Paused) == 0x000004, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::CallFunc_IsEventHitPaused_Paused' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_EnemyIdList) == 0x000008, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_EnemyIdList' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_EncountID_3) == 0x000018, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_EncountID_3' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_SpawnTransform_2) == 0x000020, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_SpawnTransform_2' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_EncountPawn) == 0x000050, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_EncountPawn' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_SymbolEncountType) == 0x000058, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_SymbolEncountType' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_ManualWhenNotEscape_1) == 0x000059, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_ManualWhenNotEscape_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_HitMapAttack_3) == 0x00005A, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_HitMapAttack_3' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_ChainEncountInfo_1) == 0x000060, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_ChainEncountInfo_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_Magatsuhi_1) == 0x000080, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_Magatsuhi_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, CallFunc_Not_PreBool_ReturnValue) == 0x000081, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_Stop) == 0x000082, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_Stop' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_Hidden) == 0x000083, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_Hidden' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_inFadeCancel) == 0x000084, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_inFadeCancel' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_Type) == 0x000085, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_Type' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_MesType) == 0x000086, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_MesType' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_PlayerMoveEnable) == 0x000087, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_PlayerMoveEnable' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_PlayerCameraEnable) == 0x000088, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_PlayerCameraEnable' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_PlayerVisible) == 0x000089, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_PlayerVisible' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_MoonTimeEnable) == 0x00008A, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_MoonTimeEnable' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_SymbolEnable) == 0x00008B, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_SymbolEnable' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_AllMapStop) == 0x00008C, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_AllMapStop' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_AllObjectHidden) == 0x00008D, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_AllObjectHidden' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_TopCamera) == 0x00008E, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_TopCamera' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_MissionCheckDisable) == 0x00008F, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_MissionCheckDisable' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_StartSymbolAIDisable) == 0x000090, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_StartSymbolAIDisable' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_ReturnPlayerPosition_1) == 0x000091, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_ReturnPlayerPosition_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_UI_Immediate_1) == 0x000092, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_UI_Immediate_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_EventEncountID_3) == 0x000094, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_EventEncountID_3' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_SpawnTransform_1) == 0x0000A0, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_SpawnTransform_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_NextEventID_1) == 0x0000D0, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_NextEventID_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_NowEventID_1) == 0x0000D4, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_NowEventID_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_Manual_1) == 0x0000D8, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_Manual_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_EventId) == 0x0000DC, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_EventId' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_RestarPoint) == 0x0000E0, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_RestarPoint' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_BattlePoint_1) == 0x0000E8, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_BattlePoint_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_Enable_5) == 0x0000F0, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_Enable_5' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_Enable_4) == 0x0000F1, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_Enable_4' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_MapEventID) == 0x0000F4, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_MapEventID' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_IsFade) == 0x0000F8, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_IsFade' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_Hero) == 0x0000F9, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_Hero' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_LevelList_1) == 0x000100, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_LevelList_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_NameList) == 0x000110, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_NameList' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_MapID_2) == 0x000120, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_MapID_2' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_AreaID_1) == 0x000124, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_AreaID_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_Enable_3) == 0x000128, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_Enable_3' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_Enable_2) == 0x000129, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_Enable_2' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_LevelList) == 0x000130, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_LevelList' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_LevelNameList) == 0x000140, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_LevelNameList' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_MapID_1) == 0x000150, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_MapID_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_AreaID) == 0x000154, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_AreaID' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_Enable_1) == 0x000158, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_Enable_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_Enable) == 0x000159, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_Enable' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_BTLActor) == 0x000160, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_BTLActor' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_PlayerPos) == 0x000170, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_PlayerPos' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_actor_2) == 0x0001A0, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_actor_2' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_IsEnable) == 0x0001A8, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_IsEnable' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_Json_1) == 0x0001B0, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_Json_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_Json) == 0x0001B8, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_Json' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_MapEventID_) == 0x0001C8, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_MapEventID_' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_ReStartPoint) == 0x0001D0, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_ReStartPoint' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_BattlePoint) == 0x0001D8, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_BattlePoint' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_InitFade) == 0x0001E0, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_InitFade' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_WaitEvent) == 0x0001E1, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_WaitEvent' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_EncountID_2) == 0x0001E4, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_EncountID_2' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_EnemyList_2) == 0x0001E8, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_EnemyList_2' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_SafeZoneID_2) == 0x0001F8, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_SafeZoneID_2' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_ManualSafeZone_3) == 0x0001FC, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_ManualSafeZone_3' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_EncountType_2) == 0x0001FD, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_EncountType_2' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_HitMapAttack_2) == 0x0001FE, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_HitMapAttack_2' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_AutoSave) == 0x0001FF, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_AutoSave' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_ReturnPlayerPosition) == 0x000200, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_ReturnPlayerPosition' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_UI_Immediate) == 0x000201, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_UI_Immediate' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_EncountAdd) == 0x000204, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_EncountAdd' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_MagatukaNum) == 0x000208, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_MagatukaNum' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_IsMapChange) == 0x00020C, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_IsMapChange' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_WarpPoint_2) == 0x000210, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_WarpPoint_2' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_FromEvent) == 0x000214, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_FromEvent' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_OtherMapReturn) == 0x000218, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_OtherMapReturn' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_Next) == 0x00021C, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_Next' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_Prev) == 0x000534, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_Prev' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_NextAreaId_1) == 0x00084C, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_NextAreaId_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_WarpPoint_1) == 0x000850, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_WarpPoint_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_FadeInTime_2) == 0x000854, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_FadeInTime_2' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_EncountID_1) == 0x000858, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_EncountID_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_EnemyList_1) == 0x000860, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_EnemyList_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_SafeZoneID_1) == 0x000870, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_SafeZoneID_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_ManualSafeZone_2) == 0x000874, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_ManualSafeZone_2' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_ChainEncountInfo) == 0x000878, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_ChainEncountInfo' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_Magatsuhi) == 0x000898, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_Magatsuhi' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_PlayerFirst) == 0x000899, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_PlayerFirst' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_actor_1) == 0x0008A0, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_Alpha_1) == 0x0008A8, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_Alpha_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_TakaraID) == 0x0008AC, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_TakaraID' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_Index) == 0x0008B0, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_Alpha) == 0x0008B4, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_Alpha' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_ActorLocation_1) == 0x0008B8, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_ActorLocation_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_InactiveFlag) == 0x0008C4, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_InactiveFlag' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_Owner_2) == 0x0008D0, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_Owner_2' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_Owner_1) == 0x0008D8, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_Owner_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_EncountID) == 0x0008E0, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_EncountID' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_EnemyList) == 0x0008E8, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_EnemyList' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_SafeZoneID) == 0x0008F8, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_SafeZoneID' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_ManualSafeZone_1) == 0x0008FC, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_ManualSafeZone_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_EncountType_1) == 0x0008FD, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_EncountType_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_EventEncountID_2) == 0x000900, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_EventEncountID_2' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_SpawnTransform) == 0x000910, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_SpawnTransform' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_ManualWhenNotEscape) == 0x000940, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_ManualWhenNotEscape' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_HitMapAttack_1) == 0x000941, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_HitMapAttack_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_EncountType) == 0x000942, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_EncountType' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_EventEncountID_1) == 0x000944, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_EventEncountID_1' has a wrong offset!");
static_assert(offsetof(MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit, K2Node_Event_SafeZoeID) == 0x000948, "Member 'MapEventHit_Type_SHit_C_ExecuteUbergraph_MapEventHit_Type_SHit::K2Node_Event_SafeZoeID' has a wrong offset!");
