#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapPlayerSpawner

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MapPlayerSpawner.MapPlayerSpawner_C
// 0x0050 (0x0270 - 0x0220)
class AMapPlayerSpawner_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTime;                                         // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PartnerID;                                         // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	E_BTL_CHAR_TYPE                               CharType;                                          // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_5B1E[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   M_AssetClass;                                      // 0x0240(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         M_Id;                                              // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Const_HayataroIndex;                               // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MapPlayerSpawner(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnLoaded_6C0EA6AF4DA4C1A7C62C3A986C07899E(TSubclassOf<class UObject> Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MapPlayerSpawner_C">();
	}
	static class AMapPlayerSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMapPlayerSpawner_C>();
	}
};
static_assert(alignof(AMapPlayerSpawner_C) == 0x000008, "Wrong alignment on AMapPlayerSpawner_C");
static_assert(sizeof(AMapPlayerSpawner_C) == 0x000270, "Wrong size on AMapPlayerSpawner_C");
static_assert(offsetof(AMapPlayerSpawner_C, UberGraphFrame) == 0x000220, "Member 'AMapPlayerSpawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMapPlayerSpawner_C, DefaultSceneRoot) == 0x000228, "Member 'AMapPlayerSpawner_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AMapPlayerSpawner_C, DeltaTime) == 0x000230, "Member 'AMapPlayerSpawner_C::DeltaTime' has a wrong offset!");
static_assert(offsetof(AMapPlayerSpawner_C, PartnerID) == 0x000234, "Member 'AMapPlayerSpawner_C::PartnerID' has a wrong offset!");
static_assert(offsetof(AMapPlayerSpawner_C, CharType) == 0x000238, "Member 'AMapPlayerSpawner_C::CharType' has a wrong offset!");
static_assert(offsetof(AMapPlayerSpawner_C, M_AssetClass) == 0x000240, "Member 'AMapPlayerSpawner_C::M_AssetClass' has a wrong offset!");
static_assert(offsetof(AMapPlayerSpawner_C, M_Id) == 0x000268, "Member 'AMapPlayerSpawner_C::M_Id' has a wrong offset!");
static_assert(offsetof(AMapPlayerSpawner_C, Const_HayataroIndex) == 0x00026C, "Member 'AMapPlayerSpawner_C::Const_HayataroIndex' has a wrong offset!");

}

