#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapSymbolHosei

#include "Basic.hpp"

#include "SymbolActPattern_structs.hpp"


namespace SDK
{

// UserDefinedStruct MapSymbolHosei.MapSymbolHosei
// 0x0080 (0x0080 - 0x0000)
struct FMapSymbolHosei final
{
public:
	float                                         Come_NormalSpeedLength_3_6E683FBA45023822931CAEA7A250A569; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Come_SlowSpeedLength_5_9BF671A04EA56DFB9CC703873550CDA1; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Come_SlowSpeedHosei_7_1DF862BE4DF0B97A8F5007914205B6A3; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Come_PlayerPos_XSecAgo_14_BEAF773640520948E34255944A3469EB; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Come_AttackChangeLength_20_292459D7470E3C92495E6F9C23AEBA76; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Attack_TrackingSec_9_8C29A1944FE65B91B49C76AC98B8F83F; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Attack_PlayerPos_XSecAfter_18_C8BFBF3E48DDAE57CA7A66AD43D2B696; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Chase_AttackChangeLength_22_A17CC4E1437136DE91068FBA8C33147D; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DaathAttack_ComeRate_24_6DBB9FCE48279A0B2E83F391B11B743F; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AfterEncount_NoCollisionTime_27_8008FA2241AE7AA0E922AEBDE715C5CF; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AfterEncount_KeepDistance_30_E4E89C8F47BB028F599D4B9C94E1B231; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Discovery_LevelDifference_34_5C00CFBF4BF2EE2D6A60A3A6F761FA7E; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Discovery_LevelDifference_Kamui_55_C159F60A4BDC01201BFFF6941A363B95; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Encount_EnemyBackRange_38_29D145C44FB72016A7D6988439F8046C; // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSymbolActPattern>              Mitama_FirstActPatterns_42_0936D09B48C50202BDD0A4A820120410; // 0x0038(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSymbolActPattern>              Mitama_SecondActPatterns_45_2B6E7814406834A6C2087FBD2D061475; // 0x0048(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSymbolActPattern>              Mitama_GiveupActPatterns_46_153201F84AD618007559F98B9B00295D; // 0x0058(0x0010)(Edit, BlueprintVisible)
	float                                         ChainEncount_InnerRange_51_F51C67034B8BAA47A28EFE97D9B72796; // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChainEncount_OuterRange_52_B4F1A4C442569C7A964D799114172337; // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChainEncount_InnerRange_Riberama_59_5F1CB2A646B579F72AFB53AB97A1D48A; // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChainEncount_OuterRange_Riberama_60_62A036D740B54E5492B4D9B97F26C0DE; // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AfterLoaded_NotDiscoveryTime_64_574AC28145E10074DBC8BD8AF7A0098D; // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FMapSymbolHosei) == 0x000008, "Wrong alignment on FMapSymbolHosei");
static_assert(sizeof(FMapSymbolHosei) == 0x000080, "Wrong size on FMapSymbolHosei");
static_assert(offsetof(FMapSymbolHosei, Come_NormalSpeedLength_3_6E683FBA45023822931CAEA7A250A569) == 0x000000, "Member 'FMapSymbolHosei::Come_NormalSpeedLength_3_6E683FBA45023822931CAEA7A250A569' has a wrong offset!");
static_assert(offsetof(FMapSymbolHosei, Come_SlowSpeedLength_5_9BF671A04EA56DFB9CC703873550CDA1) == 0x000004, "Member 'FMapSymbolHosei::Come_SlowSpeedLength_5_9BF671A04EA56DFB9CC703873550CDA1' has a wrong offset!");
static_assert(offsetof(FMapSymbolHosei, Come_SlowSpeedHosei_7_1DF862BE4DF0B97A8F5007914205B6A3) == 0x000008, "Member 'FMapSymbolHosei::Come_SlowSpeedHosei_7_1DF862BE4DF0B97A8F5007914205B6A3' has a wrong offset!");
static_assert(offsetof(FMapSymbolHosei, Come_PlayerPos_XSecAgo_14_BEAF773640520948E34255944A3469EB) == 0x00000C, "Member 'FMapSymbolHosei::Come_PlayerPos_XSecAgo_14_BEAF773640520948E34255944A3469EB' has a wrong offset!");
static_assert(offsetof(FMapSymbolHosei, Come_AttackChangeLength_20_292459D7470E3C92495E6F9C23AEBA76) == 0x000010, "Member 'FMapSymbolHosei::Come_AttackChangeLength_20_292459D7470E3C92495E6F9C23AEBA76' has a wrong offset!");
static_assert(offsetof(FMapSymbolHosei, Attack_TrackingSec_9_8C29A1944FE65B91B49C76AC98B8F83F) == 0x000014, "Member 'FMapSymbolHosei::Attack_TrackingSec_9_8C29A1944FE65B91B49C76AC98B8F83F' has a wrong offset!");
static_assert(offsetof(FMapSymbolHosei, Attack_PlayerPos_XSecAfter_18_C8BFBF3E48DDAE57CA7A66AD43D2B696) == 0x000018, "Member 'FMapSymbolHosei::Attack_PlayerPos_XSecAfter_18_C8BFBF3E48DDAE57CA7A66AD43D2B696' has a wrong offset!");
static_assert(offsetof(FMapSymbolHosei, Chase_AttackChangeLength_22_A17CC4E1437136DE91068FBA8C33147D) == 0x00001C, "Member 'FMapSymbolHosei::Chase_AttackChangeLength_22_A17CC4E1437136DE91068FBA8C33147D' has a wrong offset!");
static_assert(offsetof(FMapSymbolHosei, DaathAttack_ComeRate_24_6DBB9FCE48279A0B2E83F391B11B743F) == 0x000020, "Member 'FMapSymbolHosei::DaathAttack_ComeRate_24_6DBB9FCE48279A0B2E83F391B11B743F' has a wrong offset!");
static_assert(offsetof(FMapSymbolHosei, AfterEncount_NoCollisionTime_27_8008FA2241AE7AA0E922AEBDE715C5CF) == 0x000024, "Member 'FMapSymbolHosei::AfterEncount_NoCollisionTime_27_8008FA2241AE7AA0E922AEBDE715C5CF' has a wrong offset!");
static_assert(offsetof(FMapSymbolHosei, AfterEncount_KeepDistance_30_E4E89C8F47BB028F599D4B9C94E1B231) == 0x000028, "Member 'FMapSymbolHosei::AfterEncount_KeepDistance_30_E4E89C8F47BB028F599D4B9C94E1B231' has a wrong offset!");
static_assert(offsetof(FMapSymbolHosei, Discovery_LevelDifference_34_5C00CFBF4BF2EE2D6A60A3A6F761FA7E) == 0x00002C, "Member 'FMapSymbolHosei::Discovery_LevelDifference_34_5C00CFBF4BF2EE2D6A60A3A6F761FA7E' has a wrong offset!");
static_assert(offsetof(FMapSymbolHosei, Discovery_LevelDifference_Kamui_55_C159F60A4BDC01201BFFF6941A363B95) == 0x000030, "Member 'FMapSymbolHosei::Discovery_LevelDifference_Kamui_55_C159F60A4BDC01201BFFF6941A363B95' has a wrong offset!");
static_assert(offsetof(FMapSymbolHosei, Encount_EnemyBackRange_38_29D145C44FB72016A7D6988439F8046C) == 0x000034, "Member 'FMapSymbolHosei::Encount_EnemyBackRange_38_29D145C44FB72016A7D6988439F8046C' has a wrong offset!");
static_assert(offsetof(FMapSymbolHosei, Mitama_FirstActPatterns_42_0936D09B48C50202BDD0A4A820120410) == 0x000038, "Member 'FMapSymbolHosei::Mitama_FirstActPatterns_42_0936D09B48C50202BDD0A4A820120410' has a wrong offset!");
static_assert(offsetof(FMapSymbolHosei, Mitama_SecondActPatterns_45_2B6E7814406834A6C2087FBD2D061475) == 0x000048, "Member 'FMapSymbolHosei::Mitama_SecondActPatterns_45_2B6E7814406834A6C2087FBD2D061475' has a wrong offset!");
static_assert(offsetof(FMapSymbolHosei, Mitama_GiveupActPatterns_46_153201F84AD618007559F98B9B00295D) == 0x000058, "Member 'FMapSymbolHosei::Mitama_GiveupActPatterns_46_153201F84AD618007559F98B9B00295D' has a wrong offset!");
static_assert(offsetof(FMapSymbolHosei, ChainEncount_InnerRange_51_F51C67034B8BAA47A28EFE97D9B72796) == 0x000068, "Member 'FMapSymbolHosei::ChainEncount_InnerRange_51_F51C67034B8BAA47A28EFE97D9B72796' has a wrong offset!");
static_assert(offsetof(FMapSymbolHosei, ChainEncount_OuterRange_52_B4F1A4C442569C7A964D799114172337) == 0x00006C, "Member 'FMapSymbolHosei::ChainEncount_OuterRange_52_B4F1A4C442569C7A964D799114172337' has a wrong offset!");
static_assert(offsetof(FMapSymbolHosei, ChainEncount_InnerRange_Riberama_59_5F1CB2A646B579F72AFB53AB97A1D48A) == 0x000070, "Member 'FMapSymbolHosei::ChainEncount_InnerRange_Riberama_59_5F1CB2A646B579F72AFB53AB97A1D48A' has a wrong offset!");
static_assert(offsetof(FMapSymbolHosei, ChainEncount_OuterRange_Riberama_60_62A036D740B54E5492B4D9B97F26C0DE) == 0x000074, "Member 'FMapSymbolHosei::ChainEncount_OuterRange_Riberama_60_62A036D740B54E5492B4D9B97F26C0DE' has a wrong offset!");
static_assert(offsetof(FMapSymbolHosei, AfterLoaded_NotDiscoveryTime_64_574AC28145E10074DBC8BD8AF7A0098D) == 0x000078, "Member 'FMapSymbolHosei::AfterLoaded_NotDiscoveryTime_64_574AC28145E10074DBC8BD8AF7A0098D' has a wrong offset!");

}

