#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapSubLevelTable_ST

#include "Basic.hpp"

#include "MapSubLevelGarden_ST_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MapAreaResident_ST_structs.hpp"
#include "MapSystemResident_ST_structs.hpp"
#include "MapSubLevelMinimap_ST_structs.hpp"
#include "MapUnResident_ST_structs.hpp"


namespace SDK
{

// UserDefinedStruct MapSubLevelTable_ST.MapSubLevelTable_ST
// 0x02A8 (0x02A8 - 0x0000)
struct FMapSubLevelTable_ST final
{
public:
	int32                                         MapID_2_875799C243A678CA77477BB6D83F6EF9;          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        PersistentLevel_28_A610C02E461DB24BA09549987A7CB45E; // 0x0004(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPrimaryAssetId>                ResidentLevel_6_E2E959194A18205E7F0E0786CB25FA51;  // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<struct FPrimaryAssetId>                ResidentBattleHideLevel_41_5FCCE279495189B7F2D736895BDB4F0F; // 0x0028(0x0010)(Edit, BlueprintVisible)
	struct FMapAreaResident_ST                    AreaResidentLevel_25_8CE35D0340B17D40CEE91EB2C95A9B60; // 0x0038(0x00B0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FMapAreaResident_ST                    AreaBattleHideLevel_37_C681AF2F49B73FB21A7A9583F2174189; // 0x00E8(0x00B0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FMapUnResident_ST>              UnresidentLevel_24_9EEF9EB14533906303846C8E33FFADCC; // 0x0198(0x0010)(Edit, BlueprintVisible)
	struct FMapSystemResident_ST                  SystemLevel_23_90717928410AB947707041B75646DDE8;   // 0x01A8(0x00A0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FMapSubLevelMinimap_ST                 Minimap_31_3BAC05D844062BB602A5938E12BEA259;       // 0x0248(0x0050)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FMapSubLevelGarden_ST>          GardenLevel_45_1BEDD3A14B48204794C7699931C3AF4B;   // 0x0298(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FMapSubLevelTable_ST) == 0x000008, "Wrong alignment on FMapSubLevelTable_ST");
static_assert(sizeof(FMapSubLevelTable_ST) == 0x0002A8, "Wrong size on FMapSubLevelTable_ST");
static_assert(offsetof(FMapSubLevelTable_ST, MapID_2_875799C243A678CA77477BB6D83F6EF9) == 0x000000, "Member 'FMapSubLevelTable_ST::MapID_2_875799C243A678CA77477BB6D83F6EF9' has a wrong offset!");
static_assert(offsetof(FMapSubLevelTable_ST, PersistentLevel_28_A610C02E461DB24BA09549987A7CB45E) == 0x000004, "Member 'FMapSubLevelTable_ST::PersistentLevel_28_A610C02E461DB24BA09549987A7CB45E' has a wrong offset!");
static_assert(offsetof(FMapSubLevelTable_ST, ResidentLevel_6_E2E959194A18205E7F0E0786CB25FA51) == 0x000018, "Member 'FMapSubLevelTable_ST::ResidentLevel_6_E2E959194A18205E7F0E0786CB25FA51' has a wrong offset!");
static_assert(offsetof(FMapSubLevelTable_ST, ResidentBattleHideLevel_41_5FCCE279495189B7F2D736895BDB4F0F) == 0x000028, "Member 'FMapSubLevelTable_ST::ResidentBattleHideLevel_41_5FCCE279495189B7F2D736895BDB4F0F' has a wrong offset!");
static_assert(offsetof(FMapSubLevelTable_ST, AreaResidentLevel_25_8CE35D0340B17D40CEE91EB2C95A9B60) == 0x000038, "Member 'FMapSubLevelTable_ST::AreaResidentLevel_25_8CE35D0340B17D40CEE91EB2C95A9B60' has a wrong offset!");
static_assert(offsetof(FMapSubLevelTable_ST, AreaBattleHideLevel_37_C681AF2F49B73FB21A7A9583F2174189) == 0x0000E8, "Member 'FMapSubLevelTable_ST::AreaBattleHideLevel_37_C681AF2F49B73FB21A7A9583F2174189' has a wrong offset!");
static_assert(offsetof(FMapSubLevelTable_ST, UnresidentLevel_24_9EEF9EB14533906303846C8E33FFADCC) == 0x000198, "Member 'FMapSubLevelTable_ST::UnresidentLevel_24_9EEF9EB14533906303846C8E33FFADCC' has a wrong offset!");
static_assert(offsetof(FMapSubLevelTable_ST, SystemLevel_23_90717928410AB947707041B75646DDE8) == 0x0001A8, "Member 'FMapSubLevelTable_ST::SystemLevel_23_90717928410AB947707041B75646DDE8' has a wrong offset!");
static_assert(offsetof(FMapSubLevelTable_ST, Minimap_31_3BAC05D844062BB602A5938E12BEA259) == 0x000248, "Member 'FMapSubLevelTable_ST::Minimap_31_3BAC05D844062BB602A5938E12BEA259' has a wrong offset!");
static_assert(offsetof(FMapSubLevelTable_ST, GardenLevel_45_1BEDD3A14B48204794C7699931C3AF4B) == 0x000298, "Member 'FMapSubLevelTable_ST::GardenLevel_45_1BEDD3A14B48204794C7699931C3AF4B' has a wrong offset!");

}

