#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapSubLevelGarden_ST

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct MapSubLevelGarden_ST.MapSubLevelGarden_ST
// 0x00B0 (0x00B0 - 0x0000)
struct FMapSubLevelGarden_ST final
{
public:
	struct FPrimaryAssetId                        GardenSpawnSublevel_31_1308D4AC41ADB40A51F92E9C03B1DC3C; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        GardenBGSublevel_30_620A912744F5CD83A883FAB4E0DE6AE4; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        GardenENVSublevel_39_308775FA431CB4D41A8A94B9A98F862E; // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        GardenLightMapSublevel_42_E967108846537B3CDB5A91A7A2A4CF8D; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        GardenPlayerCollisionSublevel_45_64211052402EBB56E11566B931A66A61; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPrimaryAssetId>                GardenSublevels_49_CC0E86414FB6C939BE25F9B0CD6F946A; // 0x0050(0x0010)(Edit, BlueprintVisible)
	struct FPrimaryAssetId                        GardenTutorialSublevel_52_9C9029EB4807B23C52B3B49F280693A1; // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             GardenWarpPointTransform_33_0EBA936A4436D8C84A8DF7B60B694398; // 0x0070(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class FName                                   GardenStartFlag_36_CC43CF9A420D08E4F71E488DB28F4744; // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FMapSubLevelGarden_ST) == 0x000010, "Wrong alignment on FMapSubLevelGarden_ST");
static_assert(sizeof(FMapSubLevelGarden_ST) == 0x0000B0, "Wrong size on FMapSubLevelGarden_ST");
static_assert(offsetof(FMapSubLevelGarden_ST, GardenSpawnSublevel_31_1308D4AC41ADB40A51F92E9C03B1DC3C) == 0x000000, "Member 'FMapSubLevelGarden_ST::GardenSpawnSublevel_31_1308D4AC41ADB40A51F92E9C03B1DC3C' has a wrong offset!");
static_assert(offsetof(FMapSubLevelGarden_ST, GardenBGSublevel_30_620A912744F5CD83A883FAB4E0DE6AE4) == 0x000010, "Member 'FMapSubLevelGarden_ST::GardenBGSublevel_30_620A912744F5CD83A883FAB4E0DE6AE4' has a wrong offset!");
static_assert(offsetof(FMapSubLevelGarden_ST, GardenENVSublevel_39_308775FA431CB4D41A8A94B9A98F862E) == 0x000020, "Member 'FMapSubLevelGarden_ST::GardenENVSublevel_39_308775FA431CB4D41A8A94B9A98F862E' has a wrong offset!");
static_assert(offsetof(FMapSubLevelGarden_ST, GardenLightMapSublevel_42_E967108846537B3CDB5A91A7A2A4CF8D) == 0x000030, "Member 'FMapSubLevelGarden_ST::GardenLightMapSublevel_42_E967108846537B3CDB5A91A7A2A4CF8D' has a wrong offset!");
static_assert(offsetof(FMapSubLevelGarden_ST, GardenPlayerCollisionSublevel_45_64211052402EBB56E11566B931A66A61) == 0x000040, "Member 'FMapSubLevelGarden_ST::GardenPlayerCollisionSublevel_45_64211052402EBB56E11566B931A66A61' has a wrong offset!");
static_assert(offsetof(FMapSubLevelGarden_ST, GardenSublevels_49_CC0E86414FB6C939BE25F9B0CD6F946A) == 0x000050, "Member 'FMapSubLevelGarden_ST::GardenSublevels_49_CC0E86414FB6C939BE25F9B0CD6F946A' has a wrong offset!");
static_assert(offsetof(FMapSubLevelGarden_ST, GardenTutorialSublevel_52_9C9029EB4807B23C52B3B49F280693A1) == 0x000060, "Member 'FMapSubLevelGarden_ST::GardenTutorialSublevel_52_9C9029EB4807B23C52B3B49F280693A1' has a wrong offset!");
static_assert(offsetof(FMapSubLevelGarden_ST, GardenWarpPointTransform_33_0EBA936A4436D8C84A8DF7B60B694398) == 0x000070, "Member 'FMapSubLevelGarden_ST::GardenWarpPointTransform_33_0EBA936A4436D8C84A8DF7B60B694398' has a wrong offset!");
static_assert(offsetof(FMapSubLevelGarden_ST, GardenStartFlag_36_CC43CF9A420D08E4F71E488DB28F4744) == 0x0000A0, "Member 'FMapSubLevelGarden_ST::GardenStartFlag_36_CC43CF9A420D08E4F71E488DB28F4744' has a wrong offset!");

}

