#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapSymbolParam_Inhale

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK
{

// UserDefinedStruct MapSymbolParam_Inhale.MapSymbolParam_Inhale
// 0x0068 (0x0068 - 0x0000)
struct FMapSymbolParam_Inhale final
{
public:
	float                                         ForceMax_2_C85CB22546382B62786ED492ECDF4627;       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InhaleDistanceMin_11_E943582B4A5044374A3FA1A5B7D4E017; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InhaleDistanceMax_12_1ACBAE24428616E2BFE64A994984747B; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CHARA_MOTION_ID                             InhaleMotion_13_3F10AFEA4E91079A9C9B03A1838B61FD;  // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CHARA_MOTION_ID                             InhaleEndMotion_16_FEBAFE0B433F7E5C7ED07F8309E8447F; // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EF5[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UParticleSystem>         InhaleEffect_20_C0E2E51E4F163FC2B32FED9179A8211F;  // 0x0010(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   InhaleEffectSocket_23_14EA742A47D4695301B1588D9C413FCD; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      InhaleDecal_29_CF8BCF1D4220755104AAC59667658B80;   // 0x0040(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FMapSymbolParam_Inhale) == 0x000008, "Wrong alignment on FMapSymbolParam_Inhale");
static_assert(sizeof(FMapSymbolParam_Inhale) == 0x000068, "Wrong size on FMapSymbolParam_Inhale");
static_assert(offsetof(FMapSymbolParam_Inhale, ForceMax_2_C85CB22546382B62786ED492ECDF4627) == 0x000000, "Member 'FMapSymbolParam_Inhale::ForceMax_2_C85CB22546382B62786ED492ECDF4627' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam_Inhale, InhaleDistanceMin_11_E943582B4A5044374A3FA1A5B7D4E017) == 0x000004, "Member 'FMapSymbolParam_Inhale::InhaleDistanceMin_11_E943582B4A5044374A3FA1A5B7D4E017' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam_Inhale, InhaleDistanceMax_12_1ACBAE24428616E2BFE64A994984747B) == 0x000008, "Member 'FMapSymbolParam_Inhale::InhaleDistanceMax_12_1ACBAE24428616E2BFE64A994984747B' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam_Inhale, InhaleMotion_13_3F10AFEA4E91079A9C9B03A1838B61FD) == 0x00000C, "Member 'FMapSymbolParam_Inhale::InhaleMotion_13_3F10AFEA4E91079A9C9B03A1838B61FD' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam_Inhale, InhaleEndMotion_16_FEBAFE0B433F7E5C7ED07F8309E8447F) == 0x00000D, "Member 'FMapSymbolParam_Inhale::InhaleEndMotion_16_FEBAFE0B433F7E5C7ED07F8309E8447F' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam_Inhale, InhaleEffect_20_C0E2E51E4F163FC2B32FED9179A8211F) == 0x000010, "Member 'FMapSymbolParam_Inhale::InhaleEffect_20_C0E2E51E4F163FC2B32FED9179A8211F' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam_Inhale, InhaleEffectSocket_23_14EA742A47D4695301B1588D9C413FCD) == 0x000038, "Member 'FMapSymbolParam_Inhale::InhaleEffectSocket_23_14EA742A47D4695301B1588D9C413FCD' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam_Inhale, InhaleDecal_29_CF8BCF1D4220755104AAC59667658B80) == 0x000040, "Member 'FMapSymbolParam_Inhale::InhaleDecal_29_CF8BCF1D4220755104AAC59667658B80' has a wrong offset!");

}

