#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapSymbolParam

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "MapSymbolDiscoveryMotion_structs.hpp"
#include "MapSymbolParam_Inhale_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct MapSymbolParam.MapSymbolParam
// 0x00E0 (0x00E0 - 0x0000)
struct FMapSymbolParam final
{
public:
	int32                                         DevilId_7_329BFC6143ACC514C3F26DAEEF5AE0B2;        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WalkSpeed_3_7ED0C64D46445B3F5AB86082C81E8A32;      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AssaultSpeed_4_A8F866DC4972D996F783CBB4B4BAB98D;   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackChangeLength_35_DE6A46A54D83A507DEFC24BB675AE95D; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MapSymbolScale_21_1FBF88074CD086C174AFDFBC8C9BFEF8; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EncountCollision_SizeX_41_8F92E1144508B1A5CAA11897146919C3; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EncountCollision_SizeY_40_C30F23F04766F301FF299E9BA00E1BD0; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EncountCollision_SizeZ_42_954969E74583F20E26B7AB99DB23D0BD; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EncountCollision_BottomSize_76_7AF5F6824243A1DC241349A05322FB9B; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackCollision_AddSize_45_E78B3E3A48655E56F45B19A0747E6ADB; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackCollision_AddBottomSize_72_032D6CC74A49F3DE09CD178066C11CFF; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackCollision_ChangeTime_47_A65C5701464C6F6900C4B1BBE8CBF51A; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackCollision_ReturnTime_49_8A764C074A194653E1B9AF89443764F1; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CHARA_MOTION_ID                             AttackMotionID_82_B265863C4FEB2AF3E0681A83D6D5096D; // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53BE[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MotionBlendTime_30_6E49A558411DFAF97EAC3DB7684E03F2; // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TurnSpeed_31_B6251F5448BC8A42741C4C9646A4365F;     // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MovingTurnSpeed_34_CBD370044FE0C820DC0DDBA0172E4E9F; // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AddForward_CheckWall_63_FDD8F8B5454DB72CE0E6C5B7FA29A5E7; // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AddWidth_CheckWall_64_9550918743896AE8DF977D9DF518B4C7; // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ClimbableHeight_62_1AF33E984D582351F695DC9834429B31; // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMapSymbolDiscoveryMotion>      DiscoveryMotions_68_0CF7D35F497F0B077C1067B1949CA36A; // 0x0050(0x0010)(Edit, BlueprintVisible)
	struct FMapSymbolParam_Inhale                 InhaleParam_83_0BA84A5242A7371DC9568E933CC0BC07;   // 0x0060(0x0068)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FVector                                AttackCollision2_Offset_87_6D920E984A4E74ECE79C48B753EDA9F5; // 0x00C8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AttackCollision2_Size_88_C4F598AE415A4EE7F953C997B3CBD076; // 0x00D4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FMapSymbolParam) == 0x000008, "Wrong alignment on FMapSymbolParam");
static_assert(sizeof(FMapSymbolParam) == 0x0000E0, "Wrong size on FMapSymbolParam");
static_assert(offsetof(FMapSymbolParam, DevilId_7_329BFC6143ACC514C3F26DAEEF5AE0B2) == 0x000000, "Member 'FMapSymbolParam::DevilId_7_329BFC6143ACC514C3F26DAEEF5AE0B2' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, WalkSpeed_3_7ED0C64D46445B3F5AB86082C81E8A32) == 0x000004, "Member 'FMapSymbolParam::WalkSpeed_3_7ED0C64D46445B3F5AB86082C81E8A32' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, AssaultSpeed_4_A8F866DC4972D996F783CBB4B4BAB98D) == 0x000008, "Member 'FMapSymbolParam::AssaultSpeed_4_A8F866DC4972D996F783CBB4B4BAB98D' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, AttackChangeLength_35_DE6A46A54D83A507DEFC24BB675AE95D) == 0x00000C, "Member 'FMapSymbolParam::AttackChangeLength_35_DE6A46A54D83A507DEFC24BB675AE95D' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, MapSymbolScale_21_1FBF88074CD086C174AFDFBC8C9BFEF8) == 0x000010, "Member 'FMapSymbolParam::MapSymbolScale_21_1FBF88074CD086C174AFDFBC8C9BFEF8' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, EncountCollision_SizeX_41_8F92E1144508B1A5CAA11897146919C3) == 0x000014, "Member 'FMapSymbolParam::EncountCollision_SizeX_41_8F92E1144508B1A5CAA11897146919C3' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, EncountCollision_SizeY_40_C30F23F04766F301FF299E9BA00E1BD0) == 0x000018, "Member 'FMapSymbolParam::EncountCollision_SizeY_40_C30F23F04766F301FF299E9BA00E1BD0' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, EncountCollision_SizeZ_42_954969E74583F20E26B7AB99DB23D0BD) == 0x00001C, "Member 'FMapSymbolParam::EncountCollision_SizeZ_42_954969E74583F20E26B7AB99DB23D0BD' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, EncountCollision_BottomSize_76_7AF5F6824243A1DC241349A05322FB9B) == 0x000020, "Member 'FMapSymbolParam::EncountCollision_BottomSize_76_7AF5F6824243A1DC241349A05322FB9B' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, AttackCollision_AddSize_45_E78B3E3A48655E56F45B19A0747E6ADB) == 0x000024, "Member 'FMapSymbolParam::AttackCollision_AddSize_45_E78B3E3A48655E56F45B19A0747E6ADB' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, AttackCollision_AddBottomSize_72_032D6CC74A49F3DE09CD178066C11CFF) == 0x000028, "Member 'FMapSymbolParam::AttackCollision_AddBottomSize_72_032D6CC74A49F3DE09CD178066C11CFF' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, AttackCollision_ChangeTime_47_A65C5701464C6F6900C4B1BBE8CBF51A) == 0x00002C, "Member 'FMapSymbolParam::AttackCollision_ChangeTime_47_A65C5701464C6F6900C4B1BBE8CBF51A' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, AttackCollision_ReturnTime_49_8A764C074A194653E1B9AF89443764F1) == 0x000030, "Member 'FMapSymbolParam::AttackCollision_ReturnTime_49_8A764C074A194653E1B9AF89443764F1' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, AttackMotionID_82_B265863C4FEB2AF3E0681A83D6D5096D) == 0x000034, "Member 'FMapSymbolParam::AttackMotionID_82_B265863C4FEB2AF3E0681A83D6D5096D' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, MotionBlendTime_30_6E49A558411DFAF97EAC3DB7684E03F2) == 0x000038, "Member 'FMapSymbolParam::MotionBlendTime_30_6E49A558411DFAF97EAC3DB7684E03F2' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, TurnSpeed_31_B6251F5448BC8A42741C4C9646A4365F) == 0x00003C, "Member 'FMapSymbolParam::TurnSpeed_31_B6251F5448BC8A42741C4C9646A4365F' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, MovingTurnSpeed_34_CBD370044FE0C820DC0DDBA0172E4E9F) == 0x000040, "Member 'FMapSymbolParam::MovingTurnSpeed_34_CBD370044FE0C820DC0DDBA0172E4E9F' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, AddForward_CheckWall_63_FDD8F8B5454DB72CE0E6C5B7FA29A5E7) == 0x000044, "Member 'FMapSymbolParam::AddForward_CheckWall_63_FDD8F8B5454DB72CE0E6C5B7FA29A5E7' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, AddWidth_CheckWall_64_9550918743896AE8DF977D9DF518B4C7) == 0x000048, "Member 'FMapSymbolParam::AddWidth_CheckWall_64_9550918743896AE8DF977D9DF518B4C7' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, ClimbableHeight_62_1AF33E984D582351F695DC9834429B31) == 0x00004C, "Member 'FMapSymbolParam::ClimbableHeight_62_1AF33E984D582351F695DC9834429B31' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, DiscoveryMotions_68_0CF7D35F497F0B077C1067B1949CA36A) == 0x000050, "Member 'FMapSymbolParam::DiscoveryMotions_68_0CF7D35F497F0B077C1067B1949CA36A' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, InhaleParam_83_0BA84A5242A7371DC9568E933CC0BC07) == 0x000060, "Member 'FMapSymbolParam::InhaleParam_83_0BA84A5242A7371DC9568E933CC0BC07' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, AttackCollision2_Offset_87_6D920E984A4E74ECE79C48B753EDA9F5) == 0x0000C8, "Member 'FMapSymbolParam::AttackCollision2_Offset_87_6D920E984A4E74ECE79C48B753EDA9F5' has a wrong offset!");
static_assert(offsetof(FMapSymbolParam, AttackCollision2_Size_88_C4F598AE415A4EE7F953C997B3CBD076) == 0x0000D4, "Member 'FMapSymbolParam::AttackCollision2_Size_88_C4F598AE415A4EE7F953C997B3CBD076' has a wrong offset!");

}

