#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapSymbolDiscoveryMotion

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK
{

// UserDefinedStruct MapSymbolDiscoveryMotion.MapSymbolDiscoveryMotion
// 0x0003 (0x0003 - 0x0000)
struct FMapSymbolDiscoveryMotion final
{
public:
	E_CHARA_MOTION_ID                             MotionID_BeforeDiscovery_4_61B7849D41592F01F96901B1C2893E53; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CHARA_MOTION_ID                             InsertMotionID_WhenDiscovery_5_3EEE30E84CD522DE64FE88A11942ACB5; // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LookPlayer_WhenDiscoveryMotion_7_6A0B81074F2A66D1A0D162B4005F24CE; // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FMapSymbolDiscoveryMotion) == 0x000001, "Wrong alignment on FMapSymbolDiscoveryMotion");
static_assert(sizeof(FMapSymbolDiscoveryMotion) == 0x000003, "Wrong size on FMapSymbolDiscoveryMotion");
static_assert(offsetof(FMapSymbolDiscoveryMotion, MotionID_BeforeDiscovery_4_61B7849D41592F01F96901B1C2893E53) == 0x000000, "Member 'FMapSymbolDiscoveryMotion::MotionID_BeforeDiscovery_4_61B7849D41592F01F96901B1C2893E53' has a wrong offset!");
static_assert(offsetof(FMapSymbolDiscoveryMotion, InsertMotionID_WhenDiscovery_5_3EEE30E84CD522DE64FE88A11942ACB5) == 0x000001, "Member 'FMapSymbolDiscoveryMotion::InsertMotionID_WhenDiscovery_5_3EEE30E84CD522DE64FE88A11942ACB5' has a wrong offset!");
static_assert(offsetof(FMapSymbolDiscoveryMotion, LookPlayer_WhenDiscoveryMotion_7_6A0B81074F2A66D1A0D162B4005F24CE) == 0x000002, "Member 'FMapSymbolDiscoveryMotion::LookPlayer_WhenDiscoveryMotion_7_6A0B81074F2A66D1A0D162B4005F24CE' has a wrong offset!");

}

