#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapWarpPoint

#include "Basic.hpp"

#include "Project_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MapWarpPoint.MapWarpPoint_C
// 0x0050 (0x0270 - 0x0220)
class AMapWarpPoint_C final : public AMapWarpPoint
{
public:
	class USceneComponent*                        RootPoint;                                         // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   Text;                                              // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor;                                        // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         PointIndex;                                        // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2504[0x4];                                     // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Base;                                              // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Index_MapWarpPoint_C;                              // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void UserConstructionScript();

	int32 GetWarpPointIndex() const;
	class FString GetWarpPointName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MapWarpPoint_C">();
	}
	static class AMapWarpPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMapWarpPoint_C>();
	}
};
static_assert(alignof(AMapWarpPoint_C) == 0x000008, "Wrong alignment on AMapWarpPoint_C");
static_assert(sizeof(AMapWarpPoint_C) == 0x000270, "Wrong size on AMapWarpPoint_C");
static_assert(offsetof(AMapWarpPoint_C, RootPoint) == 0x000220, "Member 'AMapWarpPoint_C::RootPoint' has a wrong offset!");
static_assert(offsetof(AMapWarpPoint_C, Arrow) == 0x000228, "Member 'AMapWarpPoint_C::Arrow' has a wrong offset!");
static_assert(offsetof(AMapWarpPoint_C, Text) == 0x000230, "Member 'AMapWarpPoint_C::Text' has a wrong offset!");
static_assert(offsetof(AMapWarpPoint_C, ChildActor) == 0x000238, "Member 'AMapWarpPoint_C::ChildActor' has a wrong offset!");
static_assert(offsetof(AMapWarpPoint_C, DefaultSceneRoot) == 0x000240, "Member 'AMapWarpPoint_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AMapWarpPoint_C, PointIndex) == 0x000248, "Member 'AMapWarpPoint_C::PointIndex' has a wrong offset!");
static_assert(offsetof(AMapWarpPoint_C, Base) == 0x000250, "Member 'AMapWarpPoint_C::Base' has a wrong offset!");
static_assert(offsetof(AMapWarpPoint_C, Index_MapWarpPoint_C) == 0x000260, "Member 'AMapWarpPoint_C::Index_MapWarpPoint_C' has a wrong offset!");

}

