#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MaterialAnimCoreComponent

#include "Basic.hpp"

#include "MaterialAnimSetting_T_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"


namespace SDK::Params
{

// Function MaterialAnimCoreComponent.MaterialAnimCoreComponent_C.OnFinishDitherRate__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct MaterialAnimCoreComponent_C_OnFinishDitherRate__DelegateSignature final
{
public:
	E_CHARA_ACTION_TYPE                           CharaAction;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MaterialAnimCoreComponent_C_OnFinishDitherRate__DelegateSignature) == 0x000001, "Wrong alignment on MaterialAnimCoreComponent_C_OnFinishDitherRate__DelegateSignature");
static_assert(sizeof(MaterialAnimCoreComponent_C_OnFinishDitherRate__DelegateSignature) == 0x000001, "Wrong size on MaterialAnimCoreComponent_C_OnFinishDitherRate__DelegateSignature");
static_assert(offsetof(MaterialAnimCoreComponent_C_OnFinishDitherRate__DelegateSignature, CharaAction) == 0x000000, "Member 'MaterialAnimCoreComponent_C_OnFinishDitherRate__DelegateSignature::CharaAction' has a wrong offset!");

// Function MaterialAnimCoreComponent.MaterialAnimCoreComponent_C.ExecuteUbergraph_MaterialAnimCoreComponent
// 0x000C (0x000C - 0x0000)
struct MaterialAnimCoreComponent_C_ExecuteUbergraph_MaterialAnimCoreComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BI_UpdateDither_CurrentDitherRate;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MaterialAnimCoreComponent_C_ExecuteUbergraph_MaterialAnimCoreComponent) == 0x000004, "Wrong alignment on MaterialAnimCoreComponent_C_ExecuteUbergraph_MaterialAnimCoreComponent");
static_assert(sizeof(MaterialAnimCoreComponent_C_ExecuteUbergraph_MaterialAnimCoreComponent) == 0x00000C, "Wrong size on MaterialAnimCoreComponent_C_ExecuteUbergraph_MaterialAnimCoreComponent");
static_assert(offsetof(MaterialAnimCoreComponent_C_ExecuteUbergraph_MaterialAnimCoreComponent, EntryPoint) == 0x000000, "Member 'MaterialAnimCoreComponent_C_ExecuteUbergraph_MaterialAnimCoreComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_ExecuteUbergraph_MaterialAnimCoreComponent, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'MaterialAnimCoreComponent_C_ExecuteUbergraph_MaterialAnimCoreComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_ExecuteUbergraph_MaterialAnimCoreComponent, CallFunc_BI_UpdateDither_CurrentDitherRate) == 0x000008, "Member 'MaterialAnimCoreComponent_C_ExecuteUbergraph_MaterialAnimCoreComponent::CallFunc_BI_UpdateDither_CurrentDitherRate' has a wrong offset!");

// Function MaterialAnimCoreComponent.MaterialAnimCoreComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct MaterialAnimCoreComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MaterialAnimCoreComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on MaterialAnimCoreComponent_C_ReceiveTick");
static_assert(sizeof(MaterialAnimCoreComponent_C_ReceiveTick) == 0x000004, "Wrong size on MaterialAnimCoreComponent_C_ReceiveTick");
static_assert(offsetof(MaterialAnimCoreComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'MaterialAnimCoreComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function MaterialAnimCoreComponent.MaterialAnimCoreComponent_C.CreateMeshMID
// 0x00E8 (0x00E8 - 0x0000)
struct MaterialAnimCoreComponent_C_CreateMeshMID final
{
public:
	class UMeshComponent*                         MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_InitialElems;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2735[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Lo_MaterialSlotNames;                              // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Lo_ElemIndex;                                      // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2736[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         Lo_MeshComp;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2737[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2738[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue;         // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2739[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_273A[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_1;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_273B[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_2;                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_273C[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_273D[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x00DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue_6;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MaterialAnimCoreComponent_C_CreateMeshMID) == 0x000008, "Wrong alignment on MaterialAnimCoreComponent_C_CreateMeshMID");
static_assert(sizeof(MaterialAnimCoreComponent_C_CreateMeshMID) == 0x0000E8, "Wrong size on MaterialAnimCoreComponent_C_CreateMeshMID");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, MeshComp) == 0x000000, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::MeshComp' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, Lo_InitialElems) == 0x000008, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::Lo_InitialElems' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, Lo_MaterialSlotNames) == 0x000010, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::Lo_MaterialSlotNames' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, Lo_ElemIndex) == 0x000020, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::Lo_ElemIndex' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, Lo_MeshComp) == 0x000028, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::Lo_MeshComp' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, Temp_int_Array_Index_Variable) == 0x000038, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, Temp_bool_Variable) == 0x00003C, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, Temp_bool_Variable_1) == 0x00003D, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_GetMaterialSlotNames_ReturnValue) == 0x000048, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_GetMaterialSlotNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_Add_IntInt_ReturnValue_1) == 0x000058, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_GetMaterial_ReturnValue) == 0x000060, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_Array_Add_ReturnValue) == 0x000068, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_Array_Add_ReturnValue_1) == 0x00006C, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000070, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_GetMaterial_ReturnValue_1) == 0x000080, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_GetMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000088, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_IsValid_ReturnValue_1) == 0x000090, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_Array_Add_ReturnValue_2) == 0x000094, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_Add_IntInt_ReturnValue_2) == 0x000098, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_Array_Add_ReturnValue_3) == 0x00009C, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_GetMaterial_ReturnValue_2) == 0x0000A0, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_GetMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_Array_Add_ReturnValue_4) == 0x0000A8, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_Array_Add_ReturnValue_5) == 0x0000AC, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x0000B0, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_IsValid_ReturnValue_2) == 0x0000B8, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_Array_Get_Item) == 0x0000BC, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_Conv_NameToString_ReturnValue) == 0x0000C8, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_Array_Length_ReturnValue_1) == 0x0000D8, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_Contains_ReturnValue) == 0x0000DC, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_Less_IntInt_ReturnValue) == 0x0000DD, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_Contains_ReturnValue_1) == 0x0000DE, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, K2Node_Select_Default) == 0x0000DF, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_CreateMeshMID, CallFunc_Array_Add_ReturnValue_6) == 0x0000E0, "Member 'MaterialAnimCoreComponent_C_CreateMeshMID::CallFunc_Array_Add_ReturnValue_6' has a wrong offset!");

// Function MaterialAnimCoreComponent.MaterialAnimCoreComponent_C.ApplyInitialize
// 0x0010 (0x0010 - 0x0000)
struct MaterialAnimCoreComponent_C_ApplyInitialize final
{
public:
	class UMaterialInstanceDynamic*               BaseMatSample;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BI_SelectSwitch_NoUSe;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MaterialAnimCoreComponent_C_ApplyInitialize) == 0x000008, "Wrong alignment on MaterialAnimCoreComponent_C_ApplyInitialize");
static_assert(sizeof(MaterialAnimCoreComponent_C_ApplyInitialize) == 0x000010, "Wrong size on MaterialAnimCoreComponent_C_ApplyInitialize");
static_assert(offsetof(MaterialAnimCoreComponent_C_ApplyInitialize, BaseMatSample) == 0x000000, "Member 'MaterialAnimCoreComponent_C_ApplyInitialize::BaseMatSample' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_ApplyInitialize, CallFunc_BI_SelectSwitch_NoUSe) == 0x000008, "Member 'MaterialAnimCoreComponent_C_ApplyInitialize::CallFunc_BI_SelectSwitch_NoUSe' has a wrong offset!");

// Function MaterialAnimCoreComponent.MaterialAnimCoreComponent_C.BI_GetAllMID
// 0x0020 (0x0020 - 0x0000)
struct MaterialAnimCoreComponent_C_BI_GetAllMID final
{
public:
	TArray<class UMaterialInstanceDynamic*>       Mid;                                               // 0x0000(0x0010)(Parm, OutParm)
	TArray<class UMaterialInstanceDynamic*>       Lo_mid;                                            // 0x0010(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(MaterialAnimCoreComponent_C_BI_GetAllMID) == 0x000008, "Wrong alignment on MaterialAnimCoreComponent_C_BI_GetAllMID");
static_assert(sizeof(MaterialAnimCoreComponent_C_BI_GetAllMID) == 0x000020, "Wrong size on MaterialAnimCoreComponent_C_BI_GetAllMID");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_GetAllMID, Mid) == 0x000000, "Member 'MaterialAnimCoreComponent_C_BI_GetAllMID::Mid' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_GetAllMID, Lo_mid) == 0x000010, "Member 'MaterialAnimCoreComponent_C_BI_GetAllMID::Lo_mid' has a wrong offset!");

// Function MaterialAnimCoreComponent.MaterialAnimCoreComponent_C.BI_SetScalarParam
// 0x0088 (0x0088 - 0x0000)
struct MaterialAnimCoreComponent_C_BI_SetScalarParam final
{
public:
	TArray<class FName>                           ParamNames;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         Val;                                               // 0x0010(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoUse;                                             // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_273E[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_273F[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2740[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_2;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_3;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2741[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MaterialAnimCoreComponent_C_BI_SetScalarParam) == 0x000008, "Wrong alignment on MaterialAnimCoreComponent_C_BI_SetScalarParam");
static_assert(sizeof(MaterialAnimCoreComponent_C_BI_SetScalarParam) == 0x000088, "Wrong size on MaterialAnimCoreComponent_C_BI_SetScalarParam");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, ParamNames) == 0x000000, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::ParamNames' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, Val) == 0x000010, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::Val' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, NoUse) == 0x000014, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::NoUse' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, CallFunc_Array_Length_ReturnValue_1) == 0x000024, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, Temp_int_Array_Index_Variable) == 0x000028, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, Temp_int_Loop_Counter_Variable_1) == 0x00002C, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, Temp_int_Array_Index_Variable_1) == 0x000034, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, Temp_int_Array_Index_Variable_2) == 0x000038, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, CallFunc_Array_Get_Item) == 0x00003C, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, Temp_int_Loop_Counter_Variable_2) == 0x000044, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, CallFunc_Add_IntInt_ReturnValue_2) == 0x00004C, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, Temp_int_Array_Index_Variable_3) == 0x000050, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, CallFunc_Array_Get_Item_1) == 0x000054, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, Temp_int_Loop_Counter_Variable_3) == 0x00005C, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, CallFunc_Less_IntInt_ReturnValue_1) == 0x000060, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, CallFunc_Add_IntInt_ReturnValue_3) == 0x000064, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, CallFunc_Array_Get_Item_2) == 0x000068, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, CallFunc_Array_Get_Item_3) == 0x000070, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, CallFunc_Array_Length_ReturnValue_2) == 0x00007C, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, CallFunc_Array_Length_ReturnValue_3) == 0x000080, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, CallFunc_Less_IntInt_ReturnValue_2) == 0x000084, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetScalarParam, CallFunc_Less_IntInt_ReturnValue_3) == 0x000085, "Member 'MaterialAnimCoreComponent_C_BI_SetScalarParam::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");

// Function MaterialAnimCoreComponent.MaterialAnimCoreComponent_C.BI_IsDitherEnable
// 0x0001 (0x0001 - 0x0000)
struct MaterialAnimCoreComponent_C_BI_IsDitherEnable final
{
public:
	bool                                          IsEnable;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MaterialAnimCoreComponent_C_BI_IsDitherEnable) == 0x000001, "Wrong alignment on MaterialAnimCoreComponent_C_BI_IsDitherEnable");
static_assert(sizeof(MaterialAnimCoreComponent_C_BI_IsDitherEnable) == 0x000001, "Wrong size on MaterialAnimCoreComponent_C_BI_IsDitherEnable");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_IsDitherEnable, IsEnable) == 0x000000, "Member 'MaterialAnimCoreComponent_C_BI_IsDitherEnable::IsEnable' has a wrong offset!");

// Function MaterialAnimCoreComponent.MaterialAnimCoreComponent_C.BI_ResetScalarParam
// 0x0088 (0x0088 - 0x0000)
struct MaterialAnimCoreComponent_C_BI_ResetScalarParam final
{
public:
	TArray<class FName>                           ParamNmaes;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          NoUse;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2742[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2743[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2744[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_2;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2745[0x2];                                     // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2746[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_3;                         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MaterialAnimCoreComponent_C_BI_ResetScalarParam) == 0x000008, "Wrong alignment on MaterialAnimCoreComponent_C_BI_ResetScalarParam");
static_assert(sizeof(MaterialAnimCoreComponent_C_BI_ResetScalarParam) == 0x000088, "Wrong size on MaterialAnimCoreComponent_C_BI_ResetScalarParam");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, ParamNmaes) == 0x000000, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::ParamNmaes' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, NoUse) == 0x000010, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::NoUse' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, Temp_int_Array_Index_Variable) == 0x000014, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, CallFunc_Array_Length_ReturnValue_1) == 0x00001C, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, Temp_int_Loop_Counter_Variable_1) == 0x000024, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, Temp_int_Array_Index_Variable_1) == 0x000034, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, Temp_int_Array_Index_Variable_2) == 0x000038, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, CallFunc_Array_Get_Item) == 0x00003C, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, CallFunc_Array_Get_Item_1) == 0x000044, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, Temp_int_Loop_Counter_Variable_2) == 0x00004C, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, CallFunc_Add_IntInt_ReturnValue_2) == 0x000050, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, Temp_int_Array_Index_Variable_3) == 0x000054, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, Temp_int_Loop_Counter_Variable_3) == 0x000058, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, CallFunc_Array_Get_Item_2) == 0x000060, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, CallFunc_Array_Length_ReturnValue_2) == 0x000068, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, CallFunc_Less_IntInt_ReturnValue_1) == 0x00006C, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, CallFunc_Less_IntInt_ReturnValue_2) == 0x00006D, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, CallFunc_Add_IntInt_ReturnValue_3) == 0x000070, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, CallFunc_Array_Get_Item_3) == 0x000078, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, CallFunc_Array_Length_ReturnValue_3) == 0x000080, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, CallFunc_IsValid_ReturnValue) == 0x000084, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_ResetScalarParam, CallFunc_Less_IntInt_ReturnValue_3) == 0x000085, "Member 'MaterialAnimCoreComponent_C_BI_ResetScalarParam::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");

// Function MaterialAnimCoreComponent.MaterialAnimCoreComponent_C.BI_SetVectorParam
// 0x0098 (0x0098 - 0x0000)
struct MaterialAnimCoreComponent_C_BI_SetVectorParam final
{
public:
	TArray<class FName>                           ParamNames;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FLinearColor                           Val;                                               // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoUse;                                             // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2747[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2748[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2749[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274A[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_2;                         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_3;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MaterialAnimCoreComponent_C_BI_SetVectorParam) == 0x000008, "Wrong alignment on MaterialAnimCoreComponent_C_BI_SetVectorParam");
static_assert(sizeof(MaterialAnimCoreComponent_C_BI_SetVectorParam) == 0x000098, "Wrong size on MaterialAnimCoreComponent_C_BI_SetVectorParam");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, ParamNames) == 0x000000, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::ParamNames' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, Val) == 0x000010, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::Val' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, NoUse) == 0x000020, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::NoUse' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, CallFunc_Array_Length_ReturnValue_1) == 0x000034, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, Temp_int_Loop_Counter_Variable_1) == 0x000038, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, Temp_int_Loop_Counter_Variable_2) == 0x00003C, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, CallFunc_Add_IntInt_ReturnValue_2) == 0x000044, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, Temp_int_Array_Index_Variable) == 0x000048, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, Temp_int_Array_Index_Variable_1) == 0x00004C, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, CallFunc_Array_Get_Item) == 0x000050, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, Temp_int_Array_Index_Variable_2) == 0x000058, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, Temp_int_Loop_Counter_Variable_3) == 0x00005C, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, CallFunc_Less_IntInt_ReturnValue_1) == 0x000060, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, CallFunc_Add_IntInt_ReturnValue_3) == 0x000064, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, Temp_int_Array_Index_Variable_3) == 0x000068, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, CallFunc_Array_Get_Item_1) == 0x00006C, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, CallFunc_Array_Get_Item_2) == 0x000078, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimCoreComponent_C_BI_SetVectorParam, CallFunc_Array_Get_Item_3) == 0x000080, "Member 'MaterialAnimCoreComponent_C_BI_SetVectorParam::CallFunc_Array_Get_Item_3' has a wrong offset!");
