#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MaterialAnimDecalComponent

#include "Basic.hpp"

#include "MaterialAnimSetting_T_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MaterialAnimDecalComponent.MaterialAnimDecalComponent_C.ExecuteUbergraph_MaterialAnimDecalComponent
// 0x0080 (0x0080 - 0x0000)
struct MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AC2[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AC3[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMaterialAnimSetting_T                 CallFunc_Array_Get_Item;                           // 0x0020(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxTimeRange_Max;                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AC4[0x1];                                     // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AC5[0x5];                                     // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        CallFunc_SpawnDecalAttached_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AC6[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC7[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent) == 0x000008, "Wrong alignment on MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent");
static_assert(sizeof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent) == 0x000080, "Wrong size on MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, EntryPoint) == 0x000000, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, Temp_int_Array_Index_Variable) == 0x000018, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, CallFunc_Array_Get_Item) == 0x000020, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, CallFunc_GetMaxTimeRange_Max) == 0x000040, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::CallFunc_GetMaxTimeRange_Max' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000044, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000045, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, CallFunc_IsValid_ReturnValue_1) == 0x000046, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, Temp_int_Variable) == 0x00004C, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, CallFunc_Less_IntInt_ReturnValue_1) == 0x000050, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, CallFunc_BooleanAND_ReturnValue) == 0x000051, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000052, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, CallFunc_SpawnDecalAttached_ReturnValue) == 0x000058, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::CallFunc_SpawnDecalAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, CallFunc_IsValid_ReturnValue_2) == 0x000060, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, CallFunc_IsValid_ReturnValue_3) == 0x000061, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000064, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, CallFunc_Add_FloatFloat_ReturnValue) == 0x000068, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000070, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent, K2Node_Event_EndPlayReason) == 0x000078, "Member 'MaterialAnimDecalComponent_C_ExecuteUbergraph_MaterialAnimDecalComponent::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function MaterialAnimDecalComponent.MaterialAnimDecalComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct MaterialAnimDecalComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MaterialAnimDecalComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on MaterialAnimDecalComponent_C_ReceiveEndPlay");
static_assert(sizeof(MaterialAnimDecalComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on MaterialAnimDecalComponent_C_ReceiveEndPlay");
static_assert(offsetof(MaterialAnimDecalComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'MaterialAnimDecalComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function MaterialAnimDecalComponent.MaterialAnimDecalComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct MaterialAnimDecalComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MaterialAnimDecalComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on MaterialAnimDecalComponent_C_ReceiveTick");
static_assert(sizeof(MaterialAnimDecalComponent_C_ReceiveTick) == 0x000004, "Wrong size on MaterialAnimDecalComponent_C_ReceiveTick");
static_assert(offsetof(MaterialAnimDecalComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'MaterialAnimDecalComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function MaterialAnimDecalComponent.MaterialAnimDecalComponent_C.GetMaxTimeRange
// 0x0058 (0x0058 - 0x0000)
struct MaterialAnimDecalComponent_C_GetMaxTimeRange final
{
public:
	float                                         CurrentMax;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMaterialAnimSetting_T                 Param_MaterialAnimSetting;                         // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Max;                                               // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lo_Max;                                            // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AC9[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeRange_MinTime;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeRange_MaxTime;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ACA[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeRange_MinTime_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeRange_MaxTime_1;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ACB[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeRange_MinTime_2;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeRange_MaxTime_2;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MaterialAnimDecalComponent_C_GetMaxTimeRange) == 0x000008, "Wrong alignment on MaterialAnimDecalComponent_C_GetMaxTimeRange");
static_assert(sizeof(MaterialAnimDecalComponent_C_GetMaxTimeRange) == 0x000058, "Wrong size on MaterialAnimDecalComponent_C_GetMaxTimeRange");
static_assert(offsetof(MaterialAnimDecalComponent_C_GetMaxTimeRange, CurrentMax) == 0x000000, "Member 'MaterialAnimDecalComponent_C_GetMaxTimeRange::CurrentMax' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_GetMaxTimeRange, Param_MaterialAnimSetting) == 0x000008, "Member 'MaterialAnimDecalComponent_C_GetMaxTimeRange::Param_MaterialAnimSetting' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_GetMaxTimeRange, Max) == 0x000028, "Member 'MaterialAnimDecalComponent_C_GetMaxTimeRange::Max' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_GetMaxTimeRange, Lo_Max) == 0x00002C, "Member 'MaterialAnimDecalComponent_C_GetMaxTimeRange::Lo_Max' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_GetMaxTimeRange, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'MaterialAnimDecalComponent_C_GetMaxTimeRange::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_GetMaxTimeRange, CallFunc_GetTimeRange_MinTime) == 0x000034, "Member 'MaterialAnimDecalComponent_C_GetMaxTimeRange::CallFunc_GetTimeRange_MinTime' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_GetMaxTimeRange, CallFunc_GetTimeRange_MaxTime) == 0x000038, "Member 'MaterialAnimDecalComponent_C_GetMaxTimeRange::CallFunc_GetTimeRange_MaxTime' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_GetMaxTimeRange, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00003C, "Member 'MaterialAnimDecalComponent_C_GetMaxTimeRange::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_GetMaxTimeRange, CallFunc_IsValid_ReturnValue_1) == 0x00003D, "Member 'MaterialAnimDecalComponent_C_GetMaxTimeRange::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_GetMaxTimeRange, CallFunc_GetTimeRange_MinTime_1) == 0x000040, "Member 'MaterialAnimDecalComponent_C_GetMaxTimeRange::CallFunc_GetTimeRange_MinTime_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_GetMaxTimeRange, CallFunc_GetTimeRange_MaxTime_1) == 0x000044, "Member 'MaterialAnimDecalComponent_C_GetMaxTimeRange::CallFunc_GetTimeRange_MaxTime_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_GetMaxTimeRange, CallFunc_IsValid_ReturnValue_2) == 0x000048, "Member 'MaterialAnimDecalComponent_C_GetMaxTimeRange::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_GetMaxTimeRange, CallFunc_GetTimeRange_MinTime_2) == 0x00004C, "Member 'MaterialAnimDecalComponent_C_GetMaxTimeRange::CallFunc_GetTimeRange_MinTime_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_GetMaxTimeRange, CallFunc_GetTimeRange_MaxTime_2) == 0x000050, "Member 'MaterialAnimDecalComponent_C_GetMaxTimeRange::CallFunc_GetTimeRange_MaxTime_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_GetMaxTimeRange, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000054, "Member 'MaterialAnimDecalComponent_C_GetMaxTimeRange::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_GetMaxTimeRange, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000055, "Member 'MaterialAnimDecalComponent_C_GetMaxTimeRange::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");

// Function MaterialAnimDecalComponent.MaterialAnimDecalComponent_C.UpdateDecalMaterial
// 0x0068 (0x0068 - 0x0000)
struct MaterialAnimDecalComponent_C_UpdateDecalMaterial final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ACC[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMaterialAnimSetting_T                 CallFunc_Array_Get_Item;                           // 0x0010(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue;          // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVectorValue_ReturnValue;               // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MaterialAnimDecalComponent_C_UpdateDecalMaterial) == 0x000008, "Wrong alignment on MaterialAnimDecalComponent_C_UpdateDecalMaterial");
static_assert(sizeof(MaterialAnimDecalComponent_C_UpdateDecalMaterial) == 0x000068, "Wrong size on MaterialAnimDecalComponent_C_UpdateDecalMaterial");
static_assert(offsetof(MaterialAnimDecalComponent_C_UpdateDecalMaterial, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'MaterialAnimDecalComponent_C_UpdateDecalMaterial::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_UpdateDecalMaterial, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'MaterialAnimDecalComponent_C_UpdateDecalMaterial::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_UpdateDecalMaterial, Temp_int_Array_Index_Variable) == 0x000008, "Member 'MaterialAnimDecalComponent_C_UpdateDecalMaterial::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_UpdateDecalMaterial, CallFunc_Array_Get_Item) == 0x000010, "Member 'MaterialAnimDecalComponent_C_UpdateDecalMaterial::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_UpdateDecalMaterial, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'MaterialAnimDecalComponent_C_UpdateDecalMaterial::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_UpdateDecalMaterial, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'MaterialAnimDecalComponent_C_UpdateDecalMaterial::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_UpdateDecalMaterial, CallFunc_IsValid_ReturnValue) == 0x000035, "Member 'MaterialAnimDecalComponent_C_UpdateDecalMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_UpdateDecalMaterial, CallFunc_IsValid_ReturnValue_1) == 0x000036, "Member 'MaterialAnimDecalComponent_C_UpdateDecalMaterial::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_UpdateDecalMaterial, CallFunc_IsValid_ReturnValue_2) == 0x000037, "Member 'MaterialAnimDecalComponent_C_UpdateDecalMaterial::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_UpdateDecalMaterial, CallFunc_GetLinearColorValue_ReturnValue) == 0x000038, "Member 'MaterialAnimDecalComponent_C_UpdateDecalMaterial::CallFunc_GetLinearColorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_UpdateDecalMaterial, CallFunc_GetVectorValue_ReturnValue) == 0x000048, "Member 'MaterialAnimDecalComponent_C_UpdateDecalMaterial::CallFunc_GetVectorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_UpdateDecalMaterial, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000054, "Member 'MaterialAnimDecalComponent_C_UpdateDecalMaterial::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MaterialAnimDecalComponent_C_UpdateDecalMaterial, CallFunc_GetFloatValue_ReturnValue) == 0x000064, "Member 'MaterialAnimDecalComponent_C_UpdateDecalMaterial::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");

}

