#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MEC_CALL_EVENT_IN

#include "Basic.hpp"

#include "MEC_INOUT_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MEC_CALL_EVENT_IN.MEC_CALL_EVENT_IN_C
// 0x0040 (0x0400 - 0x03C0)
class AMEC_CALL_EVENT_IN_C final : public AMEC_INOUT_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MEC_CALL_EVENT_IN_C;                // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMEC_FLAG_C*                            MEC_FLAG;                                          // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMEC_CALL_EVENT_C*                      MEC_CALL_EVENT;                                    // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         MapEventID;                                        // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C93B[0x4];                                     // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           ON_Flag;                                           // 0x03E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           OFF_Flag;                                          // 0x03F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_MEC_CALL_EVENT_IN(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	bool IsHitEnabled();
	int32 GetMapEventId();
	bool EnableHit(bool IsEnable);
	bool EnableIcon(bool IsEnable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MEC_CALL_EVENT_IN_C">();
	}
	static class AMEC_CALL_EVENT_IN_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMEC_CALL_EVENT_IN_C>();
	}
};
static_assert(alignof(AMEC_CALL_EVENT_IN_C) == 0x000008, "Wrong alignment on AMEC_CALL_EVENT_IN_C");
static_assert(sizeof(AMEC_CALL_EVENT_IN_C) == 0x000400, "Wrong size on AMEC_CALL_EVENT_IN_C");
static_assert(offsetof(AMEC_CALL_EVENT_IN_C, UberGraphFrame_MEC_CALL_EVENT_IN_C) == 0x0003C0, "Member 'AMEC_CALL_EVENT_IN_C::UberGraphFrame_MEC_CALL_EVENT_IN_C' has a wrong offset!");
static_assert(offsetof(AMEC_CALL_EVENT_IN_C, MEC_FLAG) == 0x0003C8, "Member 'AMEC_CALL_EVENT_IN_C::MEC_FLAG' has a wrong offset!");
static_assert(offsetof(AMEC_CALL_EVENT_IN_C, MEC_CALL_EVENT) == 0x0003D0, "Member 'AMEC_CALL_EVENT_IN_C::MEC_CALL_EVENT' has a wrong offset!");
static_assert(offsetof(AMEC_CALL_EVENT_IN_C, MapEventID) == 0x0003D8, "Member 'AMEC_CALL_EVENT_IN_C::MapEventID' has a wrong offset!");
static_assert(offsetof(AMEC_CALL_EVENT_IN_C, ON_Flag) == 0x0003E0, "Member 'AMEC_CALL_EVENT_IN_C::ON_Flag' has a wrong offset!");
static_assert(offsetof(AMEC_CALL_EVENT_IN_C, OFF_Flag) == 0x0003F0, "Member 'AMEC_CALL_EVENT_IN_C::OFF_Flag' has a wrong offset!");

}

