#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MEC_FADEIN

#include "Basic.hpp"


namespace SDK::Params
{

// Function MEC_FADEIN.MEC_FADEIN_C.ExecuteUbergraph_MEC_FADEIN
// 0x0028 (0x0028 - 0x0000)
struct MEC_FADEIN_C_ExecuteUbergraph_MEC_FADEIN final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FadeIn_Black_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94B8[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(MEC_FADEIN_C_ExecuteUbergraph_MEC_FADEIN) == 0x000008, "Wrong alignment on MEC_FADEIN_C_ExecuteUbergraph_MEC_FADEIN");
static_assert(sizeof(MEC_FADEIN_C_ExecuteUbergraph_MEC_FADEIN) == 0x000028, "Wrong size on MEC_FADEIN_C_ExecuteUbergraph_MEC_FADEIN");
static_assert(offsetof(MEC_FADEIN_C_ExecuteUbergraph_MEC_FADEIN, EntryPoint) == 0x000000, "Member 'MEC_FADEIN_C_ExecuteUbergraph_MEC_FADEIN::EntryPoint' has a wrong offset!");
static_assert(offsetof(MEC_FADEIN_C_ExecuteUbergraph_MEC_FADEIN, CallFunc_FadeIn_Black_ReturnValue) == 0x000004, "Member 'MEC_FADEIN_C_ExecuteUbergraph_MEC_FADEIN::CallFunc_FadeIn_Black_ReturnValue' has a wrong offset!");
static_assert(offsetof(MEC_FADEIN_C_ExecuteUbergraph_MEC_FADEIN, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'MEC_FADEIN_C_ExecuteUbergraph_MEC_FADEIN::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MEC_FADEIN_C_ExecuteUbergraph_MEC_FADEIN, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'MEC_FADEIN_C_ExecuteUbergraph_MEC_FADEIN::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

}

