#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MEC_FADEOUT

#include "Basic.hpp"


namespace SDK::Params
{

// Function MEC_FADEOUT.MEC_FADEOUT_C.ExecuteUbergraph_MEC_FADEOUT
// 0x0030 (0x0030 - 0x0000)
struct MEC_FADEOUT_C_ExecuteUbergraph_MEC_FADEOUT final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_979A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_FadeOut_Black_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_979B[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(MEC_FADEOUT_C_ExecuteUbergraph_MEC_FADEOUT) == 0x000008, "Wrong alignment on MEC_FADEOUT_C_ExecuteUbergraph_MEC_FADEOUT");
static_assert(sizeof(MEC_FADEOUT_C_ExecuteUbergraph_MEC_FADEOUT) == 0x000030, "Wrong size on MEC_FADEOUT_C_ExecuteUbergraph_MEC_FADEOUT");
static_assert(offsetof(MEC_FADEOUT_C_ExecuteUbergraph_MEC_FADEOUT, EntryPoint) == 0x000000, "Member 'MEC_FADEOUT_C_ExecuteUbergraph_MEC_FADEOUT::EntryPoint' has a wrong offset!");
static_assert(offsetof(MEC_FADEOUT_C_ExecuteUbergraph_MEC_FADEOUT, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'MEC_FADEOUT_C_ExecuteUbergraph_MEC_FADEOUT::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MEC_FADEOUT_C_ExecuteUbergraph_MEC_FADEOUT, CallFunc_FadeOut_Black_ReturnValue) == 0x000018, "Member 'MEC_FADEOUT_C_ExecuteUbergraph_MEC_FADEOUT::CallFunc_FadeOut_Black_ReturnValue' has a wrong offset!");
static_assert(offsetof(MEC_FADEOUT_C_ExecuteUbergraph_MEC_FADEOUT, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'MEC_FADEOUT_C_ExecuteUbergraph_MEC_FADEOUT::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

}

