#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MEC_CALL_EVENT_IN

#include "Basic.hpp"


namespace SDK::Params
{

// Function MEC_CALL_EVENT_IN.MEC_CALL_EVENT_IN_C.ExecuteUbergraph_MEC_CALL_EVENT_IN
// 0x0004 (0x0004 - 0x0000)
struct MEC_CALL_EVENT_IN_C_ExecuteUbergraph_MEC_CALL_EVENT_IN final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MEC_CALL_EVENT_IN_C_ExecuteUbergraph_MEC_CALL_EVENT_IN) == 0x000004, "Wrong alignment on MEC_CALL_EVENT_IN_C_ExecuteUbergraph_MEC_CALL_EVENT_IN");
static_assert(sizeof(MEC_CALL_EVENT_IN_C_ExecuteUbergraph_MEC_CALL_EVENT_IN) == 0x000004, "Wrong size on MEC_CALL_EVENT_IN_C_ExecuteUbergraph_MEC_CALL_EVENT_IN");
static_assert(offsetof(MEC_CALL_EVENT_IN_C_ExecuteUbergraph_MEC_CALL_EVENT_IN, EntryPoint) == 0x000000, "Member 'MEC_CALL_EVENT_IN_C_ExecuteUbergraph_MEC_CALL_EVENT_IN::EntryPoint' has a wrong offset!");

// Function MEC_CALL_EVENT_IN.MEC_CALL_EVENT_IN_C.IsHitEnabled
// 0x0002 (0x0002 - 0x0000)
struct MEC_CALL_EVENT_IN_C_IsHitEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsCollisionEnabled_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MEC_CALL_EVENT_IN_C_IsHitEnabled) == 0x000001, "Wrong alignment on MEC_CALL_EVENT_IN_C_IsHitEnabled");
static_assert(sizeof(MEC_CALL_EVENT_IN_C_IsHitEnabled) == 0x000002, "Wrong size on MEC_CALL_EVENT_IN_C_IsHitEnabled");
static_assert(offsetof(MEC_CALL_EVENT_IN_C_IsHitEnabled, ReturnValue) == 0x000000, "Member 'MEC_CALL_EVENT_IN_C_IsHitEnabled::ReturnValue' has a wrong offset!");
static_assert(offsetof(MEC_CALL_EVENT_IN_C_IsHitEnabled, CallFunc_K2_IsCollisionEnabled_ReturnValue) == 0x000001, "Member 'MEC_CALL_EVENT_IN_C_IsHitEnabled::CallFunc_K2_IsCollisionEnabled_ReturnValue' has a wrong offset!");

// Function MEC_CALL_EVENT_IN.MEC_CALL_EVENT_IN_C.GetMapEventId
// 0x0004 (0x0004 - 0x0000)
struct MEC_CALL_EVENT_IN_C_GetMapEventId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MEC_CALL_EVENT_IN_C_GetMapEventId) == 0x000004, "Wrong alignment on MEC_CALL_EVENT_IN_C_GetMapEventId");
static_assert(sizeof(MEC_CALL_EVENT_IN_C_GetMapEventId) == 0x000004, "Wrong size on MEC_CALL_EVENT_IN_C_GetMapEventId");
static_assert(offsetof(MEC_CALL_EVENT_IN_C_GetMapEventId, ReturnValue) == 0x000000, "Member 'MEC_CALL_EVENT_IN_C_GetMapEventId::ReturnValue' has a wrong offset!");

// Function MEC_CALL_EVENT_IN.MEC_CALL_EVENT_IN_C.EnableHit
// 0x0002 (0x0002 - 0x0000)
struct MEC_CALL_EVENT_IN_C_EnableHit final
{
public:
	bool                                          IsEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MEC_CALL_EVENT_IN_C_EnableHit) == 0x000001, "Wrong alignment on MEC_CALL_EVENT_IN_C_EnableHit");
static_assert(sizeof(MEC_CALL_EVENT_IN_C_EnableHit) == 0x000002, "Wrong size on MEC_CALL_EVENT_IN_C_EnableHit");
static_assert(offsetof(MEC_CALL_EVENT_IN_C_EnableHit, IsEnable) == 0x000000, "Member 'MEC_CALL_EVENT_IN_C_EnableHit::IsEnable' has a wrong offset!");
static_assert(offsetof(MEC_CALL_EVENT_IN_C_EnableHit, ReturnValue) == 0x000001, "Member 'MEC_CALL_EVENT_IN_C_EnableHit::ReturnValue' has a wrong offset!");

// Function MEC_CALL_EVENT_IN.MEC_CALL_EVENT_IN_C.EnableIcon
// 0x0002 (0x0002 - 0x0000)
struct MEC_CALL_EVENT_IN_C_EnableIcon final
{
public:
	bool                                          IsEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MEC_CALL_EVENT_IN_C_EnableIcon) == 0x000001, "Wrong alignment on MEC_CALL_EVENT_IN_C_EnableIcon");
static_assert(sizeof(MEC_CALL_EVENT_IN_C_EnableIcon) == 0x000002, "Wrong size on MEC_CALL_EVENT_IN_C_EnableIcon");
static_assert(offsetof(MEC_CALL_EVENT_IN_C_EnableIcon, IsEnable) == 0x000000, "Member 'MEC_CALL_EVENT_IN_C_EnableIcon::IsEnable' has a wrong offset!");
static_assert(offsetof(MEC_CALL_EVENT_IN_C_EnableIcon, ReturnValue) == 0x000001, "Member 'MEC_CALL_EVENT_IN_C_EnableIcon::ReturnValue' has a wrong offset!");

}

