#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MEC_AREA_CHANGE

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MEC_BaseTask_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MEC_AREA_CHANGE.MEC_AREA_CHANGE_C
// 0x0010 (0x0230 - 0x0220)
class UMEC_AREA_CHANGE_C final : public UMEC_BaseTask_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MEC_AREA_CHANGE_C;                  // 0x0218(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         NextAreaId;                                        // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NextWarpPoint;                                     // 0x0224(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MEC_AREA_CHANGE(int32 EntryPoint);
	void FinishFadeOut();
	void CallTask();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MEC_AREA_CHANGE_C">();
	}
	static class UMEC_AREA_CHANGE_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMEC_AREA_CHANGE_C>();
	}
};
static_assert(alignof(UMEC_AREA_CHANGE_C) == 0x000010, "Wrong alignment on UMEC_AREA_CHANGE_C");
static_assert(sizeof(UMEC_AREA_CHANGE_C) == 0x000230, "Wrong size on UMEC_AREA_CHANGE_C");
static_assert(offsetof(UMEC_AREA_CHANGE_C, UberGraphFrame_MEC_AREA_CHANGE_C) == 0x000218, "Member 'UMEC_AREA_CHANGE_C::UberGraphFrame_MEC_AREA_CHANGE_C' has a wrong offset!");
static_assert(offsetof(UMEC_AREA_CHANGE_C, NextAreaId) == 0x000220, "Member 'UMEC_AREA_CHANGE_C::NextAreaId' has a wrong offset!");
static_assert(offsetof(UMEC_AREA_CHANGE_C, NextWarpPoint) == 0x000224, "Member 'UMEC_AREA_CHANGE_C::NextWarpPoint' has a wrong offset!");

}

