#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MEC_AREA_CHANGE

#include "Basic.hpp"


namespace SDK::Params
{

// Function MEC_AREA_CHANGE.MEC_AREA_CHANGE_C.ExecuteUbergraph_MEC_AREA_CHANGE
// 0x0068 (0x0068 - 0x0000)
struct MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_9068[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_FadeOut_Black_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9069[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUIFadeBase*                            CallFunc_GetBP_ScreenFade_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE) == 0x000008, "Wrong alignment on MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE");
static_assert(sizeof(MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE) == 0x000068, "Wrong size on MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE");
static_assert(offsetof(MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE, EntryPoint) == 0x000000, "Member 'MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE::EntryPoint' has a wrong offset!");
static_assert(offsetof(MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE, CallFunc_FadeOut_Black_ReturnValue) == 0x000028, "Member 'MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE::CallFunc_FadeOut_Black_ReturnValue' has a wrong offset!");
static_assert(offsetof(MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE, CallFunc_GetBP_ScreenFade_ReturnValue) == 0x000040, "Member 'MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE::CallFunc_GetBP_ScreenFade_ReturnValue' has a wrong offset!");
static_assert(offsetof(MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE, CallFunc_GetMapCommon_rerutn) == 0x000048, "Member 'MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE, K2Node_DynamicCast_AsBPI_Map_Common) == 0x000050, "Member 'MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'MEC_AREA_CHANGE_C_ExecuteUbergraph_MEC_AREA_CHANGE::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

