#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MEC_CALL_EVENT

#include "Basic.hpp"


namespace SDK::Params
{

// Function MEC_CALL_EVENT.MEC_CALL_EVENT_C.ExecuteUbergraph_MEC_CALL_EVENT
// 0x0048 (0x0048 - 0x0000)
struct MEC_CALL_EVENT_C_ExecuteUbergraph_MEC_CALL_EVENT final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A141[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MEC_CALL_EVENT_C_ExecuteUbergraph_MEC_CALL_EVENT) == 0x000008, "Wrong alignment on MEC_CALL_EVENT_C_ExecuteUbergraph_MEC_CALL_EVENT");
static_assert(sizeof(MEC_CALL_EVENT_C_ExecuteUbergraph_MEC_CALL_EVENT) == 0x000048, "Wrong size on MEC_CALL_EVENT_C_ExecuteUbergraph_MEC_CALL_EVENT");
static_assert(offsetof(MEC_CALL_EVENT_C_ExecuteUbergraph_MEC_CALL_EVENT, EntryPoint) == 0x000000, "Member 'MEC_CALL_EVENT_C_ExecuteUbergraph_MEC_CALL_EVENT::EntryPoint' has a wrong offset!");
static_assert(offsetof(MEC_CALL_EVENT_C_ExecuteUbergraph_MEC_CALL_EVENT, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'MEC_CALL_EVENT_C_ExecuteUbergraph_MEC_CALL_EVENT::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MEC_CALL_EVENT_C_ExecuteUbergraph_MEC_CALL_EVENT, CallFunc_GetMapCommon_rerutn) == 0x000018, "Member 'MEC_CALL_EVENT_C_ExecuteUbergraph_MEC_CALL_EVENT::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(MEC_CALL_EVENT_C_ExecuteUbergraph_MEC_CALL_EVENT, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'MEC_CALL_EVENT_C_ExecuteUbergraph_MEC_CALL_EVENT::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(MEC_CALL_EVENT_C_ExecuteUbergraph_MEC_CALL_EVENT, K2Node_DynamicCast_AsBPI_Map_Common) == 0x000030, "Member 'MEC_CALL_EVENT_C_ExecuteUbergraph_MEC_CALL_EVENT::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(MEC_CALL_EVENT_C_ExecuteUbergraph_MEC_CALL_EVENT, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'MEC_CALL_EVENT_C_ExecuteUbergraph_MEC_CALL_EVENT::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

