#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MEC_MAP_MOVE

#include "Basic.hpp"


namespace SDK::Params
{

// Function MEC_MAP_MOVE.MEC_MAP_MOVE_C.ExecuteUbergraph_MEC_MAP_MOVE
// 0x0028 (0x0028 - 0x0000)
struct MEC_MAP_MOVE_C_ExecuteUbergraph_MEC_MAP_MOVE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29D6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(MEC_MAP_MOVE_C_ExecuteUbergraph_MEC_MAP_MOVE) == 0x000008, "Wrong alignment on MEC_MAP_MOVE_C_ExecuteUbergraph_MEC_MAP_MOVE");
static_assert(sizeof(MEC_MAP_MOVE_C_ExecuteUbergraph_MEC_MAP_MOVE) == 0x000028, "Wrong size on MEC_MAP_MOVE_C_ExecuteUbergraph_MEC_MAP_MOVE");
static_assert(offsetof(MEC_MAP_MOVE_C_ExecuteUbergraph_MEC_MAP_MOVE, EntryPoint) == 0x000000, "Member 'MEC_MAP_MOVE_C_ExecuteUbergraph_MEC_MAP_MOVE::EntryPoint' has a wrong offset!");
static_assert(offsetof(MEC_MAP_MOVE_C_ExecuteUbergraph_MEC_MAP_MOVE, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'MEC_MAP_MOVE_C_ExecuteUbergraph_MEC_MAP_MOVE::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MEC_MAP_MOVE_C_ExecuteUbergraph_MEC_MAP_MOVE, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'MEC_MAP_MOVE_C_ExecuteUbergraph_MEC_MAP_MOVE::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

}

