#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MinimapPOIComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MinimapPOIComponent.MinimapPOIComponent_C.ExecuteUbergraph_MinimapPOIComponent
// 0x0008 (0x0008 - 0x0000)
struct MinimapPOIComponent_C_ExecuteUbergraph_MinimapPOIComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MinimapPOIComponent_C_ExecuteUbergraph_MinimapPOIComponent) == 0x000004, "Wrong alignment on MinimapPOIComponent_C_ExecuteUbergraph_MinimapPOIComponent");
static_assert(sizeof(MinimapPOIComponent_C_ExecuteUbergraph_MinimapPOIComponent) == 0x000008, "Wrong size on MinimapPOIComponent_C_ExecuteUbergraph_MinimapPOIComponent");
static_assert(offsetof(MinimapPOIComponent_C_ExecuteUbergraph_MinimapPOIComponent, EntryPoint) == 0x000000, "Member 'MinimapPOIComponent_C_ExecuteUbergraph_MinimapPOIComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(MinimapPOIComponent_C_ExecuteUbergraph_MinimapPOIComponent, K2Node_Event_EndPlayReason) == 0x000004, "Member 'MinimapPOIComponent_C_ExecuteUbergraph_MinimapPOIComponent::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function MinimapPOIComponent.MinimapPOIComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct MinimapPOIComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MinimapPOIComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on MinimapPOIComponent_C_ReceiveEndPlay");
static_assert(sizeof(MinimapPOIComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on MinimapPOIComponent_C_ReceiveEndPlay");
static_assert(offsetof(MinimapPOIComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'MinimapPOIComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

