#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM0154

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MM_M061_EM0154.MM_M061_EM0154_C.ExecuteUbergraph_MM_M061_EM0154
// 0x0580 (0x0580 - 0x0000)
struct MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D9B[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D9C[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl;                 // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D9D[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_1;               // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IIsFinishedWindowOut_OutFinished;         // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D9E[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_2;               // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D9F[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_3;               // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DA0[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFinish_IsFinish;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DA1[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AutoRotateFocus_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	class UGazeTargetHolder*                      CallFunc_GetGazeTargetHolder_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DA2[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DA3[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_1;             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_3;              // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DA4[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_4;              // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DA5[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_2;             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_1;                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_4;               // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DA6[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_5;               // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd;             // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DA7[0x6];                                     // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_5;              // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DA8[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_2;                // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_6;               // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DA9[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_7;               // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1;           // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DAA[0x6];                                     // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_4;            // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_6;              // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DAB[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_7;              // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DAC[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_3;             // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_4;             // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_8;              // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DAD[0x7];                                     // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_3;                // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_9;              // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DAE[0x7];                                     // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_8;               // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DAF[0x7];                                     // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_4;                // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_2;           // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DB0[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_9;               // 0x02B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_19;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DB1[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_10;              // 0x02D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_20;                    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_3;           // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DB2[0x6];                                     // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_11;              // 0x02E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_21;                    // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_1;             // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DB3[0x6];                                     // 0x02FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_5;            // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_10;             // 0x0308(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_22;                    // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DB4[0x7];                                     // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_5;             // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_11;             // 0x0328(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_23;                    // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DB5[0x7];                                     // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_5;                // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_12;              // 0x0348(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_24;                    // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DB6[0x7];                                     // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_13;              // 0x0360(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_25;                    // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DB7[0x7];                                     // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_14;              // 0x0378(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_26;                    // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DB8[0x7];                                     // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_15;              // 0x0390(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_27;                    // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IIsFinishedWindowOut_OutFinished_1;       // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_2;             // 0x03A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ScreenTransition_isFadeFinish_outValue;   // 0x03A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ScreenTransition_isFadeFinish_outValue_1; // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DB9[0x3];                                     // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActive_IsActive;                       // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartMapEvent_Dummy;                      // 0x03AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DBA[0x2];                                     // 0x03AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetPoint*                           CallFunc_Array_Get_Item_1;                         // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x03C0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DBB[0x7];                                     // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADev345_Simple_C*                       CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor;      // 0x0410(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_28;                    // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DBC[0x7];                                     // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1;    // 0x0428(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_29;                    // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_StopMotion_NoUse;                      // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DBD[0x6];                                     // 0x043A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_6;            // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_12;             // 0x0448(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_30;                    // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DBE[0x7];                                     // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_6;             // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DBF[0x7];                                     // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_13;             // 0x0470(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_31;                    // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC0[0x7];                                     // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_6;                // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_16;              // 0x0490(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_32;                    // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC1[0x7];                                     // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_17;              // 0x04A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_33;                    // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC2[0x7];                                     // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_18;              // 0x04C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_34;                    // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC3[0x7];                                     // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGazeTarget>           K2Node_DynamicCast_AsGaze_Target;                  // 0x04D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_35;                    // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC4[0x7];                                     // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_DynamicCast_AsAnim_Sequence_Base;           // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_36;                    // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC5[0x7];                                     // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BI_EventPlayMotion_NoUse;                 // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFinish_IsFinish_1;                     // 0x0511(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EndMapEvent_Dummy;                        // 0x0512(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC6[0x1];                                     // 0x0513(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC7[0x3];                                     // 0x0519(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapUICtrl_MapUICtrl;                   // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapUICtrl_C>      K2Node_DynamicCast_AsBPI_Map_UICtrl;               // 0x0528(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_37;                    // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC8[0x7];                                     // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Minimap_C*                          CallFunc_BPI_StartMinimapFocusMission_EventTarget; // 0x0540(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapUICtrl_MapUICtrl_1;                 // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapUICtrl_C>      K2Node_DynamicCast_AsBPI_Map_UICtrl_1;             // 0x0550(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_38;                    // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_EndMinimapFocusMission_dummy;         // 0x0561(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionCancelTrigger_ReturnValue;        // 0x0562(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC9[0x1];                                     // 0x0563(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0564(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154) == 0x000010, "Wrong alignment on MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154");
static_assert(sizeof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154) == 0x000580, "Wrong size on MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, EntryPoint) == 0x000000, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::EntryPoint' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_UIManager) == 0x000010, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_BPI_GetUIManager_UIManager) == 0x000028, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000030, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_BPI_GetMsgCtrl_OutActor) == 0x000048, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_BPI_GetMsgCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_Msg_Ctrl) == 0x000050, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_Msg_Ctrl' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_Msg_Ctrl_1) == 0x000068, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_Msg_Ctrl_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_3) == 0x000078, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_IIsFinishedWindowOut_OutFinished) == 0x000079, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_IIsFinishedWindowOut_OutFinished' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_Msg_Ctrl_2) == 0x000080, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_Msg_Ctrl_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_4) == 0x000090, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_Msg_Ctrl_3) == 0x000098, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_Msg_Ctrl_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_5) == 0x0000A8, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_MakeTransform_ReturnValue) == 0x0000B0, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000E0, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_GetFinish_IsFinish) == 0x0000E8, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_GetFinish_IsFinish' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000F0, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_CreateDelegate_OutputDelegate) == 0x0000F8, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_GetGazeTargetHolder_ReturnValue) == 0x000108, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_GetGazeTargetHolder_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_CheckEventFlag_ReturnValue) == 0x000110, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_GetGameInstance_ReturnValue_1) == 0x000118, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_UIManager_2) == 0x000120, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_UIManager_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_6) == 0x000130, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_BPI_GetUIManager_UIManager_1) == 0x000138, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_BPI_GetUIManager_UIManager_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_GetGameInstance_ReturnValue_2) == 0x000140, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_UIManager_3) == 0x000148, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_UIManager_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_7) == 0x000158, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_UIManager_4) == 0x000160, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_UIManager_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_8) == 0x000170, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_BPI_GetUIManager_UIManager_2) == 0x000178, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_BPI_GetUIManager_UIManager_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_BPI_GetMsgCtrl_OutActor_1) == 0x000180, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_BPI_GetMsgCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_Msg_Ctrl_4) == 0x000188, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_Msg_Ctrl_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_9) == 0x000198, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_Msg_Ctrl_5) == 0x0001A0, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_Msg_Ctrl_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_10) == 0x0001B0, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd) == 0x0001B1, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_UIManager_5) == 0x0001B8, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_UIManager_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_11) == 0x0001C8, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_BPI_GetMsgCtrl_OutActor_2) == 0x0001D0, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_BPI_GetMsgCtrl_OutActor_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_Msg_Ctrl_6) == 0x0001D8, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_Msg_Ctrl_6' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_12) == 0x0001E8, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_Msg_Ctrl_7) == 0x0001F0, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_Msg_Ctrl_7' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_13) == 0x000200, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1) == 0x000201, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_GetGameInstance_ReturnValue_3) == 0x000208, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_GetGameInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_GetGameInstance_ReturnValue_4) == 0x000210, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_GetGameInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_UIManager_6) == 0x000218, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_UIManager_6' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_14) == 0x000228, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_UIManager_7) == 0x000230, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_UIManager_7' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_15) == 0x000240, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_15' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_BPI_GetUIManager_UIManager_3) == 0x000248, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_BPI_GetUIManager_UIManager_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_BPI_GetUIManager_UIManager_4) == 0x000250, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_BPI_GetUIManager_UIManager_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_UIManager_8) == 0x000258, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_UIManager_8' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_16) == 0x000268, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_16' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_BPI_GetMsgCtrl_OutActor_3) == 0x000270, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_BPI_GetMsgCtrl_OutActor_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_UIManager_9) == 0x000278, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_UIManager_9' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_17) == 0x000288, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_17' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_Msg_Ctrl_8) == 0x000290, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_Msg_Ctrl_8' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_18) == 0x0002A0, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_18' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_BPI_GetMsgCtrl_OutActor_4) == 0x0002A8, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_BPI_GetMsgCtrl_OutActor_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_2) == 0x0002B0, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_Msg_Ctrl_9) == 0x0002B8, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_Msg_Ctrl_9' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_19) == 0x0002C8, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_19' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_Msg_Ctrl_10) == 0x0002D0, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_Msg_Ctrl_10' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_20) == 0x0002E0, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_20' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_3) == 0x0002E1, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_Msg_Ctrl_11) == 0x0002E8, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_Msg_Ctrl_11' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_21) == 0x0002F8, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_21' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_CheckEventFlag_ReturnValue_1) == 0x0002F9, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_CheckEventFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_GetGameInstance_ReturnValue_5) == 0x000300, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_GetGameInstance_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_UIManager_10) == 0x000308, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_UIManager_10' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_22) == 0x000318, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_22' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_BPI_GetUIManager_UIManager_5) == 0x000320, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_BPI_GetUIManager_UIManager_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_UIManager_11) == 0x000328, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_UIManager_11' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_23) == 0x000338, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_23' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_BPI_GetMsgCtrl_OutActor_5) == 0x000340, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_BPI_GetMsgCtrl_OutActor_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_Msg_Ctrl_12) == 0x000348, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_Msg_Ctrl_12' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_24) == 0x000358, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_24' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_Msg_Ctrl_13) == 0x000360, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_Msg_Ctrl_13' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_25) == 0x000370, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_25' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_Msg_Ctrl_14) == 0x000378, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_Msg_Ctrl_14' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_26) == 0x000388, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_26' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_Msg_Ctrl_15) == 0x000390, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_Msg_Ctrl_15' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_27) == 0x0003A0, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_27' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_IIsFinishedWindowOut_OutFinished_1) == 0x0003A1, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_IIsFinishedWindowOut_OutFinished_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_CheckEventFlag_ReturnValue_2) == 0x0003A2, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_CheckEventFlag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_ScreenTransition_isFadeFinish_outValue) == 0x0003A3, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_ScreenTransition_isFadeFinish_outValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_ScreenTransition_isFadeFinish_outValue_1) == 0x0003A4, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_ScreenTransition_isFadeFinish_outValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, Temp_int_Array_Index_Variable) == 0x0003A8, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_GetActive_IsActive) == 0x0003AC, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_GetActive_IsActive' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_StartMapEvent_Dummy) == 0x0003AD, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_StartMapEvent_Dummy' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_Array_Get_Item) == 0x0003B0, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_Array_Get_Item_1) == 0x0003B8, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_GetTransform_ReturnValue) == 0x0003C0, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_IsValid_ReturnValue) == 0x0003F0, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0003F8, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000400, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_Array_Length_ReturnValue) == 0x000408, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_Array_Add_ReturnValue) == 0x00040C, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor) == 0x000410, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_28) == 0x000420, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_28' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1) == 0x000428, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_29) == 0x000438, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_29' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_BI_StopMotion_NoUse) == 0x000439, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_BI_StopMotion_NoUse' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_GetGameInstance_ReturnValue_6) == 0x000440, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_GetGameInstance_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_AsBPI_UIManager_12) == 0x000448, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_AsBPI_UIManager_12' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, K2Node_DynamicCast_bSuccess_30) == 0x000458, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::K2Node_DynamicCast_bSuccess_30' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_BPI_GetUIManager_UIManager_6) == 0x000460, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_BPI_GetUIManager_UIManager_6' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154, CallFunc_IsValid_ReturnValue_1) == 0x000468, "Member 'MM_M061_EM0154_C_ExecuteUbergraph_MM_M061_EM0154::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
