#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM0181

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_EventMissionBase_Hit_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM0181.MM_M061_EM0181_C
// 0x00C8 (0x0390 - 0x02C8)
class AMM_M061_EM0181_C final : public ABP_EventMissionBase_Hit_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM0181_C;                   // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         _______4_FOV_8D10405D4D1EA2F4399AC7AB27684B46;     // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______4__Direction_8D10405D4D1EA2F4399AC7AB27684B46; // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CF1[0x3];                                     // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______4;                                          // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______0_Rot_DC04B84A4ACD5ED03C12FC9C6BA704FC;     // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______0__Direction_DC04B84A4ACD5ED03C12FC9C6BA704FC; // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CF2[0x3];                                     // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______0;                                          // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectIndex;                                       // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CF3[0x4];                                     // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 Mission_Event;                                     // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ABP_EventCameraBlend_C*                 CameraBlender;                                     // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DefCamera;                                         // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DefDevRot;                                         // 0x0340(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               PLRot;                                             // 0x034C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ACharaBase_C*                           SpawnActor;                                        // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           InstantCamera;                                     // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefFOV;                                            // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DefInstantCameraRot;                               // 0x036C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ABP_EventScriptFade_C*                  LocalFade;                                         // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Emitter;                                           // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewFOV;                                            // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_EM0181(int32 EntryPoint);
	void EvtDis_FinishComplete();
	void EvtDis_Finish();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void CallDeactivate();
	void CheckActive();
	void QuestExecute();
	void ReceiveBeginPlay();
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD22219F03(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDE83225BC(class UObject* Loaded);
	void _______4__UpdateFunc();
	void _______4__FinishedFunc();
	void _______0__UpdateFunc();
	void _______0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM0181_C">();
	}
	static class AMM_M061_EM0181_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM0181_C>();
	}
};
static_assert(alignof(AMM_M061_EM0181_C) == 0x000008, "Wrong alignment on AMM_M061_EM0181_C");
static_assert(sizeof(AMM_M061_EM0181_C) == 0x000390, "Wrong size on AMM_M061_EM0181_C");
static_assert(offsetof(AMM_M061_EM0181_C, UberGraphFrame_MM_M061_EM0181_C) == 0x0002C8, "Member 'AMM_M061_EM0181_C::UberGraphFrame_MM_M061_EM0181_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, _______4_FOV_8D10405D4D1EA2F4399AC7AB27684B46) == 0x0002D0, "Member 'AMM_M061_EM0181_C::_______4_FOV_8D10405D4D1EA2F4399AC7AB27684B46' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, _______4__Direction_8D10405D4D1EA2F4399AC7AB27684B46) == 0x0002D4, "Member 'AMM_M061_EM0181_C::_______4__Direction_8D10405D4D1EA2F4399AC7AB27684B46' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, _______4) == 0x0002D8, "Member 'AMM_M061_EM0181_C::_______4' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, _______0_Rot_DC04B84A4ACD5ED03C12FC9C6BA704FC) == 0x0002E0, "Member 'AMM_M061_EM0181_C::_______0_Rot_DC04B84A4ACD5ED03C12FC9C6BA704FC' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, _______0__Direction_DC04B84A4ACD5ED03C12FC9C6BA704FC) == 0x0002E4, "Member 'AMM_M061_EM0181_C::_______0__Direction_DC04B84A4ACD5ED03C12FC9C6BA704FC' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, _______0) == 0x0002E8, "Member 'AMM_M061_EM0181_C::_______0' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, SelectIndex) == 0x0002F0, "Member 'AMM_M061_EM0181_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, SystemMessageAsset) == 0x0002F8, "Member 'AMM_M061_EM0181_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, MissionMessageAsset) == 0x000300, "Member 'AMM_M061_EM0181_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, Mission_Event) == 0x000308, "Member 'AMM_M061_EM0181_C::Mission_Event' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, Camera) == 0x000310, "Member 'AMM_M061_EM0181_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, Target) == 0x000320, "Member 'AMM_M061_EM0181_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, CameraBlender) == 0x000330, "Member 'AMM_M061_EM0181_C::CameraBlender' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, DefCamera) == 0x000338, "Member 'AMM_M061_EM0181_C::DefCamera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, DefDevRot) == 0x000340, "Member 'AMM_M061_EM0181_C::DefDevRot' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, PLRot) == 0x00034C, "Member 'AMM_M061_EM0181_C::PLRot' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, SpawnActor) == 0x000358, "Member 'AMM_M061_EM0181_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, InstantCamera) == 0x000360, "Member 'AMM_M061_EM0181_C::InstantCamera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, DefFOV) == 0x000368, "Member 'AMM_M061_EM0181_C::DefFOV' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, DefInstantCameraRot) == 0x00036C, "Member 'AMM_M061_EM0181_C::DefInstantCameraRot' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, LocalFade) == 0x000378, "Member 'AMM_M061_EM0181_C::LocalFade' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, Emitter) == 0x000380, "Member 'AMM_M061_EM0181_C::Emitter' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0181_C, NewFOV) == 0x000388, "Member 'AMM_M061_EM0181_C::NewFOV' has a wrong offset!");

}

