#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM1041

#include "Basic.hpp"

#include "BP_EventMissionBase_HitAction_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM1041.MM_M061_EM1041_C
// 0x0088 (0x0380 - 0x02F8)
class AMM_M061_EM1041_C final : public ABP_EventMissionBase_HitAction_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM1041_C;                   // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Select_Index;                                      // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Mission_ID;                                        // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 Mission_Event;                                     // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AActor*                                 Default_View_Target;                               // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Battle_Point;                                      // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Motion_check;                                      // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_695C[0x7];                                     // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AutoRotateFocus_C*                  Auto_Rot_Ctrl;                                     // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           SpawnActor;                                        // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADevilBase_C*                           FakeActor;                                         // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Emitter;                                           // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraBlend_C*                 CameraBlender;                                     // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_EM1041(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnDestroyed______0(class AActor* DestroyedActor);
	void Re_talk2();
	void Re_talk();
	void End_Mission();
	void Battle_Start();
	void Dev_motion2();
	void EndBattle______0();
	void Clear_Mission();
	void QuestExecute();
	void OnLoaded_1ECCDA7645D8C9BB0B3BF197A6478817(TSubclassOf<class UObject> Loaded);
	void OnLoaded_4C72C4BD48134C8C44C5AB9DC60F3A09(TSubclassOf<class UObject> Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BCC12A1388(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDB2D8CDDC(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC0529C85F(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD8A87E29C(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD6377F875(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDE18268DE(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDFD833F79(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC8C48D324(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD1B5946C5(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDD9702B14(class UObject* Loaded);
	void CallDeactivate();
	void ReceiveBeginPlay();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM1041_C">();
	}
	static class AMM_M061_EM1041_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM1041_C>();
	}
};
static_assert(alignof(AMM_M061_EM1041_C) == 0x000008, "Wrong alignment on AMM_M061_EM1041_C");
static_assert(sizeof(AMM_M061_EM1041_C) == 0x000380, "Wrong size on AMM_M061_EM1041_C");
static_assert(offsetof(AMM_M061_EM1041_C, UberGraphFrame_MM_M061_EM1041_C) == 0x0002F8, "Member 'AMM_M061_EM1041_C::UberGraphFrame_MM_M061_EM1041_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1041_C, Select_Index) == 0x000300, "Member 'AMM_M061_EM1041_C::Select_Index' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1041_C, Mission_ID) == 0x000304, "Member 'AMM_M061_EM1041_C::Mission_ID' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1041_C, SystemMessageAsset) == 0x000308, "Member 'AMM_M061_EM1041_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1041_C, MissionMessageAsset) == 0x000310, "Member 'AMM_M061_EM1041_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1041_C, Mission_Event) == 0x000318, "Member 'AMM_M061_EM1041_C::Mission_Event' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1041_C, Camera) == 0x000320, "Member 'AMM_M061_EM1041_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1041_C, Target) == 0x000330, "Member 'AMM_M061_EM1041_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1041_C, Default_View_Target) == 0x000340, "Member 'AMM_M061_EM1041_C::Default_View_Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1041_C, Battle_Point) == 0x000348, "Member 'AMM_M061_EM1041_C::Battle_Point' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1041_C, Motion_check) == 0x000350, "Member 'AMM_M061_EM1041_C::Motion_check' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1041_C, Auto_Rot_Ctrl) == 0x000358, "Member 'AMM_M061_EM1041_C::Auto_Rot_Ctrl' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1041_C, SpawnActor) == 0x000360, "Member 'AMM_M061_EM1041_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1041_C, FakeActor) == 0x000368, "Member 'AMM_M061_EM1041_C::FakeActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1041_C, Emitter) == 0x000370, "Member 'AMM_M061_EM1041_C::Emitter' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1041_C, CameraBlender) == 0x000378, "Member 'AMM_M061_EM1041_C::CameraBlender' has a wrong offset!");

}

