#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM0020

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_EventMissionBase_HitAction_classes.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM0020.MM_M061_EM0020_C
// 0x0090 (0x0388 - 0x02F8)
class AMM_M061_EM0020_C final : public ABP_EventMissionBase_HitAction_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM0020_C;                   // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Select_Index;                                      // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9EC0[0x4];                                     // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 Mission_Event;                                     // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AActor*                                 Default_View_Target;                               // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraBlend_C*                 Camera_Blender;                                    // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetPoint*                           IconPos;                                           // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  NaviDevil;                                         // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FirstTalkFlag;                                     // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EndEventFlag;                                      // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EndBattleFlag;                                     // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MissionEntryFlag;                                  // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Spawn_Emitter;                                     // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_EM0020(int32 EntryPoint);
	void EvtDis_Finish();
	void Evt_FinishComplete();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void FocusMissionEnd();
	void FinishMission();
	void Actor_dead();
	void Re_Entry();
	void Not_Report();
	void Can_Report();
	void End_Mission();
	void OnLoaded_6207549B4BD30CD30EA97FB13B4A7E11(TSubclassOf<class UObject> Loaded);
	void OnLoaded_A0F3B9A04DFF775EB961AAAE47A5B134(TSubclassOf<class UObject> Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDD4763FCE(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDB384B4B9(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDF3958F91(class UObject* Loaded);
	void ResultFadeFunc();
	void CallDeactivate();
	void ReceiveBeginPlay();
	void QuestFunctionHit();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM0020_C">();
	}
	static class AMM_M061_EM0020_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM0020_C>();
	}
};
static_assert(alignof(AMM_M061_EM0020_C) == 0x000008, "Wrong alignment on AMM_M061_EM0020_C");
static_assert(sizeof(AMM_M061_EM0020_C) == 0x000388, "Wrong size on AMM_M061_EM0020_C");
static_assert(offsetof(AMM_M061_EM0020_C, UberGraphFrame_MM_M061_EM0020_C) == 0x0002F8, "Member 'AMM_M061_EM0020_C::UberGraphFrame_MM_M061_EM0020_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0020_C, Select_Index) == 0x000300, "Member 'AMM_M061_EM0020_C::Select_Index' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0020_C, SystemMessageAsset) == 0x000308, "Member 'AMM_M061_EM0020_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0020_C, MissionMessageAsset) == 0x000310, "Member 'AMM_M061_EM0020_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0020_C, Mission_Event) == 0x000318, "Member 'AMM_M061_EM0020_C::Mission_Event' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0020_C, Camera) == 0x000320, "Member 'AMM_M061_EM0020_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0020_C, Target) == 0x000330, "Member 'AMM_M061_EM0020_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0020_C, Default_View_Target) == 0x000340, "Member 'AMM_M061_EM0020_C::Default_View_Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0020_C, Camera_Blender) == 0x000348, "Member 'AMM_M061_EM0020_C::Camera_Blender' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0020_C, IconPos) == 0x000350, "Member 'AMM_M061_EM0020_C::IconPos' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0020_C, NaviDevil) == 0x000358, "Member 'AMM_M061_EM0020_C::NaviDevil' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0020_C, FirstTalkFlag) == 0x000360, "Member 'AMM_M061_EM0020_C::FirstTalkFlag' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0020_C, EndEventFlag) == 0x000368, "Member 'AMM_M061_EM0020_C::EndEventFlag' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0020_C, EndBattleFlag) == 0x000370, "Member 'AMM_M061_EM0020_C::EndBattleFlag' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0020_C, MissionEntryFlag) == 0x000378, "Member 'AMM_M061_EM0020_C::MissionEntryFlag' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0020_C, Spawn_Emitter) == 0x000380, "Member 'AMM_M061_EM0020_C::Spawn_Emitter' has a wrong offset!");

}

