#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM1715

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_EventMissionBase_Hit_classes.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM1715.MM_M061_EM1715_C
// 0x0090 (0x0358 - 0x02C8)
class AMM_M061_EM1715_C final : public ABP_EventMissionBase_Hit_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM1715_C;                   // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SelectIndex;                                       // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3F6[0x4];                                     // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 Mission_Event;                                     // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ABP_EventCameraBlend_C*                 CameraBlender;                                     // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetPoint*                           BattlePoint;                                       // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           SpawnActor;                                        // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           SpawnActor2;                                       // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           SpawnActor3;                                       // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           SpawnActor4;                                       // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           SpawnActor5;                                       // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Def_Camera;                                        // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventScriptFade_C*                  LocalFade;                                         // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_EM1715(int32 EntryPoint);
	void EvtDis_FinishComplete();
	void EvtDis_Finish();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void _________0();
	void BattleSetting();
	void OnDestroyed______0(class AActor* DestroyedActor);
	void CallDeactivate();
	void QuestExecute();
	void ReceiveBeginPlay();
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD405D8DBC(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDC4D6B098(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDE72C8F2C(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD5D4CEB96(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD2F79D810(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDA2206842(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD4B58D10E(class UObject* Loaded);
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM1715_C">();
	}
	static class AMM_M061_EM1715_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM1715_C>();
	}
};
static_assert(alignof(AMM_M061_EM1715_C) == 0x000008, "Wrong alignment on AMM_M061_EM1715_C");
static_assert(sizeof(AMM_M061_EM1715_C) == 0x000358, "Wrong size on AMM_M061_EM1715_C");
static_assert(offsetof(AMM_M061_EM1715_C, UberGraphFrame_MM_M061_EM1715_C) == 0x0002C8, "Member 'AMM_M061_EM1715_C::UberGraphFrame_MM_M061_EM1715_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1715_C, SelectIndex) == 0x0002D0, "Member 'AMM_M061_EM1715_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1715_C, SystemMessageAsset) == 0x0002D8, "Member 'AMM_M061_EM1715_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1715_C, MissionMessageAsset) == 0x0002E0, "Member 'AMM_M061_EM1715_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1715_C, Mission_Event) == 0x0002E8, "Member 'AMM_M061_EM1715_C::Mission_Event' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1715_C, Camera) == 0x0002F0, "Member 'AMM_M061_EM1715_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1715_C, Target) == 0x000300, "Member 'AMM_M061_EM1715_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1715_C, CameraBlender) == 0x000310, "Member 'AMM_M061_EM1715_C::CameraBlender' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1715_C, BattlePoint) == 0x000318, "Member 'AMM_M061_EM1715_C::BattlePoint' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1715_C, SpawnActor) == 0x000320, "Member 'AMM_M061_EM1715_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1715_C, SpawnActor2) == 0x000328, "Member 'AMM_M061_EM1715_C::SpawnActor2' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1715_C, SpawnActor3) == 0x000330, "Member 'AMM_M061_EM1715_C::SpawnActor3' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1715_C, SpawnActor4) == 0x000338, "Member 'AMM_M061_EM1715_C::SpawnActor4' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1715_C, SpawnActor5) == 0x000340, "Member 'AMM_M061_EM1715_C::SpawnActor5' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1715_C, Def_Camera) == 0x000348, "Member 'AMM_M061_EM1715_C::Def_Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1715_C, LocalFade) == 0x000350, "Member 'AMM_M061_EM1715_C::LocalFade' has a wrong offset!");

}

