#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM0182

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_EventMissionBase_Hit_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM0182.MM_M061_EM0182_C
// 0x00D8 (0x03A0 - 0x02C8)
class AMM_M061_EM0182_C final : public ABP_EventMissionBase_Hit_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM0182_C;                   // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         _______2_move_96536A0F424C1E259A703BB5C17CB2B8;    // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______2__Direction_96536A0F424C1E259A703BB5C17CB2B8; // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C795[0x3];                                     // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______2;                                          // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______1_move_E1FA24754946F6195DD684986395DF14;    // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______1__Direction_E1FA24754946F6195DD684986395DF14; // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C796[0x3];                                     // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______1;                                          // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______0_Rot_874EC96340C59F6A0FB66B9E4CD7C851;     // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______0__Direction_874EC96340C59F6A0FB66B9E4CD7C851; // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C797[0x3];                                     // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______0;                                          // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectIndex;                                       // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C798[0x4];                                     // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 Mission_Event;                                     // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ABP_EventCameraBlend_C*                 CameraBlender;                                     // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DefCamera;                                         // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DefDevRot;                                         // 0x0350(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               PLRot;                                             // 0x035C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ACharaBase_C*                           SpawnActor;                                        // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           InstantCamera;                                     // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefFOV;                                            // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DefInstantCameraRot;                               // 0x037C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ABP_EventScriptFade_C*                  LocalFade;                                         // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Emitter;                                           // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewFOV;                                            // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_EM0182(int32 EntryPoint);
	void EvtDis_FinishComplete();
	void EvtDis_Finish();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnDestroyed______1(class AActor* DestroyedActor);
	void MoveEnd();
	void CallDeactivate();
	void CheckActive();
	void QuestExecute();
	void ReceiveBeginPlay();
	void OnLoaded_E3186F6840BE7D9EE9C6DE9A199F14B0(TSubclassOf<class UObject> Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD47A4DC42(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BCE3815897(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC1062C6DF(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDA13CF05A(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC0E9CCBBC(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDB71B7548(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDD2E90497(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDCB4D1ED7(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDD358E272(class UObject* Loaded);
	void _______2__UpdateFunc();
	void _______2__FinishedFunc();
	void _______1__UpdateFunc();
	void _______1__FinishedFunc();
	void _______0__UpdateFunc();
	void _______0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM0182_C">();
	}
	static class AMM_M061_EM0182_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM0182_C>();
	}
};
static_assert(alignof(AMM_M061_EM0182_C) == 0x000008, "Wrong alignment on AMM_M061_EM0182_C");
static_assert(sizeof(AMM_M061_EM0182_C) == 0x0003A0, "Wrong size on AMM_M061_EM0182_C");
static_assert(offsetof(AMM_M061_EM0182_C, UberGraphFrame_MM_M061_EM0182_C) == 0x0002C8, "Member 'AMM_M061_EM0182_C::UberGraphFrame_MM_M061_EM0182_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, _______2_move_96536A0F424C1E259A703BB5C17CB2B8) == 0x0002D0, "Member 'AMM_M061_EM0182_C::_______2_move_96536A0F424C1E259A703BB5C17CB2B8' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, _______2__Direction_96536A0F424C1E259A703BB5C17CB2B8) == 0x0002D4, "Member 'AMM_M061_EM0182_C::_______2__Direction_96536A0F424C1E259A703BB5C17CB2B8' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, _______2) == 0x0002D8, "Member 'AMM_M061_EM0182_C::_______2' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, _______1_move_E1FA24754946F6195DD684986395DF14) == 0x0002E0, "Member 'AMM_M061_EM0182_C::_______1_move_E1FA24754946F6195DD684986395DF14' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, _______1__Direction_E1FA24754946F6195DD684986395DF14) == 0x0002E4, "Member 'AMM_M061_EM0182_C::_______1__Direction_E1FA24754946F6195DD684986395DF14' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, _______1) == 0x0002E8, "Member 'AMM_M061_EM0182_C::_______1' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, _______0_Rot_874EC96340C59F6A0FB66B9E4CD7C851) == 0x0002F0, "Member 'AMM_M061_EM0182_C::_______0_Rot_874EC96340C59F6A0FB66B9E4CD7C851' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, _______0__Direction_874EC96340C59F6A0FB66B9E4CD7C851) == 0x0002F4, "Member 'AMM_M061_EM0182_C::_______0__Direction_874EC96340C59F6A0FB66B9E4CD7C851' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, _______0) == 0x0002F8, "Member 'AMM_M061_EM0182_C::_______0' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, SelectIndex) == 0x000300, "Member 'AMM_M061_EM0182_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, SystemMessageAsset) == 0x000308, "Member 'AMM_M061_EM0182_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, MissionMessageAsset) == 0x000310, "Member 'AMM_M061_EM0182_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, Mission_Event) == 0x000318, "Member 'AMM_M061_EM0182_C::Mission_Event' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, Camera) == 0x000320, "Member 'AMM_M061_EM0182_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, Target) == 0x000330, "Member 'AMM_M061_EM0182_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, CameraBlender) == 0x000340, "Member 'AMM_M061_EM0182_C::CameraBlender' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, DefCamera) == 0x000348, "Member 'AMM_M061_EM0182_C::DefCamera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, DefDevRot) == 0x000350, "Member 'AMM_M061_EM0182_C::DefDevRot' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, PLRot) == 0x00035C, "Member 'AMM_M061_EM0182_C::PLRot' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, SpawnActor) == 0x000368, "Member 'AMM_M061_EM0182_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, InstantCamera) == 0x000370, "Member 'AMM_M061_EM0182_C::InstantCamera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, DefFOV) == 0x000378, "Member 'AMM_M061_EM0182_C::DefFOV' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, DefInstantCameraRot) == 0x00037C, "Member 'AMM_M061_EM0182_C::DefInstantCameraRot' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, LocalFade) == 0x000388, "Member 'AMM_M061_EM0182_C::LocalFade' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, Emitter) == 0x000390, "Member 'AMM_M061_EM0182_C::Emitter' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0182_C, NewFOV) == 0x000398, "Member 'AMM_M061_EM0182_C::NewFOV' has a wrong offset!");

}

