#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_E0251_hit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_EventMissionBase_Hit_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_E0251_hit.MM_M061_E0251_hit_C
// 0x0058 (0x0320 - 0x02C8)
class AMM_M061_E0251_hit_C final : public ABP_EventMissionBase_Hit_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_E0251_hit_C;                // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SelectIndex;                                       // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CF89[0x4];                                     // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 Mission_Event;                                     // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AActor*                                 DefCamera;                                         // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraBlend_C*                 CameraBlender;                                     // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_E0251_hit(int32 EntryPoint);
	void EvtDis_FinishComplete();
	void EvtDis_Finish();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnDestroyed______1(class AActor* DestroyedActor);
	void MoveEnd();
	void CallDeactivate();
	void CheckActive();
	void QuestExecute();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_E0251_hit_C">();
	}
	static class AMM_M061_E0251_hit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_E0251_hit_C>();
	}
};
static_assert(alignof(AMM_M061_E0251_hit_C) == 0x000008, "Wrong alignment on AMM_M061_E0251_hit_C");
static_assert(sizeof(AMM_M061_E0251_hit_C) == 0x000320, "Wrong size on AMM_M061_E0251_hit_C");
static_assert(offsetof(AMM_M061_E0251_hit_C, UberGraphFrame_MM_M061_E0251_hit_C) == 0x0002C8, "Member 'AMM_M061_E0251_hit_C::UberGraphFrame_MM_M061_E0251_hit_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0251_hit_C, SelectIndex) == 0x0002D0, "Member 'AMM_M061_E0251_hit_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0251_hit_C, SystemMessageAsset) == 0x0002D8, "Member 'AMM_M061_E0251_hit_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0251_hit_C, MissionMessageAsset) == 0x0002E0, "Member 'AMM_M061_E0251_hit_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0251_hit_C, Mission_Event) == 0x0002E8, "Member 'AMM_M061_E0251_hit_C::Mission_Event' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0251_hit_C, Camera) == 0x0002F0, "Member 'AMM_M061_E0251_hit_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0251_hit_C, Target) == 0x000300, "Member 'AMM_M061_E0251_hit_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0251_hit_C, DefCamera) == 0x000310, "Member 'AMM_M061_E0251_hit_C::DefCamera' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0251_hit_C, CameraBlender) == 0x000318, "Member 'AMM_M061_E0251_hit_C::CameraBlender' has a wrong offset!");

}

