#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM2246

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_EventMissionBase_HitAction_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM2246.MM_M061_EM2246_C
// 0x0088 (0x0380 - 0x02F8)
class AMM_M061_EM2246_C final : public ABP_EventMissionBase_HitAction_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM2246_C;                   // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SelectIndex;                                       // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D304[0x4];                                     // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MissionEventBase_C*                 Mission_Event;                                     // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EventHit_Location;                                 // 0x0310(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               EventHit_Rotater;                                  // 0x031C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                EvenrHit_Size;                                     // 0x0328(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D305[0x4];                                     // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0358(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate)
	class ABP_AutoRotateFocus_C*                  AutoRotControl;                                    // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           SpawnActor;                                        // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CameraFocusEnd;                                    // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_MM_M061_EM2246(int32 EntryPoint);
	void EndEvent();
	void CameraFocus();
	void QuestExecute();
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDC9896194(class UObject* Loaded);
	void UserConstructionScript();
	void CallDeactivate();
	void QuestFunctionHit();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM2246_C">();
	}
	static class AMM_M061_EM2246_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM2246_C>();
	}
};
static_assert(alignof(AMM_M061_EM2246_C) == 0x000008, "Wrong alignment on AMM_M061_EM2246_C");
static_assert(sizeof(AMM_M061_EM2246_C) == 0x000380, "Wrong size on AMM_M061_EM2246_C");
static_assert(offsetof(AMM_M061_EM2246_C, UberGraphFrame_MM_M061_EM2246_C) == 0x0002F8, "Member 'AMM_M061_EM2246_C::UberGraphFrame_MM_M061_EM2246_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2246_C, SelectIndex) == 0x000300, "Member 'AMM_M061_EM2246_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2246_C, Mission_Event) == 0x000308, "Member 'AMM_M061_EM2246_C::Mission_Event' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2246_C, EventHit_Location) == 0x000310, "Member 'AMM_M061_EM2246_C::EventHit_Location' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2246_C, EventHit_Rotater) == 0x00031C, "Member 'AMM_M061_EM2246_C::EventHit_Rotater' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2246_C, EvenrHit_Size) == 0x000328, "Member 'AMM_M061_EM2246_C::EvenrHit_Size' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2246_C, SystemMessageAsset) == 0x000338, "Member 'AMM_M061_EM2246_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2246_C, MissionMessageAsset) == 0x000340, "Member 'AMM_M061_EM2246_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2246_C, Camera) == 0x000348, "Member 'AMM_M061_EM2246_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2246_C, Target) == 0x000358, "Member 'AMM_M061_EM2246_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2246_C, AutoRotControl) == 0x000368, "Member 'AMM_M061_EM2246_C::AutoRotControl' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2246_C, SpawnActor) == 0x000370, "Member 'AMM_M061_EM2246_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2246_C, CameraFocusEnd) == 0x000378, "Member 'AMM_M061_EM2246_C::CameraFocusEnd' has a wrong offset!");

}

