#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_E2626

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_EventMissionBase_Hit_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_E2626.MM_M061_E2626_C
// 0x0090 (0x0358 - 0x02C8)
class AMM_M061_E2626_C final : public ABP_EventMissionBase_Hit_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_E2626_C;                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         _______1_rot_FB0DD8C34CB34BFACF7DBFB9D3268AA1;     // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______1__Direction_FB0DD8C34CB34BFACF7DBFB9D3268AA1; // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C515[0x3];                                     // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______1;                                          // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______0_rot_8152E1D6464BD5C6A7DC24B2C5E6B4F5;     // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______0__Direction_8152E1D6464BD5C6A7DC24B2C5E6B4F5; // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C516[0x3];                                     // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______0;                                          // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectIndex;                                       // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C517[0x4];                                     // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 Mission_Event;                                     // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ACharaBase_C*                           SpawnActor;                                        // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DefaultCamera;                                     // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           InstantCamera;                                     // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefFOV;                                            // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DefInstatCameraRoll;                               // 0x034C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_MM_M061_E2626(int32 EntryPoint);
	void EvtDis_FinishComplete();
	void EvtDis_Finish();
	void CallDeactivate();
	void QuestExecute();
	void ReceiveBeginPlay();
	void EndMoved();
	void _______1__UpdateFunc();
	void _______1__FinishedFunc();
	void _______0__UpdateFunc();
	void _______0__FinishedFunc();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_E2626_C">();
	}
	static class AMM_M061_E2626_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_E2626_C>();
	}
};
static_assert(alignof(AMM_M061_E2626_C) == 0x000008, "Wrong alignment on AMM_M061_E2626_C");
static_assert(sizeof(AMM_M061_E2626_C) == 0x000358, "Wrong size on AMM_M061_E2626_C");
static_assert(offsetof(AMM_M061_E2626_C, UberGraphFrame_MM_M061_E2626_C) == 0x0002C8, "Member 'AMM_M061_E2626_C::UberGraphFrame_MM_M061_E2626_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2626_C, _______1_rot_FB0DD8C34CB34BFACF7DBFB9D3268AA1) == 0x0002D0, "Member 'AMM_M061_E2626_C::_______1_rot_FB0DD8C34CB34BFACF7DBFB9D3268AA1' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2626_C, _______1__Direction_FB0DD8C34CB34BFACF7DBFB9D3268AA1) == 0x0002D4, "Member 'AMM_M061_E2626_C::_______1__Direction_FB0DD8C34CB34BFACF7DBFB9D3268AA1' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2626_C, _______1) == 0x0002D8, "Member 'AMM_M061_E2626_C::_______1' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2626_C, _______0_rot_8152E1D6464BD5C6A7DC24B2C5E6B4F5) == 0x0002E0, "Member 'AMM_M061_E2626_C::_______0_rot_8152E1D6464BD5C6A7DC24B2C5E6B4F5' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2626_C, _______0__Direction_8152E1D6464BD5C6A7DC24B2C5E6B4F5) == 0x0002E4, "Member 'AMM_M061_E2626_C::_______0__Direction_8152E1D6464BD5C6A7DC24B2C5E6B4F5' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2626_C, _______0) == 0x0002E8, "Member 'AMM_M061_E2626_C::_______0' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2626_C, SelectIndex) == 0x0002F0, "Member 'AMM_M061_E2626_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2626_C, SystemMessageAsset) == 0x0002F8, "Member 'AMM_M061_E2626_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2626_C, MissionMessageAsset) == 0x000300, "Member 'AMM_M061_E2626_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2626_C, Mission_Event) == 0x000308, "Member 'AMM_M061_E2626_C::Mission_Event' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2626_C, Camera) == 0x000310, "Member 'AMM_M061_E2626_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2626_C, Target) == 0x000320, "Member 'AMM_M061_E2626_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2626_C, SpawnActor) == 0x000330, "Member 'AMM_M061_E2626_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2626_C, DefaultCamera) == 0x000338, "Member 'AMM_M061_E2626_C::DefaultCamera' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2626_C, InstantCamera) == 0x000340, "Member 'AMM_M061_E2626_C::InstantCamera' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2626_C, DefFOV) == 0x000348, "Member 'AMM_M061_E2626_C::DefFOV' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2626_C, DefInstatCameraRoll) == 0x00034C, "Member 'AMM_M061_E2626_C::DefInstatCameraRoll' has a wrong offset!");

}

