#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM1802_NewRoute

#include "Basic.hpp"

#include "BP_EventMissionBase_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM1802_NewRoute.MM_M061_EM1802_NewRoute_C
// 0x00D0 (0x03F0 - 0x0320)
class AMM_M061_EM1802_NewRoute_C final : public ABP_EventMissionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM1802_NewRoute_C;          // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SelectIndex;                                       // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DCA[0x4];                                     // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADevilBase_C*                           SpawnActor;                                        // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset_2;                             // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset_3;                             // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 MissionEvent;                                      // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AutoRotateFocus_C*                  Auto_Rot_Ctrl;                                     // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ATargetPoint*                           BattlePoint;                                       // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraBlend_C*                 CameraBlender;                                     // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DefCamera;                                         // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             DefaultPos;                                        // 0x03A0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ATargetPoint*                           ObjectPoint;                                       // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Emitter;                                           // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MajinWarpPoint_C*                   SpawnObject;                                       // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_EM1802_NewRoute(int32 EntryPoint);
	void Evt_FinishComplete();
	void Evt_Finish();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void MoveFinish();
	void OnDestroyed______1(class AActor* DestroyedActor);
	void BattleStandby();
	void _________0();
	void OnDestroyed______0(class AActor* DestroyedActor);
	void EndMission();
	void EventStart();
	void QuestExecute();
	void ReceiveBeginPlay();
	void OnLoaded_2E3BE2F0450018341E9B13A89D5DBB29(TSubclassOf<class UObject> Loaded);
	void OnLoaded_8E0E0F39490BEB983AE3B0A0020DEFA7(TSubclassOf<class UObject> Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD8ACB860A(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC620BC133(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDE04911DC(class UObject* Loaded);
	void CallDeactivate();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM1802_NewRoute_C">();
	}
	static class AMM_M061_EM1802_NewRoute_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM1802_NewRoute_C>();
	}
};
static_assert(alignof(AMM_M061_EM1802_NewRoute_C) == 0x000010, "Wrong alignment on AMM_M061_EM1802_NewRoute_C");
static_assert(sizeof(AMM_M061_EM1802_NewRoute_C) == 0x0003F0, "Wrong size on AMM_M061_EM1802_NewRoute_C");
static_assert(offsetof(AMM_M061_EM1802_NewRoute_C, UberGraphFrame_MM_M061_EM1802_NewRoute_C) == 0x000320, "Member 'AMM_M061_EM1802_NewRoute_C::UberGraphFrame_MM_M061_EM1802_NewRoute_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1802_NewRoute_C, SelectIndex) == 0x000328, "Member 'AMM_M061_EM1802_NewRoute_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1802_NewRoute_C, SpawnActor) == 0x000330, "Member 'AMM_M061_EM1802_NewRoute_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1802_NewRoute_C, SystemMessageAsset) == 0x000338, "Member 'AMM_M061_EM1802_NewRoute_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1802_NewRoute_C, MissionMessageAsset) == 0x000340, "Member 'AMM_M061_EM1802_NewRoute_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1802_NewRoute_C, MissionMessageAsset_2) == 0x000348, "Member 'AMM_M061_EM1802_NewRoute_C::MissionMessageAsset_2' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1802_NewRoute_C, MissionMessageAsset_3) == 0x000350, "Member 'AMM_M061_EM1802_NewRoute_C::MissionMessageAsset_3' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1802_NewRoute_C, MissionEvent) == 0x000358, "Member 'AMM_M061_EM1802_NewRoute_C::MissionEvent' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1802_NewRoute_C, Auto_Rot_Ctrl) == 0x000360, "Member 'AMM_M061_EM1802_NewRoute_C::Auto_Rot_Ctrl' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1802_NewRoute_C, Camera) == 0x000368, "Member 'AMM_M061_EM1802_NewRoute_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1802_NewRoute_C, Target) == 0x000378, "Member 'AMM_M061_EM1802_NewRoute_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1802_NewRoute_C, BattlePoint) == 0x000388, "Member 'AMM_M061_EM1802_NewRoute_C::BattlePoint' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1802_NewRoute_C, CameraBlender) == 0x000390, "Member 'AMM_M061_EM1802_NewRoute_C::CameraBlender' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1802_NewRoute_C, DefCamera) == 0x000398, "Member 'AMM_M061_EM1802_NewRoute_C::DefCamera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1802_NewRoute_C, DefaultPos) == 0x0003A0, "Member 'AMM_M061_EM1802_NewRoute_C::DefaultPos' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1802_NewRoute_C, ObjectPoint) == 0x0003D0, "Member 'AMM_M061_EM1802_NewRoute_C::ObjectPoint' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1802_NewRoute_C, Emitter) == 0x0003D8, "Member 'AMM_M061_EM1802_NewRoute_C::Emitter' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1802_NewRoute_C, SpawnObject) == 0x0003E0, "Member 'AMM_M061_EM1802_NewRoute_C::SpawnObject' has a wrong offset!");

}

