#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM2221

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MM_M061_EM2221.MM_M061_EM2221_C.ExecuteUbergraph_MM_M061_EM2221
// 0x00D0 (0x00D0 - 0x0000)
struct MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5AF[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_EventScriptArea_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActive_IsActive;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5B0[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventScriptArea_C*                  CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5B1[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EventScript_C>    K2Node_DynamicCast_AsBPI_Event_Script;             // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SpawnReflesh_NoUse;                       // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_1;             // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5B2[0x1];                                     // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5B3[0x2];                                     // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_A5B4[0x8];                                     // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0080(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FindItemObject_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5B5[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221) == 0x000010, "Wrong alignment on MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221");
static_assert(sizeof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221) == 0x0000D0, "Wrong size on MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, EntryPoint) == 0x000000, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::EntryPoint' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, Temp_int_Array_Index_Variable) == 0x000024, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, CallFunc_GetActive_IsActive) == 0x000028, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::CallFunc_GetActive_IsActive' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, Temp_int_Array_Index_Variable_1) == 0x00002C, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, CallFunc_Array_Get_Item) == 0x000030, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, CallFunc_CheckEventFlag_ReturnValue) == 0x000038, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, K2Node_DynamicCast_AsBPI_Event_Script) == 0x000040, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::K2Node_DynamicCast_AsBPI_Event_Script' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, CallFunc_SpawnReflesh_NoUse) == 0x000051, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::CallFunc_SpawnReflesh_NoUse' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, CallFunc_CheckEventFlag_ReturnValue_1) == 0x000052, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::CallFunc_CheckEventFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, CallFunc_Array_Add_ReturnValue) == 0x000054, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, CallFunc_IsValid_ReturnValue) == 0x000065, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, CallFunc_GetTransform_ReturnValue) == 0x000080, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000B0, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000B8, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, Temp_int_Loop_Counter_Variable_1) == 0x0000C0, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C4, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C8, "Member 'MM_M061_EM2221_C_ExecuteUbergraph_MM_M061_EM2221::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

}

