#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM2380

#include "Basic.hpp"

#include "BP_EventMissionBase_classes.hpp"
#include "Engine_structs.hpp"
#include "Project_structs.hpp"
#include "E_MakkaWindowAnimState_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM2380.MM_M061_EM2380_C
// 0x00D0 (0x03F0 - 0x0320)
class AMM_M061_EM2380_C final : public ABP_EventMissionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM2380_C;                   // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_RotateMoshobou_Weight_E80BA6B94F9C237DB926A99A36BA9646; // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_RotateMoshobou__Direction_E80BA6B94F9C237DB926A99A36BA9646; // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE71[0x3];                                     // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_RotateMoshobou;                           // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_MoveDev269_Weight_27DA5BAD49B9C77A1F88A1A085545C6E; // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_MoveDev269__Direction_27DA5BAD49B9C77A1F88A1A085545C6E; // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE72[0x3];                                     // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_MoveDev269;                               // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_MoveDev289_Weight_EF1C617D4C82E7375292F393FC70CD9D; // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_MoveDev289__Direction_EF1C617D4C82E7375292F393FC70CD9D; // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE73[0x3];                                     // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_MoveDev289;                               // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectIndex;                                       // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE74[0x4];                                     // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 MissionEvent;                                      // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ABP_EventPlayerChange_C*                ChangeCtrl;                                        // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    SequenceActor;                                     // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PrevMakka;                                         // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE75[0x4];                                     // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATargetPoint*                           BattlePoint;                                       // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADevilBase_C*                           SpawnMoshobou;                                     // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMM_M061_EM2380_Start_C*                StartEvent;                                        // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MoShoboMoveWeight;                                 // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE76[0x7];                                     // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           CameraActor;                                       // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADevilBase_C*                           SpawnDev272;                                       // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BecomeNavi;                                        // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ChangeBGM;                                         // 0x03D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE77[0x6];                                     // 0x03D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaBase_C*                           SpawnActor;                                        // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PrevLandscapeLOD;                                  // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChangeLandscapeLOD;                                // 0x03E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE78[0x3];                                     // 0x03E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LandscapeLOD;                                      // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_EM2380(int32 EntryPoint);
	void Evt_FinishComplete();
	void Evt_Finish();
	void InterruptEvent();
	void RotateMoshobou();
	void AfterBattle();
	void OnDestroyed_Event(class AActor* DestroyedActor);
	void MoveDev272();
	void MoveDev289();
	void TraportEvent();
	void EndTalk();
	void StartFirstEvent();
	void StartRepeatEvent();
	void StartRetryEvent();
	void StartBattleEvent();
	void QuestExecute();
	void ReceiveBeginPlay();
	void OnLoaded_3B95B6674E6044C73C327E9EEE1ADE1D(TSubclassOf<class UObject> Loaded);
	void OnLoaded_1709D5A5442A6B6EC712AE9AFA9D2D99(TSubclassOf<class UObject> Loaded);
	void OnLoaded_1E6A0649430797CF1FADE2A5930D8D81(TSubclassOf<class UObject> Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F8289A342(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FCB059AFE(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD86C309F4(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD1F127E50(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDDCCCC1C5(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD1C9E3787(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD7B47CBD5(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD4B68D49C(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD0DBFCBC8(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BCB244A85E(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDA498FBE4(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BCF7FE147D(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD67A75525(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC6DE0F415(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD2DD371ED(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC11A3621B(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDA211D6AD(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDE8AF2155(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F65CBC4F6(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F590078FC(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FC985A792(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F9B3C8C8D(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FE4D5A977(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F37B20345(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FEAD4CA2F(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F97D4EE0D(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F44B489A4(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FC1BCB26E(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F49C68F17(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FC5D2DA80(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FC22234E3(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F00C7398B(class UObject* Loaded);
	void Timeline_RotateMoshobou__UpdateFunc();
	void Timeline_RotateMoshobou__FinishedFunc();
	void Timeline_MoveDev269__UpdateFunc();
	void Timeline_MoveDev269__FinishedFunc();
	void Timeline_MoveDev289__UpdateFunc();
	void Timeline_MoveDev289__FinishedFunc();
	void CallDeactivate();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM2380_C">();
	}
	static class AMM_M061_EM2380_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM2380_C>();
	}
};
static_assert(alignof(AMM_M061_EM2380_C) == 0x000008, "Wrong alignment on AMM_M061_EM2380_C");
static_assert(sizeof(AMM_M061_EM2380_C) == 0x0003F0, "Wrong size on AMM_M061_EM2380_C");
static_assert(offsetof(AMM_M061_EM2380_C, UberGraphFrame_MM_M061_EM2380_C) == 0x000320, "Member 'AMM_M061_EM2380_C::UberGraphFrame_MM_M061_EM2380_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, Timeline_RotateMoshobou_Weight_E80BA6B94F9C237DB926A99A36BA9646) == 0x000328, "Member 'AMM_M061_EM2380_C::Timeline_RotateMoshobou_Weight_E80BA6B94F9C237DB926A99A36BA9646' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, Timeline_RotateMoshobou__Direction_E80BA6B94F9C237DB926A99A36BA9646) == 0x00032C, "Member 'AMM_M061_EM2380_C::Timeline_RotateMoshobou__Direction_E80BA6B94F9C237DB926A99A36BA9646' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, Timeline_RotateMoshobou) == 0x000330, "Member 'AMM_M061_EM2380_C::Timeline_RotateMoshobou' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, Timeline_MoveDev269_Weight_27DA5BAD49B9C77A1F88A1A085545C6E) == 0x000338, "Member 'AMM_M061_EM2380_C::Timeline_MoveDev269_Weight_27DA5BAD49B9C77A1F88A1A085545C6E' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, Timeline_MoveDev269__Direction_27DA5BAD49B9C77A1F88A1A085545C6E) == 0x00033C, "Member 'AMM_M061_EM2380_C::Timeline_MoveDev269__Direction_27DA5BAD49B9C77A1F88A1A085545C6E' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, Timeline_MoveDev269) == 0x000340, "Member 'AMM_M061_EM2380_C::Timeline_MoveDev269' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, Timeline_MoveDev289_Weight_EF1C617D4C82E7375292F393FC70CD9D) == 0x000348, "Member 'AMM_M061_EM2380_C::Timeline_MoveDev289_Weight_EF1C617D4C82E7375292F393FC70CD9D' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, Timeline_MoveDev289__Direction_EF1C617D4C82E7375292F393FC70CD9D) == 0x00034C, "Member 'AMM_M061_EM2380_C::Timeline_MoveDev289__Direction_EF1C617D4C82E7375292F393FC70CD9D' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, Timeline_MoveDev289) == 0x000350, "Member 'AMM_M061_EM2380_C::Timeline_MoveDev289' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, SelectIndex) == 0x000358, "Member 'AMM_M061_EM2380_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, SystemMessageAsset) == 0x000360, "Member 'AMM_M061_EM2380_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, MissionMessageAsset) == 0x000368, "Member 'AMM_M061_EM2380_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, MissionEvent) == 0x000370, "Member 'AMM_M061_EM2380_C::MissionEvent' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, Target) == 0x000378, "Member 'AMM_M061_EM2380_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, ChangeCtrl) == 0x000388, "Member 'AMM_M061_EM2380_C::ChangeCtrl' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, SequenceActor) == 0x000390, "Member 'AMM_M061_EM2380_C::SequenceActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, PrevMakka) == 0x000398, "Member 'AMM_M061_EM2380_C::PrevMakka' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, BattlePoint) == 0x0003A0, "Member 'AMM_M061_EM2380_C::BattlePoint' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, SpawnMoshobou) == 0x0003A8, "Member 'AMM_M061_EM2380_C::SpawnMoshobou' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, StartEvent) == 0x0003B0, "Member 'AMM_M061_EM2380_C::StartEvent' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, MoShoboMoveWeight) == 0x0003B8, "Member 'AMM_M061_EM2380_C::MoShoboMoveWeight' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, CameraActor) == 0x0003C0, "Member 'AMM_M061_EM2380_C::CameraActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, SpawnDev272) == 0x0003C8, "Member 'AMM_M061_EM2380_C::SpawnDev272' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, BecomeNavi) == 0x0003D0, "Member 'AMM_M061_EM2380_C::BecomeNavi' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, ChangeBGM) == 0x0003D1, "Member 'AMM_M061_EM2380_C::ChangeBGM' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, SpawnActor) == 0x0003D8, "Member 'AMM_M061_EM2380_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, PrevLandscapeLOD) == 0x0003E0, "Member 'AMM_M061_EM2380_C::PrevLandscapeLOD' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, ChangeLandscapeLOD) == 0x0003E4, "Member 'AMM_M061_EM2380_C::ChangeLandscapeLOD' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2380_C, LandscapeLOD) == 0x0003E8, "Member 'AMM_M061_EM2380_C::LandscapeLOD' has a wrong offset!");

}

