#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM2530

#include "Basic.hpp"

#include "BP_EventMissionBase_classes.hpp"
#include "Engine_structs.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM2530.MM_M061_EM2530_C
// 0x0040 (0x0360 - 0x0320)
class AMM_M061_EM2530_C final : public ABP_EventMissionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM2530_C;                   // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SelectIndex;                                       // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A50B[0x4];                                     // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 MissionEvent;                                      // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AutoRotateFocus_C*                  CameraRotCtrl;                                     // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FocusFinish;                                       // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UseFade;                                           // 0x0351(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ChangeBGM;                                         // 0x0352(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A50C[0x5];                                     // 0x0353(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaBase_C*                           SpawnActor;                                        // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_EM2530(int32 EntryPoint);
	void Evt_FinishComplete();
	void Evt_Finish();
	void FocusMissionEnd();
	void EndTalk();
	void StartTalk();
	void QuestExecute();
	void ReceiveBeginPlay();
	void OnLoaded_B221FF934785A5DF053F7FB4931CE661(TSubclassOf<class UObject> Loaded);
	void OnLoaded_242A4B9F4B779767820A74A0C230648E(TSubclassOf<class UObject> Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC245B472F(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD6F680E84(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD4A7867E4(class UObject* Loaded);
	void CallDeactivate();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM2530_C">();
	}
	static class AMM_M061_EM2530_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM2530_C>();
	}
};
static_assert(alignof(AMM_M061_EM2530_C) == 0x000008, "Wrong alignment on AMM_M061_EM2530_C");
static_assert(sizeof(AMM_M061_EM2530_C) == 0x000360, "Wrong size on AMM_M061_EM2530_C");
static_assert(offsetof(AMM_M061_EM2530_C, UberGraphFrame_MM_M061_EM2530_C) == 0x000320, "Member 'AMM_M061_EM2530_C::UberGraphFrame_MM_M061_EM2530_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2530_C, SelectIndex) == 0x000328, "Member 'AMM_M061_EM2530_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2530_C, SystemMessageAsset) == 0x000330, "Member 'AMM_M061_EM2530_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2530_C, MissionMessageAsset) == 0x000338, "Member 'AMM_M061_EM2530_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2530_C, MissionEvent) == 0x000340, "Member 'AMM_M061_EM2530_C::MissionEvent' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2530_C, CameraRotCtrl) == 0x000348, "Member 'AMM_M061_EM2530_C::CameraRotCtrl' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2530_C, FocusFinish) == 0x000350, "Member 'AMM_M061_EM2530_C::FocusFinish' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2530_C, UseFade) == 0x000351, "Member 'AMM_M061_EM2530_C::UseFade' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2530_C, ChangeBGM) == 0x000352, "Member 'AMM_M061_EM2530_C::ChangeBGM' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2530_C, SpawnActor) == 0x000358, "Member 'AMM_M061_EM2530_C::SpawnActor' has a wrong offset!");

}

