#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM2191

#include "Basic.hpp"

#include "BP_EventMissionBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM2191.MM_M061_EM2191_C
// 0x0050 (0x0370 - 0x0320)
class AMM_M061_EM2191_C final : public ABP_EventMissionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM2191_C;                   // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SelectIndex;                                       // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E27[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATargetPoint*>                   Target;                                            // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ACameraActor*                           Camera;                                            // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           SpawnActor;                                        // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    SequencerActor;                                    // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Def_Camera;                                        // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IconData_Id;                                       // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_EM2191(int32 EntryPoint);
	void QuestExecute();
	void ReceiveBeginPlay();
	void OnLoaded_CA4C919B47E016D1B6B5949FF69A78D8(class UObject* Loaded);
	void CallDeactivate();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM2191_C">();
	}
	static class AMM_M061_EM2191_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM2191_C>();
	}
};
static_assert(alignof(AMM_M061_EM2191_C) == 0x000008, "Wrong alignment on AMM_M061_EM2191_C");
static_assert(sizeof(AMM_M061_EM2191_C) == 0x000370, "Wrong size on AMM_M061_EM2191_C");
static_assert(offsetof(AMM_M061_EM2191_C, UberGraphFrame_MM_M061_EM2191_C) == 0x000320, "Member 'AMM_M061_EM2191_C::UberGraphFrame_MM_M061_EM2191_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2191_C, SelectIndex) == 0x000328, "Member 'AMM_M061_EM2191_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2191_C, Target) == 0x000330, "Member 'AMM_M061_EM2191_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2191_C, Camera) == 0x000340, "Member 'AMM_M061_EM2191_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2191_C, SpawnActor) == 0x000348, "Member 'AMM_M061_EM2191_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2191_C, MissionMessageAsset) == 0x000350, "Member 'AMM_M061_EM2191_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2191_C, SequencerActor) == 0x000358, "Member 'AMM_M061_EM2191_C::SequencerActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2191_C, Def_Camera) == 0x000360, "Member 'AMM_M061_EM2191_C::Def_Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2191_C, IconData_Id) == 0x000368, "Member 'AMM_M061_EM2191_C::IconData_Id' has a wrong offset!");

}

