#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM2220

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_EventMissionBase_HitAction_classes.hpp"
#include "Engine_structs.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM2220.MM_M061_EM2220_C
// 0x00C0 (0x03B8 - 0x02F8)
class AMM_M061_EM2220_C final : public ABP_EventMissionBase_HitAction_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM2220_C;                   // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SelectIndex;                                       // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA1E[0x4];                                     // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MissionEventBase_C*                 Mission_Event;                                     // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EventHit_Location;                                 // 0x0310(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               EventHit_Rotater;                                  // 0x031C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                EvenrHit_Size;                                     // 0x0328(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA1F[0x4];                                     // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           Camera;                                            // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0350(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate)
	class ACharaBase_C*                           SpawnActor;                                        // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Def_Camera;                                        // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    SequencerActor;                                    // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSeq;                                             // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA20[0x7];                                     // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           TA_ItemFlagArray;                                  // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          CameraFocusEnd;                                    // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA21[0x7];                                     // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AutoRotateFocus_C*                  Auto_Rot_Ctrl;                                     // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetPoint*                           Focus_Point;                                       // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Event_Item_Id;                                     // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Condition;                                         // 0x03AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsFirstTalk;                                       // 0x03AD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA22[0x2];                                     // 0x03AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CountVal;                                          // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_EM2220(int32 EntryPoint);
	void EvtDis_FinishComplete();
	void EvtDis_Finish();
	void ReDirectReport();
	void ReTimeFall();
	void ReTimeSuccess();
	void MapFocusEnd2();
	void DirectReport(bool DirectEnd);
	void MapFocusEnd1();
	void MapFocusEnd0();
	void Focus();
	void MapFocus(const int32 Int);
	void TA_Start();
	void EvtDis_Finish_Complete();
	void NowOtherTimeAttack();
	void ReTry();
	void ReEntry();
	void EndMission();
	void EvtDis_Finish______0();
	void QuestExecute();
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDFCD7D42B(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC0CABE130(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDD073010A(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC0EE1DDC1(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDA9149B36(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BCD84DDC8B(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDBE984E61(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC55583364(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD4A17BC77(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC2E9F264A(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDDBBF34CB(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC804AB379(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDBCDF07D9(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F60A4EAA6(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FBDF18431(class UObject* Loaded);
	void OnLoaded_FD0FBD46434B6B1E05D7C9AFBAD48243(TSubclassOf<class UObject> Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F89F4CA90(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F1CC9C8DD(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F9337E402(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F871B8479(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F882CFB57(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FB5C2853E(class UObject* Loaded);
	void OnLoaded_DE960BD0440397DE61A238A53AAB0B53(TSubclassOf<class UObject> Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F7F2B1356(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F4D4E21D8(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F3B184E59(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F4CA69131(class UObject* Loaded);
	void UserConstructionScript();
	void CallDeactivate();
	void QuestFunctionHit();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM2220_C">();
	}
	static class AMM_M061_EM2220_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM2220_C>();
	}
};
static_assert(alignof(AMM_M061_EM2220_C) == 0x000008, "Wrong alignment on AMM_M061_EM2220_C");
static_assert(sizeof(AMM_M061_EM2220_C) == 0x0003B8, "Wrong size on AMM_M061_EM2220_C");
static_assert(offsetof(AMM_M061_EM2220_C, UberGraphFrame_MM_M061_EM2220_C) == 0x0002F8, "Member 'AMM_M061_EM2220_C::UberGraphFrame_MM_M061_EM2220_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2220_C, SelectIndex) == 0x000300, "Member 'AMM_M061_EM2220_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2220_C, Mission_Event) == 0x000308, "Member 'AMM_M061_EM2220_C::Mission_Event' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2220_C, EventHit_Location) == 0x000310, "Member 'AMM_M061_EM2220_C::EventHit_Location' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2220_C, EventHit_Rotater) == 0x00031C, "Member 'AMM_M061_EM2220_C::EventHit_Rotater' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2220_C, EvenrHit_Size) == 0x000328, "Member 'AMM_M061_EM2220_C::EvenrHit_Size' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2220_C, SystemMessageAsset) == 0x000338, "Member 'AMM_M061_EM2220_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2220_C, MissionMessageAsset) == 0x000340, "Member 'AMM_M061_EM2220_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2220_C, Camera) == 0x000348, "Member 'AMM_M061_EM2220_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2220_C, Target) == 0x000350, "Member 'AMM_M061_EM2220_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2220_C, SpawnActor) == 0x000360, "Member 'AMM_M061_EM2220_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2220_C, Def_Camera) == 0x000368, "Member 'AMM_M061_EM2220_C::Def_Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2220_C, SequencerActor) == 0x000370, "Member 'AMM_M061_EM2220_C::SequencerActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2220_C, IsSeq) == 0x000378, "Member 'AMM_M061_EM2220_C::IsSeq' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2220_C, TA_ItemFlagArray) == 0x000380, "Member 'AMM_M061_EM2220_C::TA_ItemFlagArray' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2220_C, CameraFocusEnd) == 0x000390, "Member 'AMM_M061_EM2220_C::CameraFocusEnd' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2220_C, Auto_Rot_Ctrl) == 0x000398, "Member 'AMM_M061_EM2220_C::Auto_Rot_Ctrl' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2220_C, Focus_Point) == 0x0003A0, "Member 'AMM_M061_EM2220_C::Focus_Point' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2220_C, Event_Item_Id) == 0x0003A8, "Member 'AMM_M061_EM2220_C::Event_Item_Id' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2220_C, Condition) == 0x0003AC, "Member 'AMM_M061_EM2220_C::Condition' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2220_C, IsFirstTalk) == 0x0003AD, "Member 'AMM_M061_EM2220_C::IsFirstTalk' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2220_C, CountVal) == 0x0003B0, "Member 'AMM_M061_EM2220_C::CountVal' has a wrong offset!");

}

