#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM2244

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MM_M061_EM2244.MM_M061_EM2244_C.ExecuteUbergraph_MM_M061_EM2244
// 0x05E0 (0x05E0 - 0x0000)
struct MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99FA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99FB[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99FC[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99FD[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl;                 // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99FE[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_1;               // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd;             // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99FF[0x2];                                     // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A00[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_1;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGazeTargetHolder*                      CallFunc_GetGazeTargetHolder_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_3;              // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A01[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_1;                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFinish_IsFinish;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A02[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_2;               // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A03[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_3;               // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1;           // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A04[0x6];                                     // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGazeTargetHolder*                      CallFunc_GetGazeTargetHolder_ReturnValue_1;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A05[0x3];                                     // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A06[0xC];                                     // 0x0124(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_4;              // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A07[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AutoRotateFocus_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_2;             // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_5;              // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A08[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_2;                // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_4;               // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A09[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_6;              // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A0A[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_5;               // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A0B[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_3;             // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_2;           // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A0C[0x7];                                     // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_7;              // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A0D[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_3;                // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_6;               // 0x0238(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A0E[0x7];                                     // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_7;               // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A0F[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_8;               // 0x0268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A10[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_4;            // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_8;              // 0x0288(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A11[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_4;             // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_9;              // 0x02A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A12[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_4;                // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_9;               // 0x02C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_19;                    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A13[0x7];                                     // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_10;              // 0x02E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_20;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A14[0x7];                                     // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_11;              // 0x02F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_21;                    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A15[0x7];                                     // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_12;              // 0x0310(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_22;                    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IIsFinishedWindowOut_OutFinished;         // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A16[0x2];                                     // 0x0322(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_1;             // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A17[0x3];                                     // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_5;            // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_10;             // 0x0340(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_23;                    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_2;             // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A18[0x6];                                     // 0x0352(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_5;             // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_11;             // 0x0360(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_24;                    // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A19[0x7];                                     // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_5;                // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_3;             // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A1A[0x7];                                     // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_13;              // 0x0388(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_25;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A1B[0x7];                                     // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_14;              // 0x03A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_26;                    // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_3;           // 0x03B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_4;             // 0x03B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A1C[0x5];                                     // 0x03B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A1D[0x4];                                     // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor;      // 0x03C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_27;                    // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A1E[0x6];                                     // 0x03DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_BI_GetMeshComponent_MeshComp;             // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A1F[0x7];                                     // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGazeTarget>           K2Node_DynamicCast_AsGaze_Target;                  // 0x03F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_28;                    // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A20[0x6];                                     // 0x0402(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_6;            // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActive_IsActive;                       // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A21[0x7];                                     // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_12;             // 0x0418(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_29;                    // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A22[0x7];                                     // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_6;             // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_13;             // 0x0438(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_30;                    // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A23[0x7];                                     // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_6;                // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_15;              // 0x0458(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_31;                    // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A24[0x7];                                     // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_16;              // 0x0470(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_32;                    // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_4;           // 0x0481(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A25[0xE];                                     // 0x0482(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0490(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADev303_Simple_C*                       CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A26[0x4];                                     // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> CallFunc_BI_EventPlayMotion_self_CastInput;        // 0x04D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_EventPlayMotion_NoUse;                 // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A27[0x3];                                     // 0x04E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAreaID_ReturnValue;                    // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A28[0x7];                                     // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGazeTarget>           K2Node_DynamicCast_AsGaze_Target_1;                // 0x04F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_33;                    // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartMapEvent_Dummy;                      // 0x0509(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A29[0x6];                                     // 0x050A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0510(0x0010)(ReferenceParm)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_7;            // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A2A[0x4];                                     // 0x052C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_14;             // 0x0530(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_34;                    // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0541(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A2B[0x6];                                     // 0x0542(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_7;             // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_15;             // 0x0550(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_35;                    // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A2C[0x7];                                     // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_7;                // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_17;              // 0x0570(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_36;                    // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A2D[0x7];                                     // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_18;              // 0x0588(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_37;                    // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_5;           // 0x0599(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EndMapEvent_Dummy;                        // 0x059A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFinish_IsFinish_1;                     // 0x059B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A2E[0x4];                                     // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x05A0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x05B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A2F[0x3];                                     // 0x05B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAreaID_ReturnValue_1;                  // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A30[0x4];                                     // 0x05BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array_2;                          // 0x05C0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x05D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A31[0x3];                                     // 0x05D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAreaID_ReturnValue_2;                  // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244) == 0x000010, "Wrong alignment on MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244");
static_assert(sizeof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244) == 0x0005E0, "Wrong size on MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, EntryPoint) == 0x000000, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::EntryPoint' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_BPI_GetUIManager_UIManager) == 0x000030, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000038, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_BPI_GetMsgCtrl_OutActor) == 0x000050, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_BPI_GetMsgCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_Msg_Ctrl) == 0x000058, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_Msg_Ctrl' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_Msg_Ctrl_1) == 0x000070, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_Msg_Ctrl_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_3) == 0x000080, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd) == 0x000081, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, Temp_int_Array_Index_Variable) == 0x000084, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_GetGameInstance_ReturnValue_1) == 0x000088, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_UIManager_2) == 0x000090, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_UIManager_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_4) == 0x0000A0, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_BPI_GetUIManager_UIManager_1) == 0x0000A8, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_BPI_GetUIManager_UIManager_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_GetGazeTargetHolder_ReturnValue) == 0x0000B0, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_GetGazeTargetHolder_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_UIManager_3) == 0x0000B8, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_UIManager_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_5) == 0x0000C8, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_BPI_GetMsgCtrl_OutActor_1) == 0x0000D0, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_BPI_GetMsgCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_GetFinish_IsFinish) == 0x0000D8, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_GetFinish_IsFinish' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_Msg_Ctrl_2) == 0x0000E0, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_Msg_Ctrl_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_6) == 0x0000F0, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_Msg_Ctrl_3) == 0x0000F8, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_Msg_Ctrl_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_7) == 0x000108, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1) == 0x000109, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_GetGazeTargetHolder_ReturnValue_1) == 0x000110, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_GetGazeTargetHolder_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_CheckEventFlag_ReturnValue) == 0x000118, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, Temp_int_Variable) == 0x00011C, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_Add_IntInt_ReturnValue_1) == 0x000120, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_MakeTransform_ReturnValue) == 0x000130, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_GetGameInstance_ReturnValue_2) == 0x000160, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000168, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_UIManager_4) == 0x000170, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_UIManager_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_8) == 0x000180, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_FinishSpawningActor_ReturnValue) == 0x000188, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_BPI_GetUIManager_UIManager_2) == 0x000190, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_BPI_GetUIManager_UIManager_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_UIManager_5) == 0x000198, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_UIManager_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_9) == 0x0001A8, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_BPI_GetMsgCtrl_OutActor_2) == 0x0001B0, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_BPI_GetMsgCtrl_OutActor_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_GetGameInstance_ReturnValue_3) == 0x0001B8, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_GetGameInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_Msg_Ctrl_4) == 0x0001C0, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_Msg_Ctrl_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_10) == 0x0001D0, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_UIManager_6) == 0x0001D8, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_UIManager_6' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_11) == 0x0001E8, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_Msg_Ctrl_5) == 0x0001F0, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_Msg_Ctrl_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_12) == 0x000200, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_BPI_GetUIManager_UIManager_3) == 0x000208, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_BPI_GetUIManager_UIManager_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_2) == 0x000210, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_UIManager_7) == 0x000218, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_UIManager_7' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_13) == 0x000228, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_BPI_GetMsgCtrl_OutActor_3) == 0x000230, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_BPI_GetMsgCtrl_OutActor_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_Msg_Ctrl_6) == 0x000238, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_Msg_Ctrl_6' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_14) == 0x000248, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_Msg_Ctrl_7) == 0x000250, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_Msg_Ctrl_7' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_15) == 0x000260, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_15' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_Msg_Ctrl_8) == 0x000268, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_Msg_Ctrl_8' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_16) == 0x000278, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_16' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_GetGameInstance_ReturnValue_4) == 0x000280, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_GetGameInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_UIManager_8) == 0x000288, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_UIManager_8' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_17) == 0x000298, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_17' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_BPI_GetUIManager_UIManager_4) == 0x0002A0, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_BPI_GetUIManager_UIManager_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_UIManager_9) == 0x0002A8, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_UIManager_9' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_18) == 0x0002B8, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_18' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_BPI_GetMsgCtrl_OutActor_4) == 0x0002C0, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_BPI_GetMsgCtrl_OutActor_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_Msg_Ctrl_9) == 0x0002C8, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_Msg_Ctrl_9' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_19) == 0x0002D8, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_19' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_Msg_Ctrl_10) == 0x0002E0, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_Msg_Ctrl_10' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_20) == 0x0002F0, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_20' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_Msg_Ctrl_11) == 0x0002F8, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_Msg_Ctrl_11' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_21) == 0x000308, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_21' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_Msg_Ctrl_12) == 0x000310, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_Msg_Ctrl_12' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_22) == 0x000320, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_22' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_IIsFinishedWindowOut_OutFinished) == 0x000321, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_IIsFinishedWindowOut_OutFinished' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, Temp_int_Variable_1) == 0x000324, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_Add_IntInt_ReturnValue_2) == 0x000328, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, Temp_int_Variable_2) == 0x00032C, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_Add_IntInt_ReturnValue_3) == 0x000330, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_CheckEventFlag_ReturnValue_1) == 0x000334, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_CheckEventFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_GetGameInstance_ReturnValue_5) == 0x000338, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_GetGameInstance_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_UIManager_10) == 0x000340, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_UIManager_10' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_23) == 0x000350, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_23' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_CheckEventFlag_ReturnValue_2) == 0x000351, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_CheckEventFlag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_BPI_GetUIManager_UIManager_5) == 0x000358, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_BPI_GetUIManager_UIManager_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_UIManager_11) == 0x000360, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_UIManager_11' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_24) == 0x000370, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_24' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_BPI_GetMsgCtrl_OutActor_5) == 0x000378, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_BPI_GetMsgCtrl_OutActor_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_CheckEventFlag_ReturnValue_3) == 0x000380, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_CheckEventFlag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_Msg_Ctrl_13) == 0x000388, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_Msg_Ctrl_13' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_25) == 0x000398, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_25' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_AsBPI_Msg_Ctrl_14) == 0x0003A0, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_AsBPI_Msg_Ctrl_14' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, K2Node_DynamicCast_bSuccess_26) == 0x0003B0, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::K2Node_DynamicCast_bSuccess_26' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_3) == 0x0003B1, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244, CallFunc_CheckEventFlag_ReturnValue_4) == 0x0003B2, "Member 'MM_M061_EM2244_C_ExecuteUbergraph_MM_M061_EM2244::CallFunc_CheckEventFlag_ReturnValue_4' has a wrong offset!");
