#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_E2006_Hit

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_EventMissionBase_Hit_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_E2006_Hit.MM_M061_E2006_Hit_C
// 0x0088 (0x0350 - 0x02C8)
class AMM_M061_E2006_Hit_C final : public ABP_EventMissionBase_Hit_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_E2006_Hit_C;                // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         _______1_FOV_7A74AC554AFC555D2F26698CC7C9B6E4;     // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______1__Direction_7A74AC554AFC555D2F26698CC7C9B6E4; // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C723[0x3];                                     // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______1;                                          // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______0_rot_98E176EF4F2841695DAC77859E678830;     // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______0__Direction_98E176EF4F2841695DAC77859E678830; // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C724[0x3];                                     // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______0;                                          // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectIndex;                                       // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C725[0x4];                                     // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 Mission_Event;                                     // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           Camera;                                            // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0318(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AActor*                                 DefCamera;                                         // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           InstantCamera;                                     // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefFOV;                                            // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DefInstatCameraRoll;                               // 0x033C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ALevelSequenceActor*                    SequencerActor;                                    // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_E2006_Hit(int32 EntryPoint);
	void EvtDis_FinishComplete();
	void EvtDis_Finish();
	void MoveEnd();
	void CallDeactivate();
	void QuestExecute();
	void ReceiveBeginPlay();
	void OnLoaded_CA4C919B47E016D1B6B5949FFD4E2D05(class UObject* Loaded);
	void _______1__UpdateFunc();
	void _______1__FinishedFunc();
	void _______0__UpdateFunc();
	void _______0__FinishedFunc();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_E2006_Hit_C">();
	}
	static class AMM_M061_E2006_Hit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_E2006_Hit_C>();
	}
};
static_assert(alignof(AMM_M061_E2006_Hit_C) == 0x000008, "Wrong alignment on AMM_M061_E2006_Hit_C");
static_assert(sizeof(AMM_M061_E2006_Hit_C) == 0x000350, "Wrong size on AMM_M061_E2006_Hit_C");
static_assert(offsetof(AMM_M061_E2006_Hit_C, UberGraphFrame_MM_M061_E2006_Hit_C) == 0x0002C8, "Member 'AMM_M061_E2006_Hit_C::UberGraphFrame_MM_M061_E2006_Hit_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2006_Hit_C, _______1_FOV_7A74AC554AFC555D2F26698CC7C9B6E4) == 0x0002D0, "Member 'AMM_M061_E2006_Hit_C::_______1_FOV_7A74AC554AFC555D2F26698CC7C9B6E4' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2006_Hit_C, _______1__Direction_7A74AC554AFC555D2F26698CC7C9B6E4) == 0x0002D4, "Member 'AMM_M061_E2006_Hit_C::_______1__Direction_7A74AC554AFC555D2F26698CC7C9B6E4' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2006_Hit_C, _______1) == 0x0002D8, "Member 'AMM_M061_E2006_Hit_C::_______1' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2006_Hit_C, _______0_rot_98E176EF4F2841695DAC77859E678830) == 0x0002E0, "Member 'AMM_M061_E2006_Hit_C::_______0_rot_98E176EF4F2841695DAC77859E678830' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2006_Hit_C, _______0__Direction_98E176EF4F2841695DAC77859E678830) == 0x0002E4, "Member 'AMM_M061_E2006_Hit_C::_______0__Direction_98E176EF4F2841695DAC77859E678830' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2006_Hit_C, _______0) == 0x0002E8, "Member 'AMM_M061_E2006_Hit_C::_______0' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2006_Hit_C, SelectIndex) == 0x0002F0, "Member 'AMM_M061_E2006_Hit_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2006_Hit_C, SystemMessageAsset) == 0x0002F8, "Member 'AMM_M061_E2006_Hit_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2006_Hit_C, MissionMessageAsset) == 0x000300, "Member 'AMM_M061_E2006_Hit_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2006_Hit_C, Mission_Event) == 0x000308, "Member 'AMM_M061_E2006_Hit_C::Mission_Event' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2006_Hit_C, Camera) == 0x000310, "Member 'AMM_M061_E2006_Hit_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2006_Hit_C, Target) == 0x000318, "Member 'AMM_M061_E2006_Hit_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2006_Hit_C, DefCamera) == 0x000328, "Member 'AMM_M061_E2006_Hit_C::DefCamera' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2006_Hit_C, InstantCamera) == 0x000330, "Member 'AMM_M061_E2006_Hit_C::InstantCamera' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2006_Hit_C, DefFOV) == 0x000338, "Member 'AMM_M061_E2006_Hit_C::DefFOV' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2006_Hit_C, DefInstatCameraRoll) == 0x00033C, "Member 'AMM_M061_E2006_Hit_C::DefInstatCameraRoll' has a wrong offset!");
static_assert(offsetof(AMM_M061_E2006_Hit_C, SequencerActor) == 0x000348, "Member 'AMM_M061_E2006_Hit_C::SequencerActor' has a wrong offset!");

}

