#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM2386

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MM_M061_EM2386.MM_M061_EM2386_C.ExecuteUbergraph_MM_M061_EM2386
// 0x06F0 (0x06F0 - 0x0000)
struct MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ACB9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_DynamicCast_AsAnim_Sequence_Base;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACBA[0xF];                                     // 0x0021(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFinish_IsFinish;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACBB[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AutoRotateFocus_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ACBC[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor;      // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_EventPlayMotion_NoUse;                 // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACBD[0x6];                                     // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1;    // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_StopMotion_NoUse;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_1;             // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACBE[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACBF[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ACC0[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACC1[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor;                  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl;                 // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACC2[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_1;               // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACC3[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_2;               // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACC4[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACC5[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_1;             // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_3;              // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACC6[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_4;              // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACC7[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_2;             // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_1;                // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_5;              // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACC8[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_2;                // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_3;               // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACC9[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_4;               // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd;             // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACCA[0x6];                                     // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_5;               // 0x0208(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1;           // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACCB[0x6];                                     // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_6;               // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACCC[0x3];                                     // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ACCD[0x4];                                     // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_6;              // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACCE[0x7];                                     // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_3;             // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_7;              // 0x0268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACCF[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_3;                // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_7;               // 0x0288(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACD0[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_8;               // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_19;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACD1[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_9;               // 0x02B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_20;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACD2[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_10;              // 0x02D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_21;                    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IIsFinishedWindowOut_OutFinished;         // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACD3[0x2];                                     // 0x02E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_EventScriptArea_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x02E8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_4;            // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_5;            // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_8;              // 0x0310(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_22;                    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACD4[0x7];                                     // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_9;              // 0x0328(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_23;                    // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACD5[0x7];                                     // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_4;             // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_5;             // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_10;             // 0x0350(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_24;                    // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACD6[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_4;                // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_11;             // 0x0370(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_25;                    // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACD7[0x7];                                     // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_11;              // 0x0388(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_26;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACD8[0x7];                                     // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_5;                // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_12;              // 0x03A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_27;                    // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_2;           // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACD9[0x6];                                     // 0x03BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_13;              // 0x03C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_28;                    // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACDA[0x7];                                     // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_14;              // 0x03D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_29;                    // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACDB[0x7];                                     // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_15;              // 0x03F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_30;                    // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACDC[0x7];                                     // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_6;            // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_12;             // 0x0410(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_31;                    // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACDD[0x7];                                     // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_7;            // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_6;             // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_13;             // 0x0438(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_32;                    // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACDE[0x7];                                     // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_7;             // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_14;             // 0x0458(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_33;                    // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACDF[0x7];                                     // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_6;                // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_15;             // 0x0478(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_34;                    // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACE0[0x7];                                     // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_7;                // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_16;              // 0x0498(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_35;                    // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_3;           // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACE1[0x6];                                     // 0x04AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_17;              // 0x04B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_36;                    // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACE2[0x7];                                     // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_18;              // 0x04C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_37;                    // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACE3[0x7];                                     // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_19;              // 0x04E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_38;                    // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IIsFinishedWindowOut_OutFinished_1;       // 0x04F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACE4[0x6];                                     // 0x04F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_20;              // 0x04F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_39;                    // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACE5[0x7];                                     // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_21;              // 0x0510(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_40;                    // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACE6[0x3];                                     // 0x0521(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventScriptArea_C*                  CallFunc_Array_Get_Item;                           // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventScript_C>    K2Node_DynamicCast_AsBPI_Event_Script;             // 0x0530(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_41;                    // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetActive_IsActive;                       // 0x0541(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SpawnReflesh_NoUse;                       // 0x0542(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartMapEvent_Dummy;                      // 0x0543(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACE7[0x4];                                     // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0554(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0555(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACE8[0x2];                                     // 0x0556(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_8;            // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ACE9[0x4];                                     // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_16;             // 0x0568(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_42;                    // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACEA[0x7];                                     // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_8;             // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_17;             // 0x0588(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_43;                    // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACEB[0x7];                                     // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x05A0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_8;                // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_22;              // 0x05E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_44;                    // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACEC[0x7];                                     // 0x05F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADev290_Simple_C*                       CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_23;              // 0x0600(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_45;                    // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_4;           // 0x0611(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACED[0x6];                                     // 0x0612(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0618(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x062C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACEE[0x3];                                     // 0x062D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x0630(0x0010)(ReferenceParm)
	float                                         CallFunc_FadeOutMapEvent_Delay;                    // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0644(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFinish_IsFinish_1;                     // 0x0649(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACEF[0x2];                                     // 0x064A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x064C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FadeInMapEvent_Delay;                     // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0654(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACF0[0x3];                                     // 0x0655(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ACF1[0x4];                                     // 0x065C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_9;            // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_18;             // 0x0668(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_46;                    // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EndMapEvent_Dummy;                        // 0x0679(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACF2[0x6];                                     // 0x067A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_9;             // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_19;             // 0x0688(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_47;                    // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACF3[0x3];                                     // 0x0699(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x069C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_ACF4[0x4];                                     // 0x06AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_9;                // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_24;              // 0x06B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_48;                    // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACF5[0x7];                                     // 0x06C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_25;              // 0x06D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_49;                    // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_5;           // 0x06E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386) == 0x000010, "Wrong alignment on MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386");
static_assert(sizeof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386) == 0x0006F0, "Wrong size on MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, EntryPoint) == 0x000000, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::EntryPoint' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, Temp_object_Variable) == 0x000010, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_AsAnim_Sequence_Base) == 0x000018, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_AsAnim_Sequence_Base' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_GetFinish_IsFinish) == 0x000068, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_GetFinish_IsFinish' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_FinishSpawningActor_ReturnValue) == 0x000070, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, Temp_int_Array_Index_Variable) == 0x000078, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor) == 0x000080, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_BI_EventPlayMotion_NoUse) == 0x000091, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_BI_EventPlayMotion_NoUse' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1) == 0x000098, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_BI_StopMotion_NoUse) == 0x0000A9, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_BI_StopMotion_NoUse' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_CheckEventFlag_ReturnValue) == 0x0000AA, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_CheckEventFlag_ReturnValue_1) == 0x0000AB, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_CheckEventFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_GetGameInstance_ReturnValue) == 0x0000B0, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_AsBPI_UIManager) == 0x0000B8, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_bSuccess_3) == 0x0000C8, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, Temp_int_Variable) == 0x0000CC, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_BPI_GetUIManager_UIManager) == 0x0000D0, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_Add_IntInt_ReturnValue) == 0x0000D8, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x0000E0, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_bSuccess_4) == 0x0000F0, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_BPI_GetMsgCtrl_OutActor) == 0x0000F8, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_BPI_GetMsgCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_AsBPI_Msg_Ctrl) == 0x000100, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_AsBPI_Msg_Ctrl' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_bSuccess_5) == 0x000110, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_AsBPI_Msg_Ctrl_1) == 0x000118, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_AsBPI_Msg_Ctrl_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_bSuccess_6) == 0x000128, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_AsBPI_Msg_Ctrl_2) == 0x000130, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_AsBPI_Msg_Ctrl_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_bSuccess_7) == 0x000140, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_GetGameInstance_ReturnValue_1) == 0x000148, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_AsBPI_UIManager_2) == 0x000150, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_AsBPI_UIManager_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_bSuccess_8) == 0x000160, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_BPI_GetUIManager_UIManager_1) == 0x000168, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_BPI_GetUIManager_UIManager_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_GetGameInstance_ReturnValue_2) == 0x000170, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_AsBPI_UIManager_3) == 0x000178, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_AsBPI_UIManager_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_bSuccess_9) == 0x000188, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_AsBPI_UIManager_4) == 0x000190, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_AsBPI_UIManager_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_bSuccess_10) == 0x0001A0, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_BPI_GetUIManager_UIManager_2) == 0x0001A8, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_BPI_GetUIManager_UIManager_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_BPI_GetMsgCtrl_OutActor_1) == 0x0001B0, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_BPI_GetMsgCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_AsBPI_UIManager_5) == 0x0001B8, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_AsBPI_UIManager_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_bSuccess_11) == 0x0001C8, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_BPI_GetMsgCtrl_OutActor_2) == 0x0001D0, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_BPI_GetMsgCtrl_OutActor_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_AsBPI_Msg_Ctrl_3) == 0x0001D8, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_AsBPI_Msg_Ctrl_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_bSuccess_12) == 0x0001E8, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_AsBPI_Msg_Ctrl_4) == 0x0001F0, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_AsBPI_Msg_Ctrl_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_bSuccess_13) == 0x000200, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd) == 0x000201, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_AsBPI_Msg_Ctrl_5) == 0x000208, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_AsBPI_Msg_Ctrl_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_bSuccess_14) == 0x000218, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1) == 0x000219, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_AsBPI_Msg_Ctrl_6) == 0x000220, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_AsBPI_Msg_Ctrl_6' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_bSuccess_15) == 0x000230, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_bSuccess_15' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, Temp_int_Variable_1) == 0x000234, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_Add_IntInt_ReturnValue_1) == 0x000238, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_GetGameInstance_ReturnValue_3) == 0x000240, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_GetGameInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_AsBPI_UIManager_6) == 0x000248, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_AsBPI_UIManager_6' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_bSuccess_16) == 0x000258, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_bSuccess_16' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_BPI_GetUIManager_UIManager_3) == 0x000260, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_BPI_GetUIManager_UIManager_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_AsBPI_UIManager_7) == 0x000268, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_AsBPI_UIManager_7' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_bSuccess_17) == 0x000278, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_bSuccess_17' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_BPI_GetMsgCtrl_OutActor_3) == 0x000280, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_BPI_GetMsgCtrl_OutActor_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_AsBPI_Msg_Ctrl_7) == 0x000288, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_AsBPI_Msg_Ctrl_7' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_bSuccess_18) == 0x000298, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_bSuccess_18' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_AsBPI_Msg_Ctrl_8) == 0x0002A0, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_AsBPI_Msg_Ctrl_8' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_bSuccess_19) == 0x0002B0, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_bSuccess_19' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_AsBPI_Msg_Ctrl_9) == 0x0002B8, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_AsBPI_Msg_Ctrl_9' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_bSuccess_20) == 0x0002C8, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_bSuccess_20' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_AsBPI_Msg_Ctrl_10) == 0x0002D0, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_AsBPI_Msg_Ctrl_10' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, K2Node_DynamicCast_bSuccess_21) == 0x0002E0, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::K2Node_DynamicCast_bSuccess_21' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, CallFunc_IIsFinishedWindowOut_OutFinished) == 0x0002E1, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::CallFunc_IIsFinishedWindowOut_OutFinished' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386, Temp_int_Loop_Counter_Variable) == 0x0002E4, "Member 'MM_M061_EM2386_C_ExecuteUbergraph_MM_M061_EM2386::Temp_int_Loop_Counter_Variable' has a wrong offset!");
