#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM2245

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MM_M061_EM2245.MM_M061_EM2245_C.ExecuteUbergraph_MM_M061_EM2245
// 0x0510 (0x0510 - 0x0000)
struct MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2E6[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFinish_IsFinish;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2E7[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AutoRotateFocus_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2E8[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGazeTargetHolder*                      CallFunc_GetGazeTargetHolder_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2E9[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGazeTargetHolder*                      CallFunc_GetGazeTargetHolder_ReturnValue_1;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2EA[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor;                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2EB[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl;                 // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2EC[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_1;               // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd;             // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2ED[0x2];                                     // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2EE[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2EF[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_1;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_3;              // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2F0[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_2;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_4;              // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2F1[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_5;              // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2F2[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_1;                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_2;                // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_2;               // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2F3[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_3;               // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1;           // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2F4[0x6];                                     // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_4;               // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2F5[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_5;               // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2F6[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_6;               // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2F7[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_6;              // 0x0210(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2F8[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_3;             // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_7;              // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2F9[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_3;                // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_7;               // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2FA[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_8;               // 0x0268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2FB[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_9;               // 0x0280(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2FC[0x7];                                     // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_10;              // 0x0298(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IIsFinishedWindowOut_OutFinished;         // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_1;             // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2FD[0x1];                                     // 0x02AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2FE[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_DynamicCast_AsAnim_Sequence_Base;           // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_19;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2FF[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_4;            // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_8;              // 0x02E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_20;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D300[0x7];                                     // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_4;             // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_9;              // 0x0300(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_21;                    // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D301[0x7];                                     // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_4;                // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_11;              // 0x0320(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_22;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D302[0x7];                                     // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D303[0x4];                                     // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor;      // 0x0348(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_23;                    // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D304[0x6];                                     // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_BI_GetMeshComponent_MeshComp;             // 0x0360(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D305[0x7];                                     // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGazeTarget>           K2Node_DynamicCast_AsGaze_Target;                  // 0x0370(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_24;                    // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D306[0x6];                                     // 0x0382(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_12;              // 0x0388(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_25;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_2;           // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D307[0x6];                                     // 0x039A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x03A0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D308[0x4];                                     // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADev426_Simple_C*                       CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1;    // 0x03E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_26;                    // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D309[0x7];                                     // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_2;    // 0x0400(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_27;                    // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_EventPlayMotion_NoUse;                 // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_StopMotion_NoUse;                      // 0x0412(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D30A[0x1];                                     // 0x0413(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAreaID_ReturnValue;                    // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_5;            // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_10;             // 0x0420(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_28;                    // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D30B[0x7];                                     // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_5;             // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D30C[0x7];                                     // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_11;             // 0x0448(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_29;                    // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D30D[0x7];                                     // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_5;                // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_13;              // 0x0468(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_30;                    // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D30E[0x7];                                     // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_14;              // 0x0480(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_31;                    // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_3;           // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D30F[0x6];                                     // 0x0492(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGazeTarget>           K2Node_DynamicCast_AsGaze_Target_1;                // 0x0498(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_32;                    // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartMapEvent_Dummy;                      // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D310[0x6];                                     // 0x04AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x04B0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x04C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EndMapEvent_Dummy;                        // 0x04C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFinish_IsFinish_1;                     // 0x04C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D311[0x1];                                     // 0x04C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x04C8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x04DC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x04EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D312[0x3];                                     // 0x04ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_3;    // 0x04F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_33;                    // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_FloatNoRotation_NoUse;                 // 0x0501(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetActive_IsActive;                       // 0x0502(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245) == 0x000010, "Wrong alignment on MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245");
static_assert(sizeof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245) == 0x000510, "Wrong size on MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, EntryPoint) == 0x000000, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::EntryPoint' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_GetFinish_IsFinish) == 0x000048, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_GetFinish_IsFinish' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_FinishSpawningActor_ReturnValue) == 0x000050, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, Temp_int_Array_Index_Variable) == 0x000060, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_GetGameInstance_ReturnValue) == 0x000068, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_GetGazeTargetHolder_ReturnValue) == 0x000070, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_GetGazeTargetHolder_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_UIManager) == 0x000078, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_GetGazeTargetHolder_ReturnValue_1) == 0x000090, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_GetGazeTargetHolder_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_BPI_GetUIManager_UIManager) == 0x000098, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x0000A0, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_BPI_GetMsgCtrl_OutActor) == 0x0000B8, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_BPI_GetMsgCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_CheckEventFlag_ReturnValue) == 0x0000C0, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_Msg_Ctrl) == 0x0000C8, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_Msg_Ctrl' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_2) == 0x0000D8, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_Msg_Ctrl_1) == 0x0000E0, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_Msg_Ctrl_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_3) == 0x0000F0, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd) == 0x0000F1, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, Temp_int_Variable) == 0x0000F4, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000F8, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_GetGameInstance_ReturnValue_1) == 0x000100, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_UIManager_2) == 0x000108, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_UIManager_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_4) == 0x000118, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_GetGameInstance_ReturnValue_2) == 0x000120, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_BPI_GetUIManager_UIManager_1) == 0x000128, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_BPI_GetUIManager_UIManager_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_UIManager_3) == 0x000130, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_UIManager_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_5) == 0x000140, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_BPI_GetUIManager_UIManager_2) == 0x000148, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_BPI_GetUIManager_UIManager_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_UIManager_4) == 0x000150, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_UIManager_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_6) == 0x000160, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_UIManager_5) == 0x000168, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_UIManager_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_7) == 0x000178, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_BPI_GetMsgCtrl_OutActor_1) == 0x000180, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_BPI_GetMsgCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_BPI_GetMsgCtrl_OutActor_2) == 0x000188, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_BPI_GetMsgCtrl_OutActor_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_Msg_Ctrl_2) == 0x000190, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_Msg_Ctrl_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_8) == 0x0001A0, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_Msg_Ctrl_3) == 0x0001A8, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_Msg_Ctrl_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_9) == 0x0001B8, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1) == 0x0001B9, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_Msg_Ctrl_4) == 0x0001C0, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_Msg_Ctrl_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_10) == 0x0001D0, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_Msg_Ctrl_5) == 0x0001D8, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_Msg_Ctrl_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_11) == 0x0001E8, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_Msg_Ctrl_6) == 0x0001F0, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_Msg_Ctrl_6' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_12) == 0x000200, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_GetGameInstance_ReturnValue_3) == 0x000208, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_GetGameInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_UIManager_6) == 0x000210, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_UIManager_6' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_13) == 0x000220, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_BPI_GetUIManager_UIManager_3) == 0x000228, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_BPI_GetUIManager_UIManager_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_UIManager_7) == 0x000230, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_UIManager_7' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_14) == 0x000240, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_BPI_GetMsgCtrl_OutActor_3) == 0x000248, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_BPI_GetMsgCtrl_OutActor_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_Msg_Ctrl_7) == 0x000250, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_Msg_Ctrl_7' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_15) == 0x000260, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_15' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_Msg_Ctrl_8) == 0x000268, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_Msg_Ctrl_8' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_16) == 0x000278, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_16' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_Msg_Ctrl_9) == 0x000280, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_Msg_Ctrl_9' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_17) == 0x000290, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_17' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_Msg_Ctrl_10) == 0x000298, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_Msg_Ctrl_10' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_18) == 0x0002A8, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_18' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_IIsFinishedWindowOut_OutFinished) == 0x0002A9, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_IIsFinishedWindowOut_OutFinished' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_CheckEventFlag_ReturnValue_1) == 0x0002AA, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_CheckEventFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, Temp_int_Variable_1) == 0x0002AC, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_Add_IntInt_ReturnValue_2) == 0x0002B0, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, Temp_object_Variable) == 0x0002B8, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsAnim_Sequence_Base) == 0x0002C0, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsAnim_Sequence_Base' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_19) == 0x0002C8, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_19' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_CustomEvent_Loaded) == 0x0002D0, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_GetGameInstance_ReturnValue_4) == 0x0002D8, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_GetGameInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_UIManager_8) == 0x0002E0, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_UIManager_8' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_20) == 0x0002F0, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_20' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_BPI_GetUIManager_UIManager_4) == 0x0002F8, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_BPI_GetUIManager_UIManager_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_UIManager_9) == 0x000300, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_UIManager_9' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_21) == 0x000310, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_21' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_BPI_GetMsgCtrl_OutActor_4) == 0x000318, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_BPI_GetMsgCtrl_OutActor_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_Msg_Ctrl_11) == 0x000320, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_Msg_Ctrl_11' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_22) == 0x000330, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_22' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_Array_Get_Item) == 0x000338, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_Array_Length_ReturnValue) == 0x000340, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor) == 0x000348, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_23) == 0x000358, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_23' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_Less_IntInt_ReturnValue) == 0x000359, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_BI_GetMeshComponent_MeshComp) == 0x000360, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_BI_GetMeshComponent_MeshComp' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_IsValid_ReturnValue) == 0x000368, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsGaze_Target) == 0x000370, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsGaze_Target' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_24) == 0x000380, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_24' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_IsValid_ReturnValue_1) == 0x000381, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_Msg_Ctrl_12) == 0x000388, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_Msg_Ctrl_12' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_25) == 0x000398, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_25' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_2) == 0x000399, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_GetTransform_ReturnValue) == 0x0003A0, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0003D0, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_Array_Add_ReturnValue) == 0x0003D8, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0003E0, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1) == 0x0003E8, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_26) == 0x0003F8, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_26' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_2) == 0x000400, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_27) == 0x000410, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_27' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_BI_EventPlayMotion_NoUse) == 0x000411, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_BI_EventPlayMotion_NoUse' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_BI_StopMotion_NoUse) == 0x000412, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_BI_StopMotion_NoUse' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_GetAreaID_ReturnValue) == 0x000414, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_GetAreaID_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_GetGameInstance_ReturnValue_5) == 0x000418, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_GetGameInstance_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_UIManager_10) == 0x000420, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_UIManager_10' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_28) == 0x000430, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_28' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_BPI_GetUIManager_UIManager_5) == 0x000438, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_BPI_GetUIManager_UIManager_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_IsValid_ReturnValue_2) == 0x000440, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_UIManager_11) == 0x000448, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_UIManager_11' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_29) == 0x000458, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_29' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_BPI_GetMsgCtrl_OutActor_5) == 0x000460, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_BPI_GetMsgCtrl_OutActor_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_Msg_Ctrl_13) == 0x000468, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_Msg_Ctrl_13' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_30) == 0x000478, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_30' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsBPI_Msg_Ctrl_14) == 0x000480, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsBPI_Msg_Ctrl_14' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_31) == 0x000490, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_31' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_3) == 0x000491, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_AsGaze_Target_1) == 0x000498, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_AsGaze_Target_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, K2Node_DynamicCast_bSuccess_32) == 0x0004A8, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::K2Node_DynamicCast_bSuccess_32' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245, CallFunc_StartMapEvent_Dummy) == 0x0004A9, "Member 'MM_M061_EM2245_C_ExecuteUbergraph_MM_M061_EM2245::CallFunc_StartMapEvent_Dummy' has a wrong offset!");
