#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM0152

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_EventMissionBase_classes.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM0152.MM_M061_EM0152_C
// 0x0070 (0x0390 - 0x0320)
class AMM_M061_EM0152_C final : public ABP_EventMissionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM0152_C;                   // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SelectIndex;                                       // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B654[0x4];                                     // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaBase_C*                           SpawnActor;                                        // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraBlend_C*                 CameraBlender;                                     // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetPoint*                           BattlePoint;                                       // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Def_Camera;                                        // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AutoRotateFocus_C*                  Auto_Rot_Ctrl;                                     // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CameraFocusEnd;                                    // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B655[0x7];                                     // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset2;                              // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)

public:
	void ExecuteUbergraph_MM_M061_EM0152(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ResultFadeFunc();
	void EvtDis_Finish_Complete();
	void EvtDis_Finish______0();
	void FinishEvent();
	void _________0();
	void OnDestroyed______0(class AActor* DestroyedActor);
	void BattleSetting();
	void EventEnd();
	void TalkEnd();
	void CloseMsgWindow();
	void CameraFocus();
	void EventStart();
	void TalkStart();
	void QuestExecute();
	void ReceiveBeginPlay();
	void OnLoaded_100992C04FC170955D27CEA14FDDCCE1(TSubclassOf<class UObject> Loaded);
	void OnLoaded_8C32BDD7442FD4405102BD90482D1324(TSubclassOf<class UObject> Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDBC35B841(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD9E6ECEAC(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD8C2B58A7(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDC8BE9A5B(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD760C9E80(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDB85A2207(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDC0EE9760(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD5FD7B77F(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD5408D58E(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD077B1B97(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDDA90CB9A(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDFEFC99F8(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD8C10A7D4(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD2CABC5BC(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDAFA38D27(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD44764F84(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDDFCFC0B2(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDF23BDA3B(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD80626BBB(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD9662279F(class UObject* Loaded);
	void OnLoaded_FD0FBD46434B6B1E05D7C9AF3D1EC020(TSubclassOf<class UObject> Loaded);
	void OnLoaded_DE960BD0440397DE61A238A54BE628A0(TSubclassOf<class UObject> Loaded);
	void CallDeactivate();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM0152_C">();
	}
	static class AMM_M061_EM0152_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM0152_C>();
	}
};
static_assert(alignof(AMM_M061_EM0152_C) == 0x000008, "Wrong alignment on AMM_M061_EM0152_C");
static_assert(sizeof(AMM_M061_EM0152_C) == 0x000390, "Wrong size on AMM_M061_EM0152_C");
static_assert(offsetof(AMM_M061_EM0152_C, UberGraphFrame_MM_M061_EM0152_C) == 0x000320, "Member 'AMM_M061_EM0152_C::UberGraphFrame_MM_M061_EM0152_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0152_C, SelectIndex) == 0x000328, "Member 'AMM_M061_EM0152_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0152_C, SpawnActor) == 0x000330, "Member 'AMM_M061_EM0152_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0152_C, CameraBlender) == 0x000338, "Member 'AMM_M061_EM0152_C::CameraBlender' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0152_C, BattlePoint) == 0x000340, "Member 'AMM_M061_EM0152_C::BattlePoint' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0152_C, Def_Camera) == 0x000348, "Member 'AMM_M061_EM0152_C::Def_Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0152_C, Auto_Rot_Ctrl) == 0x000350, "Member 'AMM_M061_EM0152_C::Auto_Rot_Ctrl' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0152_C, CameraFocusEnd) == 0x000358, "Member 'AMM_M061_EM0152_C::CameraFocusEnd' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0152_C, MissionMessageAsset) == 0x000360, "Member 'AMM_M061_EM0152_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0152_C, MissionMessageAsset2) == 0x000368, "Member 'AMM_M061_EM0152_C::MissionMessageAsset2' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0152_C, Camera) == 0x000370, "Member 'AMM_M061_EM0152_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0152_C, Target) == 0x000380, "Member 'AMM_M061_EM0152_C::Target' has a wrong offset!");

}

