#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM1630

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_EventMissionBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM1630.MM_M061_EM1630_C
// 0x00B0 (0x03D0 - 0x0320)
class AMM_M061_EM1630_C final : public ABP_EventMissionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM1630_C;                   // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SelectIndex;                                       // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_474C[0x4];                                     // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaBase_C*                           SpawnActor;                                        // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 MissionEvent;                                      // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AutoRotateFocus_C*                  Auto_Rot_Ctrl;                                     // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RequestItemId;                                     // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RequestItemNum;                                    // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AddRewardItemId;                                   // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AddRewardItemNum;                                  // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AddRewardMakka;                                    // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TextInt;                                           // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ABP_EventCameraBlend_C*                 CameraBlender;                                     // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetPoint*                           BattlePoint;                                       // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Def_Camera;                                        // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADevilBase_C*                           FakeActor;                                         // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Emitter;                                           // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Change_BGM;                                        // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CameraFocusEnd;                                    // 0x03B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEventNow;                                        // 0x03BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NotDeleteActor;                                    // 0x03BB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_474D[0x4];                                     // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADevilBase_C*                           SpawnYoko;                                         // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    SequencerActor;                                    // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_EM1630(int32 EntryPoint);
	void Evt_Finish();
	void Evt_FinishComplete();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void E2018();
	void FocusMissionEnd();
	void EndEvent();
	void FirstEvent();
	void CloseMsgWindow();
	void CameraFocus();
	void OnDestroyed______0(class AActor* DestroyedActor);
	void BattleEnd();
	void SpawnFriend();
	void AddEntryMission();
	void BattleStandby();
	void PartyJoin();
	void EndMission();
	void TalkStart();
	void QuestExecute();
	void ReceiveBeginPlay();
	void OnLoaded_34179C1C4B50977C9C0FB39796DBB0DD(TSubclassOf<class UObject> Loaded);
	void OnLoaded_4C874D904990638AA53127B289222DC6(TSubclassOf<class UObject> Loaded);
	void OnLoaded_CFA5E66540E41E2E3F27128F7E31F7B4(TSubclassOf<class UObject> Loaded);
	void OnLoaded_32621DDC435684209913348125A55150(TSubclassOf<class UObject> Loaded);
	void OnLoaded_141345424E3AAAC06BFC5D87EE086E26(TSubclassOf<class UObject> Loaded);
	void OnLoaded_E84C6B6B414B327C034CFB8944516F8D(TSubclassOf<class UObject> Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD766E535D(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD5DD4805D(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC90573E93(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDB8CCD8AF(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDCCA2E367(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC2AEEC597(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BCEA7DB50A(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BCC7496F42(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD74D76394(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FAE2997B5(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F444D984B(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F4DB8772E(class UObject* Loaded);
	void CallDeactivate();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM1630_C">();
	}
	static class AMM_M061_EM1630_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM1630_C>();
	}
};
static_assert(alignof(AMM_M061_EM1630_C) == 0x000008, "Wrong alignment on AMM_M061_EM1630_C");
static_assert(sizeof(AMM_M061_EM1630_C) == 0x0003D0, "Wrong size on AMM_M061_EM1630_C");
static_assert(offsetof(AMM_M061_EM1630_C, UberGraphFrame_MM_M061_EM1630_C) == 0x000320, "Member 'AMM_M061_EM1630_C::UberGraphFrame_MM_M061_EM1630_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, SelectIndex) == 0x000328, "Member 'AMM_M061_EM1630_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, SpawnActor) == 0x000330, "Member 'AMM_M061_EM1630_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, SystemMessageAsset) == 0x000338, "Member 'AMM_M061_EM1630_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, MissionMessageAsset) == 0x000340, "Member 'AMM_M061_EM1630_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, MissionEvent) == 0x000348, "Member 'AMM_M061_EM1630_C::MissionEvent' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, Auto_Rot_Ctrl) == 0x000350, "Member 'AMM_M061_EM1630_C::Auto_Rot_Ctrl' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, RequestItemId) == 0x000358, "Member 'AMM_M061_EM1630_C::RequestItemId' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, RequestItemNum) == 0x00035C, "Member 'AMM_M061_EM1630_C::RequestItemNum' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, AddRewardItemId) == 0x000360, "Member 'AMM_M061_EM1630_C::AddRewardItemId' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, AddRewardItemNum) == 0x000364, "Member 'AMM_M061_EM1630_C::AddRewardItemNum' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, AddRewardMakka) == 0x000368, "Member 'AMM_M061_EM1630_C::AddRewardMakka' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, TextInt) == 0x00036C, "Member 'AMM_M061_EM1630_C::TextInt' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, Camera) == 0x000370, "Member 'AMM_M061_EM1630_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, Target) == 0x000380, "Member 'AMM_M061_EM1630_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, CameraBlender) == 0x000390, "Member 'AMM_M061_EM1630_C::CameraBlender' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, BattlePoint) == 0x000398, "Member 'AMM_M061_EM1630_C::BattlePoint' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, Def_Camera) == 0x0003A0, "Member 'AMM_M061_EM1630_C::Def_Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, FakeActor) == 0x0003A8, "Member 'AMM_M061_EM1630_C::FakeActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, Emitter) == 0x0003B0, "Member 'AMM_M061_EM1630_C::Emitter' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, Change_BGM) == 0x0003B8, "Member 'AMM_M061_EM1630_C::Change_BGM' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, CameraFocusEnd) == 0x0003B9, "Member 'AMM_M061_EM1630_C::CameraFocusEnd' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, IsEventNow) == 0x0003BA, "Member 'AMM_M061_EM1630_C::IsEventNow' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, NotDeleteActor) == 0x0003BB, "Member 'AMM_M061_EM1630_C::NotDeleteActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, SpawnYoko) == 0x0003C0, "Member 'AMM_M061_EM1630_C::SpawnYoko' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1630_C, SequencerActor) == 0x0003C8, "Member 'AMM_M061_EM1630_C::SequencerActor' has a wrong offset!");

}

