#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M200_EN0100

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_EventMissionBase_Direct_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M200_EN0100.MM_M200_EN0100_C
// 0x0080 (0x0340 - 0x02C0)
class AMM_M200_EN0100_C final : public ABP_EventMissionBase_Direct_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M200_EN0100_C;                   // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SelectIndex;                                       // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA43[0x4];                                     // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           Camera;                                            // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATargetPoint*>                   Target;                                            // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AActor*                                 DefaultCamera;                                     // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADevilBase_C*                           SpawnYuzu;                                         // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADevilBase_C*                           SpawnYoko;                                         // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    SequencerActor;                                    // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADevilBase_C*                           SpawnActor;                                        // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetPoint*                           FocusPoint;                                        // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADevilBase_C*                           FakeActor;                                         // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Emitter;                                           // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EndSeq;                                            // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_MM_M200_EN0100(int32 EntryPoint);
	void EvtDis_Finish_Complete();
	void FoucusEnd();
	void QuestExecute();
	void CallDeactivate();
	void OnLoaded_CA4C919B47E016D1B6B5949F167DBB78(class UObject* Loaded);
	void OnLoaded_03402F454DEE9E800AC765B090C26598(TSubclassOf<class UObject> Loaded);
	void OnLoaded_9D324BB644D8BAA59F5E959877BD6E1E(TSubclassOf<class UObject> Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD1898B475(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD8DD6369D(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD8E64323F(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD4250A7B9(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD11A8CAF4(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC2E4BFEE9(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD6117C35F(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC7E03A928(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD23327143(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD8C582C0C(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD2C65748F(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FA468EFC0(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F3955B133(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F912608FB(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FE3F3173F(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F107693F6(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F08E19188(class UObject* Loaded);
	void OnLoaded_FD0FBD46434B6B1E05D7C9AF8F5834A4(TSubclassOf<class UObject> Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M200_EN0100_C">();
	}
	static class AMM_M200_EN0100_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M200_EN0100_C>();
	}
};
static_assert(alignof(AMM_M200_EN0100_C) == 0x000008, "Wrong alignment on AMM_M200_EN0100_C");
static_assert(sizeof(AMM_M200_EN0100_C) == 0x000340, "Wrong size on AMM_M200_EN0100_C");
static_assert(offsetof(AMM_M200_EN0100_C, UberGraphFrame_MM_M200_EN0100_C) == 0x0002C0, "Member 'AMM_M200_EN0100_C::UberGraphFrame_MM_M200_EN0100_C' has a wrong offset!");
static_assert(offsetof(AMM_M200_EN0100_C, SelectIndex) == 0x0002C8, "Member 'AMM_M200_EN0100_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M200_EN0100_C, SystemMessageAsset) == 0x0002D0, "Member 'AMM_M200_EN0100_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M200_EN0100_C, MissionMessageAsset) == 0x0002D8, "Member 'AMM_M200_EN0100_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M200_EN0100_C, Camera) == 0x0002E0, "Member 'AMM_M200_EN0100_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M200_EN0100_C, Target) == 0x0002E8, "Member 'AMM_M200_EN0100_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M200_EN0100_C, DefaultCamera) == 0x0002F8, "Member 'AMM_M200_EN0100_C::DefaultCamera' has a wrong offset!");
static_assert(offsetof(AMM_M200_EN0100_C, SpawnYuzu) == 0x000300, "Member 'AMM_M200_EN0100_C::SpawnYuzu' has a wrong offset!");
static_assert(offsetof(AMM_M200_EN0100_C, SpawnYoko) == 0x000308, "Member 'AMM_M200_EN0100_C::SpawnYoko' has a wrong offset!");
static_assert(offsetof(AMM_M200_EN0100_C, SequencerActor) == 0x000310, "Member 'AMM_M200_EN0100_C::SequencerActor' has a wrong offset!");
static_assert(offsetof(AMM_M200_EN0100_C, SpawnActor) == 0x000318, "Member 'AMM_M200_EN0100_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(AMM_M200_EN0100_C, FocusPoint) == 0x000320, "Member 'AMM_M200_EN0100_C::FocusPoint' has a wrong offset!");
static_assert(offsetof(AMM_M200_EN0100_C, FakeActor) == 0x000328, "Member 'AMM_M200_EN0100_C::FakeActor' has a wrong offset!");
static_assert(offsetof(AMM_M200_EN0100_C, Emitter) == 0x000330, "Member 'AMM_M200_EN0100_C::Emitter' has a wrong offset!");
static_assert(offsetof(AMM_M200_EN0100_C, EndSeq) == 0x000338, "Member 'AMM_M200_EN0100_C::EndSeq' has a wrong offset!");

}

