#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM2040

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_EventMissionBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM2040.MM_M061_EM2040_C
// 0x00A8 (0x03C8 - 0x0320)
class AMM_M061_EM2040_C final : public ABP_EventMissionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM2040_C;                   // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SelectIndex;                                       // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93CF[0x4];                                     // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADevilBaseLight_C*                      SpawnActor;                                        // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 MissionEvent;                                      // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraBlend_C*                 CameraBlender;                                     // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChangeBGM;                                         // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93D0[0x7];                                     // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 DefCamera;                                         // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEventNow;                                        // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93D1[0x7];                                     // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AutoRotateFocus_C*                  AutoRotControl;                                    // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CameraFocusEnd;                                    // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93D2[0x7];                                     // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATargetPoint*>                   Target;                                            // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ACameraActor*                           Em2030Camera;                                      // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    Seq_Actor;                                         // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ScrollEnd;                                         // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93D3[0x7];                                     // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           Seq_Camera;                                        // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EventSend;                                         // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93D4[0x7];                                     // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    MissionMessageAsset_Report;                        // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LawValue;                                          // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ChaosValue;                                        // 0x03C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_EM2040(int32 EntryPoint);
	void Evt_FinishComplete();
	void Evt_Finish();
	void ReportMSG();
	void AddEntryMission();
	void CameraFocus();
	void TalkStart();
	void QuestExecute();
	void ReceiveBeginPlay();
	void OnLoaded_68F23E49485F878E95C468A80B1715C6(TSubclassOf<class UObject> Loaded);
	void OnLoaded_0F497C784A2997AD0BAB53881B3CD228(TSubclassOf<class UObject> Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BCE9038A6D(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD5903E053(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BCB02CCA47(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDC5041C05(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD04ECE3A0(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F4DE07D7F(class UObject* Loaded);
	void PlayerPawnTeleport();
	void ResultFadeFunc_2040();
	void CallDeactivate();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM2040_C">();
	}
	static class AMM_M061_EM2040_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM2040_C>();
	}
};
static_assert(alignof(AMM_M061_EM2040_C) == 0x000008, "Wrong alignment on AMM_M061_EM2040_C");
static_assert(sizeof(AMM_M061_EM2040_C) == 0x0003C8, "Wrong size on AMM_M061_EM2040_C");
static_assert(offsetof(AMM_M061_EM2040_C, UberGraphFrame_MM_M061_EM2040_C) == 0x000320, "Member 'AMM_M061_EM2040_C::UberGraphFrame_MM_M061_EM2040_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2040_C, SelectIndex) == 0x000328, "Member 'AMM_M061_EM2040_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2040_C, SpawnActor) == 0x000330, "Member 'AMM_M061_EM2040_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2040_C, SystemMessageAsset) == 0x000338, "Member 'AMM_M061_EM2040_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2040_C, MissionMessageAsset) == 0x000340, "Member 'AMM_M061_EM2040_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2040_C, MissionEvent) == 0x000348, "Member 'AMM_M061_EM2040_C::MissionEvent' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2040_C, CameraBlender) == 0x000350, "Member 'AMM_M061_EM2040_C::CameraBlender' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2040_C, ChangeBGM) == 0x000358, "Member 'AMM_M061_EM2040_C::ChangeBGM' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2040_C, DefCamera) == 0x000360, "Member 'AMM_M061_EM2040_C::DefCamera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2040_C, IsEventNow) == 0x000368, "Member 'AMM_M061_EM2040_C::IsEventNow' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2040_C, AutoRotControl) == 0x000370, "Member 'AMM_M061_EM2040_C::AutoRotControl' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2040_C, CameraFocusEnd) == 0x000378, "Member 'AMM_M061_EM2040_C::CameraFocusEnd' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2040_C, Target) == 0x000380, "Member 'AMM_M061_EM2040_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2040_C, Em2030Camera) == 0x000390, "Member 'AMM_M061_EM2040_C::Em2030Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2040_C, Seq_Actor) == 0x000398, "Member 'AMM_M061_EM2040_C::Seq_Actor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2040_C, ScrollEnd) == 0x0003A0, "Member 'AMM_M061_EM2040_C::ScrollEnd' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2040_C, Seq_Camera) == 0x0003A8, "Member 'AMM_M061_EM2040_C::Seq_Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2040_C, EventSend) == 0x0003B0, "Member 'AMM_M061_EM2040_C::EventSend' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2040_C, MissionMessageAsset_Report) == 0x0003B8, "Member 'AMM_M061_EM2040_C::MissionMessageAsset_Report' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2040_C, LawValue) == 0x0003C0, "Member 'AMM_M061_EM2040_C::LawValue' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2040_C, ChaosValue) == 0x0003C4, "Member 'AMM_M061_EM2040_C::ChaosValue' has a wrong offset!");

}

