#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M060_EM1460

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_EventMissionBase_classes.hpp"
#include "Engine_structs.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M060_EM1460.MM_M060_EM1460_C
// 0x00B8 (0x03D8 - 0x0320)
class AMM_M060_EM1460_C final : public ABP_EventMissionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M060_EM1460_C;                   // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         CamRot_rot_53B1A52C43300B89603B57AECC19790B;       // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            CamRot__Direction_53B1A52C43300B89603B57AECC19790B; // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A1C[0x3];                                     // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     CamRot;                                            // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectIndex;                                       // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A1D[0x4];                                     // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaBase_C*                           SpawnActor;                                        // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset2;                              // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 MissionEvent;                                      // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AutoRotateFocus_C*                  Auto_Rot_Ctrl;                                     // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraBlend_C*                 CameraBlender;                                     // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DefaultCamera;                                     // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           InstantCamera;                                     // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DefCamRot;                                         // 0x0388(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A1E[0x4];                                     // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATargetPoint*                           LookAt;                                            // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATargetPoint*>                   Target;                                            // 0x03A0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ACameraActor*>                   Camera;                                            // 0x03B0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ATargetPoint*                           BattlePoint;                                       // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetPoint*                           IconTarget;                                        // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Change_BGM;                                        // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          StayBGM;                                           // 0x03D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_MM_M060_EM1460(int32 EntryPoint);
	void Evt_Finish();
	void Evt_FinishComplete();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void EndMapEventOnly();
	void SelectFinish();
	void EnrtyEM1460();
	void SelectEntry();
	void NoEntry();
	void EndMission();
	void TalkStart();
	void QuestExecute();
	void ReceiveBeginPlay();
	void EM1470BattleStandby();
	void OnDestroyed______0(class AActor* DestroyedActor);
	void EM1470Finish();
	void EndBattle______0();
	void EntryEM1470();
	void EM1470Standby();
	void OnLoaded_F5FADCE44B4F5AC0F3DF2CBC9728877D(TSubclassOf<class UObject> Loaded);
	void OnLoaded_D70DDF7C45CF06848B96AF94A4A3522E(TSubclassOf<class UObject> Loaded);
	void OnLoaded_12FA7584418F7431AD91EBBF47DBF389(TSubclassOf<class UObject> Loaded);
	void CamRot__UpdateFunc();
	void CamRot__FinishedFunc();
	void CallDeactivate();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M060_EM1460_C">();
	}
	static class AMM_M060_EM1460_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M060_EM1460_C>();
	}
};
static_assert(alignof(AMM_M060_EM1460_C) == 0x000008, "Wrong alignment on AMM_M060_EM1460_C");
static_assert(sizeof(AMM_M060_EM1460_C) == 0x0003D8, "Wrong size on AMM_M060_EM1460_C");
static_assert(offsetof(AMM_M060_EM1460_C, UberGraphFrame_MM_M060_EM1460_C) == 0x000320, "Member 'AMM_M060_EM1460_C::UberGraphFrame_MM_M060_EM1460_C' has a wrong offset!");
static_assert(offsetof(AMM_M060_EM1460_C, CamRot_rot_53B1A52C43300B89603B57AECC19790B) == 0x000328, "Member 'AMM_M060_EM1460_C::CamRot_rot_53B1A52C43300B89603B57AECC19790B' has a wrong offset!");
static_assert(offsetof(AMM_M060_EM1460_C, CamRot__Direction_53B1A52C43300B89603B57AECC19790B) == 0x00032C, "Member 'AMM_M060_EM1460_C::CamRot__Direction_53B1A52C43300B89603B57AECC19790B' has a wrong offset!");
static_assert(offsetof(AMM_M060_EM1460_C, CamRot) == 0x000330, "Member 'AMM_M060_EM1460_C::CamRot' has a wrong offset!");
static_assert(offsetof(AMM_M060_EM1460_C, SelectIndex) == 0x000338, "Member 'AMM_M060_EM1460_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M060_EM1460_C, SpawnActor) == 0x000340, "Member 'AMM_M060_EM1460_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(AMM_M060_EM1460_C, SystemMessageAsset) == 0x000348, "Member 'AMM_M060_EM1460_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M060_EM1460_C, MissionMessageAsset) == 0x000350, "Member 'AMM_M060_EM1460_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M060_EM1460_C, MissionMessageAsset2) == 0x000358, "Member 'AMM_M060_EM1460_C::MissionMessageAsset2' has a wrong offset!");
static_assert(offsetof(AMM_M060_EM1460_C, MissionEvent) == 0x000360, "Member 'AMM_M060_EM1460_C::MissionEvent' has a wrong offset!");
static_assert(offsetof(AMM_M060_EM1460_C, Auto_Rot_Ctrl) == 0x000368, "Member 'AMM_M060_EM1460_C::Auto_Rot_Ctrl' has a wrong offset!");
static_assert(offsetof(AMM_M060_EM1460_C, CameraBlender) == 0x000370, "Member 'AMM_M060_EM1460_C::CameraBlender' has a wrong offset!");
static_assert(offsetof(AMM_M060_EM1460_C, DefaultCamera) == 0x000378, "Member 'AMM_M060_EM1460_C::DefaultCamera' has a wrong offset!");
static_assert(offsetof(AMM_M060_EM1460_C, InstantCamera) == 0x000380, "Member 'AMM_M060_EM1460_C::InstantCamera' has a wrong offset!");
static_assert(offsetof(AMM_M060_EM1460_C, DefCamRot) == 0x000388, "Member 'AMM_M060_EM1460_C::DefCamRot' has a wrong offset!");
static_assert(offsetof(AMM_M060_EM1460_C, LookAt) == 0x000398, "Member 'AMM_M060_EM1460_C::LookAt' has a wrong offset!");
static_assert(offsetof(AMM_M060_EM1460_C, Target) == 0x0003A0, "Member 'AMM_M060_EM1460_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M060_EM1460_C, Camera) == 0x0003B0, "Member 'AMM_M060_EM1460_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M060_EM1460_C, BattlePoint) == 0x0003C0, "Member 'AMM_M060_EM1460_C::BattlePoint' has a wrong offset!");
static_assert(offsetof(AMM_M060_EM1460_C, IconTarget) == 0x0003C8, "Member 'AMM_M060_EM1460_C::IconTarget' has a wrong offset!");
static_assert(offsetof(AMM_M060_EM1460_C, Change_BGM) == 0x0003D0, "Member 'AMM_M060_EM1460_C::Change_BGM' has a wrong offset!");
static_assert(offsetof(AMM_M060_EM1460_C, StayBGM) == 0x0003D1, "Member 'AMM_M060_EM1460_C::StayBGM' has a wrong offset!");

}

