#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM1640

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_EventMissionBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM1640.MM_M061_EM1640_C
// 0x00B8 (0x03D8 - 0x0320)
class AMM_M061_EM1640_C final : public ABP_EventMissionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM1640_C;                   // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SelectIndex;                                       // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A68F[0x4];                                     // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaBase_C*                           SpawnActor;                                        // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 MissionEvent;                                      // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AutoRotateFocus_C*                  Auto_Rot_Ctrl;                                     // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RequestItemId;                                     // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RequestItemNum;                                    // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AddRewardItemId;                                   // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AddRewardItemNum;                                  // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AddRewardMakka;                                    // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TextInt;                                           // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ABP_EventCameraBlend_C*                 CameraBlender;                                     // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetPoint*                           BattlePoint;                                       // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Def_Camera;                                        // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpawnInt;                                          // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A690[0x4];                                     // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADevilBase_C*                           FakeActor;                                         // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Emitter;                                           // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Change_BGM;                                        // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CameraFocusEnd;                                    // 0x03C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A691[0x6];                                     // 0x03C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ADevilBase_C*                           SpawnYoko;                                         // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    SequencerActor;                                    // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_EM1640(int32 EntryPoint);
	void Evt_Finish();
	void Evt_FinishComplete();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void FocusMissionEnd();
	void CameraFocus();
	void EndMission();
	void CloseMsgWindow();
	void OnDestroyed______0(class AActor* DestroyedActor);
	void BattleEnd();
	void SpawnFriend();
	void AddEntryMission();
	void BattleStandby();
	void PartyJoin();
	void TalkStart();
	void QuestExecute();
	void ReceiveBeginPlay();
	void OnLoaded_09A29E624F17ED2A5F39E79398C25294(TSubclassOf<class UObject> Loaded);
	void OnLoaded_1B3A4BE54D718FA039055D95345FD22E(TSubclassOf<class UObject> Loaded);
	void OnLoaded_FD10E226489089F1019CBEA66D5D4416(TSubclassOf<class UObject> Loaded);
	void OnLoaded_E183319D4E3D23E16E1320AF1FFE2F2B(TSubclassOf<class UObject> Loaded);
	void OnLoaded_3786FC99400004DDF0291EA816426F71(TSubclassOf<class UObject> Loaded);
	void OnLoaded_FA7837F1405AC656B1A516B3933D666E(TSubclassOf<class UObject> Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDD8BF5DA9(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDCB908477(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC8C1F6A3E(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD81C8C465(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD2DDA10D0(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD908C7080(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDD557B0BE(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC01552774(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD75EA58A3(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F78717C4C(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FB75B94AB(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F15300BFB(class UObject* Loaded);
	void CallDeactivate();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM1640_C">();
	}
	static class AMM_M061_EM1640_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM1640_C>();
	}
};
static_assert(alignof(AMM_M061_EM1640_C) == 0x000008, "Wrong alignment on AMM_M061_EM1640_C");
static_assert(sizeof(AMM_M061_EM1640_C) == 0x0003D8, "Wrong size on AMM_M061_EM1640_C");
static_assert(offsetof(AMM_M061_EM1640_C, UberGraphFrame_MM_M061_EM1640_C) == 0x000320, "Member 'AMM_M061_EM1640_C::UberGraphFrame_MM_M061_EM1640_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, SelectIndex) == 0x000328, "Member 'AMM_M061_EM1640_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, SpawnActor) == 0x000330, "Member 'AMM_M061_EM1640_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, SystemMessageAsset) == 0x000338, "Member 'AMM_M061_EM1640_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, MissionMessageAsset) == 0x000340, "Member 'AMM_M061_EM1640_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, MissionEvent) == 0x000348, "Member 'AMM_M061_EM1640_C::MissionEvent' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, Auto_Rot_Ctrl) == 0x000350, "Member 'AMM_M061_EM1640_C::Auto_Rot_Ctrl' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, RequestItemId) == 0x000358, "Member 'AMM_M061_EM1640_C::RequestItemId' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, RequestItemNum) == 0x00035C, "Member 'AMM_M061_EM1640_C::RequestItemNum' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, AddRewardItemId) == 0x000360, "Member 'AMM_M061_EM1640_C::AddRewardItemId' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, AddRewardItemNum) == 0x000364, "Member 'AMM_M061_EM1640_C::AddRewardItemNum' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, AddRewardMakka) == 0x000368, "Member 'AMM_M061_EM1640_C::AddRewardMakka' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, TextInt) == 0x00036C, "Member 'AMM_M061_EM1640_C::TextInt' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, Camera) == 0x000370, "Member 'AMM_M061_EM1640_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, Target) == 0x000380, "Member 'AMM_M061_EM1640_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, CameraBlender) == 0x000390, "Member 'AMM_M061_EM1640_C::CameraBlender' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, BattlePoint) == 0x000398, "Member 'AMM_M061_EM1640_C::BattlePoint' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, Def_Camera) == 0x0003A0, "Member 'AMM_M061_EM1640_C::Def_Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, SpawnInt) == 0x0003A8, "Member 'AMM_M061_EM1640_C::SpawnInt' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, FakeActor) == 0x0003B0, "Member 'AMM_M061_EM1640_C::FakeActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, Emitter) == 0x0003B8, "Member 'AMM_M061_EM1640_C::Emitter' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, Change_BGM) == 0x0003C0, "Member 'AMM_M061_EM1640_C::Change_BGM' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, CameraFocusEnd) == 0x0003C1, "Member 'AMM_M061_EM1640_C::CameraFocusEnd' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, SpawnYoko) == 0x0003C8, "Member 'AMM_M061_EM1640_C::SpawnYoko' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1640_C, SequencerActor) == 0x0003D0, "Member 'AMM_M061_EM1640_C::SequencerActor' has a wrong offset!");

}

