#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM2190

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_EventMissionBase_HitAction_classes.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM2190.MM_M061_EM2190_C
// 0x00A8 (0x03A0 - 0x02F8)
class AMM_M061_EM2190_C final : public ABP_EventMissionBase_HitAction_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM2190_C;                   // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SelectIndex;                                       // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CFDB[0x4];                                     // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MissionEventBase_C*                 Mission_Event;                                     // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EventHit_Location;                                 // 0x0310(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               EventHit_Rotater;                                  // 0x031C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                EvenrHit_Size;                                     // 0x0328(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CFDC[0x4];                                     // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           Camera;                                            // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0350(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate)
	class AActor*                                 Def_Camera;                                        // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           SpawnActor;                                        // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           SpawnActor2;                                       // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           SpawnActor3;                                       // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    SequencerActor;                                    // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADevilBase_C*                           SpawnOni;                                          // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventScriptFade_C*                  LocalFade;                                         // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChangeBGM;                                         // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_MM_M061_EM2190(int32 EntryPoint);
	void EvtDis_FinishComplete();
	void EvtDis_Finish();
	void EvtDis_Finish_Complete();
	void ReEntry();
	void EndMission();
	void EvtDis_Finish______0();
	void QuestExecute();
	void OnLoaded_CA4C919B47E016D1B6B5949F81984CE2(class UObject* Loaded);
	void OnLoaded_24B0A3E34FE5614CD5FA21867D2F309E(TSubclassOf<class UObject> Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FE1761BDE(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC530ACD1E(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDA569C30D(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC01B588DE(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD101E455D(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BCAC37807D(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD5EAA1FD3(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD943B5B3B(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD67857359(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC48DC31FF(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD2A7C3D14(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BCCC675C77(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDAE044EE8(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD2A0CEAC2(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD64C8342F(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD17E0E280(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD3CA426F7(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F8B045811(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD2ACF010C(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDF06F818B(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDC065CD79(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD912FDB65(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FE52668C0(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F172B4A3E(class UObject* Loaded);
	void OnLoaded_FD0FBD46434B6B1E05D7C9AF21F5C339(TSubclassOf<class UObject> Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F1C4E25CD(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FA1C85527(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FFA5D27CB(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F92B1FF26(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F311D3CD1(class UObject* Loaded);
	void OnLoaded_DE960BD0440397DE61A238A546FD0519(TSubclassOf<class UObject> Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F38517BE9(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F86617099(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F2034259A(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FC38B820F(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F3419DB76(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F15873B86(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FA1CF9AD4(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F754DB006(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FBA956FAF(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F89B404CE(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FF2581A4F(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F25191F54(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FAA36C759(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F1B9EAEC2(class UObject* Loaded);
	void UserConstructionScript();
	void CallDeactivate();
	void QuestFunctionHit();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM2190_C">();
	}
	static class AMM_M061_EM2190_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM2190_C>();
	}
};
static_assert(alignof(AMM_M061_EM2190_C) == 0x000008, "Wrong alignment on AMM_M061_EM2190_C");
static_assert(sizeof(AMM_M061_EM2190_C) == 0x0003A0, "Wrong size on AMM_M061_EM2190_C");
static_assert(offsetof(AMM_M061_EM2190_C, UberGraphFrame_MM_M061_EM2190_C) == 0x0002F8, "Member 'AMM_M061_EM2190_C::UberGraphFrame_MM_M061_EM2190_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2190_C, SelectIndex) == 0x000300, "Member 'AMM_M061_EM2190_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2190_C, Mission_Event) == 0x000308, "Member 'AMM_M061_EM2190_C::Mission_Event' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2190_C, EventHit_Location) == 0x000310, "Member 'AMM_M061_EM2190_C::EventHit_Location' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2190_C, EventHit_Rotater) == 0x00031C, "Member 'AMM_M061_EM2190_C::EventHit_Rotater' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2190_C, EvenrHit_Size) == 0x000328, "Member 'AMM_M061_EM2190_C::EvenrHit_Size' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2190_C, SystemMessageAsset) == 0x000338, "Member 'AMM_M061_EM2190_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2190_C, MissionMessageAsset) == 0x000340, "Member 'AMM_M061_EM2190_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2190_C, Camera) == 0x000348, "Member 'AMM_M061_EM2190_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2190_C, Target) == 0x000350, "Member 'AMM_M061_EM2190_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2190_C, Def_Camera) == 0x000360, "Member 'AMM_M061_EM2190_C::Def_Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2190_C, SpawnActor) == 0x000368, "Member 'AMM_M061_EM2190_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2190_C, SpawnActor2) == 0x000370, "Member 'AMM_M061_EM2190_C::SpawnActor2' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2190_C, SpawnActor3) == 0x000378, "Member 'AMM_M061_EM2190_C::SpawnActor3' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2190_C, SequencerActor) == 0x000380, "Member 'AMM_M061_EM2190_C::SequencerActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2190_C, SpawnOni) == 0x000388, "Member 'AMM_M061_EM2190_C::SpawnOni' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2190_C, LocalFade) == 0x000390, "Member 'AMM_M061_EM2190_C::LocalFade' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2190_C, ChangeBGM) == 0x000398, "Member 'AMM_M061_EM2190_C::ChangeBGM' has a wrong offset!");

}

