#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM1771

#include "Basic.hpp"

#include "BP_EventMissionBase_Hit_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM1771.MM_M061_EM1771_C
// 0x00A0 (0x0368 - 0x02C8)
class AMM_M061_EM1771_C final : public ABP_EventMissionBase_Hit_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM1771_C;                   // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SelectIndex;                                       // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C228[0x4];                                     // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 Mission_Event;                                     // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ADev078_C*                              SpawnActor;                                        // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEventMobBase_C*                        SpawnActor2;                                       // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraBlend_C*                 CameraBlender;                                     // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetPoint*                           BattlePoint;                                       // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetPoint*                           ReturnPoint;                                       // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DefCamera;                                         // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventScriptFade_C*                  LocalFade;                                         // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Emitter;                                           // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetPoint*                           TalkIconPoint;                                     // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PlayerPos;                                         // 0x0358(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_EM1771(int32 EntryPoint);
	void EvtDis_FinishComplete();
	void EvtDis_Finish();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void EndMission();
	void MoveFinish();
	void _________0();
	void OnDestroyed______0(class AActor* DestroyedActor);
	void BattleStandby();
	void EventStart();
	void CallDeactivate();
	void QuestExecute();
	void ReceiveBeginPlay();
	void EndMoved();
	void OnLoaded_BDF831CA467FBED86C1A2784360EB2AA(TSubclassOf<class UObject> Loaded);
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM1771_C">();
	}
	static class AMM_M061_EM1771_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM1771_C>();
	}
};
static_assert(alignof(AMM_M061_EM1771_C) == 0x000008, "Wrong alignment on AMM_M061_EM1771_C");
static_assert(sizeof(AMM_M061_EM1771_C) == 0x000368, "Wrong size on AMM_M061_EM1771_C");
static_assert(offsetof(AMM_M061_EM1771_C, UberGraphFrame_MM_M061_EM1771_C) == 0x0002C8, "Member 'AMM_M061_EM1771_C::UberGraphFrame_MM_M061_EM1771_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1771_C, SelectIndex) == 0x0002D0, "Member 'AMM_M061_EM1771_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1771_C, SystemMessageAsset) == 0x0002D8, "Member 'AMM_M061_EM1771_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1771_C, MissionMessageAsset) == 0x0002E0, "Member 'AMM_M061_EM1771_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1771_C, Mission_Event) == 0x0002E8, "Member 'AMM_M061_EM1771_C::Mission_Event' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1771_C, Camera) == 0x0002F0, "Member 'AMM_M061_EM1771_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1771_C, Target) == 0x000300, "Member 'AMM_M061_EM1771_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1771_C, SpawnActor) == 0x000310, "Member 'AMM_M061_EM1771_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1771_C, SpawnActor2) == 0x000318, "Member 'AMM_M061_EM1771_C::SpawnActor2' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1771_C, CameraBlender) == 0x000320, "Member 'AMM_M061_EM1771_C::CameraBlender' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1771_C, BattlePoint) == 0x000328, "Member 'AMM_M061_EM1771_C::BattlePoint' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1771_C, ReturnPoint) == 0x000330, "Member 'AMM_M061_EM1771_C::ReturnPoint' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1771_C, DefCamera) == 0x000338, "Member 'AMM_M061_EM1771_C::DefCamera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1771_C, LocalFade) == 0x000340, "Member 'AMM_M061_EM1771_C::LocalFade' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1771_C, Emitter) == 0x000348, "Member 'AMM_M061_EM1771_C::Emitter' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1771_C, TalkIconPoint) == 0x000350, "Member 'AMM_M061_EM1771_C::TalkIconPoint' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1771_C, PlayerPos) == 0x000358, "Member 'AMM_M061_EM1771_C::PlayerPos' has a wrong offset!");

}

