#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM2531

#include "Basic.hpp"

#include "BP_EventMissionBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM2531.MM_M061_EM2531_C
// 0x0068 (0x0388 - 0x0320)
class AMM_M061_EM2531_C final : public ABP_EventMissionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM2531_C;                   // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SelectIndex;                                       // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FF7[0x4];                                     // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 MissionEvent;                                      // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AutoRotateFocus_C*                  CameraRotCtrl;                                     // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FocusFinish;                                       // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FF8[0x7];                                     // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATargetPoint*                           BattlePoint;                                       // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ADevilBase_C*                           SpawnDevil;                                        // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventScriptFade_C*                  FadeManager;                                       // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           SpawnActor;                                        // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_EM2531(int32 EntryPoint);
	void Evt_FinishComplete();
	void Evt_Finish();
	void EndBattle();
	void OnDestroyed_Event(class AActor* DestroyedActor);
	void StartTalk();
	void QuestExecute();
	void ReceiveBeginPlay();
	void OnLoaded_41EF9146402E81306A47AA92B6E05EF8(TSubclassOf<class UObject> Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDAC262DA4(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDA595DCD8(class UObject* Loaded);
	void CallDeactivate();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM2531_C">();
	}
	static class AMM_M061_EM2531_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM2531_C>();
	}
};
static_assert(alignof(AMM_M061_EM2531_C) == 0x000008, "Wrong alignment on AMM_M061_EM2531_C");
static_assert(sizeof(AMM_M061_EM2531_C) == 0x000388, "Wrong size on AMM_M061_EM2531_C");
static_assert(offsetof(AMM_M061_EM2531_C, UberGraphFrame_MM_M061_EM2531_C) == 0x000320, "Member 'AMM_M061_EM2531_C::UberGraphFrame_MM_M061_EM2531_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2531_C, SelectIndex) == 0x000328, "Member 'AMM_M061_EM2531_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2531_C, SystemMessageAsset) == 0x000330, "Member 'AMM_M061_EM2531_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2531_C, MissionMessageAsset) == 0x000338, "Member 'AMM_M061_EM2531_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2531_C, MissionEvent) == 0x000340, "Member 'AMM_M061_EM2531_C::MissionEvent' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2531_C, CameraRotCtrl) == 0x000348, "Member 'AMM_M061_EM2531_C::CameraRotCtrl' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2531_C, FocusFinish) == 0x000350, "Member 'AMM_M061_EM2531_C::FocusFinish' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2531_C, BattlePoint) == 0x000358, "Member 'AMM_M061_EM2531_C::BattlePoint' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2531_C, Target) == 0x000360, "Member 'AMM_M061_EM2531_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2531_C, SpawnDevil) == 0x000370, "Member 'AMM_M061_EM2531_C::SpawnDevil' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2531_C, FadeManager) == 0x000378, "Member 'AMM_M061_EM2531_C::FadeManager' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2531_C, SpawnActor) == 0x000380, "Member 'AMM_M061_EM2531_C::SpawnActor' has a wrong offset!");

}

