#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM2242

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MM_M061_EM2242.MM_M061_EM2242_C.ExecuteUbergraph_MM_M061_EM2242
// 0x0610 (0x0610 - 0x0000)
struct MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAreaID_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D316[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D317[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_1;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D318[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_3;              // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D319[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_1;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl;                 // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D31A[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_1;               // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D31B[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_2;               // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D31C[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_3;               // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D31D[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_4;               // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IIsFinishedWindowOut_OutFinished;         // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D31E[0x6];                                     // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_5;               // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D31F[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_6;               // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D320[0x3];                                     // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_4;              // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D321[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_2;             // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGazeTargetHolder*                      CallFunc_GetGazeTargetHolder_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_5;              // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D322[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_2;                // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_7;               // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFinish_IsFinish;                       // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D323[0x6];                                     // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_8;               // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd;             // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D324[0x6];                                     // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01D0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AutoRotateFocus_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGazeTargetHolder*                      CallFunc_GetGazeTargetHolder_ReturnValue_1;        // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D325[0x3];                                     // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_1;             // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D326[0x3];                                     // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_6;              // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_2;             // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D327[0x6];                                     // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_3;             // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_7;              // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D328[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_3;                // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_3;             // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D329[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_9;               // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D32A[0x7];                                     // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_10;              // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1;           // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_4;             // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D32B[0x1];                                     // 0x02A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_5;             // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D32C[0x3];                                     // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_4;            // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_8;              // 0x02B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_19;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_6;             // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D32D[0x6];                                     // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_4;             // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_9;              // 0x02D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_20;                    // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D32E[0x7];                                     // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_4;                // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_11;              // 0x02F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_21;                    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D32F[0x7];                                     // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_12;              // 0x0310(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_22;                    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_2;           // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartMapEvent_Dummy;                      // 0x0322(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D330[0xD];                                     // 0x0323(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0330(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D331[0x4];                                     // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADev193_Simple_C*                       CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor;      // 0x0378(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_23;                    // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D332[0x7];                                     // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_1;    // 0x0390(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_24;                    // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_StopMotion_NoUse;                      // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D333[0x6];                                     // 0x03A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x03A8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EndMapEvent_Dummy;                        // 0x03BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFinish_IsFinish_1;                     // 0x03BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D334[0x1];                                     // 0x03BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAreaID_ReturnValue_1;                  // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D335[0x4];                                     // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_DynamicCast_AsAnim_Sequence_Base;           // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_25;                    // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D336[0x7];                                     // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BI_EventPlayMotion_NoUse;                 // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D337[0x7];                                     // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> K2Node_DynamicCast_AsBPI_Chara_Base_Accessor_2;    // 0x03F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_26;                    // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D338[0x7];                                     // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_BI_GetMeshComponent_MeshComp;             // 0x0408(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGazeTarget>           K2Node_DynamicCast_AsGaze_Target;                  // 0x0410(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_27;                    // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0422(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D339[0x1];                                     // 0x0423(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D33A[0x7];                                     // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_5;            // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_10;             // 0x0438(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_28;                    // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D33B[0x6];                                     // 0x044A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_5;             // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_11;             // 0x0458(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_29;                    // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D33C[0x7];                                     // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_5;                // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGazeTarget>           K2Node_DynamicCast_AsGaze_Target_1;                // 0x0478(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_30;                    // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D33D[0x7];                                     // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_13;              // 0x0490(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_31;                    // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D33E[0x7];                                     // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_14;              // 0x04A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_32;                    // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_3;           // 0x04B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D33F[0x6];                                     // 0x04BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x04C0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x04D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D340[0x3];                                     // 0x04D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAreaID_ReturnValue_2;                  // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D341[0x4];                                     // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActive_IsActive;                       // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D342[0x7];                                     // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_6;            // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_12;             // 0x04F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_33;                    // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D343[0x7];                                     // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_6;             // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_13;             // 0x0518(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_34;                    // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D344[0x7];                                     // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_6;                // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_15;              // 0x0538(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_35;                    // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D345[0x3];                                     // 0x0549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x054C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_D346[0x4];                                     // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_16;              // 0x0560(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_36;                    // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_4;           // 0x0571(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D347[0x6];                                     // 0x0572(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array_2;                          // 0x0578(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x058C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D348[0x3];                                     // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_7;            // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_14;             // 0x0598(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_37;                    // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D349[0x7];                                     // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_7;             // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_15;             // 0x05B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_38;                    // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D34A[0x7];                                     // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_7;                // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_17;              // 0x05D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_39;                    // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D34B[0x7];                                     // 0x05E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_18;              // 0x05F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_40;                    // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_5;           // 0x0601(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242) == 0x000010, "Wrong alignment on MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242");
static_assert(sizeof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242) == 0x000610, "Wrong size on MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, EntryPoint) == 0x000000, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::EntryPoint' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_GetAreaID_ReturnValue) == 0x000004, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_GetAreaID_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, Temp_int_Variable) == 0x000008, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_UIManager) == 0x000018, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_GetGameInstance_ReturnValue_1) == 0x000030, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_BPI_GetUIManager_UIManager) == 0x000038, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000040, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_BPI_GetUIManager_UIManager_1) == 0x000058, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_BPI_GetUIManager_UIManager_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_UIManager_2) == 0x000060, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_UIManager_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_BPI_GetMsgCtrl_OutActor) == 0x000078, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_BPI_GetMsgCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_UIManager_3) == 0x000080, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_UIManager_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess_3) == 0x000090, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_BPI_GetMsgCtrl_OutActor_1) == 0x000098, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_BPI_GetMsgCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_Msg_Ctrl) == 0x0000A0, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_Msg_Ctrl' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess_4) == 0x0000B0, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_Msg_Ctrl_1) == 0x0000B8, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_Msg_Ctrl_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess_5) == 0x0000C8, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_Msg_Ctrl_2) == 0x0000D0, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_Msg_Ctrl_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess_6) == 0x0000E0, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_Msg_Ctrl_3) == 0x0000E8, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_Msg_Ctrl_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess_7) == 0x0000F8, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_Msg_Ctrl_4) == 0x000100, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_Msg_Ctrl_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess_8) == 0x000110, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_IIsFinishedWindowOut_OutFinished) == 0x000111, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_IIsFinishedWindowOut_OutFinished' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_Msg_Ctrl_5) == 0x000118, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_Msg_Ctrl_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess_9) == 0x000128, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_Msg_Ctrl_6) == 0x000130, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_Msg_Ctrl_6' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess_10) == 0x000140, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, Temp_int_Loop_Counter_Variable) == 0x000144, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_Add_IntInt_ReturnValue_1) == 0x000148, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, Temp_int_Array_Index_Variable) == 0x00014C, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_GetGameInstance_ReturnValue_2) == 0x000150, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_UIManager_4) == 0x000158, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_UIManager_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess_11) == 0x000168, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_BPI_GetUIManager_UIManager_2) == 0x000170, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_BPI_GetUIManager_UIManager_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_GetGazeTargetHolder_ReturnValue) == 0x000178, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_GetGazeTargetHolder_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_UIManager_5) == 0x000180, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_UIManager_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess_12) == 0x000190, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_BPI_GetMsgCtrl_OutActor_2) == 0x000198, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_BPI_GetMsgCtrl_OutActor_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_Msg_Ctrl_7) == 0x0001A0, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_Msg_Ctrl_7' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess_13) == 0x0001B0, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_GetFinish_IsFinish) == 0x0001B1, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_GetFinish_IsFinish' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_Msg_Ctrl_8) == 0x0001B8, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_Msg_Ctrl_8' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess_14) == 0x0001C8, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd) == 0x0001C9, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_MakeTransform_ReturnValue) == 0x0001D0, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000200, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_FinishSpawningActor_ReturnValue) == 0x000208, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_GetGazeTargetHolder_ReturnValue_1) == 0x000210, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_GetGazeTargetHolder_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_CheckEventFlag_ReturnValue) == 0x000218, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_CheckEventFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, Temp_int_Variable_1) == 0x00021C, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_Add_IntInt_ReturnValue_2) == 0x000220, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_CheckEventFlag_ReturnValue_1) == 0x000224, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_CheckEventFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_GetGameInstance_ReturnValue_3) == 0x000228, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_GetGameInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_UIManager_6) == 0x000230, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_UIManager_6' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess_15) == 0x000240, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess_15' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_CheckEventFlag_ReturnValue_2) == 0x000241, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_CheckEventFlag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_BPI_GetUIManager_UIManager_3) == 0x000248, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_BPI_GetUIManager_UIManager_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_UIManager_7) == 0x000250, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_UIManager_7' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess_16) == 0x000260, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess_16' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_BPI_GetMsgCtrl_OutActor_3) == 0x000268, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_BPI_GetMsgCtrl_OutActor_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_CheckEventFlag_ReturnValue_3) == 0x000270, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_CheckEventFlag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_Msg_Ctrl_9) == 0x000278, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_Msg_Ctrl_9' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess_17) == 0x000288, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess_17' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_Msg_Ctrl_10) == 0x000290, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_Msg_Ctrl_10' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess_18) == 0x0002A0, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess_18' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1) == 0x0002A1, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_CheckEventFlag_ReturnValue_4) == 0x0002A2, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_CheckEventFlag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, Temp_int_Variable_2) == 0x0002A4, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_Add_IntInt_ReturnValue_3) == 0x0002A8, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_CheckEventFlag_ReturnValue_5) == 0x0002AC, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_CheckEventFlag_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_GetGameInstance_ReturnValue_4) == 0x0002B0, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_GetGameInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_UIManager_8) == 0x0002B8, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_UIManager_8' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess_19) == 0x0002C8, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess_19' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_CheckEventFlag_ReturnValue_6) == 0x0002C9, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_CheckEventFlag_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_BPI_GetUIManager_UIManager_4) == 0x0002D0, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_BPI_GetUIManager_UIManager_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_UIManager_9) == 0x0002D8, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_UIManager_9' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess_20) == 0x0002E8, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess_20' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_BPI_GetMsgCtrl_OutActor_4) == 0x0002F0, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_BPI_GetMsgCtrl_OutActor_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_Msg_Ctrl_11) == 0x0002F8, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_Msg_Ctrl_11' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess_21) == 0x000308, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess_21' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_AsBPI_Msg_Ctrl_12) == 0x000310, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_AsBPI_Msg_Ctrl_12' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, K2Node_DynamicCast_bSuccess_22) == 0x000320, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::K2Node_DynamicCast_bSuccess_22' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_2) == 0x000321, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_StartMapEvent_Dummy) == 0x000322, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_StartMapEvent_Dummy' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_GetTransform_ReturnValue) == 0x000330, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000360, "Member 'MM_M061_EM2242_C_ExecuteUbergraph_MM_M061_EM2242::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
