#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM2240

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_EventMissionBase_HitAction_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM2240.MM_M061_EM2240_C
// 0x0148 (0x0440 - 0x02F8)
class AMM_M061_EM2240_C final : public ABP_EventMissionBase_HitAction_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM2240_C;                   // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         _______3___Track_0_B329C2DE4F74B66BD7B8BF84CBBA5914; // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______3__Direction_B329C2DE4F74B66BD7B8BF84CBBA5914; // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D395[0x3];                                     // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______3;                                          // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______2___Track_0_0420677C443D807A6674A8B6A62849A3; // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______2__Direction_0420677C443D807A6674A8B6A62849A3; // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D396[0x3];                                     // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______2;                                          // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______1_EmitterScaleDown_45EFC1054DD74D517735248CDDBF177C; // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______1__Direction_45EFC1054DD74D517735248CDDBF177C; // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D397[0x3];                                     // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______1;                                          // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______0___Track_0_182A49624E2B11AE067989A961A824CE; // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______0__Direction_182A49624E2B11AE067989A961A824CE; // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D398[0x3];                                     // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______0;                                          // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmitterFloat___Track_0_2A2972D5438D6C74207ACB99AB795061; // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            EmitterFloat__Direction_2A2972D5438D6C74207ACB99AB795061; // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D399[0x3];                                     // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     EmitterFloat;                                      // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmitterDestroy3___Track_0_753629A84CAE4DDE333CE085704436FF; // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            EmitterDestroy3__Direction_753629A84CAE4DDE333CE085704436FF; // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D39A[0x3];                                     // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     EmitterDestroy3;                                   // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmitterDesetroy2___Track_0_AB0773A043AE307CD74EA29850962DF7; // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            EmitterDesetroy2__Direction_AB0773A043AE307CD74EA29850962DF7; // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D39B[0x3];                                     // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     EmitterDesetroy2;                                  // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmitterDestroy_EmitterScaleDown_5914A43B48BA04085DDF36AB468479A0; // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            EmitterDestroy__Direction_5914A43B48BA04085DDF36AB468479A0; // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D39C[0x3];                                     // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     EmitterDestroy;                                    // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectIndex;                                       // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D39D[0x4];                                     // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MissionEventBase_C*                 Mission_Event;                                     // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EventHit_Location;                                 // 0x0390(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               EventHit_Rotater;                                  // 0x039C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                EvenrHit_Size;                                     // 0x03A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D39E[0x4];                                     // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target;                                            // 0x03D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate)
	class ACameraActor*                           EM2240_Cam;                                        // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    Seq_Actor;                                         // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADevilBaseLight_C*                      Spawn_Khonsu;                                      // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChangeBGM;                                         // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D39F[0x7];                                     // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               Emitter;                                           // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANpc615_C*                              SPawn_Miyazu;                                      // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 MissionEvent;                                      // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADev427_C*                              Khonsu_la;                                         // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Event_Item_Id;                                     // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FinishParticleGraph;                               // 0x042C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SeqEnd;                                            // 0x042D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D3A0[0x2];                                     // 0x042E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventScriptFade_C*                  LocalFade;                                         // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASkeletalMeshActor*                     Sword;                                             // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_EM2240(int32 EntryPoint);
	void EvtDis_FinishComplete();
	void Evt_Finish();
	void EvtDis_Finish();
	void Entry();
	void EndEvent2();
	void EndEvent();
	void BattleEnd();
	void OnDestroyed______0(class AActor* DestroyedActor);
	void BattleStandby();
	void EndTalk();
	void QuestExecute();
	void OnLoaded_2F11142A49190D58E7F63EB699FB24D3(TSubclassOf<class UObject> Loaded);
	void OnLoaded_E9AD177C4579EBC6FD7A19AC7DB2B15B(TSubclassOf<class UObject> Loaded);
	void OnLoaded_260E04004B32700550A582B540B7FB93(TSubclassOf<class UObject> Loaded);
	void OnLoaded_BD43240748AA3032B7377CAD00DB7CD4(TSubclassOf<class UObject> Loaded);
	void OnLoaded_A9352E79487F293BE6BD47B19D32F323(TSubclassOf<class UObject> Loaded);
	void OnLoaded_C96965B744DA5B16452B7AB791316D8D(TSubclassOf<class UObject> Loaded);
	void OnLoaded_A5E459F84AF7C0849128B8B951C63EC7(TSubclassOf<class UObject> Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BCA0A899AA(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD6D8B8F6C(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC05D91FDF(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD5230E4CD(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F30C1C585(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F940E1B29(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC192686A5(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD644D9F9C(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BCE14CBFD2(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD5151E3DA(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BCB834EA04(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD76EFD523(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BCB7AB93BD(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDBCD7B453(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD76EAFB39(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD39DF1997(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD32F1EB38(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD4C5FEB86(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD2DD7FEC9(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD2FDAA55C(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD5280A6E2(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC0A6B4691(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD1625DE42(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC3A46E4A8(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD32AE4620(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FEEC67488(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F134ACE61(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F9A3690FF(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FA1170418(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FCE465A52(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F56434440(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F3E40A032(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F2DB68158(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F660650A5(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FCDE78D96(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FAB60AE8F(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F59242F1D(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F2A556FD0(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F76EFCF35(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F70650157(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F4B377045(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F1B6A0B05(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F013E38C9(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FF50743AF(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FB734D521(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F1C7287CD(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FC22EC95A(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F1CC6F725(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F7D9A4E92(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F12170617(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FBD3CBA46(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F7B5C569F(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FB06EFBAF(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FF88D1879(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F650F9F5E(class UObject* Loaded);
	void _______2__UpdateFunc();
	void _______2__FinishedFunc();
	void _______3__UpdateFunc();
	void _______3__FinishedFunc();
	void _______1__UpdateFunc();
	void _______1__FinishedFunc();
	void EmitterDesetroy2__UpdateFunc();
	void EmitterDesetroy2__FinishedFunc();
	void EmitterDestroy3__UpdateFunc();
	void EmitterDestroy3__FinishedFunc();
	void EmitterDestroy__UpdateFunc();
	void EmitterDestroy__FinishedFunc();
	void EmitterFloat__UpdateFunc();
	void EmitterFloat__FinishedFunc();
	void _______0__UpdateFunc();
	void _______0__FinishedFunc();
	void UserConstructionScript();
	void Result_fade_func();
	void CallDeactivate();
	void QuestFunctionHit();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM2240_C">();
	}
	static class AMM_M061_EM2240_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM2240_C>();
	}
};
static_assert(alignof(AMM_M061_EM2240_C) == 0x000008, "Wrong alignment on AMM_M061_EM2240_C");
static_assert(sizeof(AMM_M061_EM2240_C) == 0x000440, "Wrong size on AMM_M061_EM2240_C");
static_assert(offsetof(AMM_M061_EM2240_C, UberGraphFrame_MM_M061_EM2240_C) == 0x0002F8, "Member 'AMM_M061_EM2240_C::UberGraphFrame_MM_M061_EM2240_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, _______3___Track_0_B329C2DE4F74B66BD7B8BF84CBBA5914) == 0x000300, "Member 'AMM_M061_EM2240_C::_______3___Track_0_B329C2DE4F74B66BD7B8BF84CBBA5914' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, _______3__Direction_B329C2DE4F74B66BD7B8BF84CBBA5914) == 0x000304, "Member 'AMM_M061_EM2240_C::_______3__Direction_B329C2DE4F74B66BD7B8BF84CBBA5914' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, _______3) == 0x000308, "Member 'AMM_M061_EM2240_C::_______3' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, _______2___Track_0_0420677C443D807A6674A8B6A62849A3) == 0x000310, "Member 'AMM_M061_EM2240_C::_______2___Track_0_0420677C443D807A6674A8B6A62849A3' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, _______2__Direction_0420677C443D807A6674A8B6A62849A3) == 0x000314, "Member 'AMM_M061_EM2240_C::_______2__Direction_0420677C443D807A6674A8B6A62849A3' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, _______2) == 0x000318, "Member 'AMM_M061_EM2240_C::_______2' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, _______1_EmitterScaleDown_45EFC1054DD74D517735248CDDBF177C) == 0x000320, "Member 'AMM_M061_EM2240_C::_______1_EmitterScaleDown_45EFC1054DD74D517735248CDDBF177C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, _______1__Direction_45EFC1054DD74D517735248CDDBF177C) == 0x000324, "Member 'AMM_M061_EM2240_C::_______1__Direction_45EFC1054DD74D517735248CDDBF177C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, _______1) == 0x000328, "Member 'AMM_M061_EM2240_C::_______1' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, _______0___Track_0_182A49624E2B11AE067989A961A824CE) == 0x000330, "Member 'AMM_M061_EM2240_C::_______0___Track_0_182A49624E2B11AE067989A961A824CE' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, _______0__Direction_182A49624E2B11AE067989A961A824CE) == 0x000334, "Member 'AMM_M061_EM2240_C::_______0__Direction_182A49624E2B11AE067989A961A824CE' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, _______0) == 0x000338, "Member 'AMM_M061_EM2240_C::_______0' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, EmitterFloat___Track_0_2A2972D5438D6C74207ACB99AB795061) == 0x000340, "Member 'AMM_M061_EM2240_C::EmitterFloat___Track_0_2A2972D5438D6C74207ACB99AB795061' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, EmitterFloat__Direction_2A2972D5438D6C74207ACB99AB795061) == 0x000344, "Member 'AMM_M061_EM2240_C::EmitterFloat__Direction_2A2972D5438D6C74207ACB99AB795061' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, EmitterFloat) == 0x000348, "Member 'AMM_M061_EM2240_C::EmitterFloat' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, EmitterDestroy3___Track_0_753629A84CAE4DDE333CE085704436FF) == 0x000350, "Member 'AMM_M061_EM2240_C::EmitterDestroy3___Track_0_753629A84CAE4DDE333CE085704436FF' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, EmitterDestroy3__Direction_753629A84CAE4DDE333CE085704436FF) == 0x000354, "Member 'AMM_M061_EM2240_C::EmitterDestroy3__Direction_753629A84CAE4DDE333CE085704436FF' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, EmitterDestroy3) == 0x000358, "Member 'AMM_M061_EM2240_C::EmitterDestroy3' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, EmitterDesetroy2___Track_0_AB0773A043AE307CD74EA29850962DF7) == 0x000360, "Member 'AMM_M061_EM2240_C::EmitterDesetroy2___Track_0_AB0773A043AE307CD74EA29850962DF7' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, EmitterDesetroy2__Direction_AB0773A043AE307CD74EA29850962DF7) == 0x000364, "Member 'AMM_M061_EM2240_C::EmitterDesetroy2__Direction_AB0773A043AE307CD74EA29850962DF7' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, EmitterDesetroy2) == 0x000368, "Member 'AMM_M061_EM2240_C::EmitterDesetroy2' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, EmitterDestroy_EmitterScaleDown_5914A43B48BA04085DDF36AB468479A0) == 0x000370, "Member 'AMM_M061_EM2240_C::EmitterDestroy_EmitterScaleDown_5914A43B48BA04085DDF36AB468479A0' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, EmitterDestroy__Direction_5914A43B48BA04085DDF36AB468479A0) == 0x000374, "Member 'AMM_M061_EM2240_C::EmitterDestroy__Direction_5914A43B48BA04085DDF36AB468479A0' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, EmitterDestroy) == 0x000378, "Member 'AMM_M061_EM2240_C::EmitterDestroy' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, SelectIndex) == 0x000380, "Member 'AMM_M061_EM2240_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, Mission_Event) == 0x000388, "Member 'AMM_M061_EM2240_C::Mission_Event' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, EventHit_Location) == 0x000390, "Member 'AMM_M061_EM2240_C::EventHit_Location' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, EventHit_Rotater) == 0x00039C, "Member 'AMM_M061_EM2240_C::EventHit_Rotater' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, EvenrHit_Size) == 0x0003A8, "Member 'AMM_M061_EM2240_C::EvenrHit_Size' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, SystemMessageAsset) == 0x0003B8, "Member 'AMM_M061_EM2240_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, MissionMessageAsset) == 0x0003C0, "Member 'AMM_M061_EM2240_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, Camera) == 0x0003C8, "Member 'AMM_M061_EM2240_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, Target) == 0x0003D8, "Member 'AMM_M061_EM2240_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, EM2240_Cam) == 0x0003E8, "Member 'AMM_M061_EM2240_C::EM2240_Cam' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, Seq_Actor) == 0x0003F0, "Member 'AMM_M061_EM2240_C::Seq_Actor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, Spawn_Khonsu) == 0x0003F8, "Member 'AMM_M061_EM2240_C::Spawn_Khonsu' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, ChangeBGM) == 0x000400, "Member 'AMM_M061_EM2240_C::ChangeBGM' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, Emitter) == 0x000408, "Member 'AMM_M061_EM2240_C::Emitter' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, SPawn_Miyazu) == 0x000410, "Member 'AMM_M061_EM2240_C::SPawn_Miyazu' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, MissionEvent) == 0x000418, "Member 'AMM_M061_EM2240_C::MissionEvent' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, Khonsu_la) == 0x000420, "Member 'AMM_M061_EM2240_C::Khonsu_la' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, Event_Item_Id) == 0x000428, "Member 'AMM_M061_EM2240_C::Event_Item_Id' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, FinishParticleGraph) == 0x00042C, "Member 'AMM_M061_EM2240_C::FinishParticleGraph' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, SeqEnd) == 0x00042D, "Member 'AMM_M061_EM2240_C::SeqEnd' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, LocalFade) == 0x000430, "Member 'AMM_M061_EM2240_C::LocalFade' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2240_C, Sword) == 0x000438, "Member 'AMM_M061_EM2240_C::Sword' has a wrong offset!");

}

