#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM1801

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_EventMissionBase_Direct_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM1801.MM_M061_EM1801_C
// 0x0078 (0x0338 - 0x02C0)
class AMM_M061_EM1801_C final : public ABP_EventMissionBase_Direct_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM1801_C;                   // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box3;                                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box2;                                              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box1;                                              // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectIndex;                                       // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC25[0x4];                                     // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ATargetPoint*                           Focus_Point;                                       // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitSize;                                           // 0x0328(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_EM1801(int32 EntryPoint);
	void FocusMissionEnd();
	void BndEvt__Box3_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__Box2_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__Box1_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void QuestExecute();
	void ReceiveBeginPlay();
	void CallDeactivate();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM1801_C">();
	}
	static class AMM_M061_EM1801_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM1801_C>();
	}
};
static_assert(alignof(AMM_M061_EM1801_C) == 0x000008, "Wrong alignment on AMM_M061_EM1801_C");
static_assert(sizeof(AMM_M061_EM1801_C) == 0x000338, "Wrong size on AMM_M061_EM1801_C");
static_assert(offsetof(AMM_M061_EM1801_C, UberGraphFrame_MM_M061_EM1801_C) == 0x0002C0, "Member 'AMM_M061_EM1801_C::UberGraphFrame_MM_M061_EM1801_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1801_C, Box3) == 0x0002C8, "Member 'AMM_M061_EM1801_C::Box3' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1801_C, Box2) == 0x0002D0, "Member 'AMM_M061_EM1801_C::Box2' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1801_C, Box1) == 0x0002D8, "Member 'AMM_M061_EM1801_C::Box1' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1801_C, Box) == 0x0002E0, "Member 'AMM_M061_EM1801_C::Box' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1801_C, SelectIndex) == 0x0002E8, "Member 'AMM_M061_EM1801_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1801_C, SystemMessageAsset) == 0x0002F0, "Member 'AMM_M061_EM1801_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1801_C, MissionMessageAsset) == 0x0002F8, "Member 'AMM_M061_EM1801_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1801_C, Camera) == 0x000300, "Member 'AMM_M061_EM1801_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1801_C, Target) == 0x000310, "Member 'AMM_M061_EM1801_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1801_C, Focus_Point) == 0x000320, "Member 'AMM_M061_EM1801_C::Focus_Point' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM1801_C, HitSize) == 0x000328, "Member 'AMM_M061_EM1801_C::HitSize' has a wrong offset!");

}

