#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_E0250

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_EventMissionBase_Hit_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_E0250.MM_M061_E0250_C
// 0x00A8 (0x0370 - 0x02C8)
class AMM_M061_E0250_C final : public ABP_EventMissionBase_Hit_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_E0250_C;                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         _______1_Rot_D41D860B46D557A37542379FF16546B3;     // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______1__Direction_D41D860B46D557A37542379FF16546B3; // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A67[0x3];                                     // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______1;                                          // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______0_FOV_70D6F8D04EADA3DCFC9FBEA4EDBBA76B;     // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______0__Direction_70D6F8D04EADA3DCFC9FBEA4EDBBA76B; // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A68[0x3];                                     // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______0;                                          // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectIndex;                                       // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A69[0x4];                                     // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MessageAsset;                                      // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 Mission_Event;                                     // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AActor*                                 Default__View_Target;                              // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraBlend_C*                 CameraBlender;                                     // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  NaviDevil;                                         // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MoveFinish;                                        // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A6A[0x7];                                     // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           InstantCamera;                                     // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefFOV;                                            // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DefInstantCameraRot;                               // 0x035C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         NewFOV;                                            // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_E0250(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void MoveEnd2();
	void OnDestroyed______1(class AActor* DestroyedActor);
	void MoveEnd();
	void CallDeactivate();
	void CheckActive();
	void QuestExecute();
	void ReceiveBeginPlay();
	void _______1__UpdateFunc();
	void _______1__FinishedFunc();
	void _______0__UpdateFunc();
	void _______0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_E0250_C">();
	}
	static class AMM_M061_E0250_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_E0250_C>();
	}
};
static_assert(alignof(AMM_M061_E0250_C) == 0x000008, "Wrong alignment on AMM_M061_E0250_C");
static_assert(sizeof(AMM_M061_E0250_C) == 0x000370, "Wrong size on AMM_M061_E0250_C");
static_assert(offsetof(AMM_M061_E0250_C, UberGraphFrame_MM_M061_E0250_C) == 0x0002C8, "Member 'AMM_M061_E0250_C::UberGraphFrame_MM_M061_E0250_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0250_C, _______1_Rot_D41D860B46D557A37542379FF16546B3) == 0x0002D0, "Member 'AMM_M061_E0250_C::_______1_Rot_D41D860B46D557A37542379FF16546B3' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0250_C, _______1__Direction_D41D860B46D557A37542379FF16546B3) == 0x0002D4, "Member 'AMM_M061_E0250_C::_______1__Direction_D41D860B46D557A37542379FF16546B3' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0250_C, _______1) == 0x0002D8, "Member 'AMM_M061_E0250_C::_______1' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0250_C, _______0_FOV_70D6F8D04EADA3DCFC9FBEA4EDBBA76B) == 0x0002E0, "Member 'AMM_M061_E0250_C::_______0_FOV_70D6F8D04EADA3DCFC9FBEA4EDBBA76B' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0250_C, _______0__Direction_70D6F8D04EADA3DCFC9FBEA4EDBBA76B) == 0x0002E4, "Member 'AMM_M061_E0250_C::_______0__Direction_70D6F8D04EADA3DCFC9FBEA4EDBBA76B' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0250_C, _______0) == 0x0002E8, "Member 'AMM_M061_E0250_C::_______0' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0250_C, SelectIndex) == 0x0002F0, "Member 'AMM_M061_E0250_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0250_C, SystemMessageAsset) == 0x0002F8, "Member 'AMM_M061_E0250_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0250_C, MessageAsset) == 0x000300, "Member 'AMM_M061_E0250_C::MessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0250_C, Mission_Event) == 0x000308, "Member 'AMM_M061_E0250_C::Mission_Event' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0250_C, Camera) == 0x000310, "Member 'AMM_M061_E0250_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0250_C, Target) == 0x000320, "Member 'AMM_M061_E0250_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0250_C, Default__View_Target) == 0x000330, "Member 'AMM_M061_E0250_C::Default__View_Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0250_C, CameraBlender) == 0x000338, "Member 'AMM_M061_E0250_C::CameraBlender' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0250_C, NaviDevil) == 0x000340, "Member 'AMM_M061_E0250_C::NaviDevil' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0250_C, MoveFinish) == 0x000348, "Member 'AMM_M061_E0250_C::MoveFinish' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0250_C, InstantCamera) == 0x000350, "Member 'AMM_M061_E0250_C::InstantCamera' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0250_C, DefFOV) == 0x000358, "Member 'AMM_M061_E0250_C::DefFOV' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0250_C, DefInstantCameraRot) == 0x00035C, "Member 'AMM_M061_E0250_C::DefInstantCameraRot' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0250_C, NewFOV) == 0x000368, "Member 'AMM_M061_E0250_C::NewFOV' has a wrong offset!");

}

