#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM0027

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_EventMissionBase_Direct_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM0027.MM_M061_EM0027_C
// 0x0098 (0x0358 - 0x02C0)
class AMM_M061_EM0027_C final : public ABP_EventMissionBase_Direct_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM0027_C;                   // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         _______0_move_F2678ADB4F09F45DCEE876A0B95720F7;    // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______0__Direction_F2678ADB4F09F45DCEE876A0B95720F7; // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_468F[0x3];                                     // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______0;                                          // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AmanoRot_rot_0C3CB632400BB82B313CEBA99CCF9F60;     // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            AmanoRot__Direction_0C3CB632400BB82B313CEBA99CCF9F60; // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4690[0x3];                                     // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     AmanoRot;                                          // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectIndex;                                       // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4691[0x4];                                     // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ABP_EventCameraBlend_C*                 CameraBlender;                                     // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DefaultCamera;                                     // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  NaviDevil;                                         // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RotCHK;                                            // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4692[0x7];                                     // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATargetPoint*                           FocusPoint;                                        // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 MissionEvent;                                      // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventScriptFade_C*                  LocalFade;                                         // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_EM0027(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void FocusMissionEnd();
	void Move2();
	void EvtDis_Finish______0();
	void MoveFinish();
	void ReverseRot();
	void QuestExecute();
	void CallDeactivate();
	void ReceiveBeginPlay();
	void OnLoaded_8C5F64BC4F1BBF199F45C4BCAA94DFAA(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD24DB1A25(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD9CA27B29(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDD2C5D40D(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDC07EAF14(class UObject* Loaded);
	void OnLoaded_DE960BD0440397DE61A238A52F222ECB(TSubclassOf<class UObject> Loaded);
	void _______0__UpdateFunc();
	void _______0__FinishedFunc();
	void AmanoRot__UpdateFunc();
	void AmanoRot__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM0027_C">();
	}
	static class AMM_M061_EM0027_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM0027_C>();
	}
};
static_assert(alignof(AMM_M061_EM0027_C) == 0x000008, "Wrong alignment on AMM_M061_EM0027_C");
static_assert(sizeof(AMM_M061_EM0027_C) == 0x000358, "Wrong size on AMM_M061_EM0027_C");
static_assert(offsetof(AMM_M061_EM0027_C, UberGraphFrame_MM_M061_EM0027_C) == 0x0002C0, "Member 'AMM_M061_EM0027_C::UberGraphFrame_MM_M061_EM0027_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0027_C, _______0_move_F2678ADB4F09F45DCEE876A0B95720F7) == 0x0002C8, "Member 'AMM_M061_EM0027_C::_______0_move_F2678ADB4F09F45DCEE876A0B95720F7' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0027_C, _______0__Direction_F2678ADB4F09F45DCEE876A0B95720F7) == 0x0002CC, "Member 'AMM_M061_EM0027_C::_______0__Direction_F2678ADB4F09F45DCEE876A0B95720F7' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0027_C, _______0) == 0x0002D0, "Member 'AMM_M061_EM0027_C::_______0' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0027_C, AmanoRot_rot_0C3CB632400BB82B313CEBA99CCF9F60) == 0x0002D8, "Member 'AMM_M061_EM0027_C::AmanoRot_rot_0C3CB632400BB82B313CEBA99CCF9F60' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0027_C, AmanoRot__Direction_0C3CB632400BB82B313CEBA99CCF9F60) == 0x0002DC, "Member 'AMM_M061_EM0027_C::AmanoRot__Direction_0C3CB632400BB82B313CEBA99CCF9F60' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0027_C, AmanoRot) == 0x0002E0, "Member 'AMM_M061_EM0027_C::AmanoRot' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0027_C, SelectIndex) == 0x0002E8, "Member 'AMM_M061_EM0027_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0027_C, SystemMessageAsset) == 0x0002F0, "Member 'AMM_M061_EM0027_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0027_C, MissionMessageAsset) == 0x0002F8, "Member 'AMM_M061_EM0027_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0027_C, Camera) == 0x000300, "Member 'AMM_M061_EM0027_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0027_C, Target) == 0x000310, "Member 'AMM_M061_EM0027_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0027_C, CameraBlender) == 0x000320, "Member 'AMM_M061_EM0027_C::CameraBlender' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0027_C, DefaultCamera) == 0x000328, "Member 'AMM_M061_EM0027_C::DefaultCamera' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0027_C, NaviDevil) == 0x000330, "Member 'AMM_M061_EM0027_C::NaviDevil' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0027_C, RotCHK) == 0x000338, "Member 'AMM_M061_EM0027_C::RotCHK' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0027_C, FocusPoint) == 0x000340, "Member 'AMM_M061_EM0027_C::FocusPoint' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0027_C, MissionEvent) == 0x000348, "Member 'AMM_M061_EM0027_C::MissionEvent' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM0027_C, LocalFade) == 0x000350, "Member 'AMM_M061_EM0027_C::LocalFade' has a wrong offset!");

}

