#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM2601

#include "Basic.hpp"

#include "BP_EventMissionBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM2601.MM_M061_EM2601_C
// 0x0080 (0x03A0 - 0x0320)
class AMM_M061_EM2601_C final : public ABP_EventMissionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM2601_C;                   // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SelectIndex;                                       // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A309[0x4];                                     // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATargetPoint*>                   Target;                                            // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSequence;                                        // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FocusFinish;                                       // 0x0349(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ChangeBGM;                                         // 0x034A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A30A[0x5];                                     // 0x034B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           CameraActor;                                       // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class ULevelSequence>>  CameraSequence;                                    // 0x0358(0x0010)(Edit, BlueprintVisible)
	class ALevelSequenceActor*                    SequenceActor;                                     // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AutoRotateFocus_C*                  CameraRotCtrl;                                     // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetPoint*                           BattlePoint;                                       // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADevilBase_C*                           SpawnDevil;                                        // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NkmId;                                             // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerLevelPart;                                   // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           SpawnActor;                                        // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OyamatsumiID;                                      // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_EM2601(int32 EntryPoint);
	void StartNPCCamera();
	void StartJoinTalk();
	void ToBattle();
	void EndBattle();
	void OnDestroyed_Event(class AActor* DestroyedActor);
	void ToReportTalk();
	void StartNotReportTalk();
	void EndTalk();
	void StartReportEvent();
	void StartBattleEvent();
	void StartFirstTakeEvent();
	void QuestExecute();
	void ReceiveBeginPlay();
	void OnLoaded_7DB625CD40CC2856EB5E08AE40E24EEC(TSubclassOf<class UObject> Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDA8BBD5FA(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD80B1EB09(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD6FDC9A46(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FCCAFC8CC(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F3AB97FBC(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F199132CC(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FBCB120E5(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F1B2BD394(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F7E0CE402(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F090FD123(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F1998B68F(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F4A11D33A(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F41A3DEAC(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F93D55F28(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FFD3392DE(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F1336A0FB(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949F26A9BE3D(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FFC3C1A37(class UObject* Loaded);
	void CallDeactivate();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM2601_C">();
	}
	static class AMM_M061_EM2601_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM2601_C>();
	}
};
static_assert(alignof(AMM_M061_EM2601_C) == 0x000008, "Wrong alignment on AMM_M061_EM2601_C");
static_assert(sizeof(AMM_M061_EM2601_C) == 0x0003A0, "Wrong size on AMM_M061_EM2601_C");
static_assert(offsetof(AMM_M061_EM2601_C, UberGraphFrame_MM_M061_EM2601_C) == 0x000320, "Member 'AMM_M061_EM2601_C::UberGraphFrame_MM_M061_EM2601_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2601_C, SelectIndex) == 0x000328, "Member 'AMM_M061_EM2601_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2601_C, Target) == 0x000330, "Member 'AMM_M061_EM2601_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2601_C, MissionMessageAsset) == 0x000340, "Member 'AMM_M061_EM2601_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2601_C, IsSequence) == 0x000348, "Member 'AMM_M061_EM2601_C::IsSequence' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2601_C, FocusFinish) == 0x000349, "Member 'AMM_M061_EM2601_C::FocusFinish' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2601_C, ChangeBGM) == 0x00034A, "Member 'AMM_M061_EM2601_C::ChangeBGM' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2601_C, CameraActor) == 0x000350, "Member 'AMM_M061_EM2601_C::CameraActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2601_C, CameraSequence) == 0x000358, "Member 'AMM_M061_EM2601_C::CameraSequence' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2601_C, SequenceActor) == 0x000368, "Member 'AMM_M061_EM2601_C::SequenceActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2601_C, CameraRotCtrl) == 0x000370, "Member 'AMM_M061_EM2601_C::CameraRotCtrl' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2601_C, BattlePoint) == 0x000378, "Member 'AMM_M061_EM2601_C::BattlePoint' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2601_C, SpawnDevil) == 0x000380, "Member 'AMM_M061_EM2601_C::SpawnDevil' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2601_C, NkmId) == 0x000388, "Member 'AMM_M061_EM2601_C::NkmId' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2601_C, PlayerLevelPart) == 0x00038C, "Member 'AMM_M061_EM2601_C::PlayerLevelPart' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2601_C, SpawnActor) == 0x000390, "Member 'AMM_M061_EM2601_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2601_C, OyamatsumiID) == 0x000398, "Member 'AMM_M061_EM2601_C::OyamatsumiID' has a wrong offset!");

}

