#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM2383

#include "Basic.hpp"

#include "BP_EventMissionBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM2383.MM_M061_EM2383_C
// 0x0068 (0x0388 - 0x0320)
class AMM_M061_EM2383_C final : public ABP_EventMissionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM2383_C;                   // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         _______0_EmitterScaleDown_707A5C9246881306103D269C8D5CD76E; // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______0__Direction_707A5C9246881306103D269C8D5CD76E; // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2071[0x3];                                     // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______0;                                          // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Rotate_Weight_8CA2FE0D4D405AE225EC94AF676A9184; // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_Rotate__Direction_8CA2FE0D4D405AE225EC94AF676A9184; // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2072[0x3];                                     // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_Rotate;                                   // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectIndex;                                       // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2073[0x4];                                     // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               SpawnEmitter;                                      // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    SequenceActor;                                     // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class UScriptMessageAsset*                    ScriptMessageAsset;                                // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADevilBase_C*                           SpawnDev272;                                       // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CameraActor;                                       // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_EM2383(int32 EntryPoint);
	void ShrinkEmitter();
	void RotateMoshobou();
	void QuestExecute();
	void ReceiveBeginPlay();
	void OnLoaded_EF6E832B4490266C90FF5E95474C4EFA(TSubclassOf<class UObject> Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD3A4B3B85(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDA4F3CF85(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC32C7A22B(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDC74B569C(class UObject* Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BCF56AF0BC(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDF1B3C09E(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FF484F52A(class UObject* Loaded);
	void OnLoaded_CA4C919B47E016D1B6B5949FBD9DDBB6(class UObject* Loaded);
	void _______0__UpdateFunc();
	void _______0__FinishedFunc();
	void Timeline_Rotate__UpdateFunc();
	void Timeline_Rotate__FinishedFunc();
	void CallDeactivate();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM2383_C">();
	}
	static class AMM_M061_EM2383_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM2383_C>();
	}
};
static_assert(alignof(AMM_M061_EM2383_C) == 0x000008, "Wrong alignment on AMM_M061_EM2383_C");
static_assert(sizeof(AMM_M061_EM2383_C) == 0x000388, "Wrong size on AMM_M061_EM2383_C");
static_assert(offsetof(AMM_M061_EM2383_C, UberGraphFrame_MM_M061_EM2383_C) == 0x000320, "Member 'AMM_M061_EM2383_C::UberGraphFrame_MM_M061_EM2383_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2383_C, _______0_EmitterScaleDown_707A5C9246881306103D269C8D5CD76E) == 0x000328, "Member 'AMM_M061_EM2383_C::_______0_EmitterScaleDown_707A5C9246881306103D269C8D5CD76E' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2383_C, _______0__Direction_707A5C9246881306103D269C8D5CD76E) == 0x00032C, "Member 'AMM_M061_EM2383_C::_______0__Direction_707A5C9246881306103D269C8D5CD76E' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2383_C, _______0) == 0x000330, "Member 'AMM_M061_EM2383_C::_______0' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2383_C, Timeline_Rotate_Weight_8CA2FE0D4D405AE225EC94AF676A9184) == 0x000338, "Member 'AMM_M061_EM2383_C::Timeline_Rotate_Weight_8CA2FE0D4D405AE225EC94AF676A9184' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2383_C, Timeline_Rotate__Direction_8CA2FE0D4D405AE225EC94AF676A9184) == 0x00033C, "Member 'AMM_M061_EM2383_C::Timeline_Rotate__Direction_8CA2FE0D4D405AE225EC94AF676A9184' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2383_C, Timeline_Rotate) == 0x000340, "Member 'AMM_M061_EM2383_C::Timeline_Rotate' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2383_C, SelectIndex) == 0x000348, "Member 'AMM_M061_EM2383_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2383_C, SpawnEmitter) == 0x000350, "Member 'AMM_M061_EM2383_C::SpawnEmitter' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2383_C, SequenceActor) == 0x000358, "Member 'AMM_M061_EM2383_C::SequenceActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2383_C, Target) == 0x000360, "Member 'AMM_M061_EM2383_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2383_C, ScriptMessageAsset) == 0x000370, "Member 'AMM_M061_EM2383_C::ScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2383_C, SpawnDev272) == 0x000378, "Member 'AMM_M061_EM2383_C::SpawnDev272' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2383_C, CameraActor) == 0x000380, "Member 'AMM_M061_EM2383_C::CameraActor' has a wrong offset!");

}

