#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM2020

#include "Basic.hpp"

#include "BP_EventMissionBase_classes.hpp"
#include "Engine_structs.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_EM2020.MM_M061_EM2020_C
// 0x0060 (0x0380 - 0x0320)
class AMM_M061_EM2020_C final : public ABP_EventMissionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_EM2020_C;                   // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectIndex;                                       // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B35C[0x4];                                     // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    MissionMessageAsset;                               // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MissionEventBase_C*                 MissionEvent;                                      // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AutoRotateFocus_C*                  CameraRotCtrl;                                     // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FocusFinish;                                       // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ChangeBGM;                                         // 0x0359(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B35D[0x6];                                     // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATargetPoint*                           BattlePoint;                                       // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATargetPoint*>                   Target;                                            // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ACharaBase_C*                           SpawnActor;                                        // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_EM2020(int32 EntryPoint);
	void Evt_FinishComplete();
	void Evt_Finish();
	void ResultFadeFunc();
	void StartCameraFocus();
	void EndBattle_Event();
	void OnDestroyed_EncountEvent(class AActor* DestroyedActor);
	void StartEventBattle();
	void StartQuizTalk();
	void EndTalk();
	void StartTalk();
	void BPI_ReceiveMapAttack(const struct FMapAttackDamageData& MapAttackData);
	void QuestExecute();
	void ReceiveBeginPlay();
	void OnLoaded_D672ED5E4813AA3DEE9D519569C5A8B2(TSubclassOf<class UObject> Loaded);
	void OnLoaded_5F6F452A41C2F65F90D5FEA6FF8FD250(TSubclassOf<class UObject> Loaded);
	void OnLoaded_26A770014DF8C82D143604953E6B65CE(TSubclassOf<class UObject> Loaded);
	void OnLoaded_8C5F64BC4F1BBF199F45C4BC8715BE85(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBDDB83A706(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD46437294(class UObject* Loaded);
	void OnLoaded_0E38A2EA4724D2AEB4E20FBD130E4683(class UObject* Loaded);
	void CallDeactivate();
	void CheckActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_EM2020_C">();
	}
	static class AMM_M061_EM2020_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_EM2020_C>();
	}
};
static_assert(alignof(AMM_M061_EM2020_C) == 0x000008, "Wrong alignment on AMM_M061_EM2020_C");
static_assert(sizeof(AMM_M061_EM2020_C) == 0x000380, "Wrong size on AMM_M061_EM2020_C");
static_assert(offsetof(AMM_M061_EM2020_C, UberGraphFrame_MM_M061_EM2020_C) == 0x000320, "Member 'AMM_M061_EM2020_C::UberGraphFrame_MM_M061_EM2020_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2020_C, Box) == 0x000328, "Member 'AMM_M061_EM2020_C::Box' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2020_C, SelectIndex) == 0x000330, "Member 'AMM_M061_EM2020_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2020_C, SystemMessageAsset) == 0x000338, "Member 'AMM_M061_EM2020_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2020_C, MissionMessageAsset) == 0x000340, "Member 'AMM_M061_EM2020_C::MissionMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2020_C, MissionEvent) == 0x000348, "Member 'AMM_M061_EM2020_C::MissionEvent' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2020_C, CameraRotCtrl) == 0x000350, "Member 'AMM_M061_EM2020_C::CameraRotCtrl' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2020_C, FocusFinish) == 0x000358, "Member 'AMM_M061_EM2020_C::FocusFinish' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2020_C, ChangeBGM) == 0x000359, "Member 'AMM_M061_EM2020_C::ChangeBGM' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2020_C, BattlePoint) == 0x000360, "Member 'AMM_M061_EM2020_C::BattlePoint' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2020_C, Target) == 0x000368, "Member 'AMM_M061_EM2020_C::Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_EM2020_C, SpawnActor) == 0x000378, "Member 'AMM_M061_EM2020_C::SpawnActor' has a wrong offset!");

}

