#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_EM0025

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MM_M061_EM0025.MM_M061_EM0025_C.ExecuteUbergraph_MM_M061_EM0025
// 0x0330 (0x0330 - 0x0000)
struct MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8F5[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_EventScriptArea_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C8F6[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventScriptArea_C*                  CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventScript_C>    K2Node_DynamicCast_AsBPI_Event_Script;             // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SpawnReflesh_NoUse;                       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C8F7[0xD];                                     // 0x0043(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraBlend_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionPadCheck_Success_2;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPL_TutorialWIndow2_IsClickedByMouse_IsClicked; // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C8F8[0x5];                                     // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C8F9[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C8FA[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C8FB[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl;                 // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C8FC[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_1;               // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C8FD[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_2;               // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C8FE[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_3;               // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IIsFinishedWindowOut_OutFinished;         // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetActive_IsActive;                       // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C8FF[0x5];                                     // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartMapEvent_Dummy;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C900[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C901[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_1;             // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EndMapEvent_Dummy;                        // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C902[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_3;              // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C903[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_1;                // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_4;               // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C904[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_5;               // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd;             // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C905[0x6];                                     // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APla603_C*                              K2Node_DynamicCast_AsPla_603;                      // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C906[0x7];                                     // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C907[0x4];                                     // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APla603_C*                              K2Node_DynamicCast_AsPla_603_1;                    // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMapActionPlaying_bPlaying;              // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMapEventActivateFlags_ReturnValue;      // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMapEventActivateFlags_ReturnValue_1;    // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C908[0x6];                                     // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C909[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_4;              // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C90A[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_2;             // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C90B[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_5;              // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C90C[0x7];                                     // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_2;                // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_6;               // 0x0268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C90D[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_7;               // 0x0280(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1;           // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C90E[0x6];                                     // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_6;              // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C90F[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager_3;             // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_7;              // 0x02C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C910[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BPI_GetMsgCtrl_OutActor_3;                // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_8;               // 0x02E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_19;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C911[0x7];                                     // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_9;               // 0x02F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_20;                    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C912[0x7];                                     // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MsgCtrl_C>        K2Node_DynamicCast_AsBPI_Msg_Ctrl_10;              // 0x0310(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_21;                    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025) == 0x000010, "Wrong alignment on MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025");
static_assert(sizeof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025) == 0x000330, "Wrong size on MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, EntryPoint) == 0x000000, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::EntryPoint' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_IsActionPadCheck_Success) == 0x000020, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_Array_Get_Item) == 0x000028, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_AsBPI_Event_Script) == 0x000030, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_AsBPI_Event_Script' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_SpawnReflesh_NoUse) == 0x000041, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_SpawnReflesh_NoUse' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_IsActionPadCheck_Success_1) == 0x000042, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_IsActionPadCheck_Success_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000080, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_FinishSpawningActor_ReturnValue) == 0x000088, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_IsActionPadCheck_Success_2) == 0x000090, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_IsActionPadCheck_Success_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_BPL_TutorialWIndow2_IsClickedByMouse_IsClicked) == 0x000091, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_BPL_TutorialWIndow2_IsClickedByMouse_IsClicked' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_BooleanOR_ReturnValue) == 0x000092, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_GetGameInstance_ReturnValue) == 0x000098, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_BooleanOR_ReturnValue_1) == 0x0000A0, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_AsBPI_UIManager) == 0x0000A8, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_BPI_GetUIManager_UIManager) == 0x0000C0, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_BPI_GetUIManager_UIManager' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x0000C8, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_bSuccess_2) == 0x0000D8, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_BPI_GetMsgCtrl_OutActor) == 0x0000E0, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_BPI_GetMsgCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_AsBPI_Msg_Ctrl) == 0x0000E8, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_AsBPI_Msg_Ctrl' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_bSuccess_3) == 0x0000F8, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_AsBPI_Msg_Ctrl_1) == 0x000100, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_AsBPI_Msg_Ctrl_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_bSuccess_4) == 0x000110, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_AsBPI_Msg_Ctrl_2) == 0x000118, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_AsBPI_Msg_Ctrl_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_bSuccess_5) == 0x000128, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_AsBPI_Msg_Ctrl_3) == 0x000130, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_AsBPI_Msg_Ctrl_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_bSuccess_6) == 0x000140, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_IIsFinishedWindowOut_OutFinished) == 0x000141, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_IIsFinishedWindowOut_OutFinished' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_GetActive_IsActive) == 0x000142, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_GetActive_IsActive' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_GetGameInstance_ReturnValue_1) == 0x000148, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_StartMapEvent_Dummy) == 0x000150, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_StartMapEvent_Dummy' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_AsBPI_UIManager_2) == 0x000158, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_AsBPI_UIManager_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_bSuccess_7) == 0x000168, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_BPI_GetUIManager_UIManager_1) == 0x000170, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_BPI_GetUIManager_UIManager_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_EndMapEvent_Dummy) == 0x000178, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_EndMapEvent_Dummy' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_AsBPI_UIManager_3) == 0x000180, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_AsBPI_UIManager_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_bSuccess_8) == 0x000190, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_BPI_GetMsgCtrl_OutActor_1) == 0x000198, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_BPI_GetMsgCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_AsBPI_Msg_Ctrl_4) == 0x0001A0, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_AsBPI_Msg_Ctrl_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_bSuccess_9) == 0x0001B0, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_AsBPI_Msg_Ctrl_5) == 0x0001B8, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_AsBPI_Msg_Ctrl_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_bSuccess_10) == 0x0001C8, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd) == 0x0001C9, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_GetPlayerPawn_ReturnValue) == 0x0001D0, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_AsPla_603) == 0x0001D8, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_AsPla_603' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_bSuccess_11) == 0x0001E0, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x0001E8, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, Temp_int_Loop_Counter_Variable) == 0x0001F0, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_AsPla_603_1) == 0x0001F8, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_AsPla_603_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_bSuccess_12) == 0x000200, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_IsMapActionPlaying_bPlaying) == 0x000201, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_IsMapActionPlaying_bPlaying' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_IsValid_ReturnValue) == 0x000202, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_Less_IntInt_ReturnValue) == 0x000203, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_Add_IntInt_ReturnValue) == 0x000204, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_IsMapEventActivateFlags_ReturnValue) == 0x000208, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_IsMapEventActivateFlags_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_IsMapEventActivateFlags_ReturnValue_1) == 0x000209, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_IsMapEventActivateFlags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_GetGameInstance_ReturnValue_2) == 0x000210, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_Event_EndPlayReason) == 0x000218, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_AsBPI_UIManager_4) == 0x000220, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_AsBPI_UIManager_4' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_bSuccess_13) == 0x000230, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_BPI_GetUIManager_UIManager_2) == 0x000238, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_BPI_GetUIManager_UIManager_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_IsValid_ReturnValue_1) == 0x000240, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_AsBPI_UIManager_5) == 0x000248, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_AsBPI_UIManager_5' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_bSuccess_14) == 0x000258, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_BPI_GetMsgCtrl_OutActor_2) == 0x000260, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_BPI_GetMsgCtrl_OutActor_2' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_AsBPI_Msg_Ctrl_6) == 0x000268, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_AsBPI_Msg_Ctrl_6' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_bSuccess_15) == 0x000278, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_bSuccess_15' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_AsBPI_Msg_Ctrl_7) == 0x000280, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_AsBPI_Msg_Ctrl_7' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_bSuccess_16) == 0x000290, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_bSuccess_16' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1) == 0x000291, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_IMsgCtrl_GetIsMacroEnd_IsEnd_1' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_GetGameInstance_ReturnValue_3) == 0x000298, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_GetGameInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_AsBPI_UIManager_6) == 0x0002A0, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_AsBPI_UIManager_6' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_bSuccess_17) == 0x0002B0, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_bSuccess_17' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_BPI_GetUIManager_UIManager_3) == 0x0002B8, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_BPI_GetUIManager_UIManager_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_AsBPI_UIManager_7) == 0x0002C0, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_AsBPI_UIManager_7' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_bSuccess_18) == 0x0002D0, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_bSuccess_18' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, CallFunc_BPI_GetMsgCtrl_OutActor_3) == 0x0002D8, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::CallFunc_BPI_GetMsgCtrl_OutActor_3' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_AsBPI_Msg_Ctrl_8) == 0x0002E0, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_AsBPI_Msg_Ctrl_8' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_bSuccess_19) == 0x0002F0, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_bSuccess_19' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_AsBPI_Msg_Ctrl_9) == 0x0002F8, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_AsBPI_Msg_Ctrl_9' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_bSuccess_20) == 0x000308, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_bSuccess_20' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_AsBPI_Msg_Ctrl_10) == 0x000310, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_AsBPI_Msg_Ctrl_10' has a wrong offset!");
static_assert(offsetof(MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025, K2Node_DynamicCast_bSuccess_21) == 0x000320, "Member 'MM_M061_EM0025_C_ExecuteUbergraph_MM_M061_EM0025::K2Node_DynamicCast_bSuccess_21' has a wrong offset!");

// Function MM_M061_EM0025.MM_M061_EM0025_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct MM_M061_EM0025_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MM_M061_EM0025_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on MM_M061_EM0025_C_ReceiveEndPlay");
static_assert(sizeof(MM_M061_EM0025_C_ReceiveEndPlay) == 0x000001, "Wrong size on MM_M061_EM0025_C_ReceiveEndPlay");
static_assert(offsetof(MM_M061_EM0025_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'MM_M061_EM0025_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

