#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_M061_E0242

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_EventMissionBase_Direct_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_M061_E0242.MM_M061_E0242_C
// 0x0070 (0x0330 - 0x02C0)
class AMM_M061_E0242_C final : public ABP_EventMissionBase_Direct_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MM_M061_E0242_C;                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SelectIndex;                                       // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C944[0x4];                                     // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    SystemMessageAsset;                                // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   Camera;                                            // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATargetPoint*>                   Target_Point;                                      // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AActor*                                 Default__View_Target;                              // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          EventBGM;                                          // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 SpawnActor;                                        // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _q__K1;                                            // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          _q__K2;                                            // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          _q__K3;                                            // 0x0312(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          _q__K4;                                            // 0x0313(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          _q__K5;                                            // 0x0314(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C945[0x3];                                     // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventCameraBlend_C*                 CameraBlender;                                     // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetPoint*                           FocusPoint;                                        // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IconData_Id;                                       // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_M061_E0242(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void FocusEnd();
	void EndEvent();
	void StartTutorial();
	void QuestExecute();
	void CallDeactivate();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_M061_E0242_C">();
	}
	static class AMM_M061_E0242_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_M061_E0242_C>();
	}
};
static_assert(alignof(AMM_M061_E0242_C) == 0x000008, "Wrong alignment on AMM_M061_E0242_C");
static_assert(sizeof(AMM_M061_E0242_C) == 0x000330, "Wrong size on AMM_M061_E0242_C");
static_assert(offsetof(AMM_M061_E0242_C, UberGraphFrame_MM_M061_E0242_C) == 0x0002C0, "Member 'AMM_M061_E0242_C::UberGraphFrame_MM_M061_E0242_C' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0242_C, SelectIndex) == 0x0002C8, "Member 'AMM_M061_E0242_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0242_C, SystemMessageAsset) == 0x0002D0, "Member 'AMM_M061_E0242_C::SystemMessageAsset' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0242_C, Camera) == 0x0002D8, "Member 'AMM_M061_E0242_C::Camera' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0242_C, Target_Point) == 0x0002E8, "Member 'AMM_M061_E0242_C::Target_Point' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0242_C, Default__View_Target) == 0x0002F8, "Member 'AMM_M061_E0242_C::Default__View_Target' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0242_C, EventBGM) == 0x000300, "Member 'AMM_M061_E0242_C::EventBGM' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0242_C, SpawnActor) == 0x000308, "Member 'AMM_M061_E0242_C::SpawnActor' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0242_C, _q__K1) == 0x000310, "Member 'AMM_M061_E0242_C::_q__K1' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0242_C, _q__K2) == 0x000311, "Member 'AMM_M061_E0242_C::_q__K2' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0242_C, _q__K3) == 0x000312, "Member 'AMM_M061_E0242_C::_q__K3' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0242_C, _q__K4) == 0x000313, "Member 'AMM_M061_E0242_C::_q__K4' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0242_C, _q__K5) == 0x000314, "Member 'AMM_M061_E0242_C::_q__K5' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0242_C, CameraBlender) == 0x000318, "Member 'AMM_M061_E0242_C::CameraBlender' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0242_C, FocusPoint) == 0x000320, "Member 'AMM_M061_E0242_C::FocusPoint' has a wrong offset!");
static_assert(offsetof(AMM_M061_E0242_C, IconData_Id) == 0x000328, "Member 'AMM_M061_E0242_C::IconData_Id' has a wrong offset!");

}

