#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MobBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MobPartData_Skeletal_structs.hpp"
#include "MobPartData_AnimationSet_structs.hpp"
#include "Engine_structs.hpp"
#include "MobPartData_Static_structs.hpp"
#include "ST_Mobbase_Color_structs.hpp"


namespace SDK::Params
{

// Function MobBase.MobBase_C.ExecuteUbergraph_MobBase
// 0x0058 (0x0058 - 0x0000)
struct MobBase_C_ExecuteUbergraph_MobBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2896[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetMapID_ReturnValue;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2897[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_Mobbase_Color                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0034(0x0014)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2898[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MobBase_C_ExecuteUbergraph_MobBase) == 0x000008, "Wrong alignment on MobBase_C_ExecuteUbergraph_MobBase");
static_assert(sizeof(MobBase_C_ExecuteUbergraph_MobBase) == 0x000058, "Wrong size on MobBase_C_ExecuteUbergraph_MobBase");
static_assert(offsetof(MobBase_C_ExecuteUbergraph_MobBase, EntryPoint) == 0x000000, "Member 'MobBase_C_ExecuteUbergraph_MobBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(MobBase_C_ExecuteUbergraph_MobBase, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000008, "Member 'MobBase_C_ExecuteUbergraph_MobBase::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(MobBase_C_ExecuteUbergraph_MobBase, CallFunc_GetMapID_ReturnValue) == 0x000018, "Member 'MobBase_C_ExecuteUbergraph_MobBase::CallFunc_GetMapID_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobBase_C_ExecuteUbergraph_MobBase, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'MobBase_C_ExecuteUbergraph_MobBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobBase_C_ExecuteUbergraph_MobBase, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'MobBase_C_ExecuteUbergraph_MobBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MobBase_C_ExecuteUbergraph_MobBase, Temp_int_Array_Index_Variable) == 0x000024, "Member 'MobBase_C_ExecuteUbergraph_MobBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MobBase_C_ExecuteUbergraph_MobBase, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'MobBase_C_ExecuteUbergraph_MobBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobBase_C_ExecuteUbergraph_MobBase, CallFunc_Array_Get_Item) == 0x00002C, "Member 'MobBase_C_ExecuteUbergraph_MobBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MobBase_C_ExecuteUbergraph_MobBase, CallFunc_GetDataTableRowFromName_OutRow) == 0x000034, "Member 'MobBase_C_ExecuteUbergraph_MobBase::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(MobBase_C_ExecuteUbergraph_MobBase, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000048, "Member 'MobBase_C_ExecuteUbergraph_MobBase::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobBase_C_ExecuteUbergraph_MobBase, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'MobBase_C_ExecuteUbergraph_MobBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobBase_C_ExecuteUbergraph_MobBase, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000050, "Member 'MobBase_C_ExecuteUbergraph_MobBase::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobBase_C_ExecuteUbergraph_MobBase, Temp_bool_True_if_break_was_hit_Variable) == 0x000051, "Member 'MobBase_C_ExecuteUbergraph_MobBase::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(MobBase_C_ExecuteUbergraph_MobBase, CallFunc_Not_PreBool_ReturnValue) == 0x000052, "Member 'MobBase_C_ExecuteUbergraph_MobBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobBase_C_ExecuteUbergraph_MobBase, CallFunc_BooleanAND_ReturnValue) == 0x000053, "Member 'MobBase_C_ExecuteUbergraph_MobBase::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function MobBase.MobBase_C.UserConstructionScript
// 0x0488 (0x0488 - 0x0000)
struct MobBase_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomChoice_OutID;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2899[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0048(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289A[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMobPartData_Skeletal                  CallFunc_GetDataTableRowFromName_OutRow;           // 0x0068(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289B[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadObjectBlocking_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289C[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289D[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_1;       // 0x00C0(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289E[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMobPartData_AnimationSet              CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x00E0(0x0068)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289F[0x6];                                     // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimSequence>           CallFunc_Array_Get_Item_2;                         // 0x0150(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A0[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadObjectBlocking_ReturnValue_1;         // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A1[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          K2Node_DynamicCast_AsAnim_Sequence;                // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A2[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSingleAnimationPlayData               K2Node_MakeStruct_SingleAnimationPlayData;         // 0x01A0(0x0018)(NoDestructor)
	class UObject*                                CallFunc_LoadObjectBlocking_ReturnValue_2;         // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A3[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A4[0x6];                                     // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadObjectBlocking_ReturnValue_3;         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A5[0x6];                                     // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh_1;                // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A6[0x2];                                     // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomChoice_OutID_1;                     // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A7[0x2];                                     // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A8[0x2];                                     // 0x020A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_2;       // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A9[0x5];                                     // 0x0213(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_2;       // 0x0218(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_3;                         // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28AA[0x4];                                     // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMobPartData_Static                    CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0238(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28AB[0x6];                                     // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadObjectBlocking_ReturnValue_4;         // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomChoice_OutID_2;                     // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28AC[0x3];                                     // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh_2;                // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x028A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28AD[0x1];                                     // 0x028B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomChoice_OutID_3;                     // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomChoice_OutID_4;                     // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomChoice_OutID_5;                     // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28AE[0x4];                                     // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_DMIRandomColor_OutDMI;                    // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_DMIRandomColor_OutColor;                  // 0x02E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_3;       // 0x02F0(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_4;                         // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28AF[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMobPartData_Skeletal                  CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x0310(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_3;    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28B0[0x6];                                     // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadObjectBlocking_ReturnValue_5;         // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28B1[0x7];                                     // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_1;              // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28B2[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_4;       // 0x0368(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_5;                         // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28B3[0x4];                                     // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMobPartData_Skeletal                  CallFunc_GetDataTableRowFromName_OutRow_4;         // 0x0388(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_4;    // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28B4[0x6];                                     // 0x03BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadObjectBlocking_ReturnValue_6;         // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_6;          // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28B5[0x7];                                     // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_2;              // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28B6[0x7];                                     // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_5;       // 0x03E0(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_6;                         // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28B7[0x4];                                     // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMobPartData_Skeletal                  CallFunc_GetDataTableRowFromName_OutRow_5;         // 0x0400(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_5;    // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28B8[0x6];                                     // 0x0432(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadObjectBlocking_ReturnValue_7;         // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_DMIRandomColor_OutDMI_1;                  // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_DMIRandomColor_OutColor_1;                // 0x0448(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_3;              // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_7;          // 0x0461(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28B9[0x6];                                     // 0x0462(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_DMIRandomColor_OutDMI_2;                  // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_DMIRandomColor_OutColor_2;                // 0x0470(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MobBase_C_UserConstructionScript) == 0x000008, "Wrong alignment on MobBase_C_UserConstructionScript");
static_assert(sizeof(MobBase_C_UserConstructionScript) == 0x000488, "Wrong size on MobBase_C_UserConstructionScript");
static_assert(offsetof(MobBase_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'MobBase_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'MobBase_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, Temp_int_Loop_Counter_Variable_1) == 0x000008, "Member 'MobBase_C_UserConstructionScript::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x00000C, "Member 'MobBase_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000010, "Member 'MobBase_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, Temp_int_Loop_Counter_Variable_2) == 0x000014, "Member 'MobBase_C_UserConstructionScript::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_2) == 0x000018, "Member 'MobBase_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'MobBase_C_UserConstructionScript::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, Temp_int_Loop_Counter_Variable_3) == 0x000020, "Member 'MobBase_C_UserConstructionScript::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_3) == 0x000024, "Member 'MobBase_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, Temp_int_Array_Index_Variable_2) == 0x000028, "Member 'MobBase_C_UserConstructionScript::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, Temp_int_Array_Index_Variable_3) == 0x00002C, "Member 'MobBase_C_UserConstructionScript::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, Temp_int_Array_Index_Variable_4) == 0x000030, "Member 'MobBase_C_UserConstructionScript::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, Temp_int_Loop_Counter_Variable_4) == 0x000034, "Member 'MobBase_C_UserConstructionScript::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_4) == 0x000038, "Member 'MobBase_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, Temp_int_Array_Index_Variable_5) == 0x00003C, "Member 'MobBase_C_UserConstructionScript::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_RandomChoice_OutID) == 0x000040, "Member 'MobBase_C_UserConstructionScript::CallFunc_RandomChoice_OutID' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000048, "Member 'MobBase_C_UserConstructionScript::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000058, "Member 'MobBase_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'MobBase_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_GetDataTableRowFromName_OutRow) == 0x000068, "Member 'MobBase_C_UserConstructionScript::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000098, "Member 'MobBase_C_UserConstructionScript::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_LoadObjectBlocking_ReturnValue) == 0x0000A0, "Member 'MobBase_C_UserConstructionScript::CallFunc_LoadObjectBlocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'MobBase_C_UserConstructionScript::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x0000B0, "Member 'MobBase_C_UserConstructionScript::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'MobBase_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_GetDataTableRowNames_OutRowNames_1) == 0x0000C0, "Member 'MobBase_C_UserConstructionScript::CallFunc_GetDataTableRowNames_OutRowNames_1' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Array_Get_Item_1) == 0x0000D0, "Member 'MobBase_C_UserConstructionScript::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_1) == 0x0000D8, "Member 'MobBase_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0000E0, "Member 'MobBase_C_UserConstructionScript::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000148, "Member 'MobBase_C_UserConstructionScript::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000149, "Member 'MobBase_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Array_Get_Item_2) == 0x000150, "Member 'MobBase_C_UserConstructionScript::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000178, "Member 'MobBase_C_UserConstructionScript::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_LoadObjectBlocking_ReturnValue_1) == 0x000180, "Member 'MobBase_C_UserConstructionScript::CallFunc_LoadObjectBlocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000188, "Member 'MobBase_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, K2Node_DynamicCast_AsAnim_Sequence) == 0x000190, "Member 'MobBase_C_UserConstructionScript::K2Node_DynamicCast_AsAnim_Sequence' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, K2Node_DynamicCast_bSuccess_1) == 0x000198, "Member 'MobBase_C_UserConstructionScript::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, K2Node_MakeStruct_SingleAnimationPlayData) == 0x0001A0, "Member 'MobBase_C_UserConstructionScript::K2Node_MakeStruct_SingleAnimationPlayData' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_LoadObjectBlocking_ReturnValue_2) == 0x0001B8, "Member 'MobBase_C_UserConstructionScript::CallFunc_LoadObjectBlocking_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x0001C0, "Member 'MobBase_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, K2Node_DynamicCast_AsStatic_Mesh) == 0x0001C8, "Member 'MobBase_C_UserConstructionScript::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, K2Node_DynamicCast_bSuccess_2) == 0x0001D0, "Member 'MobBase_C_UserConstructionScript::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x0001D1, "Member 'MobBase_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_LoadObjectBlocking_ReturnValue_3) == 0x0001D8, "Member 'MobBase_C_UserConstructionScript::CallFunc_LoadObjectBlocking_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0001E0, "Member 'MobBase_C_UserConstructionScript::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_2) == 0x0001E1, "Member 'MobBase_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, K2Node_DynamicCast_AsStatic_Mesh_1) == 0x0001E8, "Member 'MobBase_C_UserConstructionScript::K2Node_DynamicCast_AsStatic_Mesh_1' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, K2Node_DynamicCast_bSuccess_3) == 0x0001F0, "Member 'MobBase_C_UserConstructionScript::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_1) == 0x0001F1, "Member 'MobBase_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_RandomChoice_OutID_1) == 0x0001F4, "Member 'MobBase_C_UserConstructionScript::CallFunc_RandomChoice_OutID_1' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0001F8, "Member 'MobBase_C_UserConstructionScript::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_BooleanOR_ReturnValue) == 0x0001F9, "Member 'MobBase_C_UserConstructionScript::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, Temp_int_Loop_Counter_Variable_5) == 0x0001FC, "Member 'MobBase_C_UserConstructionScript::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_5) == 0x000200, "Member 'MobBase_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_6) == 0x000204, "Member 'MobBase_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue_1) == 0x000208, "Member 'MobBase_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000209, "Member 'MobBase_C_UserConstructionScript::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_7) == 0x00020C, "Member 'MobBase_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000210, "Member 'MobBase_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000211, "Member 'MobBase_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue_2) == 0x000212, "Member 'MobBase_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_GetDataTableRowNames_OutRowNames_2) == 0x000218, "Member 'MobBase_C_UserConstructionScript::CallFunc_GetDataTableRowNames_OutRowNames_2' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Array_Get_Item_3) == 0x000228, "Member 'MobBase_C_UserConstructionScript::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_2) == 0x000230, "Member 'MobBase_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x000238, "Member 'MobBase_C_UserConstructionScript::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_GetDataTableRowFromName_ReturnValue_2) == 0x000268, "Member 'MobBase_C_UserConstructionScript::CallFunc_GetDataTableRowFromName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue_2) == 0x000269, "Member 'MobBase_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_LoadObjectBlocking_ReturnValue_4) == 0x000270, "Member 'MobBase_C_UserConstructionScript::CallFunc_LoadObjectBlocking_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_RandomChoice_OutID_2) == 0x000278, "Member 'MobBase_C_UserConstructionScript::CallFunc_RandomChoice_OutID_2' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_3) == 0x00027C, "Member 'MobBase_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, K2Node_DynamicCast_AsStatic_Mesh_2) == 0x000280, "Member 'MobBase_C_UserConstructionScript::K2Node_DynamicCast_AsStatic_Mesh_2' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, K2Node_DynamicCast_bSuccess_4) == 0x000288, "Member 'MobBase_C_UserConstructionScript::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x000289, "Member 'MobBase_C_UserConstructionScript::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_2) == 0x00028A, "Member 'MobBase_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x00028C, "Member 'MobBase_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue) == 0x000298, "Member 'MobBase_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00029C, "Member 'MobBase_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x0002A0, "Member 'MobBase_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue) == 0x0002A4, "Member 'MobBase_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0002A8, "Member 'MobBase_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x0002AC, "Member 'MobBase_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0002B0, "Member 'MobBase_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x0002B4, "Member 'MobBase_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue_5) == 0x0002B8, "Member 'MobBase_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0002BC, "Member 'MobBase_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_RandomChoice_OutID_3) == 0x0002C0, "Member 'MobBase_C_UserConstructionScript::CallFunc_RandomChoice_OutID_3' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x0002C4, "Member 'MobBase_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0002C8, "Member 'MobBase_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_RandomChoice_OutID_4) == 0x0002CC, "Member 'MobBase_C_UserConstructionScript::CallFunc_RandomChoice_OutID_4' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_RandomChoice_OutID_5) == 0x0002D0, "Member 'MobBase_C_UserConstructionScript::CallFunc_RandomChoice_OutID_5' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_DMIRandomColor_OutDMI) == 0x0002D8, "Member 'MobBase_C_UserConstructionScript::CallFunc_DMIRandomColor_OutDMI' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_DMIRandomColor_OutColor) == 0x0002E0, "Member 'MobBase_C_UserConstructionScript::CallFunc_DMIRandomColor_OutColor' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_GetDataTableRowNames_OutRowNames_3) == 0x0002F0, "Member 'MobBase_C_UserConstructionScript::CallFunc_GetDataTableRowNames_OutRowNames_3' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Array_Get_Item_4) == 0x000300, "Member 'MobBase_C_UserConstructionScript::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_3) == 0x000308, "Member 'MobBase_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_GetDataTableRowFromName_OutRow_3) == 0x000310, "Member 'MobBase_C_UserConstructionScript::CallFunc_GetDataTableRowFromName_OutRow_3' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_GetDataTableRowFromName_ReturnValue_3) == 0x000340, "Member 'MobBase_C_UserConstructionScript::CallFunc_GetDataTableRowFromName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue_3) == 0x000341, "Member 'MobBase_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_LoadObjectBlocking_ReturnValue_5) == 0x000348, "Member 'MobBase_C_UserConstructionScript::CallFunc_LoadObjectBlocking_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_EqualEqual_IntInt_ReturnValue_5) == 0x000350, "Member 'MobBase_C_UserConstructionScript::CallFunc_EqualEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, K2Node_DynamicCast_AsSkeletal_Mesh_1) == 0x000358, "Member 'MobBase_C_UserConstructionScript::K2Node_DynamicCast_AsSkeletal_Mesh_1' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, K2Node_DynamicCast_bSuccess_5) == 0x000360, "Member 'MobBase_C_UserConstructionScript::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_GetDataTableRowNames_OutRowNames_4) == 0x000368, "Member 'MobBase_C_UserConstructionScript::CallFunc_GetDataTableRowNames_OutRowNames_4' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Array_Get_Item_5) == 0x000378, "Member 'MobBase_C_UserConstructionScript::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_4) == 0x000380, "Member 'MobBase_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_GetDataTableRowFromName_OutRow_4) == 0x000388, "Member 'MobBase_C_UserConstructionScript::CallFunc_GetDataTableRowFromName_OutRow_4' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_GetDataTableRowFromName_ReturnValue_4) == 0x0003B8, "Member 'MobBase_C_UserConstructionScript::CallFunc_GetDataTableRowFromName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue_4) == 0x0003B9, "Member 'MobBase_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_LoadObjectBlocking_ReturnValue_6) == 0x0003C0, "Member 'MobBase_C_UserConstructionScript::CallFunc_LoadObjectBlocking_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_EqualEqual_IntInt_ReturnValue_6) == 0x0003C8, "Member 'MobBase_C_UserConstructionScript::CallFunc_EqualEqual_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, K2Node_DynamicCast_AsSkeletal_Mesh_2) == 0x0003D0, "Member 'MobBase_C_UserConstructionScript::K2Node_DynamicCast_AsSkeletal_Mesh_2' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, K2Node_DynamicCast_bSuccess_6) == 0x0003D8, "Member 'MobBase_C_UserConstructionScript::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_GetDataTableRowNames_OutRowNames_5) == 0x0003E0, "Member 'MobBase_C_UserConstructionScript::CallFunc_GetDataTableRowNames_OutRowNames_5' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Array_Get_Item_6) == 0x0003F0, "Member 'MobBase_C_UserConstructionScript::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_5) == 0x0003F8, "Member 'MobBase_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_GetDataTableRowFromName_OutRow_5) == 0x000400, "Member 'MobBase_C_UserConstructionScript::CallFunc_GetDataTableRowFromName_OutRow_5' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_GetDataTableRowFromName_ReturnValue_5) == 0x000430, "Member 'MobBase_C_UserConstructionScript::CallFunc_GetDataTableRowFromName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue_5) == 0x000431, "Member 'MobBase_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MobBase_C_UserConstructionScript, CallFunc_LoadObjectBlocking_ReturnValue_7) == 0x000438, "Member 'MobBase_C_UserConstructionScript::CallFunc_LoadObjectBlocking_ReturnValue_7' has a wrong offset!");
