#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MP_HangingRock_a

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MP_HangingRock_a.MP_HangingRock_a_C.SetMinimapIconTableRow
// 0x0148 (0x0148 - 0x0000)
struct MP_HangingRock_a_C_SetMinimapIconTableRow final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B18[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMinimapIconTableRow                   OutRow;                                            // 0x0008(0x0058)(Parm, OutParm)
	bool                                          NeedToAddMore;                                     // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B19[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMinimapIconTableRow                   K2Node_MakeStruct_MinimapIconTableRow;             // 0x0068(0x0058)()
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAreaID_ReturnValue;                    // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMapID_ReturnValue;                     // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMinimapIconTableRow                   K2Node_MakeStruct_MinimapIconTableRow_1;           // 0x00F0(0x0058)()
};
static_assert(alignof(MP_HangingRock_a_C_SetMinimapIconTableRow) == 0x000008, "Wrong alignment on MP_HangingRock_a_C_SetMinimapIconTableRow");
static_assert(sizeof(MP_HangingRock_a_C_SetMinimapIconTableRow) == 0x000148, "Wrong size on MP_HangingRock_a_C_SetMinimapIconTableRow");
static_assert(offsetof(MP_HangingRock_a_C_SetMinimapIconTableRow, Param_Index) == 0x000000, "Member 'MP_HangingRock_a_C_SetMinimapIconTableRow::Param_Index' has a wrong offset!");
static_assert(offsetof(MP_HangingRock_a_C_SetMinimapIconTableRow, OutRow) == 0x000008, "Member 'MP_HangingRock_a_C_SetMinimapIconTableRow::OutRow' has a wrong offset!");
static_assert(offsetof(MP_HangingRock_a_C_SetMinimapIconTableRow, NeedToAddMore) == 0x000060, "Member 'MP_HangingRock_a_C_SetMinimapIconTableRow::NeedToAddMore' has a wrong offset!");
static_assert(offsetof(MP_HangingRock_a_C_SetMinimapIconTableRow, K2Node_MakeStruct_MinimapIconTableRow) == 0x000068, "Member 'MP_HangingRock_a_C_SetMinimapIconTableRow::K2Node_MakeStruct_MinimapIconTableRow' has a wrong offset!");
static_assert(offsetof(MP_HangingRock_a_C_SetMinimapIconTableRow, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000C0, "Member 'MP_HangingRock_a_C_SetMinimapIconTableRow::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_HangingRock_a_C_SetMinimapIconTableRow, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000CC, "Member 'MP_HangingRock_a_C_SetMinimapIconTableRow::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_HangingRock_a_C_SetMinimapIconTableRow, CallFunc_BreakRotator_Roll) == 0x0000D8, "Member 'MP_HangingRock_a_C_SetMinimapIconTableRow::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(MP_HangingRock_a_C_SetMinimapIconTableRow, CallFunc_BreakRotator_Pitch) == 0x0000DC, "Member 'MP_HangingRock_a_C_SetMinimapIconTableRow::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(MP_HangingRock_a_C_SetMinimapIconTableRow, CallFunc_BreakRotator_Yaw) == 0x0000E0, "Member 'MP_HangingRock_a_C_SetMinimapIconTableRow::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(MP_HangingRock_a_C_SetMinimapIconTableRow, CallFunc_GetAreaID_ReturnValue) == 0x0000E4, "Member 'MP_HangingRock_a_C_SetMinimapIconTableRow::CallFunc_GetAreaID_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_HangingRock_a_C_SetMinimapIconTableRow, CallFunc_FTrunc_ReturnValue) == 0x0000E8, "Member 'MP_HangingRock_a_C_SetMinimapIconTableRow::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_HangingRock_a_C_SetMinimapIconTableRow, CallFunc_GetMapID_ReturnValue) == 0x0000EC, "Member 'MP_HangingRock_a_C_SetMinimapIconTableRow::CallFunc_GetMapID_ReturnValue' has a wrong offset!");
static_assert(offsetof(MP_HangingRock_a_C_SetMinimapIconTableRow, K2Node_MakeStruct_MinimapIconTableRow_1) == 0x0000F0, "Member 'MP_HangingRock_a_C_SetMinimapIconTableRow::K2Node_MakeStruct_MinimapIconTableRow_1' has a wrong offset!");

}

