#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MP_TraficSignH_L

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MP_TraficSignH_L.MP_TraficSignH_L_C
// 0x0020 (0x0240 - 0x0220)
class AMP_TraficSignH_L_C final : public AActor
{
public:
	class UDecalComponent*                        Decal;                                             // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_STRUCT_13_annnaiA;                              // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Texture_LinerGrayscale_;                           // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MP_TraficSignH_L_C">();
	}
	static class AMP_TraficSignH_L_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMP_TraficSignH_L_C>();
	}
};
static_assert(alignof(AMP_TraficSignH_L_C) == 0x000008, "Wrong alignment on AMP_TraficSignH_L_C");
static_assert(sizeof(AMP_TraficSignH_L_C) == 0x000240, "Wrong size on AMP_TraficSignH_L_C");
static_assert(offsetof(AMP_TraficSignH_L_C, Decal) == 0x000220, "Member 'AMP_TraficSignH_L_C::Decal' has a wrong offset!");
static_assert(offsetof(AMP_TraficSignH_L_C, SM_STRUCT_13_annnaiA) == 0x000228, "Member 'AMP_TraficSignH_L_C::SM_STRUCT_13_annnaiA' has a wrong offset!");
static_assert(offsetof(AMP_TraficSignH_L_C, DefaultSceneRoot) == 0x000230, "Member 'AMP_TraficSignH_L_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AMP_TraficSignH_L_C, Texture_LinerGrayscale_) == 0x000238, "Member 'AMP_TraficSignH_L_C::Texture_LinerGrayscale_' has a wrong offset!");

}

