#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NkmPlaceInFieldActor

#include "Basic.hpp"

#include "ST_DevilPostData_structs.hpp"
#include "E_PLAYER_MANAGER_TYPE_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"
#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK::Params
{

// Function NkmPlaceInFieldActor.NkmPlaceInFieldActor_C.ExecuteUbergraph_NkmPlaceInFieldActor
// 0x0670 (0x0670 - 0x0000)
struct NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AF7[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0010(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0014(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x001C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AF8[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AF9[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AFA[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<uint8>                                 CallFunc_GetNkmBattleUnitList_ReturnValue;         // 0x0050(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AFB[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AFC[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerBase_C*                          CallFunc_GetActivePlayer_Player;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_PLAYER_MANAGER_TYPE                         CallFunc_GetActivePlayer_E_Type;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AFD[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AFE[0x2];                                     // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AFF[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B00[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaBase_C*                           CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Array_Get_Item_2;                         // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B01[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> CallFunc_BI_SetAllVisibility_self_CastInput;       // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_SetAllVisibility_NoUse;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B02[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B03[0x5];                                     // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNkmData                               CallFunc_GetNkmData_ReturnValue;                   // 0x00D0(0x0120)(ConstParm)
	TScriptInterface<class IBPI_CharaBaseAccessor_C> CallFunc_BI_SetAllVisibility_self_CastInput_1;     // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BI_SetAllVisibility_NoUse_1;              // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B04[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_DevilPostData                      CallFunc_GetDevilPostData_PostData;                // 0x0208(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B05[0x4];                                     // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBattleUnitPlaceOne                    K2Node_MakeStruct_BattleUnitPlaceOne;              // 0x0230(0x0028)()
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B06[0x3];                                     // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B07[0xF];                                     // 0x0271(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0280(0x0030)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_3;                         // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B08[0x4];                                     // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapDevilSpawner_C*                     CallFunc_FinishSpawningActor_ReturnValue;          // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x02F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x02FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TraceGround_Hit;                          // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B09[0x3];                                     // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_TraceGround_Location;                     // 0x0318(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TraceGround_Normal;                       // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_TraceGround_Surface;                      // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B0A[0xF];                                     // 0x0331(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0340(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0370(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x037C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0388(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0394(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_Map_Find_Value;                           // 0x03A0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B0B[0x3];                                     // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x03D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x03E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x03EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B0C[0x8];                                     // 0x03F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Map_Find_Value_1;                         // 0x0400(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B0D[0x3];                                     // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0434(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x04BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B0E[0x3];                                     // 0x04BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x04C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x04CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x04D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B0F[0x4];                                     // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerBase_C*                          CallFunc_GetActivePlayer_Player_1;                 // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_PLAYER_MANAGER_TYPE                         CallFunc_GetActivePlayer_E_Type_1;                 // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B10[0x3];                                     // 0x04F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x04F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_3;                // 0x0500(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_3;                // 0x050C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_3;                   // 0x0518(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistance_ReturnValue;                  // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0528(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B11[0xC];                                     // 0x0534(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Map_Find_Value_2;                         // 0x0540(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B12[0x3];                                     // 0x0571(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistance_ReturnValue_1;                // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_4;                // 0x0578(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_4;                // 0x0584(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_4;                   // 0x0590(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x059C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x059D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B13[0x2];                                     // 0x059E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Find_Look_at_Rotation_with_UpVec_Fix_ReturnValue; // 0x05A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue_1;           // 0x05AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x05B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Find_Look_at_Rotation_with_UpVec_Fix_ReturnValue_1; // 0x05C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               K2Node_Select_Default;                             // 0x05D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMotionFinished_retValue;                // 0x05DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x05DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B14[0x2];                                     // 0x05DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x05E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x05E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x05E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B15[0x1];                                     // 0x05E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x05E8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_1;        // 0x05F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B16[0x6];                                     // 0x05FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_4;                         // 0x0600(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x060C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B17[0x3];                                     // 0x060D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEventFlag_ReturnValue;               // 0x0614(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEventFlag_ReturnValue_1;             // 0x0615(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B18[0x2];                                     // 0x0616(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x0618(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x061C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B19[0x3];                                     // 0x061D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0620(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMapDevilSpawner_C*                     CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMapDevilSpawner_C*                     CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor) == 0x000010, "Wrong alignment on NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor");
static_assert(sizeof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor) == 0x000670, "Wrong size on NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, EntryPoint) == 0x000000, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, Temp_int_Variable) == 0x000004, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, Temp_bool_Variable) == 0x000008, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, Temp_int_Variable_1) == 0x00000C, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, Temp_int_Variable_2) == 0x000010, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, Temp_int_Variable_3) == 0x000014, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, Temp_int_Variable_4) == 0x000018, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, Temp_int_Variable_5) == 0x00001C, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, Temp_bool_Has_Been_Initd_Variable) == 0x000020, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, Temp_bool_IsClosed_Variable) == 0x000028, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, Temp_int_Loop_Counter_Variable_1) == 0x000030, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, Temp_int_Array_Index_Variable) == 0x000038, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_MakeLiteralByte_ReturnValue) == 0x00003C, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, Temp_int_Array_Index_Variable_1) == 0x000040, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, Temp_int_Loop_Counter_Variable_2) == 0x000044, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Add_IntInt_ReturnValue_2) == 0x000048, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, Temp_int_Array_Index_Variable_2) == 0x00004C, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_GetNkmBattleUnitList_ReturnValue) == 0x000050, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_GetNkmBattleUnitList_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, Temp_int_Loop_Counter_Variable_3) == 0x000068, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Add_IntInt_ReturnValue_3) == 0x00006C, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000070, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, K2Node_Event_DeltaSeconds) == 0x000074, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_GetActivePlayer_Player) == 0x000078, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_GetActivePlayer_Player' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_GetActivePlayer_E_Type) == 0x000080, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_GetActivePlayer_E_Type' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Array_Get_Item) == 0x000084, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Greater_IntInt_ReturnValue) == 0x000088, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000089, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Array_Length_ReturnValue_1) == 0x00008C, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Less_IntInt_ReturnValue_1) == 0x000090, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Array_Length_ReturnValue_2) == 0x000094, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, Temp_int_Array_Index_Variable_3) == 0x000098, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Array_Get_Item_2) == 0x0000A8, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_BI_SetAllVisibility_self_CastInput) == 0x0000B0, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_BI_SetAllVisibility_self_CastInput' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_BI_SetAllVisibility_NoUse) == 0x0000C0, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_BI_SetAllVisibility_NoUse' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000C4, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x0000C8, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000C9, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000CA, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_GetNkmData_ReturnValue) == 0x0000D0, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_GetNkmData_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_BI_SetAllVisibility_self_CastInput_1) == 0x0001F0, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_BI_SetAllVisibility_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_BI_SetAllVisibility_NoUse_1) == 0x000200, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_BI_SetAllVisibility_NoUse_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_GetDevilPostData_PostData) == 0x000208, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_GetDevilPostData_PostData' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Array_Add_ReturnValue) == 0x000228, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, K2Node_MakeStruct_BattleUnitPlaceOne) == 0x000230, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::K2Node_MakeStruct_BattleUnitPlaceOne' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Array_Add_ReturnValue_1) == 0x000258, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Array_Length_ReturnValue_3) == 0x00025C, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Less_IntInt_ReturnValue_2) == 0x000260, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Array_Add_ReturnValue_2) == 0x000264, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Array_Length_ReturnValue_4) == 0x000268, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Array_Add_ReturnValue_3) == 0x00026C, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000270, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_MakeTransform_ReturnValue) == 0x000280, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Array_Get_Item_3) == 0x0002B0, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0002B8, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x0002C0, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_FinishSpawningActor_ReturnValue) == 0x0002D0, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_GetUpVector_ReturnValue) == 0x0002D8, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0002E4, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0002F0, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0002FC, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Add_VectorVector_ReturnValue) == 0x000308, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_TraceGround_Hit) == 0x000314, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_TraceGround_Hit' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_TraceGround_Location) == 0x000318, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_TraceGround_Location' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_TraceGround_Normal) == 0x000324, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_TraceGround_Normal' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_TraceGround_Surface) == 0x000330, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_TraceGround_Surface' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_MakeTransform_ReturnValue_1) == 0x000340, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_GetActorUpVector_ReturnValue) == 0x000370, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_BreakTransform_Location) == 0x00037C, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_BreakTransform_Rotation) == 0x000388, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_BreakTransform_Scale) == 0x000394, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Map_Find_Value) == 0x0003A0, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Map_Find_ReturnValue) == 0x0003D0, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_BreakTransform_Location_1) == 0x0003D4, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_BreakTransform_Rotation_1) == 0x0003E0, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_BreakTransform_Scale_1) == 0x0003EC, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Map_Find_Value_1) == 0x000400, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Map_Find_ReturnValue_1) == 0x000430, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000434, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0004BC, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_BreakTransform_Location_2) == 0x0004C0, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_BreakTransform_Location_2' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_BreakTransform_Rotation_2) == 0x0004CC, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_BreakTransform_Rotation_2' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_BreakTransform_Scale_2) == 0x0004D8, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_BreakTransform_Scale_2' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_GetActivePlayer_Player_1) == 0x0004E8, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_GetActivePlayer_Player_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_GetActivePlayer_E_Type_1) == 0x0004F0, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_GetActivePlayer_E_Type_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0004F4, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_BreakTransform_Location_3) == 0x000500, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_BreakTransform_Location_3' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_BreakTransform_Rotation_3) == 0x00050C, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_BreakTransform_Rotation_3' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_BreakTransform_Scale_3) == 0x000518, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_BreakTransform_Scale_3' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_GetDistance_ReturnValue) == 0x000524, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_GetDistance_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000528, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Map_Find_Value_2) == 0x000540, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Map_Find_ReturnValue_2) == 0x000570, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_GetDistance_ReturnValue_1) == 0x000574, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_GetDistance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_BreakTransform_Location_4) == 0x000578, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_BreakTransform_Location_4' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_BreakTransform_Rotation_4) == 0x000584, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_BreakTransform_Rotation_4' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_BreakTransform_Scale_4) == 0x000590, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_BreakTransform_Scale_4' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00059C, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Not_PreBool_ReturnValue) == 0x00059D, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Find_Look_at_Rotation_with_UpVec_Fix_ReturnValue) == 0x0005A0, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Find_Look_at_Rotation_with_UpVec_Fix_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_GetActorUpVector_ReturnValue_1) == 0x0005AC, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_GetActorUpVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0005B8, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Find_Look_at_Rotation_with_UpVec_Fix_ReturnValue_1) == 0x0005C4, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Find_Look_at_Rotation_with_UpVec_Fix_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, K2Node_Select_Default) == 0x0005D0, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_IsMotionFinished_retValue) == 0x0005DC, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_IsMotionFinished_retValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0005DD, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_Add_FloatFloat_ReturnValue) == 0x0005E0, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0005E4, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0005E5, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, CallFunc_BooleanOR_ReturnValue) == 0x0005E6, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor, K2Node_CreateDelegate_OutputDelegate) == 0x0005E8, "Member 'NkmPlaceInFieldActor_C_ExecuteUbergraph_NkmPlaceInFieldActor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
