#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Npc631PartData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Npc631PartData.Npc631PartData
// 0x0070 (0x0070 - 0x0000)
struct FNpc631PartData final
{
public:
	int32                                         ID_6_01563B2548D70C81A0C79AB150A1F723;             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94EE[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USkeletalMesh>           Mesh_7_1261914F49BB68102E2816980A90D822;           // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          Light_10_D6F9421444BA004DD1A515A130AF738D;         // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94EF[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   LightSocket_12_5DD2E1EC428AB1B6CE4E99BF42940375;   // 0x0034(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94F0[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UParticleSystem>         Effect_20_042B7C664A24F73BE09D7C84485484C0;        // 0x0040(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   EffectSocket_17_0A09555043165E4FF804A6AF37EAB1D4;  // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FNpc631PartData) == 0x000008, "Wrong alignment on FNpc631PartData");
static_assert(sizeof(FNpc631PartData) == 0x000070, "Wrong size on FNpc631PartData");
static_assert(offsetof(FNpc631PartData, ID_6_01563B2548D70C81A0C79AB150A1F723) == 0x000000, "Member 'FNpc631PartData::ID_6_01563B2548D70C81A0C79AB150A1F723' has a wrong offset!");
static_assert(offsetof(FNpc631PartData, Mesh_7_1261914F49BB68102E2816980A90D822) == 0x000008, "Member 'FNpc631PartData::Mesh_7_1261914F49BB68102E2816980A90D822' has a wrong offset!");
static_assert(offsetof(FNpc631PartData, Light_10_D6F9421444BA004DD1A515A130AF738D) == 0x000030, "Member 'FNpc631PartData::Light_10_D6F9421444BA004DD1A515A130AF738D' has a wrong offset!");
static_assert(offsetof(FNpc631PartData, LightSocket_12_5DD2E1EC428AB1B6CE4E99BF42940375) == 0x000034, "Member 'FNpc631PartData::LightSocket_12_5DD2E1EC428AB1B6CE4E99BF42940375' has a wrong offset!");
static_assert(offsetof(FNpc631PartData, Effect_20_042B7C664A24F73BE09D7C84485484C0) == 0x000040, "Member 'FNpc631PartData::Effect_20_042B7C664A24F73BE09D7C84485484C0' has a wrong offset!");
static_assert(offsetof(FNpc631PartData, EffectSocket_17_0A09555043165E4FF804A6AF37EAB1D4) == 0x000068, "Member 'FNpc631PartData::EffectSocket_17_0A09555043165E4FF804A6AF37EAB1D4' has a wrong offset!");

}

