#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Npc615

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DevilBase_classes.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Npc615.Npc615_C
// 0x0048 (0x0A98 - 0x0A50)
class ANpc615_C final : public ADevilBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Npc615_C;                           // 0x0A50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCharaRotateComponent_C*                Rotate;                                            // 0x0A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaFaceComponent*                    Face;                                              // 0x0A60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaStepSmootherComponent_C*          StepSmoother;                                      // 0x0A68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaEyeComponent_C*                   RightEye;                                          // 0x0A70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaEyeComponent_C*                   LeftEye;                                           // 0x0A78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaHeadComponent_C*                  Head;                                              // 0x0A80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaLegComponent_C*                   RightLeg;                                          // 0x0A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharaLegComponent_C*                   LeftLeg;                                           // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Npc615(int32 EntryPoint);
	void PlaySpeakingMotion();
	void BndEvt__DevilMovement_K2Node_ComponentBoundEvent_0_CharaMovementUpdatedSignature__DelegateSignature();
	void ReceiveBeginPlay();

	EGazeTargetType GetGazeTargetType() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Npc615_C">();
	}
	static class ANpc615_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANpc615_C>();
	}
};
static_assert(alignof(ANpc615_C) == 0x000008, "Wrong alignment on ANpc615_C");
static_assert(sizeof(ANpc615_C) == 0x000A98, "Wrong size on ANpc615_C");
static_assert(offsetof(ANpc615_C, UberGraphFrame_Npc615_C) == 0x000A50, "Member 'ANpc615_C::UberGraphFrame_Npc615_C' has a wrong offset!");
static_assert(offsetof(ANpc615_C, Rotate) == 0x000A58, "Member 'ANpc615_C::Rotate' has a wrong offset!");
static_assert(offsetof(ANpc615_C, Face) == 0x000A60, "Member 'ANpc615_C::Face' has a wrong offset!");
static_assert(offsetof(ANpc615_C, StepSmoother) == 0x000A68, "Member 'ANpc615_C::StepSmoother' has a wrong offset!");
static_assert(offsetof(ANpc615_C, RightEye) == 0x000A70, "Member 'ANpc615_C::RightEye' has a wrong offset!");
static_assert(offsetof(ANpc615_C, LeftEye) == 0x000A78, "Member 'ANpc615_C::LeftEye' has a wrong offset!");
static_assert(offsetof(ANpc615_C, Head) == 0x000A80, "Member 'ANpc615_C::Head' has a wrong offset!");
static_assert(offsetof(ANpc615_C, RightLeg) == 0x000A88, "Member 'ANpc615_C::RightLeg' has a wrong offset!");
static_assert(offsetof(ANpc615_C, LeftLeg) == 0x000A90, "Member 'ANpc615_C::LeftLeg' has a wrong offset!");

}

