#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Npc631AnimData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Npc631AnimData.Npc631AnimData
// 0x0038 (0x0038 - 0x0000)
struct FNpc631AnimData final
{
public:
	int32                                         ID_3_7D63470D4A184A05F386489266EEEA25;             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94F1[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimSequence>           Anim_5_BCD9770B43D20500CB7FB0BC81582A08;           // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          UseWhenTalking_9_CA08E46D44AB79B2AFE1B69AB9BBC8F0; // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HeadIK_WhenTalk_14_6A4787954F6868516BC5D6B11BB48CAD; // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LegIK_13_A4DD6ACA4E248E82B3973986653DB918;         // 0x0032(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FNpc631AnimData) == 0x000008, "Wrong alignment on FNpc631AnimData");
static_assert(sizeof(FNpc631AnimData) == 0x000038, "Wrong size on FNpc631AnimData");
static_assert(offsetof(FNpc631AnimData, ID_3_7D63470D4A184A05F386489266EEEA25) == 0x000000, "Member 'FNpc631AnimData::ID_3_7D63470D4A184A05F386489266EEEA25' has a wrong offset!");
static_assert(offsetof(FNpc631AnimData, Anim_5_BCD9770B43D20500CB7FB0BC81582A08) == 0x000008, "Member 'FNpc631AnimData::Anim_5_BCD9770B43D20500CB7FB0BC81582A08' has a wrong offset!");
static_assert(offsetof(FNpc631AnimData, UseWhenTalking_9_CA08E46D44AB79B2AFE1B69AB9BBC8F0) == 0x000030, "Member 'FNpc631AnimData::UseWhenTalking_9_CA08E46D44AB79B2AFE1B69AB9BBC8F0' has a wrong offset!");
static_assert(offsetof(FNpc631AnimData, HeadIK_WhenTalk_14_6A4787954F6868516BC5D6B11BB48CAD) == 0x000031, "Member 'FNpc631AnimData::HeadIK_WhenTalk_14_6A4787954F6868516BC5D6B11BB48CAD' has a wrong offset!");
static_assert(offsetof(FNpc631AnimData, LegIK_13_A4DD6ACA4E248E82B3973986653DB918) == 0x000032, "Member 'FNpc631AnimData::LegIK_13_A4DD6ACA4E248E82B3973986653DB918' has a wrong offset!");

}

