#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Npc631_AnimBP_slim

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Npc631_AnimBP_slim.Npc631_AnimBP_slim_C
// 0x10D0 (0x1390 - 0x02C0)
class UNpc631_AnimBP_slim_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3640[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x02C8(0x0020)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_1;                          // 0x02E8(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x03D8(0x00F0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x04C8(0x0108)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0x05D0(0x01E0)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x07B0(0x01E0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0990(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0A98(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0BA0(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0CA8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0CC8(0x0030)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x0CF8(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0DA8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0DF0(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0E70(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0FC8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0FF0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1018(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1098(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x10C8(0x00B0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x1178(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1240(0x0080)()
	E_CHARA_ANIMATION_MODE                        ModeCurrent;                                       // 0x12C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	E_CHARA_ANIMATION_MODE                        ModePrevious;                                      // 0x12C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_3641[0x2];                                     // 0x12C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ModeBlendTime;                                     // 0x12C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UAnimSequenceBase*                      DefaultAnimation;                                  // 0x12C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RootOffsetEnable;                                  // 0x12D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RootOffset;                                        // 0x12D4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LegIKEnable;                                       // 0x12E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3642[0x3];                                     // 0x12E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LegIKAlphaLeft;                                    // 0x12E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FVector                                LeftLegIKEffectorLocation;                         // 0x12E8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RightLegIKEffectorLocation;                        // 0x12F4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LeftLegIKTargetLocation;                           // 0x1300(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RightLegIKTargetLocation;                          // 0x130C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LeftLegIKEffectorRotation;                         // 0x1318(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               RightLegIKEffectorRotation;                        // 0x1324(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HeadIKEnable;                                      // 0x1330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3643[0x3];                                     // 0x1331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HeadIKAlpha;                                       // 0x1334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FRotator                               HeadIKRotation;                                    // 0x1338(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EyeIKEnable;                                       // 0x1344(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3644[0x3];                                     // 0x1345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EyeIKAlpha;                                        // 0x1348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FRotator                               LeftEyeIKRotation;                                 // 0x134C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               RightEyeIKRotation;                                // 0x1358(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               RootDeltaRotation;                                 // 0x1364(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          LookAtEnable;                                      // 0x1370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3645[0x7];                                     // 0x1371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      MumbleAnimation;                                   // 0x1378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MumbleEnable;                                      // 0x1380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3646[0x3];                                     // 0x1381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MumbleAlpha;                                       // 0x1384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          LegInvalidIKLeft;                                  // 0x1388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          LegInvalidIKRight;                                 // 0x1389(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3647[0x2];                                     // 0x138A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LegIKAlphaRight;                                   // 0x138C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void SetHeadIKInterpSpeed(float NewSpeed);
	void ChangeTwistAsset(int32 Param_Index);
	void InvalidLookAt(bool Invalid);
	void SetHeadIKRotationTick(int32 Param_Index, const struct FRotator& Rotation, float DeltaTime);
	void SetWorldOffsetBoneTranses(const TArray<struct FTransform>& Transes, const TArray<float>& TransAlphas);
	void SetEnableBoneTrans(bool IsEnable);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintInitializeAnimation();
	void BlueprintPostEvaluateAnimation();
	void SetRootOffset(const struct FVector& Offset, const struct FRotator& DeltaRotation);
	void SetLegIKEffector(int32 Param_Index, const struct FVector& Location, const struct FRotator& DeltaRotation);
	void SetLegIKTarget(int32 Param_Index, const struct FVector& Location);
	void SetHeadIKRotation(int32 Param_Index, const struct FRotator& Rotation);
	void SetEyeIKRotation(int32 Param_Index, const struct FRotator& Rotation);
	void SetAnimationMode(E_CHARA_ANIMATION_MODE Mode, float BlendTime);
	void SetRootOffsetEnable(bool Enable);
	void SetLegIKEnable(bool Enable, bool Immediately);
	void SetHeadIKEnable(bool Enable, bool Immediately);
	void SetEyeIKEnable(bool Enable, bool Immediately);
	void SetPrimaryWorldOffsetBoneTrans(const struct FTransform& Trans, float BlendAlpha);
	void SetFloatingIKPerch(float Alpha);
	void SetBodyIKEnable(bool Enable, bool Immediately);
	void SetBoneMotionEnable(bool Enable);
	void SetDefaultAnimation(class UAnimSequenceBase* Animation);
	void SetLookAtEnable(bool Enable);
	void SetMumbleAnimation(class UAnimSequenceBase* Animation);
	void SetMumbleEnable(bool Enable);
	void SetPoseWeightTable(class UCustomPoseWeightTable* PoseWeightTable);
	void SetInvalidLegIK(bool Invalid, int32 Param_Index);
	void ExecuteUbergraph_Npc631_AnimBP_slim(int32 EntryPoint);

	class UAnimSequenceBase* GetMumbleAnimation() const;
	void GetAnimationMode(E_CHARA_ANIMATION_MODE* Param_ModeCurrent, E_CHARA_ANIMATION_MODE* Param_ModePrevious) const;
	class UAnimSequenceBase* GetDefaultAnimation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Npc631_AnimBP_slim_C">();
	}
	static class UNpc631_AnimBP_slim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNpc631_AnimBP_slim_C>();
	}
};
static_assert(alignof(UNpc631_AnimBP_slim_C) == 0x000010, "Wrong alignment on UNpc631_AnimBP_slim_C");
static_assert(sizeof(UNpc631_AnimBP_slim_C) == 0x001390, "Wrong size on UNpc631_AnimBP_slim_C");
static_assert(offsetof(UNpc631_AnimBP_slim_C, UberGraphFrame) == 0x0002C0, "Member 'UNpc631_AnimBP_slim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, AnimGraphNode_ComponentToLocalSpace) == 0x0002C8, "Member 'UNpc631_AnimBP_slim_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, AnimGraphNode_CopyBone_1) == 0x0002E8, "Member 'UNpc631_AnimBP_slim_C::AnimGraphNode_CopyBone_1' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, AnimGraphNode_CopyBone) == 0x0003D8, "Member 'UNpc631_AnimBP_slim_C::AnimGraphNode_CopyBone' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, AnimGraphNode_ModifyBone_3) == 0x0004C8, "Member 'UNpc631_AnimBP_slim_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, AnimGraphNode_TwoBoneIK_1) == 0x0005D0, "Member 'UNpc631_AnimBP_slim_C::AnimGraphNode_TwoBoneIK_1' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, AnimGraphNode_TwoBoneIK) == 0x0007B0, "Member 'UNpc631_AnimBP_slim_C::AnimGraphNode_TwoBoneIK' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, AnimGraphNode_ModifyBone_2) == 0x000990, "Member 'UNpc631_AnimBP_slim_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, AnimGraphNode_ModifyBone_1) == 0x000A98, "Member 'UNpc631_AnimBP_slim_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, AnimGraphNode_ModifyBone) == 0x000BA0, "Member 'UNpc631_AnimBP_slim_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, AnimGraphNode_LocalToComponentSpace) == 0x000CA8, "Member 'UNpc631_AnimBP_slim_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, AnimGraphNode_Root) == 0x000CC8, "Member 'UNpc631_AnimBP_slim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, AnimGraphNode_BlendListByEnum) == 0x000CF8, "Member 'UNpc631_AnimBP_slim_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, AnimGraphNode_Slot) == 0x000DA8, "Member 'UNpc631_AnimBP_slim_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, AnimGraphNode_SequencePlayer_2) == 0x000DF0, "Member 'UNpc631_AnimBP_slim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, AnimGraphNode_SaveCachedPose) == 0x000E70, "Member 'UNpc631_AnimBP_slim_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, AnimGraphNode_UseCachedPose_1) == 0x000FC8, "Member 'UNpc631_AnimBP_slim_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, AnimGraphNode_UseCachedPose) == 0x000FF0, "Member 'UNpc631_AnimBP_slim_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, AnimGraphNode_SequencePlayer_1) == 0x001018, "Member 'UNpc631_AnimBP_slim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, AnimGraphNode_StateResult) == 0x001098, "Member 'UNpc631_AnimBP_slim_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, AnimGraphNode_StateMachine) == 0x0010C8, "Member 'UNpc631_AnimBP_slim_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, AnimGraphNode_ApplyAdditive) == 0x001178, "Member 'UNpc631_AnimBP_slim_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, AnimGraphNode_SequencePlayer) == 0x001240, "Member 'UNpc631_AnimBP_slim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, ModeCurrent) == 0x0012C0, "Member 'UNpc631_AnimBP_slim_C::ModeCurrent' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, ModePrevious) == 0x0012C1, "Member 'UNpc631_AnimBP_slim_C::ModePrevious' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, ModeBlendTime) == 0x0012C4, "Member 'UNpc631_AnimBP_slim_C::ModeBlendTime' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, DefaultAnimation) == 0x0012C8, "Member 'UNpc631_AnimBP_slim_C::DefaultAnimation' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, RootOffsetEnable) == 0x0012D0, "Member 'UNpc631_AnimBP_slim_C::RootOffsetEnable' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, RootOffset) == 0x0012D4, "Member 'UNpc631_AnimBP_slim_C::RootOffset' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, LegIKEnable) == 0x0012E0, "Member 'UNpc631_AnimBP_slim_C::LegIKEnable' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, LegIKAlphaLeft) == 0x0012E4, "Member 'UNpc631_AnimBP_slim_C::LegIKAlphaLeft' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, LeftLegIKEffectorLocation) == 0x0012E8, "Member 'UNpc631_AnimBP_slim_C::LeftLegIKEffectorLocation' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, RightLegIKEffectorLocation) == 0x0012F4, "Member 'UNpc631_AnimBP_slim_C::RightLegIKEffectorLocation' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, LeftLegIKTargetLocation) == 0x001300, "Member 'UNpc631_AnimBP_slim_C::LeftLegIKTargetLocation' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, RightLegIKTargetLocation) == 0x00130C, "Member 'UNpc631_AnimBP_slim_C::RightLegIKTargetLocation' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, LeftLegIKEffectorRotation) == 0x001318, "Member 'UNpc631_AnimBP_slim_C::LeftLegIKEffectorRotation' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, RightLegIKEffectorRotation) == 0x001324, "Member 'UNpc631_AnimBP_slim_C::RightLegIKEffectorRotation' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, HeadIKEnable) == 0x001330, "Member 'UNpc631_AnimBP_slim_C::HeadIKEnable' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, HeadIKAlpha) == 0x001334, "Member 'UNpc631_AnimBP_slim_C::HeadIKAlpha' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, HeadIKRotation) == 0x001338, "Member 'UNpc631_AnimBP_slim_C::HeadIKRotation' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, EyeIKEnable) == 0x001344, "Member 'UNpc631_AnimBP_slim_C::EyeIKEnable' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, EyeIKAlpha) == 0x001348, "Member 'UNpc631_AnimBP_slim_C::EyeIKAlpha' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, LeftEyeIKRotation) == 0x00134C, "Member 'UNpc631_AnimBP_slim_C::LeftEyeIKRotation' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, RightEyeIKRotation) == 0x001358, "Member 'UNpc631_AnimBP_slim_C::RightEyeIKRotation' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, RootDeltaRotation) == 0x001364, "Member 'UNpc631_AnimBP_slim_C::RootDeltaRotation' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, LookAtEnable) == 0x001370, "Member 'UNpc631_AnimBP_slim_C::LookAtEnable' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, MumbleAnimation) == 0x001378, "Member 'UNpc631_AnimBP_slim_C::MumbleAnimation' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, MumbleEnable) == 0x001380, "Member 'UNpc631_AnimBP_slim_C::MumbleEnable' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, MumbleAlpha) == 0x001384, "Member 'UNpc631_AnimBP_slim_C::MumbleAlpha' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, LegInvalidIKLeft) == 0x001388, "Member 'UNpc631_AnimBP_slim_C::LegInvalidIKLeft' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, LegInvalidIKRight) == 0x001389, "Member 'UNpc631_AnimBP_slim_C::LegInvalidIKRight' has a wrong offset!");
static_assert(offsetof(UNpc631_AnimBP_slim_C, LegIKAlphaRight) == 0x00138C, "Member 'UNpc631_AnimBP_slim_C::LegIKAlphaRight' has a wrong offset!");

}

