#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionFieldBrightnessPP_st

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct OptionFieldBrightnessPP_st.OptionFieldBrightnessPP_st
// 0x0030 (0x0030 - 0x0000)
struct FOptionFieldBrightnessPP_st final
{
public:
	class APostProcessVolume*                     PostProcessVolume_5_95D2D05A4855FB0B395A118921392FE4; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC6[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               DefaultGainColor_7_1BF628A742EC34563490239C29D7C7C0; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MainEnv_9_35BB273D43347D6BCFBD86BB0DC37DEC;        // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FOptionFieldBrightnessPP_st) == 0x000010, "Wrong alignment on FOptionFieldBrightnessPP_st");
static_assert(sizeof(FOptionFieldBrightnessPP_st) == 0x000030, "Wrong size on FOptionFieldBrightnessPP_st");
static_assert(offsetof(FOptionFieldBrightnessPP_st, PostProcessVolume_5_95D2D05A4855FB0B395A118921392FE4) == 0x000000, "Member 'FOptionFieldBrightnessPP_st::PostProcessVolume_5_95D2D05A4855FB0B395A118921392FE4' has a wrong offset!");
static_assert(offsetof(FOptionFieldBrightnessPP_st, DefaultGainColor_7_1BF628A742EC34563490239C29D7C7C0) == 0x000010, "Member 'FOptionFieldBrightnessPP_st::DefaultGainColor_7_1BF628A742EC34563490239C29D7C7C0' has a wrong offset!");
static_assert(offsetof(FOptionFieldBrightnessPP_st, MainEnv_9_35BB273D43347D6BCFBD86BB0DC37DEC) == 0x000020, "Member 'FOptionFieldBrightnessPP_st::MainEnv_9_35BB273D43347D6BCFBD86BB0DC37DEC' has a wrong offset!");

}

