#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pla289_AnimBP

#include "Basic.hpp"

#include "E_PLAYER_MOVEMENT_STATE_structs.hpp"
#include "Project_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Pla289_AnimBP.Pla289_AnimBP_C
// 0x0B70 (0x0E30 - 0x02C0)
class UPla289_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_4C26[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x02C8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x02E8(0x0020)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x0308(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x03B8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0400(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0480(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x05D8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0600(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0628(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0650(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0678(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x06F8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0728(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x07A8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x07D8(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0888(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x08B8(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0968(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x09E8(0x00C8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0AB0(0x0108)()
	struct FAnimNode_CustomPoseBlendNode          AnimGraphNode_CustomPoseBlendNode;                 // 0x0BB8(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0C78(0x0030)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x0CA8(0x00F0)()
	class UAnimSequenceBase*                      MumbleAnimation;                                   // 0x0D98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MumbleEnable;                                      // 0x0DA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HeadIKEnable;                                      // 0x0DA1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	E_CHARA_ANIMATION_MODE                        ModeCurrent;                                       // 0x0DA2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CHARA_ANIMATION_MODE                        ModePrevious;                                      // 0x0DA3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ModeBlendTime;                                     // 0x0DA4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      DefaultAnimation;                                  // 0x0DA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MumbleAlpha;                                       // 0x0DB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HeadIKAlpha;                                       // 0x0DB4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RootOffsetEnable;                                  // 0x0DB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               HeadIKRotation;                                    // 0x0DBC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               RootDeltaRotation;                                 // 0x0DC8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                RootOffset;                                        // 0x0DD4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LookAtEnable;                                      // 0x0DE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C27[0x3];                                     // 0x0DE1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MovementSpeed;                                     // 0x0DE4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MovementInput;                                     // 0x0DE8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRunMotion;                                       // 0x0DF4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C28[0x3];                                     // 0x0DF5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RunMotionRate;                                     // 0x0DF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C29[0x4];                                     // 0x0DFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPoseAsset*                             TwistPoseAsset;                                    // 0x0E00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomPoseWeightTable*                 PoseWeightTable;                                   // 0x0E08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BodyIKAlpha;                                       // 0x0E10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BodyIKEnable;                                      // 0x0E14(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C2A[0x3];                                     // 0x0E15(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPoseAsset*>                     TwistPoseList;                                     // 0x0E18(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Pla289_AnimBP(int32 EntryPoint);
	void SetMovementRotation(const struct FRotator& MomentRotation, const struct FRotator& SlopeRotation);
	void SetMovementState(E_PLAYER_MOVEMENT_STATE State);
	void SetBodyIKEnable(bool Enable, bool Immediately);
	void SetPoseWeightTable(class UCustomPoseWeightTable* Param_PoseWeightTable);
	void MapAttackTrigger();
	void MapAttackEnd();
	void ChangeTwistAsset(int32 Param_Index);
	void SetRunMotionRate(float RunRate);
	void SetMovementVelocity(const struct FVector& IdealVelocity, const struct FVector& Input);
	void SetMovementTurnState(bool State, float Angle);
	void SetEventMotionVal(const struct FVector2D& Input);
	void SetHeadIKRotation(int32 Param_Index, const struct FRotator& Rotation);
	void SetHeadIKEnable(bool Enable, bool Immediately);
	void SetLookAtEnable(bool Enable);
	void SetEventMotionTap(bool TapFlag);
	void SetRootOffset(const struct FVector& Offset, const struct FRotator& DeltaRotation);
	void SetRootOffsetEnable(bool Enable);
	void SetEventMotionSpace(class UBlendSpace* BlendSpace, int32 Param_Index);
	void TriggerLanding(float JumpHeight);
	void SetMumbleAnimation(class UAnimSequenceBase* Animation);
	void SetMumbleEnable(bool Enable);
	void SetDefaultAnimation(class UAnimSequenceBase* Animation);
	void SetAnimationMode(E_CHARA_ANIMATION_MODE Mode, float BlendTime);
	void BlueprintPostEvaluateAnimation();
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void SetSwordOpen(bool bSwordOpen);
	void MapAttackReTrigger();
	void MapDamageTrigger();
	void MapDamageEnd();
	void TriggerJumping();
	void ImmediateFallTrigger();
	void SetBoneMotionEnable(bool Enable);
	void SetLegIKEnable(bool Enable, bool Immediately);
	void SetLegIKEffector(int32 Param_Index, const struct FVector& Location, const struct FRotator& DeltaRotation);
	void SetLegIKTarget(int32 Param_Index, const struct FVector& Location);
	void SetEyeIKEnable(bool Enable, bool Immediately);
	void SetEyeIKRotation(int32 Param_Index, const struct FRotator& Rotation);
	void SetFloatingIKPerch(float Alpha);
	void SetPrimaryWorldOffsetBoneTrans(const struct FTransform& Trans, float BlendAlpha);
	void SetEnableBoneTrans(bool IsEnable);
	void SetWorldOffsetBoneTranses(const TArray<struct FTransform>& Transes, const TArray<float>& TransAlphas);
	void SetInvalidLegIK(bool Invalid, int32 Param_Index);
	void SetHeadIKRotationTick(int32 Param_Index, const struct FRotator& Rotation, float DeltaTime);
	void SetHeadIKInterpSpeed(float NewSpeed);
	void InvalidLookAt(bool Invalid);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

	class UAnimSequenceBase* GetMumbleAnimation() const;
	class UAnimSequenceBase* GetDefaultAnimation() const;
	void GetAnimationMode(E_CHARA_ANIMATION_MODE* Param_ModeCurrent, E_CHARA_ANIMATION_MODE* Param_ModePrevious) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Pla289_AnimBP_C">();
	}
	static class UPla289_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPla289_AnimBP_C>();
	}
};
static_assert(alignof(UPla289_AnimBP_C) == 0x000010, "Wrong alignment on UPla289_AnimBP_C");
static_assert(sizeof(UPla289_AnimBP_C) == 0x000E30, "Wrong size on UPla289_AnimBP_C");
static_assert(offsetof(UPla289_AnimBP_C, UberGraphFrame) == 0x0002C0, "Member 'UPla289_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0002C8, "Member 'UPla289_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0002E8, "Member 'UPla289_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_BlendListByEnum) == 0x000308, "Member 'UPla289_AnimBP_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_Slot) == 0x0003B8, "Member 'UPla289_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x000400, "Member 'UPla289_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x000480, "Member 'UPla289_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x0005D8, "Member 'UPla289_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x000600, "Member 'UPla289_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x000628, "Member 'UPla289_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_TransitionResult) == 0x000650, "Member 'UPla289_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x000678, "Member 'UPla289_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_StateResult_2) == 0x0006F8, "Member 'UPla289_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000728, "Member 'UPla289_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_StateResult_1) == 0x0007A8, "Member 'UPla289_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_StateMachine_1) == 0x0007D8, "Member 'UPla289_AnimBP_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_StateResult) == 0x000888, "Member 'UPla289_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_StateMachine) == 0x0008B8, "Member 'UPla289_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x000968, "Member 'UPla289_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_ApplyAdditive) == 0x0009E8, "Member 'UPla289_AnimBP_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000AB0, "Member 'UPla289_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_CustomPoseBlendNode) == 0x000BB8, "Member 'UPla289_AnimBP_C::AnimGraphNode_CustomPoseBlendNode' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_Root) == 0x000C78, "Member 'UPla289_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, AnimGraphNode_CopyBone) == 0x000CA8, "Member 'UPla289_AnimBP_C::AnimGraphNode_CopyBone' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, MumbleAnimation) == 0x000D98, "Member 'UPla289_AnimBP_C::MumbleAnimation' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, MumbleEnable) == 0x000DA0, "Member 'UPla289_AnimBP_C::MumbleEnable' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, HeadIKEnable) == 0x000DA1, "Member 'UPla289_AnimBP_C::HeadIKEnable' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, ModeCurrent) == 0x000DA2, "Member 'UPla289_AnimBP_C::ModeCurrent' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, ModePrevious) == 0x000DA3, "Member 'UPla289_AnimBP_C::ModePrevious' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, ModeBlendTime) == 0x000DA4, "Member 'UPla289_AnimBP_C::ModeBlendTime' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, DefaultAnimation) == 0x000DA8, "Member 'UPla289_AnimBP_C::DefaultAnimation' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, MumbleAlpha) == 0x000DB0, "Member 'UPla289_AnimBP_C::MumbleAlpha' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, HeadIKAlpha) == 0x000DB4, "Member 'UPla289_AnimBP_C::HeadIKAlpha' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, RootOffsetEnable) == 0x000DB8, "Member 'UPla289_AnimBP_C::RootOffsetEnable' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, HeadIKRotation) == 0x000DBC, "Member 'UPla289_AnimBP_C::HeadIKRotation' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, RootDeltaRotation) == 0x000DC8, "Member 'UPla289_AnimBP_C::RootDeltaRotation' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, RootOffset) == 0x000DD4, "Member 'UPla289_AnimBP_C::RootOffset' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, LookAtEnable) == 0x000DE0, "Member 'UPla289_AnimBP_C::LookAtEnable' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, MovementSpeed) == 0x000DE4, "Member 'UPla289_AnimBP_C::MovementSpeed' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, MovementInput) == 0x000DE8, "Member 'UPla289_AnimBP_C::MovementInput' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, IsRunMotion) == 0x000DF4, "Member 'UPla289_AnimBP_C::IsRunMotion' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, RunMotionRate) == 0x000DF8, "Member 'UPla289_AnimBP_C::RunMotionRate' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, TwistPoseAsset) == 0x000E00, "Member 'UPla289_AnimBP_C::TwistPoseAsset' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, PoseWeightTable) == 0x000E08, "Member 'UPla289_AnimBP_C::PoseWeightTable' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, BodyIKAlpha) == 0x000E10, "Member 'UPla289_AnimBP_C::BodyIKAlpha' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, BodyIKEnable) == 0x000E14, "Member 'UPla289_AnimBP_C::BodyIKEnable' has a wrong offset!");
static_assert(offsetof(UPla289_AnimBP_C, TwistPoseList) == 0x000E18, "Member 'UPla289_AnimBP_C::TwistPoseList' has a wrong offset!");

}

