#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pla603_PostAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Pla603_PostAnimBP.Pla603_PostAnimBP_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct Pla603_PostAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Pla603_PostAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Pla603_PostAnimBP_C_AnimGraph");
static_assert(sizeof(Pla603_PostAnimBP_C_AnimGraph) == 0x000020, "Wrong size on Pla603_PostAnimBP_C_AnimGraph");
static_assert(offsetof(Pla603_PostAnimBP_C_AnimGraph, InPose) == 0x000000, "Member 'Pla603_PostAnimBP_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(Pla603_PostAnimBP_C_AnimGraph, Param_AnimGraph) == 0x000010, "Member 'Pla603_PostAnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function Pla603_PostAnimBP.Pla603_PostAnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Pla603_PostAnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_PostAnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Pla603_PostAnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(Pla603_PostAnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Pla603_PostAnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(Pla603_PostAnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Pla603_PostAnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Pla603_PostAnimBP.Pla603_PostAnimBP_C.ExecuteUbergraph_Pla603_PostAnimBP
// 0x0008 (0x0008 - 0x0000)
struct Pla603_PostAnimBP_C_ExecuteUbergraph_Pla603_PostAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_PostAnimBP_C_ExecuteUbergraph_Pla603_PostAnimBP) == 0x000004, "Wrong alignment on Pla603_PostAnimBP_C_ExecuteUbergraph_Pla603_PostAnimBP");
static_assert(sizeof(Pla603_PostAnimBP_C_ExecuteUbergraph_Pla603_PostAnimBP) == 0x000008, "Wrong size on Pla603_PostAnimBP_C_ExecuteUbergraph_Pla603_PostAnimBP");
static_assert(offsetof(Pla603_PostAnimBP_C_ExecuteUbergraph_Pla603_PostAnimBP, EntryPoint) == 0x000000, "Member 'Pla603_PostAnimBP_C_ExecuteUbergraph_Pla603_PostAnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Pla603_PostAnimBP_C_ExecuteUbergraph_Pla603_PostAnimBP, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'Pla603_PostAnimBP_C_ExecuteUbergraph_Pla603_PostAnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");

}

