#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pla603

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_Pla603_Weapon_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_PLAYER_MOVEMENT_STATE_structs.hpp"
#include "Project_structs.hpp"
#include "E_MapAction_Pla603_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "MapAttackDamageData_structs.hpp"


namespace SDK::Params
{

// Function Pla603.Pla603_C.CheckIdleAnimBP
// 0x0003 (0x0003 - 0x0000)
struct Pla603_C_CheckIdleAnimBP final
{
public:
	bool                                          Idle;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckIdle_Idle;                           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_C_CheckIdleAnimBP) == 0x000001, "Wrong alignment on Pla603_C_CheckIdleAnimBP");
static_assert(sizeof(Pla603_C_CheckIdleAnimBP) == 0x000003, "Wrong size on Pla603_C_CheckIdleAnimBP");
static_assert(offsetof(Pla603_C_CheckIdleAnimBP, Idle) == 0x000000, "Member 'Pla603_C_CheckIdleAnimBP::Idle' has a wrong offset!");
static_assert(offsetof(Pla603_C_CheckIdleAnimBP, CallFunc_CheckIdle_Idle) == 0x000001, "Member 'Pla603_C_CheckIdleAnimBP::CallFunc_CheckIdle_Idle' has a wrong offset!");
static_assert(offsetof(Pla603_C_CheckIdleAnimBP, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'Pla603_C_CheckIdleAnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Pla603.Pla603_C.SetRideCoasterSlopeAngle
// 0x0008 (0x0008 - 0x0000)
struct Pla603_C_SetRideCoasterSlopeAngle final
{
public:
	float                                         Angle;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewParam;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_C_SetRideCoasterSlopeAngle) == 0x000004, "Wrong alignment on Pla603_C_SetRideCoasterSlopeAngle");
static_assert(sizeof(Pla603_C_SetRideCoasterSlopeAngle) == 0x000008, "Wrong size on Pla603_C_SetRideCoasterSlopeAngle");
static_assert(offsetof(Pla603_C_SetRideCoasterSlopeAngle, Angle) == 0x000000, "Member 'Pla603_C_SetRideCoasterSlopeAngle::Angle' has a wrong offset!");
static_assert(offsetof(Pla603_C_SetRideCoasterSlopeAngle, NewParam) == 0x000004, "Member 'Pla603_C_SetRideCoasterSlopeAngle::NewParam' has a wrong offset!");
static_assert(offsetof(Pla603_C_SetRideCoasterSlopeAngle, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'Pla603_C_SetRideCoasterSlopeAngle::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Pla603.Pla603_C.IsTsukuyomiForm
// 0x0001 (0x0001 - 0x0000)
struct Pla603_C_IsTsukuyomiForm final
{
public:
	bool                                          TsukuyomiForm;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_C_IsTsukuyomiForm) == 0x000001, "Wrong alignment on Pla603_C_IsTsukuyomiForm");
static_assert(sizeof(Pla603_C_IsTsukuyomiForm) == 0x000001, "Wrong size on Pla603_C_IsTsukuyomiForm");
static_assert(offsetof(Pla603_C_IsTsukuyomiForm, TsukuyomiForm) == 0x000000, "Member 'Pla603_C_IsTsukuyomiForm::TsukuyomiForm' has a wrong offset!");

// Function Pla603.Pla603_C.FormChange
// 0x00F0 (0x00F0 - 0x0000)
struct Pla603_C_FormChange final
{
public:
	bool                                          TSUKUYOMI;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NewParam;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8470[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharaMotionTable*                      L_MotionTable;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          L_SkeletalMesh;                                    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8471[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          Temp_object_Variable_1;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8472[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharaMotionTable*                      Temp_object_Variable_2;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumLODs_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8473[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPla603_AnimBP_C*                       K2Node_DynamicCast_AsPla_603_Anim_BP;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8474[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8475[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharaMotionTable*                      Temp_object_Variable_3;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetPostProcessInstance_ReturnValue;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectIKAnimInstance*                 K2Node_DynamicCast_AsProject_IKAnim_Instance;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8476[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          K2Node_Select_Default;                             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8477[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSkeletalMaterial>              CallFunc_GetMaterials_ReturnValue;                 // 0x00A8(0x0010)(ConstParm, ReferenceParm)
	struct FSkeletalMaterial                      CallFunc_Array_Get_Item;                           // 0x00B8(0x0028)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8478[0x2];                                     // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharaMotionTable*                      K2Node_Select_Default_1;                           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_C_FormChange) == 0x000008, "Wrong alignment on Pla603_C_FormChange");
static_assert(sizeof(Pla603_C_FormChange) == 0x0000F0, "Wrong size on Pla603_C_FormChange");
static_assert(offsetof(Pla603_C_FormChange, TSUKUYOMI) == 0x000000, "Member 'Pla603_C_FormChange::TSUKUYOMI' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, NewParam) == 0x000001, "Member 'Pla603_C_FormChange::NewParam' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, L_MotionTable) == 0x000008, "Member 'Pla603_C_FormChange::L_MotionTable' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, L_SkeletalMesh) == 0x000010, "Member 'Pla603_C_FormChange::L_SkeletalMesh' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, Temp_bool_Variable) == 0x000018, "Member 'Pla603_C_FormChange::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, Temp_object_Variable) == 0x000020, "Member 'Pla603_C_FormChange::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, Temp_object_Variable_1) == 0x000028, "Member 'Pla603_C_FormChange::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, Temp_int_Array_Index_Variable) == 0x000030, "Member 'Pla603_C_FormChange::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, Temp_object_Variable_2) == 0x000038, "Member 'Pla603_C_FormChange::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, Temp_int_Variable) == 0x000040, "Member 'Pla603_C_FormChange::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, CallFunc_GetNumLODs_ReturnValue) == 0x000044, "Member 'Pla603_C_FormChange::CallFunc_GetNumLODs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, CallFunc_Subtract_IntInt_ReturnValue) == 0x000048, "Member 'Pla603_C_FormChange::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'Pla603_C_FormChange::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000050, "Member 'Pla603_C_FormChange::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, CallFunc_GetAnimInstance_ReturnValue) == 0x000058, "Member 'Pla603_C_FormChange::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, K2Node_DynamicCast_AsPla_603_Anim_BP) == 0x000060, "Member 'Pla603_C_FormChange::K2Node_DynamicCast_AsPla_603_Anim_BP' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'Pla603_C_FormChange::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, Temp_int_Loop_Counter_Variable) == 0x00006C, "Member 'Pla603_C_FormChange::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, CallFunc_Add_IntInt_ReturnValue_1) == 0x000070, "Member 'Pla603_C_FormChange::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, Temp_object_Variable_3) == 0x000078, "Member 'Pla603_C_FormChange::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, CallFunc_GetPostProcessInstance_ReturnValue) == 0x000080, "Member 'Pla603_C_FormChange::CallFunc_GetPostProcessInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, K2Node_DynamicCast_AsProject_IKAnim_Instance) == 0x000088, "Member 'Pla603_C_FormChange::K2Node_DynamicCast_AsProject_IKAnim_Instance' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'Pla603_C_FormChange::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, K2Node_Select_Default) == 0x000098, "Member 'Pla603_C_FormChange::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000A0, "Member 'Pla603_C_FormChange::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, CallFunc_GetMaterials_ReturnValue) == 0x0000A8, "Member 'Pla603_C_FormChange::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'Pla603_C_FormChange::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, CallFunc_Array_Length_ReturnValue) == 0x0000E0, "Member 'Pla603_C_FormChange::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, CallFunc_Less_IntInt_ReturnValue) == 0x0000E4, "Member 'Pla603_C_FormChange::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, Temp_bool_Variable_1) == 0x0000E5, "Member 'Pla603_C_FormChange::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_FormChange, K2Node_Select_Default_1) == 0x0000E8, "Member 'Pla603_C_FormChange::K2Node_Select_Default_1' has a wrong offset!");

// Function Pla603.Pla603_C.InitFormChange
// 0x0020 (0x0020 - 0x0000)
struct Pla603_C_InitFormChange final
{
public:
	bool                                          CallFunc_CheckPrimeMinisterNahobino_ReturnValue;   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FormChange_NewParam;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FormChange_NewParam_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FormChange_NewParam_2;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FormChange_NewParam_3;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8479[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectGameInstanceBase*               K2Node_DynamicCast_AsProject_Game_Instance_Base;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_C_InitFormChange) == 0x000008, "Wrong alignment on Pla603_C_InitFormChange");
static_assert(sizeof(Pla603_C_InitFormChange) == 0x000020, "Wrong size on Pla603_C_InitFormChange");
static_assert(offsetof(Pla603_C_InitFormChange, CallFunc_CheckPrimeMinisterNahobino_ReturnValue) == 0x000000, "Member 'Pla603_C_InitFormChange::CallFunc_CheckPrimeMinisterNahobino_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitFormChange, CallFunc_FormChange_NewParam) == 0x000001, "Member 'Pla603_C_InitFormChange::CallFunc_FormChange_NewParam' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitFormChange, CallFunc_FormChange_NewParam_1) == 0x000002, "Member 'Pla603_C_InitFormChange::CallFunc_FormChange_NewParam_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitFormChange, CallFunc_FormChange_NewParam_2) == 0x000003, "Member 'Pla603_C_InitFormChange::CallFunc_FormChange_NewParam_2' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitFormChange, CallFunc_FormChange_NewParam_3) == 0x000004, "Member 'Pla603_C_InitFormChange::CallFunc_FormChange_NewParam_3' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitFormChange, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'Pla603_C_InitFormChange::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitFormChange, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'Pla603_C_InitFormChange::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitFormChange, K2Node_DynamicCast_AsProject_Game_Instance_Base) == 0x000010, "Member 'Pla603_C_InitFormChange::K2Node_DynamicCast_AsProject_Game_Instance_Base' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitFormChange, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Pla603_C_InitFormChange::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Pla603.Pla603_C.CheckWeaponView
// 0x0010 (0x0010 - 0x0000)
struct Pla603_C_CheckWeaponView final
{
public:
	float                                         PrevCurveValue;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NextCurveValue;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          View;                                              // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_C_CheckWeaponView) == 0x000004, "Wrong alignment on Pla603_C_CheckWeaponView");
static_assert(sizeof(Pla603_C_CheckWeaponView) == 0x000010, "Wrong size on Pla603_C_CheckWeaponView");
static_assert(offsetof(Pla603_C_CheckWeaponView, PrevCurveValue) == 0x000000, "Member 'Pla603_C_CheckWeaponView::PrevCurveValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_CheckWeaponView, NextCurveValue) == 0x000004, "Member 'Pla603_C_CheckWeaponView::NextCurveValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_CheckWeaponView, View) == 0x000008, "Member 'Pla603_C_CheckWeaponView::View' has a wrong offset!");
static_assert(offsetof(Pla603_C_CheckWeaponView, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000009, "Member 'Pla603_C_CheckWeaponView::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_CheckWeaponView, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00000A, "Member 'Pla603_C_CheckWeaponView::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_CheckWeaponView, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000B, "Member 'Pla603_C_CheckWeaponView::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_CheckWeaponView, CallFunc_Less_FloatFloat_ReturnValue) == 0x00000C, "Member 'Pla603_C_CheckWeaponView::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_CheckWeaponView, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x00000D, "Member 'Pla603_C_CheckWeaponView::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function Pla603.Pla603_C.TickWeapon
// 0x0180 (0x0180 - 0x0000)
struct Pla603_C_TickWeapon final
{
public:
	E_Pla603_Weapon                               L_Weapon;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_847A[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         L_Value;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          L_Temp;                                            // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          L_View;                                            // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_847B[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_847C[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_847D[0x1];                                     // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_847E[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckWeaponView_View;                     // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_847F[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_Pla603_Weapon                               Temp_byte_Variable;                                // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8480[0x2];                                     // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8481[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumLODs_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_1;          // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8482[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8483[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8484[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x0100(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8485[0x3];                                     // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_1;                          // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_2;                       // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_3;                       // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_4;                       // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_C_TickWeapon) == 0x000010, "Wrong alignment on Pla603_C_TickWeapon");
static_assert(sizeof(Pla603_C_TickWeapon) == 0x000180, "Wrong size on Pla603_C_TickWeapon");
static_assert(offsetof(Pla603_C_TickWeapon, L_Weapon) == 0x000000, "Member 'Pla603_C_TickWeapon::L_Weapon' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, L_Value) == 0x000004, "Member 'Pla603_C_TickWeapon::L_Value' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, L_Temp) == 0x000008, "Member 'Pla603_C_TickWeapon::L_Temp' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, L_View) == 0x000009, "Member 'Pla603_C_TickWeapon::L_View' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, Temp_name_Variable) == 0x00000C, "Member 'Pla603_C_TickWeapon::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, Temp_name_Variable_1) == 0x000014, "Member 'Pla603_C_TickWeapon::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, Temp_name_Variable_2) == 0x00001C, "Member 'Pla603_C_TickWeapon::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, Temp_name_Variable_3) == 0x000024, "Member 'Pla603_C_TickWeapon::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, Temp_int_Variable) == 0x00002C, "Member 'Pla603_C_TickWeapon::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, Temp_int_Variable_1) == 0x000030, "Member 'Pla603_C_TickWeapon::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_Conv_IntToByte_ReturnValue) == 0x000034, "Member 'Pla603_C_TickWeapon::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'Pla603_C_TickWeapon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_GetValidValue_ReturnValue) == 0x00003C, "Member 'Pla603_C_TickWeapon::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x00003D, "Member 'Pla603_C_TickWeapon::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x00003E, "Member 'Pla603_C_TickWeapon::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000040, "Member 'Pla603_C_TickWeapon::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000044, "Member 'Pla603_C_TickWeapon::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000048, "Member 'Pla603_C_TickWeapon::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x00004C, "Member 'Pla603_C_TickWeapon::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000050, "Member 'Pla603_C_TickWeapon::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_CheckWeaponView_View) == 0x000054, "Member 'Pla603_C_TickWeapon::CallFunc_CheckWeaponView_View' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'Pla603_C_TickWeapon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_Greater_IntInt_ReturnValue) == 0x00005C, "Member 'Pla603_C_TickWeapon::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, Temp_byte_Variable) == 0x00005D, "Member 'Pla603_C_TickWeapon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, K2Node_Select_Default) == 0x000060, "Member 'Pla603_C_TickWeapon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000068, "Member 'Pla603_C_TickWeapon::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_GetAnimInstance_ReturnValue) == 0x000070, "Member 'Pla603_C_TickWeapon::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_GetCurveValue_ReturnValue) == 0x000078, "Member 'Pla603_C_TickWeapon::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_GetNumLODs_ReturnValue) == 0x00007C, "Member 'Pla603_C_TickWeapon::CallFunc_GetNumLODs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_Subtract_IntInt_ReturnValue) == 0x000080, "Member 'Pla603_C_TickWeapon::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_NotEqual_BoolBool_ReturnValue_1) == 0x000084, "Member 'Pla603_C_TickWeapon::CallFunc_NotEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, Temp_int_Variable_2) == 0x000088, "Member 'Pla603_C_TickWeapon::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00008C, "Member 'Pla603_C_TickWeapon::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_Add_IntInt_ReturnValue_1) == 0x000090, "Member 'Pla603_C_TickWeapon::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_MakeLiteralInt_ReturnValue) == 0x000094, "Member 'Pla603_C_TickWeapon::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'Pla603_C_TickWeapon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_GetSocketTransform_ReturnValue) == 0x0000A0, "Member 'Pla603_C_TickWeapon::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_BreakTransform_Location) == 0x0000D0, "Member 'Pla603_C_TickWeapon::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_BreakTransform_Rotation) == 0x0000DC, "Member 'Pla603_C_TickWeapon::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_BreakTransform_Scale) == 0x0000E8, "Member 'Pla603_C_TickWeapon::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_BreakVector_X) == 0x0000F4, "Member 'Pla603_C_TickWeapon::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_BreakVector_Y) == 0x0000F8, "Member 'Pla603_C_TickWeapon::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_BreakVector_Z) == 0x0000FC, "Member 'Pla603_C_TickWeapon::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_GetSocketTransform_ReturnValue_1) == 0x000100, "Member 'Pla603_C_TickWeapon::CallFunc_GetSocketTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_BreakTransform_Location_1) == 0x000130, "Member 'Pla603_C_TickWeapon::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_BreakTransform_Rotation_1) == 0x00013C, "Member 'Pla603_C_TickWeapon::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_BreakTransform_Scale_1) == 0x000148, "Member 'Pla603_C_TickWeapon::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_Not_PreBool_ReturnValue) == 0x000154, "Member 'Pla603_C_TickWeapon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_BreakVector_X_1) == 0x000158, "Member 'Pla603_C_TickWeapon::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_BreakVector_Y_1) == 0x00015C, "Member 'Pla603_C_TickWeapon::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_BreakVector_Z_1) == 0x000160, "Member 'Pla603_C_TickWeapon::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_FMax_ReturnValue) == 0x000164, "Member 'Pla603_C_TickWeapon::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_FMax_ReturnValue_1) == 0x000168, "Member 'Pla603_C_TickWeapon::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_FMax_ReturnValue_2) == 0x00016C, "Member 'Pla603_C_TickWeapon::CallFunc_FMax_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_FMax_ReturnValue_3) == 0x000170, "Member 'Pla603_C_TickWeapon::CallFunc_FMax_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_FMax_ReturnValue_4) == 0x000174, "Member 'Pla603_C_TickWeapon::CallFunc_FMax_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Pla603_C_TickWeapon, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000178, "Member 'Pla603_C_TickWeapon::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function Pla603.Pla603_C.InitWeapon
// 0x0090 (0x0090 - 0x0000)
struct Pla603_C_InitWeapon final
{
public:
	int32                                         L_LoopEnd;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8486[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8487[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8488[0x1];                                     // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8489[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0040(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_848A[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterial*                              CallFunc_GetBaseMaterial_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_848B[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_C_InitWeapon) == 0x000008, "Wrong alignment on Pla603_C_InitWeapon");
static_assert(sizeof(Pla603_C_InitWeapon) == 0x000090, "Wrong size on Pla603_C_InitWeapon");
static_assert(offsetof(Pla603_C_InitWeapon, L_LoopEnd) == 0x000000, "Member 'Pla603_C_InitWeapon::L_LoopEnd' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_MakeLiteralInt_ReturnValue) == 0x000004, "Member 'Pla603_C_InitWeapon::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, Temp_bool_Variable) == 0x000008, "Member 'Pla603_C_InitWeapon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, Temp_int_Variable) == 0x00000C, "Member 'Pla603_C_InitWeapon::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, Temp_int_Variable_1) == 0x000010, "Member 'Pla603_C_InitWeapon::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_Conv_IntToByte_ReturnValue) == 0x000014, "Member 'Pla603_C_InitWeapon::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'Pla603_C_InitWeapon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_GetValidValue_ReturnValue) == 0x00001C, "Member 'Pla603_C_InitWeapon::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x00001D, "Member 'Pla603_C_InitWeapon::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x00001E, "Member 'Pla603_C_InitWeapon::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000020, "Member 'Pla603_C_InitWeapon::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, Temp_int_Array_Index_Variable) == 0x000024, "Member 'Pla603_C_InitWeapon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x000028, "Member 'Pla603_C_InitWeapon::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'Pla603_C_InitWeapon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, Temp_int_Variable_2) == 0x000030, "Member 'Pla603_C_InitWeapon::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'Pla603_C_InitWeapon::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000038, "Member 'Pla603_C_InitWeapon::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, Temp_bool_Variable_1) == 0x000039, "Member 'Pla603_C_InitWeapon::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_Not_PreBool_ReturnValue) == 0x00003A, "Member 'Pla603_C_InitWeapon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_BooleanAND_ReturnValue) == 0x00003B, "Member 'Pla603_C_InitWeapon::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'Pla603_C_InitWeapon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, Temp_float_Variable) == 0x000040, "Member 'Pla603_C_InitWeapon::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'Pla603_C_InitWeapon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_GetMaterial_ReturnValue) == 0x000048, "Member 'Pla603_C_InitWeapon::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_Less_IntInt_ReturnValue_1) == 0x000050, "Member 'Pla603_C_InitWeapon::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_GetBaseMaterial_ReturnValue) == 0x000058, "Member 'Pla603_C_InitWeapon::CallFunc_GetBaseMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_GetObjectName_ReturnValue) == 0x000060, "Member 'Pla603_C_InitWeapon::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000070, "Member 'Pla603_C_InitWeapon::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_FindSubstring_ReturnValue) == 0x000078, "Member 'Pla603_C_InitWeapon::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00007C, "Member 'Pla603_C_InitWeapon::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_Add_IntInt_ReturnValue_2) == 0x000080, "Member 'Pla603_C_InitWeapon::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_GetNumMaterials_ReturnValue) == 0x000084, "Member 'Pla603_C_InitWeapon::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla603_C_InitWeapon, CallFunc_Subtract_IntInt_ReturnValue) == 0x000088, "Member 'Pla603_C_InitWeapon::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function Pla603.Pla603_C.BI_SetAnimBP
// 0x0020 (0x0020 - 0x0000)
struct Pla603_C_BI_SetAnimBP final
{
public:
	class UAnimInstance*                          AnimInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoUse;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_848C[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPla603_AnimBP_C*                       K2Node_DynamicCast_AsPla_603_Anim_BP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_C_BI_SetAnimBP) == 0x000008, "Wrong alignment on Pla603_C_BI_SetAnimBP");
static_assert(sizeof(Pla603_C_BI_SetAnimBP) == 0x000020, "Wrong size on Pla603_C_BI_SetAnimBP");
