#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pla601

#include "Basic.hpp"

#include "E_MapAction_Pla601_structs.hpp"


namespace SDK::Params
{

// Function Pla601.Pla601_C.IsAutoRunning
// 0x0001 (0x0001 - 0x0000)
struct Pla601_C_IsAutoRunning final
{
public:
	bool                                          bAutoRunning;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla601_C_IsAutoRunning) == 0x000001, "Wrong alignment on Pla601_C_IsAutoRunning");
static_assert(sizeof(Pla601_C_IsAutoRunning) == 0x000001, "Wrong size on Pla601_C_IsAutoRunning");
static_assert(offsetof(Pla601_C_IsAutoRunning, bAutoRunning) == 0x000000, "Member 'Pla601_C_IsAutoRunning::bAutoRunning' has a wrong offset!");

// Function Pla601.Pla601_C.BI_SetAnimBP
// 0x0020 (0x0020 - 0x0000)
struct Pla601_C_BI_SetAnimBP final
{
public:
	class UAnimInstance*                          AnimInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoUse;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E67[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPla601_AnimBP_C*                       K2Node_DynamicCast_AsPla_601_Anim_BP;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla601_C_BI_SetAnimBP) == 0x000008, "Wrong alignment on Pla601_C_BI_SetAnimBP");
static_assert(sizeof(Pla601_C_BI_SetAnimBP) == 0x000020, "Wrong size on Pla601_C_BI_SetAnimBP");
static_assert(offsetof(Pla601_C_BI_SetAnimBP, AnimInstance) == 0x000000, "Member 'Pla601_C_BI_SetAnimBP::AnimInstance' has a wrong offset!");
static_assert(offsetof(Pla601_C_BI_SetAnimBP, NoUse) == 0x000008, "Member 'Pla601_C_BI_SetAnimBP::NoUse' has a wrong offset!");
static_assert(offsetof(Pla601_C_BI_SetAnimBP, K2Node_DynamicCast_AsPla_601_Anim_BP) == 0x000010, "Member 'Pla601_C_BI_SetAnimBP::K2Node_DynamicCast_AsPla_601_Anim_BP' has a wrong offset!");
static_assert(offsetof(Pla601_C_BI_SetAnimBP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Pla601_C_BI_SetAnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Pla601.Pla601_C.IsMapActionPlaying
// 0x0001 (0x0001 - 0x0000)
struct Pla601_C_IsMapActionPlaying final
{
public:
	bool                                          bPlaying;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla601_C_IsMapActionPlaying) == 0x000001, "Wrong alignment on Pla601_C_IsMapActionPlaying");
static_assert(sizeof(Pla601_C_IsMapActionPlaying) == 0x000001, "Wrong size on Pla601_C_IsMapActionPlaying");
static_assert(offsetof(Pla601_C_IsMapActionPlaying, bPlaying) == 0x000000, "Member 'Pla601_C_IsMapActionPlaying::bPlaying' has a wrong offset!");

// Function Pla601.Pla601_C.Notify_WalkBrakeTrigger
// 0x0004 (0x0004 - 0x0000)
struct Pla601_C_Notify_WalkBrakeTrigger final
{
public:
	bool                                          bLeft_1;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLeft_2;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bRight_1;                                          // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bRight_2;                                          // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla601_C_Notify_WalkBrakeTrigger) == 0x000001, "Wrong alignment on Pla601_C_Notify_WalkBrakeTrigger");
static_assert(sizeof(Pla601_C_Notify_WalkBrakeTrigger) == 0x000004, "Wrong size on Pla601_C_Notify_WalkBrakeTrigger");
static_assert(offsetof(Pla601_C_Notify_WalkBrakeTrigger, bLeft_1) == 0x000000, "Member 'Pla601_C_Notify_WalkBrakeTrigger::bLeft_1' has a wrong offset!");
static_assert(offsetof(Pla601_C_Notify_WalkBrakeTrigger, bLeft_2) == 0x000001, "Member 'Pla601_C_Notify_WalkBrakeTrigger::bLeft_2' has a wrong offset!");
static_assert(offsetof(Pla601_C_Notify_WalkBrakeTrigger, bRight_1) == 0x000002, "Member 'Pla601_C_Notify_WalkBrakeTrigger::bRight_1' has a wrong offset!");
static_assert(offsetof(Pla601_C_Notify_WalkBrakeTrigger, bRight_2) == 0x000003, "Member 'Pla601_C_Notify_WalkBrakeTrigger::bRight_2' has a wrong offset!");

// Function Pla601.Pla601_C.MapAttackActivate
// 0x0008 (0x0008 - 0x0000)
struct Pla601_C_MapAttackActivate final
{
public:
	bool                                          bActivate;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E68[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AttackID;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla601_C_MapAttackActivate) == 0x000004, "Wrong alignment on Pla601_C_MapAttackActivate");
static_assert(sizeof(Pla601_C_MapAttackActivate) == 0x000008, "Wrong size on Pla601_C_MapAttackActivate");
static_assert(offsetof(Pla601_C_MapAttackActivate, bActivate) == 0x000000, "Member 'Pla601_C_MapAttackActivate::bActivate' has a wrong offset!");
static_assert(offsetof(Pla601_C_MapAttackActivate, AttackID) == 0x000004, "Member 'Pla601_C_MapAttackActivate::AttackID' has a wrong offset!");

// Function Pla601.Pla601_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Pla601_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla601_C_ReceiveTick) == 0x000004, "Wrong alignment on Pla601_C_ReceiveTick");
static_assert(sizeof(Pla601_C_ReceiveTick) == 0x000004, "Wrong size on Pla601_C_ReceiveTick");
static_assert(offsetof(Pla601_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Pla601_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Pla601.Pla601_C.PlayMapAction
// 0x0001 (0x0001 - 0x0000)
struct Pla601_C_PlayMapAction final
{
public:
	E_MapAction_Pla601                            Action;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla601_C_PlayMapAction) == 0x000001, "Wrong alignment on Pla601_C_PlayMapAction");
static_assert(sizeof(Pla601_C_PlayMapAction) == 0x000001, "Wrong size on Pla601_C_PlayMapAction");
static_assert(offsetof(Pla601_C_PlayMapAction, Action) == 0x000000, "Member 'Pla601_C_PlayMapAction::Action' has a wrong offset!");

// Function Pla601.Pla601_C.ReceivePossessed
// 0x0008 (0x0008 - 0x0000)
struct Pla601_C_ReceivePossessed final
{
public:
	class AController*                            NewController;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla601_C_ReceivePossessed) == 0x000008, "Wrong alignment on Pla601_C_ReceivePossessed");
static_assert(sizeof(Pla601_C_ReceivePossessed) == 0x000008, "Wrong size on Pla601_C_ReceivePossessed");
static_assert(offsetof(Pla601_C_ReceivePossessed, NewController) == 0x000000, "Member 'Pla601_C_ReceivePossessed::NewController' has a wrong offset!");

// Function Pla601.Pla601_C.ExecuteUbergraph_Pla601
// 0x0038 (0x0038 - 0x0000)
struct Pla601_C_ExecuteUbergraph_Pla601 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bLeft_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bLeft_2;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRight_1;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRight_2;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bActivate;                            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E69[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_AttackID;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E6A[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPla601_AnimBP_C*                       K2Node_DynamicCast_AsPla_601_Anim_BP;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_MapAction_Pla601                            K2Node_CustomEvent_Action;                         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E6B[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_NewController;                        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla601_C_ExecuteUbergraph_Pla601) == 0x000008, "Wrong alignment on Pla601_C_ExecuteUbergraph_Pla601");
static_assert(sizeof(Pla601_C_ExecuteUbergraph_Pla601) == 0x000038, "Wrong size on Pla601_C_ExecuteUbergraph_Pla601");
static_assert(offsetof(Pla601_C_ExecuteUbergraph_Pla601, EntryPoint) == 0x000000, "Member 'Pla601_C_ExecuteUbergraph_Pla601::EntryPoint' has a wrong offset!");
static_assert(offsetof(Pla601_C_ExecuteUbergraph_Pla601, K2Node_Event_bLeft_1) == 0x000004, "Member 'Pla601_C_ExecuteUbergraph_Pla601::K2Node_Event_bLeft_1' has a wrong offset!");
static_assert(offsetof(Pla601_C_ExecuteUbergraph_Pla601, K2Node_Event_bLeft_2) == 0x000005, "Member 'Pla601_C_ExecuteUbergraph_Pla601::K2Node_Event_bLeft_2' has a wrong offset!");
static_assert(offsetof(Pla601_C_ExecuteUbergraph_Pla601, K2Node_Event_bRight_1) == 0x000006, "Member 'Pla601_C_ExecuteUbergraph_Pla601::K2Node_Event_bRight_1' has a wrong offset!");
static_assert(offsetof(Pla601_C_ExecuteUbergraph_Pla601, K2Node_Event_bRight_2) == 0x000007, "Member 'Pla601_C_ExecuteUbergraph_Pla601::K2Node_Event_bRight_2' has a wrong offset!");
static_assert(offsetof(Pla601_C_ExecuteUbergraph_Pla601, K2Node_Event_bActivate) == 0x000008, "Member 'Pla601_C_ExecuteUbergraph_Pla601::K2Node_Event_bActivate' has a wrong offset!");
static_assert(offsetof(Pla601_C_ExecuteUbergraph_Pla601, K2Node_Event_AttackID) == 0x00000C, "Member 'Pla601_C_ExecuteUbergraph_Pla601::K2Node_Event_AttackID' has a wrong offset!");
static_assert(offsetof(Pla601_C_ExecuteUbergraph_Pla601, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'Pla601_C_ExecuteUbergraph_Pla601::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Pla601_C_ExecuteUbergraph_Pla601, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'Pla601_C_ExecuteUbergraph_Pla601::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pla601_C_ExecuteUbergraph_Pla601, K2Node_DynamicCast_AsPla_601_Anim_BP) == 0x000020, "Member 'Pla601_C_ExecuteUbergraph_Pla601::K2Node_DynamicCast_AsPla_601_Anim_BP' has a wrong offset!");
static_assert(offsetof(Pla601_C_ExecuteUbergraph_Pla601, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Pla601_C_ExecuteUbergraph_Pla601::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Pla601_C_ExecuteUbergraph_Pla601, K2Node_CustomEvent_Action) == 0x000029, "Member 'Pla601_C_ExecuteUbergraph_Pla601::K2Node_CustomEvent_Action' has a wrong offset!");
static_assert(offsetof(Pla601_C_ExecuteUbergraph_Pla601, K2Node_Event_NewController) == 0x000030, "Member 'Pla601_C_ExecuteUbergraph_Pla601::K2Node_Event_NewController' has a wrong offset!");

}

