#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pla601_PostAnimBP

#include "Basic.hpp"

#include "Project_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Pla601_PostAnimBP.Pla601_PostAnimBP_C
// 0x0ED0 (0x12D0 - 0x0400)
class UPla601_PostAnimBP_C final : public UProjectIKAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0408(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0438(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0550(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x06A8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x06D0(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0770(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0798(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x08A0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x08C0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x08E0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x09E8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0AF0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0BF8(0x0108)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0x0D00(0x01E0)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x0EE0(0x01E0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x10C0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x11C8(0x0108)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_Pla601_PostAnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Pla601_PostAnimBP_C">();
	}
	static class UPla601_PostAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPla601_PostAnimBP_C>();
	}
};
static_assert(alignof(UPla601_PostAnimBP_C) == 0x000010, "Wrong alignment on UPla601_PostAnimBP_C");
static_assert(sizeof(UPla601_PostAnimBP_C) == 0x0012D0, "Wrong size on UPla601_PostAnimBP_C");
static_assert(offsetof(UPla601_PostAnimBP_C, UberGraphFrame) == 0x000400, "Member 'UPla601_PostAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPla601_PostAnimBP_C, AnimGraphNode_Root) == 0x000408, "Member 'UPla601_PostAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UPla601_PostAnimBP_C, AnimGraphNode_SubInput) == 0x000438, "Member 'UPla601_PostAnimBP_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UPla601_PostAnimBP_C, AnimGraphNode_SaveCachedPose) == 0x000550, "Member 'UPla601_PostAnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UPla601_PostAnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x0006A8, "Member 'UPla601_PostAnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UPla601_PostAnimBP_C, AnimGraphNode_BlendListByBool) == 0x0006D0, "Member 'UPla601_PostAnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UPla601_PostAnimBP_C, AnimGraphNode_UseCachedPose) == 0x000770, "Member 'UPla601_PostAnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UPla601_PostAnimBP_C, AnimGraphNode_ModifyBone_6) == 0x000798, "Member 'UPla601_PostAnimBP_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UPla601_PostAnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0008A0, "Member 'UPla601_PostAnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UPla601_PostAnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0008C0, "Member 'UPla601_PostAnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UPla601_PostAnimBP_C, AnimGraphNode_ModifyBone_5) == 0x0008E0, "Member 'UPla601_PostAnimBP_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UPla601_PostAnimBP_C, AnimGraphNode_ModifyBone_4) == 0x0009E8, "Member 'UPla601_PostAnimBP_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UPla601_PostAnimBP_C, AnimGraphNode_ModifyBone_3) == 0x000AF0, "Member 'UPla601_PostAnimBP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UPla601_PostAnimBP_C, AnimGraphNode_ModifyBone_2) == 0x000BF8, "Member 'UPla601_PostAnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UPla601_PostAnimBP_C, AnimGraphNode_TwoBoneIK_1) == 0x000D00, "Member 'UPla601_PostAnimBP_C::AnimGraphNode_TwoBoneIK_1' has a wrong offset!");
static_assert(offsetof(UPla601_PostAnimBP_C, AnimGraphNode_TwoBoneIK) == 0x000EE0, "Member 'UPla601_PostAnimBP_C::AnimGraphNode_TwoBoneIK' has a wrong offset!");
static_assert(offsetof(UPla601_PostAnimBP_C, AnimGraphNode_ModifyBone_1) == 0x0010C0, "Member 'UPla601_PostAnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UPla601_PostAnimBP_C, AnimGraphNode_ModifyBone) == 0x0011C8, "Member 'UPla601_PostAnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");

}

