#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pla603_AnimBP

#include "Basic.hpp"

#include "E_PLAYER_MOVEMENT_STATE_structs.hpp"
#include "E_MapAction_Pla603_structs.hpp"
#include "Project_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Pla603_AnimBP.Pla603_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Pla603_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Pla603_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Pla603_AnimBP_C_AnimGraph");
static_assert(sizeof(Pla603_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on Pla603_AnimBP_C_AnimGraph");
static_assert(offsetof(Pla603_AnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'Pla603_AnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.CheckIdle
// 0x0002 (0x0002 - 0x0000)
struct Pla603_AnimBP_C_CheckIdle final
{
public:
	bool                                          Idle;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_AnimBP_C_CheckIdle) == 0x000001, "Wrong alignment on Pla603_AnimBP_C_CheckIdle");
static_assert(sizeof(Pla603_AnimBP_C_CheckIdle) == 0x000002, "Wrong size on Pla603_AnimBP_C_CheckIdle");
static_assert(offsetof(Pla603_AnimBP_C_CheckIdle, Idle) == 0x000000, "Member 'Pla603_AnimBP_C_CheckIdle::Idle' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_CheckIdle, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'Pla603_AnimBP_C_CheckIdle::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetBoneMotionEnable
// 0x0001 (0x0001 - 0x0000)
struct Pla603_AnimBP_C_SetBoneMotionEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_AnimBP_C_SetBoneMotionEnable) == 0x000001, "Wrong alignment on Pla603_AnimBP_C_SetBoneMotionEnable");
static_assert(sizeof(Pla603_AnimBP_C_SetBoneMotionEnable) == 0x000001, "Wrong size on Pla603_AnimBP_C_SetBoneMotionEnable");
static_assert(offsetof(Pla603_AnimBP_C_SetBoneMotionEnable, Enable) == 0x000000, "Member 'Pla603_AnimBP_C_SetBoneMotionEnable::Enable' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetRootOffsetEnable
// 0x0001 (0x0001 - 0x0000)
struct Pla603_AnimBP_C_SetRootOffsetEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_AnimBP_C_SetRootOffsetEnable) == 0x000001, "Wrong alignment on Pla603_AnimBP_C_SetRootOffsetEnable");
static_assert(sizeof(Pla603_AnimBP_C_SetRootOffsetEnable) == 0x000001, "Wrong size on Pla603_AnimBP_C_SetRootOffsetEnable");
static_assert(offsetof(Pla603_AnimBP_C_SetRootOffsetEnable, Enable) == 0x000000, "Member 'Pla603_AnimBP_C_SetRootOffsetEnable::Enable' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetRootOffset
// 0x0018 (0x0018 - 0x0000)
struct Pla603_AnimBP_C_SetRootOffset final
{
public:
	struct FVector                                Offset;                                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DeltaRotation;                                     // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_AnimBP_C_SetRootOffset) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_SetRootOffset");
static_assert(sizeof(Pla603_AnimBP_C_SetRootOffset) == 0x000018, "Wrong size on Pla603_AnimBP_C_SetRootOffset");
static_assert(offsetof(Pla603_AnimBP_C_SetRootOffset, Offset) == 0x000000, "Member 'Pla603_AnimBP_C_SetRootOffset::Offset' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetRootOffset, DeltaRotation) == 0x00000C, "Member 'Pla603_AnimBP_C_SetRootOffset::DeltaRotation' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetLegIKEnable
// 0x0002 (0x0002 - 0x0000)
struct Pla603_AnimBP_C_SetLegIKEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Immediately;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_AnimBP_C_SetLegIKEnable) == 0x000001, "Wrong alignment on Pla603_AnimBP_C_SetLegIKEnable");
static_assert(sizeof(Pla603_AnimBP_C_SetLegIKEnable) == 0x000002, "Wrong size on Pla603_AnimBP_C_SetLegIKEnable");
static_assert(offsetof(Pla603_AnimBP_C_SetLegIKEnable, Enable) == 0x000000, "Member 'Pla603_AnimBP_C_SetLegIKEnable::Enable' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetLegIKEnable, Immediately) == 0x000001, "Member 'Pla603_AnimBP_C_SetLegIKEnable::Immediately' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetLegIKEffector
// 0x001C (0x001C - 0x0000)
struct Pla603_AnimBP_C_SetLegIKEffector final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DeltaRotation;                                     // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_AnimBP_C_SetLegIKEffector) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_SetLegIKEffector");
static_assert(sizeof(Pla603_AnimBP_C_SetLegIKEffector) == 0x00001C, "Wrong size on Pla603_AnimBP_C_SetLegIKEffector");
static_assert(offsetof(Pla603_AnimBP_C_SetLegIKEffector, Param_Index) == 0x000000, "Member 'Pla603_AnimBP_C_SetLegIKEffector::Param_Index' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetLegIKEffector, Location) == 0x000004, "Member 'Pla603_AnimBP_C_SetLegIKEffector::Location' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetLegIKEffector, DeltaRotation) == 0x000010, "Member 'Pla603_AnimBP_C_SetLegIKEffector::DeltaRotation' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetLegIKTarget
// 0x0010 (0x0010 - 0x0000)
struct Pla603_AnimBP_C_SetLegIKTarget final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_SetLegIKTarget) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_SetLegIKTarget");
static_assert(sizeof(Pla603_AnimBP_C_SetLegIKTarget) == 0x000010, "Wrong size on Pla603_AnimBP_C_SetLegIKTarget");
static_assert(offsetof(Pla603_AnimBP_C_SetLegIKTarget, Param_Index) == 0x000000, "Member 'Pla603_AnimBP_C_SetLegIKTarget::Param_Index' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetLegIKTarget, Location) == 0x000004, "Member 'Pla603_AnimBP_C_SetLegIKTarget::Location' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetBodyIKEnable
// 0x0002 (0x0002 - 0x0000)
struct Pla603_AnimBP_C_SetBodyIKEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Immediately;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_AnimBP_C_SetBodyIKEnable) == 0x000001, "Wrong alignment on Pla603_AnimBP_C_SetBodyIKEnable");
static_assert(sizeof(Pla603_AnimBP_C_SetBodyIKEnable) == 0x000002, "Wrong size on Pla603_AnimBP_C_SetBodyIKEnable");
static_assert(offsetof(Pla603_AnimBP_C_SetBodyIKEnable, Enable) == 0x000000, "Member 'Pla603_AnimBP_C_SetBodyIKEnable::Enable' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetBodyIKEnable, Immediately) == 0x000001, "Member 'Pla603_AnimBP_C_SetBodyIKEnable::Immediately' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetFloatingIKPerch
// 0x0004 (0x0004 - 0x0000)
struct Pla603_AnimBP_C_SetFloatingIKPerch final
{
public:
	float                                         Alpha;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_SetFloatingIKPerch) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_SetFloatingIKPerch");
static_assert(sizeof(Pla603_AnimBP_C_SetFloatingIKPerch) == 0x000004, "Wrong size on Pla603_AnimBP_C_SetFloatingIKPerch");
static_assert(offsetof(Pla603_AnimBP_C_SetFloatingIKPerch, Alpha) == 0x000000, "Member 'Pla603_AnimBP_C_SetFloatingIKPerch::Alpha' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetPrimaryWorldOffsetBoneTrans
// 0x0040 (0x0040 - 0x0000)
struct Pla603_AnimBP_C_SetPrimaryWorldOffsetBoneTrans final
{
public:
	struct FTransform                             Trans;                                             // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         BlendAlpha;                                        // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_SetPrimaryWorldOffsetBoneTrans) == 0x000010, "Wrong alignment on Pla603_AnimBP_C_SetPrimaryWorldOffsetBoneTrans");
static_assert(sizeof(Pla603_AnimBP_C_SetPrimaryWorldOffsetBoneTrans) == 0x000040, "Wrong size on Pla603_AnimBP_C_SetPrimaryWorldOffsetBoneTrans");
static_assert(offsetof(Pla603_AnimBP_C_SetPrimaryWorldOffsetBoneTrans, Trans) == 0x000000, "Member 'Pla603_AnimBP_C_SetPrimaryWorldOffsetBoneTrans::Trans' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetPrimaryWorldOffsetBoneTrans, BlendAlpha) == 0x000030, "Member 'Pla603_AnimBP_C_SetPrimaryWorldOffsetBoneTrans::BlendAlpha' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetEnableBoneTrans
// 0x0001 (0x0001 - 0x0000)
struct Pla603_AnimBP_C_SetEnableBoneTrans final
{
public:
	bool                                          IsEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_AnimBP_C_SetEnableBoneTrans) == 0x000001, "Wrong alignment on Pla603_AnimBP_C_SetEnableBoneTrans");
static_assert(sizeof(Pla603_AnimBP_C_SetEnableBoneTrans) == 0x000001, "Wrong size on Pla603_AnimBP_C_SetEnableBoneTrans");
static_assert(offsetof(Pla603_AnimBP_C_SetEnableBoneTrans, IsEnable) == 0x000000, "Member 'Pla603_AnimBP_C_SetEnableBoneTrans::IsEnable' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetWorldOffsetBoneTranses
// 0x0020 (0x0020 - 0x0000)
struct Pla603_AnimBP_C_SetWorldOffsetBoneTranses final
{
public:
	TArray<struct FTransform>                     Transes;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<float>                                 TransAlphas;                                       // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Pla603_AnimBP_C_SetWorldOffsetBoneTranses) == 0x000008, "Wrong alignment on Pla603_AnimBP_C_SetWorldOffsetBoneTranses");
static_assert(sizeof(Pla603_AnimBP_C_SetWorldOffsetBoneTranses) == 0x000020, "Wrong size on Pla603_AnimBP_C_SetWorldOffsetBoneTranses");
static_assert(offsetof(Pla603_AnimBP_C_SetWorldOffsetBoneTranses, Transes) == 0x000000, "Member 'Pla603_AnimBP_C_SetWorldOffsetBoneTranses::Transes' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetWorldOffsetBoneTranses, TransAlphas) == 0x000010, "Member 'Pla603_AnimBP_C_SetWorldOffsetBoneTranses::TransAlphas' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetInvalidLegIK
// 0x0008 (0x0008 - 0x0000)
struct Pla603_AnimBP_C_SetInvalidLegIK final
{
public:
	bool                                          Invalid;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8502[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param_Index;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_SetInvalidLegIK) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_SetInvalidLegIK");
static_assert(sizeof(Pla603_AnimBP_C_SetInvalidLegIK) == 0x000008, "Wrong size on Pla603_AnimBP_C_SetInvalidLegIK");
static_assert(offsetof(Pla603_AnimBP_C_SetInvalidLegIK, Invalid) == 0x000000, "Member 'Pla603_AnimBP_C_SetInvalidLegIK::Invalid' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetInvalidLegIK, Param_Index) == 0x000004, "Member 'Pla603_AnimBP_C_SetInvalidLegIK::Param_Index' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetHeadIKRotationTick
// 0x0014 (0x0014 - 0x0000)
struct Pla603_AnimBP_C_SetHeadIKRotationTick final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         DeltaTime;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_SetHeadIKRotationTick) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_SetHeadIKRotationTick");
static_assert(sizeof(Pla603_AnimBP_C_SetHeadIKRotationTick) == 0x000014, "Wrong size on Pla603_AnimBP_C_SetHeadIKRotationTick");
static_assert(offsetof(Pla603_AnimBP_C_SetHeadIKRotationTick, Param_Index) == 0x000000, "Member 'Pla603_AnimBP_C_SetHeadIKRotationTick::Param_Index' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetHeadIKRotationTick, Rotation) == 0x000004, "Member 'Pla603_AnimBP_C_SetHeadIKRotationTick::Rotation' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetHeadIKRotationTick, DeltaTime) == 0x000010, "Member 'Pla603_AnimBP_C_SetHeadIKRotationTick::DeltaTime' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.InvalidLookAt
// 0x0001 (0x0001 - 0x0000)
struct Pla603_AnimBP_C_InvalidLookAt final
{
public:
	bool                                          Invalid;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_AnimBP_C_InvalidLookAt) == 0x000001, "Wrong alignment on Pla603_AnimBP_C_InvalidLookAt");
static_assert(sizeof(Pla603_AnimBP_C_InvalidLookAt) == 0x000001, "Wrong size on Pla603_AnimBP_C_InvalidLookAt");
static_assert(offsetof(Pla603_AnimBP_C_InvalidLookAt, Invalid) == 0x000000, "Member 'Pla603_AnimBP_C_InvalidLookAt::Invalid' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.ChangeTwistAsset
// 0x0004 (0x0004 - 0x0000)
struct Pla603_AnimBP_C_ChangeTwistAsset final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_ChangeTwistAsset) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_ChangeTwistAsset");
static_assert(sizeof(Pla603_AnimBP_C_ChangeTwistAsset) == 0x000004, "Wrong size on Pla603_AnimBP_C_ChangeTwistAsset");
static_assert(offsetof(Pla603_AnimBP_C_ChangeTwistAsset, Param_Index) == 0x000000, "Member 'Pla603_AnimBP_C_ChangeTwistAsset::Param_Index' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetHeadIKInterpSpeed
// 0x0004 (0x0004 - 0x0000)
struct Pla603_AnimBP_C_SetHeadIKInterpSpeed final
{
public:
	float                                         NewSpeed;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_SetHeadIKInterpSpeed) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_SetHeadIKInterpSpeed");
static_assert(sizeof(Pla603_AnimBP_C_SetHeadIKInterpSpeed) == 0x000004, "Wrong size on Pla603_AnimBP_C_SetHeadIKInterpSpeed");
static_assert(offsetof(Pla603_AnimBP_C_SetHeadIKInterpSpeed, NewSpeed) == 0x000000, "Member 'Pla603_AnimBP_C_SetHeadIKInterpSpeed::NewSpeed' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetMumbleEnable
// 0x0001 (0x0001 - 0x0000)
struct Pla603_AnimBP_C_SetMumbleEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_AnimBP_C_SetMumbleEnable) == 0x000001, "Wrong alignment on Pla603_AnimBP_C_SetMumbleEnable");
static_assert(sizeof(Pla603_AnimBP_C_SetMumbleEnable) == 0x000001, "Wrong size on Pla603_AnimBP_C_SetMumbleEnable");
static_assert(offsetof(Pla603_AnimBP_C_SetMumbleEnable, Enable) == 0x000000, "Member 'Pla603_AnimBP_C_SetMumbleEnable::Enable' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetMumbleAnimation
// 0x0008 (0x0008 - 0x0000)
struct Pla603_AnimBP_C_SetMumbleAnimation final
{
public:
	class UAnimSequenceBase*                      Animation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_SetMumbleAnimation) == 0x000008, "Wrong alignment on Pla603_AnimBP_C_SetMumbleAnimation");
static_assert(sizeof(Pla603_AnimBP_C_SetMumbleAnimation) == 0x000008, "Wrong size on Pla603_AnimBP_C_SetMumbleAnimation");
static_assert(offsetof(Pla603_AnimBP_C_SetMumbleAnimation, Animation) == 0x000000, "Member 'Pla603_AnimBP_C_SetMumbleAnimation::Animation' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetRunMotionRate
// 0x0004 (0x0004 - 0x0000)
struct Pla603_AnimBP_C_SetRunMotionRate final
{
public:
	float                                         RunRate;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_SetRunMotionRate) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_SetRunMotionRate");
static_assert(sizeof(Pla603_AnimBP_C_SetRunMotionRate) == 0x000004, "Wrong size on Pla603_AnimBP_C_SetRunMotionRate");
static_assert(offsetof(Pla603_AnimBP_C_SetRunMotionRate, RunRate) == 0x000000, "Member 'Pla603_AnimBP_C_SetRunMotionRate::RunRate' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetEventMotionSpace
// 0x0010 (0x0010 - 0x0000)
struct Pla603_AnimBP_C_SetEventMotionSpace final
{
public:
	class UBlendSpace*                            BlendSpace;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_SetEventMotionSpace) == 0x000008, "Wrong alignment on Pla603_AnimBP_C_SetEventMotionSpace");
static_assert(sizeof(Pla603_AnimBP_C_SetEventMotionSpace) == 0x000010, "Wrong size on Pla603_AnimBP_C_SetEventMotionSpace");
static_assert(offsetof(Pla603_AnimBP_C_SetEventMotionSpace, BlendSpace) == 0x000000, "Member 'Pla603_AnimBP_C_SetEventMotionSpace::BlendSpace' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetEventMotionSpace, Param_Index) == 0x000008, "Member 'Pla603_AnimBP_C_SetEventMotionSpace::Param_Index' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetEventMotionTap
// 0x0001 (0x0001 - 0x0000)
struct Pla603_AnimBP_C_SetEventMotionTap final
{
public:
	bool                                          TapFlag;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_AnimBP_C_SetEventMotionTap) == 0x000001, "Wrong alignment on Pla603_AnimBP_C_SetEventMotionTap");
static_assert(sizeof(Pla603_AnimBP_C_SetEventMotionTap) == 0x000001, "Wrong size on Pla603_AnimBP_C_SetEventMotionTap");
static_assert(offsetof(Pla603_AnimBP_C_SetEventMotionTap, TapFlag) == 0x000000, "Member 'Pla603_AnimBP_C_SetEventMotionTap::TapFlag' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetEventMotionVal
// 0x0008 (0x0008 - 0x0000)
struct Pla603_AnimBP_C_SetEventMotionVal final
{
public:
	struct FVector2D                              Input;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_SetEventMotionVal) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_SetEventMotionVal");
static_assert(sizeof(Pla603_AnimBP_C_SetEventMotionVal) == 0x000008, "Wrong size on Pla603_AnimBP_C_SetEventMotionVal");
static_assert(offsetof(Pla603_AnimBP_C_SetEventMotionVal, Input) == 0x000000, "Member 'Pla603_AnimBP_C_SetEventMotionVal::Input' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.PlayMapAction
// 0x0001 (0x0001 - 0x0000)
struct Pla603_AnimBP_C_PlayMapAction final
{
public:
	E_MapAction_Pla603                            Action;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_PlayMapAction) == 0x000001, "Wrong alignment on Pla603_AnimBP_C_PlayMapAction");
static_assert(sizeof(Pla603_AnimBP_C_PlayMapAction) == 0x000001, "Wrong size on Pla603_AnimBP_C_PlayMapAction");
static_assert(offsetof(Pla603_AnimBP_C_PlayMapAction, Action) == 0x000000, "Member 'Pla603_AnimBP_C_PlayMapAction::Action' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.TickMapAction
// 0x0004 (0x0004 - 0x0000)
struct Pla603_AnimBP_C_TickMapAction final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_TickMapAction) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_TickMapAction");
static_assert(sizeof(Pla603_AnimBP_C_TickMapAction) == 0x000004, "Wrong size on Pla603_AnimBP_C_TickMapAction");
static_assert(offsetof(Pla603_AnimBP_C_TickMapAction, DeltaSeconds) == 0x000000, "Member 'Pla603_AnimBP_C_TickMapAction::DeltaSeconds' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetMovementTurnState
// 0x0008 (0x0008 - 0x0000)
struct Pla603_AnimBP_C_SetMovementTurnState final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8503[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Angle;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_SetMovementTurnState) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_SetMovementTurnState");
static_assert(sizeof(Pla603_AnimBP_C_SetMovementTurnState) == 0x000008, "Wrong size on Pla603_AnimBP_C_SetMovementTurnState");
static_assert(offsetof(Pla603_AnimBP_C_SetMovementTurnState, State) == 0x000000, "Member 'Pla603_AnimBP_C_SetMovementTurnState::State' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetMovementTurnState, Angle) == 0x000004, "Member 'Pla603_AnimBP_C_SetMovementTurnState::Angle' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Pla603_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(Pla603_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Pla603_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(Pla603_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Pla603_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetHeadIKRotation
// 0x0010 (0x0010 - 0x0000)
struct Pla603_AnimBP_C_SetHeadIKRotation final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_AnimBP_C_SetHeadIKRotation) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_SetHeadIKRotation");
static_assert(sizeof(Pla603_AnimBP_C_SetHeadIKRotation) == 0x000010, "Wrong size on Pla603_AnimBP_C_SetHeadIKRotation");
static_assert(offsetof(Pla603_AnimBP_C_SetHeadIKRotation, Param_Index) == 0x000000, "Member 'Pla603_AnimBP_C_SetHeadIKRotation::Param_Index' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetHeadIKRotation, Rotation) == 0x000004, "Member 'Pla603_AnimBP_C_SetHeadIKRotation::Rotation' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetEyeIKRotation
// 0x0010 (0x0010 - 0x0000)
struct Pla603_AnimBP_C_SetEyeIKRotation final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_AnimBP_C_SetEyeIKRotation) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_SetEyeIKRotation");
static_assert(sizeof(Pla603_AnimBP_C_SetEyeIKRotation) == 0x000010, "Wrong size on Pla603_AnimBP_C_SetEyeIKRotation");
static_assert(offsetof(Pla603_AnimBP_C_SetEyeIKRotation, Param_Index) == 0x000000, "Member 'Pla603_AnimBP_C_SetEyeIKRotation::Param_Index' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetEyeIKRotation, Rotation) == 0x000004, "Member 'Pla603_AnimBP_C_SetEyeIKRotation::Rotation' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetAnimationMode
// 0x0008 (0x0008 - 0x0000)
struct Pla603_AnimBP_C_SetAnimationMode final
{
public:
	E_CHARA_ANIMATION_MODE                        Mode;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8504[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendTime;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_SetAnimationMode) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_SetAnimationMode");
static_assert(sizeof(Pla603_AnimBP_C_SetAnimationMode) == 0x000008, "Wrong size on Pla603_AnimBP_C_SetAnimationMode");
static_assert(offsetof(Pla603_AnimBP_C_SetAnimationMode, Mode) == 0x000000, "Member 'Pla603_AnimBP_C_SetAnimationMode::Mode' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetAnimationMode, BlendTime) == 0x000004, "Member 'Pla603_AnimBP_C_SetAnimationMode::BlendTime' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetHeadIKEnable
// 0x0002 (0x0002 - 0x0000)
struct Pla603_AnimBP_C_SetHeadIKEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Immediately;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_AnimBP_C_SetHeadIKEnable) == 0x000001, "Wrong alignment on Pla603_AnimBP_C_SetHeadIKEnable");
static_assert(sizeof(Pla603_AnimBP_C_SetHeadIKEnable) == 0x000002, "Wrong size on Pla603_AnimBP_C_SetHeadIKEnable");
static_assert(offsetof(Pla603_AnimBP_C_SetHeadIKEnable, Enable) == 0x000000, "Member 'Pla603_AnimBP_C_SetHeadIKEnable::Enable' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetHeadIKEnable, Immediately) == 0x000001, "Member 'Pla603_AnimBP_C_SetHeadIKEnable::Immediately' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetEyeIKEnable
// 0x0002 (0x0002 - 0x0000)
struct Pla603_AnimBP_C_SetEyeIKEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Immediately;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_AnimBP_C_SetEyeIKEnable) == 0x000001, "Wrong alignment on Pla603_AnimBP_C_SetEyeIKEnable");
static_assert(sizeof(Pla603_AnimBP_C_SetEyeIKEnable) == 0x000002, "Wrong size on Pla603_AnimBP_C_SetEyeIKEnable");
static_assert(offsetof(Pla603_AnimBP_C_SetEyeIKEnable, Enable) == 0x000000, "Member 'Pla603_AnimBP_C_SetEyeIKEnable::Enable' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetEyeIKEnable, Immediately) == 0x000001, "Member 'Pla603_AnimBP_C_SetEyeIKEnable::Immediately' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetRotateAlphaInterpSpeed
// 0x0008 (0x0008 - 0x0000)
struct Pla603_AnimBP_C_SetRotateAlphaInterpSpeed final
{
public:
	float                                         StartSpeed;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndSpeed;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_SetRotateAlphaInterpSpeed) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_SetRotateAlphaInterpSpeed");
static_assert(sizeof(Pla603_AnimBP_C_SetRotateAlphaInterpSpeed) == 0x000008, "Wrong size on Pla603_AnimBP_C_SetRotateAlphaInterpSpeed");
static_assert(offsetof(Pla603_AnimBP_C_SetRotateAlphaInterpSpeed, StartSpeed) == 0x000000, "Member 'Pla603_AnimBP_C_SetRotateAlphaInterpSpeed::StartSpeed' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetRotateAlphaInterpSpeed, EndSpeed) == 0x000004, "Member 'Pla603_AnimBP_C_SetRotateAlphaInterpSpeed::EndSpeed' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetRotateIdleAnimation
// 0x0008 (0x0008 - 0x0000)
struct Pla603_AnimBP_C_SetRotateIdleAnimation final
{
public:
	class UAnimSequenceBase*                      RotateIdle;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_SetRotateIdleAnimation) == 0x000008, "Wrong alignment on Pla603_AnimBP_C_SetRotateIdleAnimation");
static_assert(sizeof(Pla603_AnimBP_C_SetRotateIdleAnimation) == 0x000008, "Wrong size on Pla603_AnimBP_C_SetRotateIdleAnimation");
static_assert(offsetof(Pla603_AnimBP_C_SetRotateIdleAnimation, RotateIdle) == 0x000000, "Member 'Pla603_AnimBP_C_SetRotateIdleAnimation::RotateIdle' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetRotateBlend
// 0x0010 (0x0010 - 0x0000)
struct Pla603_AnimBP_C_SetRotateBlend final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8505[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Val;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace1D*                          BlendSpace;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_SetRotateBlend) == 0x000008, "Wrong alignment on Pla603_AnimBP_C_SetRotateBlend");
static_assert(sizeof(Pla603_AnimBP_C_SetRotateBlend) == 0x000010, "Wrong size on Pla603_AnimBP_C_SetRotateBlend");
static_assert(offsetof(Pla603_AnimBP_C_SetRotateBlend, Enable) == 0x000000, "Member 'Pla603_AnimBP_C_SetRotateBlend::Enable' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetRotateBlend, Val) == 0x000004, "Member 'Pla603_AnimBP_C_SetRotateBlend::Val' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetRotateBlend, BlendSpace) == 0x000008, "Member 'Pla603_AnimBP_C_SetRotateBlend::BlendSpace' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetDefaultAnimation
// 0x0008 (0x0008 - 0x0000)
struct Pla603_AnimBP_C_SetDefaultAnimation final
{
public:
	class UAnimSequenceBase*                      Animation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_SetDefaultAnimation) == 0x000008, "Wrong alignment on Pla603_AnimBP_C_SetDefaultAnimation");
static_assert(sizeof(Pla603_AnimBP_C_SetDefaultAnimation) == 0x000008, "Wrong size on Pla603_AnimBP_C_SetDefaultAnimation");
static_assert(offsetof(Pla603_AnimBP_C_SetDefaultAnimation, Animation) == 0x000000, "Member 'Pla603_AnimBP_C_SetDefaultAnimation::Animation' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetLookAtEnable
// 0x0001 (0x0001 - 0x0000)
struct Pla603_AnimBP_C_SetLookAtEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_AnimBP_C_SetLookAtEnable) == 0x000001, "Wrong alignment on Pla603_AnimBP_C_SetLookAtEnable");
static_assert(sizeof(Pla603_AnimBP_C_SetLookAtEnable) == 0x000001, "Wrong size on Pla603_AnimBP_C_SetLookAtEnable");
static_assert(offsetof(Pla603_AnimBP_C_SetLookAtEnable, Enable) == 0x000000, "Member 'Pla603_AnimBP_C_SetLookAtEnable::Enable' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetPoseWeightTable
// 0x0008 (0x0008 - 0x0000)
struct Pla603_AnimBP_C_SetPoseWeightTable final
{
public:
	class UCustomPoseWeightTable*                 Param_PoseWeightTable;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_SetPoseWeightTable) == 0x000008, "Wrong alignment on Pla603_AnimBP_C_SetPoseWeightTable");
static_assert(sizeof(Pla603_AnimBP_C_SetPoseWeightTable) == 0x000008, "Wrong size on Pla603_AnimBP_C_SetPoseWeightTable");
static_assert(offsetof(Pla603_AnimBP_C_SetPoseWeightTable, Param_PoseWeightTable) == 0x000000, "Member 'Pla603_AnimBP_C_SetPoseWeightTable::Param_PoseWeightTable' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetMovementVelocity
// 0x0018 (0x0018 - 0x0000)
struct Pla603_AnimBP_C_SetMovementVelocity final
{
public:
	struct FVector                                IdealVelocity;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Input;                                             // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_SetMovementVelocity) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_SetMovementVelocity");
static_assert(sizeof(Pla603_AnimBP_C_SetMovementVelocity) == 0x000018, "Wrong size on Pla603_AnimBP_C_SetMovementVelocity");
static_assert(offsetof(Pla603_AnimBP_C_SetMovementVelocity, IdealVelocity) == 0x000000, "Member 'Pla603_AnimBP_C_SetMovementVelocity::IdealVelocity' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetMovementVelocity, Input) == 0x00000C, "Member 'Pla603_AnimBP_C_SetMovementVelocity::Input' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetMovementRotation
// 0x0018 (0x0018 - 0x0000)
struct Pla603_AnimBP_C_SetMovementRotation final
{
public:
	struct FRotator                               MomentRotation;                                    // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               SlopeRotation;                                     // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_AnimBP_C_SetMovementRotation) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_SetMovementRotation");
static_assert(sizeof(Pla603_AnimBP_C_SetMovementRotation) == 0x000018, "Wrong size on Pla603_AnimBP_C_SetMovementRotation");
static_assert(offsetof(Pla603_AnimBP_C_SetMovementRotation, MomentRotation) == 0x000000, "Member 'Pla603_AnimBP_C_SetMovementRotation::MomentRotation' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetMovementRotation, SlopeRotation) == 0x00000C, "Member 'Pla603_AnimBP_C_SetMovementRotation::SlopeRotation' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetMovementState
// 0x0001 (0x0001 - 0x0000)
struct Pla603_AnimBP_C_SetMovementState final
{
public:
	E_PLAYER_MOVEMENT_STATE                       State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_SetMovementState) == 0x000001, "Wrong alignment on Pla603_AnimBP_C_SetMovementState");
static_assert(sizeof(Pla603_AnimBP_C_SetMovementState) == 0x000001, "Wrong size on Pla603_AnimBP_C_SetMovementState");
static_assert(offsetof(Pla603_AnimBP_C_SetMovementState, State) == 0x000000, "Member 'Pla603_AnimBP_C_SetMovementState::State' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.TriggerLanding
// 0x0004 (0x0004 - 0x0000)
struct Pla603_AnimBP_C_TriggerLanding final
{
public:
	float                                         JumpHeight;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_TriggerLanding) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_TriggerLanding");
static_assert(sizeof(Pla603_AnimBP_C_TriggerLanding) == 0x000004, "Wrong size on Pla603_AnimBP_C_TriggerLanding");
static_assert(offsetof(Pla603_AnimBP_C_TriggerLanding, JumpHeight) == 0x000000, "Member 'Pla603_AnimBP_C_TriggerLanding::JumpHeight' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetHeadBlendAnimation
// 0x0008 (0x0008 - 0x0000)
struct Pla603_AnimBP_C_SetHeadBlendAnimation final
{
public:
	class UAnimSequenceBase*                      Animation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_SetHeadBlendAnimation) == 0x000008, "Wrong alignment on Pla603_AnimBP_C_SetHeadBlendAnimation");
static_assert(sizeof(Pla603_AnimBP_C_SetHeadBlendAnimation) == 0x000008, "Wrong size on Pla603_AnimBP_C_SetHeadBlendAnimation");
static_assert(offsetof(Pla603_AnimBP_C_SetHeadBlendAnimation, Animation) == 0x000000, "Member 'Pla603_AnimBP_C_SetHeadBlendAnimation::Animation' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetHeadBlendFlag
// 0x0001 (0x0001 - 0x0000)
struct Pla603_AnimBP_C_SetHeadBlendFlag final
{
public:
	bool                                          BlendFlag;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_AnimBP_C_SetHeadBlendFlag) == 0x000001, "Wrong alignment on Pla603_AnimBP_C_SetHeadBlendFlag");
static_assert(sizeof(Pla603_AnimBP_C_SetHeadBlendFlag) == 0x000001, "Wrong size on Pla603_AnimBP_C_SetHeadBlendFlag");
static_assert(offsetof(Pla603_AnimBP_C_SetHeadBlendFlag, BlendFlag) == 0x000000, "Member 'Pla603_AnimBP_C_SetHeadBlendFlag::BlendFlag' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetExpressionEnable
// 0x0008 (0x0008 - 0x0000)
struct Pla603_AnimBP_C_SetExpressionEnable final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_AnimBP_C_SetExpressionEnable) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_SetExpressionEnable");
static_assert(sizeof(Pla603_AnimBP_C_SetExpressionEnable) == 0x000008, "Wrong size on Pla603_AnimBP_C_SetExpressionEnable");
static_assert(offsetof(Pla603_AnimBP_C_SetExpressionEnable, Param_Index) == 0x000000, "Member 'Pla603_AnimBP_C_SetExpressionEnable::Param_Index' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetExpressionEnable, Enable) == 0x000004, "Member 'Pla603_AnimBP_C_SetExpressionEnable::Enable' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetExpressionAttenuate
// 0x000C (0x000C - 0x0000)
struct Pla603_AnimBP_C_SetExpressionAttenuate final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_LidExpressionAttenuate;                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_LipExpressionAttenuate;                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pla603_AnimBP_C_SetExpressionAttenuate) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_SetExpressionAttenuate");
static_assert(sizeof(Pla603_AnimBP_C_SetExpressionAttenuate) == 0x00000C, "Wrong size on Pla603_AnimBP_C_SetExpressionAttenuate");
static_assert(offsetof(Pla603_AnimBP_C_SetExpressionAttenuate, Param_Index) == 0x000000, "Member 'Pla603_AnimBP_C_SetExpressionAttenuate::Param_Index' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetExpressionAttenuate, Param_LidExpressionAttenuate) == 0x000004, "Member 'Pla603_AnimBP_C_SetExpressionAttenuate::Param_LidExpressionAttenuate' has a wrong offset!");
static_assert(offsetof(Pla603_AnimBP_C_SetExpressionAttenuate, Param_LipExpressionAttenuate) == 0x000008, "Member 'Pla603_AnimBP_C_SetExpressionAttenuate::Param_LipExpressionAttenuate' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetSwordOpen
// 0x0001 (0x0001 - 0x0000)
struct Pla603_AnimBP_C_SetSwordOpen final
{
public:
	bool                                          bSwordOpen;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pla603_AnimBP_C_SetSwordOpen) == 0x000001, "Wrong alignment on Pla603_AnimBP_C_SetSwordOpen");
static_assert(sizeof(Pla603_AnimBP_C_SetSwordOpen) == 0x000001, "Wrong size on Pla603_AnimBP_C_SetSwordOpen");
static_assert(offsetof(Pla603_AnimBP_C_SetSwordOpen, bSwordOpen) == 0x000000, "Member 'Pla603_AnimBP_C_SetSwordOpen::bSwordOpen' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.SetKawaiiHairParameter
// 0x007C (0x007C - 0x0000)
struct Pla603_AnimBP_C_SetKawaiiHairParameter final
{
public:
	struct FRuntimeKawaiiHairParameter            InParam;                                           // 0x0000(0x007C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Pla603_AnimBP_C_SetKawaiiHairParameter) == 0x000004, "Wrong alignment on Pla603_AnimBP_C_SetKawaiiHairParameter");
static_assert(sizeof(Pla603_AnimBP_C_SetKawaiiHairParameter) == 0x00007C, "Wrong size on Pla603_AnimBP_C_SetKawaiiHairParameter");
static_assert(offsetof(Pla603_AnimBP_C_SetKawaiiHairParameter, InParam) == 0x000000, "Member 'Pla603_AnimBP_C_SetKawaiiHairParameter::InParam' has a wrong offset!");

// Function Pla603_AnimBP.Pla603_AnimBP_C.ExecuteUbergraph_Pla603_AnimBP
// 0x0620 (0x0620 - 0x0000)
struct Pla603_AnimBP_C_ExecuteUbergraph_Pla603_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Invalid;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8506[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Index_5;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_6;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Event_Rotation_2;                           // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaTime;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewSpeed;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Invalid_1;                            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8507[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Index_7;                              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8508[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     K2Node_Event_Transes;                              // 0x0030(0x0010)(ConstParm, ReferenceParm)
	TArray<float>                                 K2Node_Event_TransAlphas;                          // 0x0040(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsEnable;                             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8509[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_850A[0x2];                                     // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_1; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_850B[0xC];                                     // 0x0064(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Event_Trans;                                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_BlendAlpha;                           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_850C[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_2; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_2;      // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_850D[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_3; // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_3;      // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_850E[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Alpha;                                // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_4; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_4;      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_850F[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8510[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8511[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAsin_ReturnValue;                      // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_5;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8512[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x00FC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCurrentStateName_ReturnValue;          // 0x0104(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_5; // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
