#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerCameraInitParam

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct PlayerCameraInitParam.PlayerCameraInitParam
// 0x00A4 (0x00A4 - 0x0000)
struct FPlayerCameraInitParam final
{
public:
	float                                         Camera_Length_10_14F96AFB4BEF5E840E500FACEF3E2428; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Camera_FOV_12_706467AF40ACBCF117A47CBACC9E162F;    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Root_Height_14_423F7763457F4AE0AF3C5186082BF4A0;   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dush_FOV_62_8F488BB9482FBC38E091268FEC62E202;      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dush_Distance_63_5AB5C32E41DFBC8168CB7DBFBF65CEBE; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dush_Height_64_1E3C2BE54BAE8D2F6EF2F483B7A54392;   // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dush_EsesInSpeed_65_F9826A7A4300F2FCC61BF9A74EFCF2AE; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dush_EsesOutSpeed_66_E6E224C547A5049AD22D40A940995EDF; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Attack_FOV_36_94B4424445402A8C7EBB559D4B32ECA3;    // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Attack_Distance_37_8E6915124C23B1B6DD5B31867BFE0834; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Attack_Height_79_893D75FE40694C75021482B910D56BC2; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Attack_EaseINSpeed_38_909591C645E70F8C4BD12ABA74DDE6C3; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Attack_EaseOUTSpeed_39_2C5889B04BBB02469F945E97A044AD5E; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Slide_FOV_71_23AB49BF4F59E96B2BFDE48F90515176;     // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Slide_Distance_70_EE6082D94F1D3290335E70AF2B2BF936; // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Slide_Height_68_65CAD0414CD5197022F9988F8B774528;  // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Slide_EaseINSpeed_72_15C9C4B448088D27FD15979725BC627F; // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Slide_EaseOUTSpeed_73_7094FFAA42724E8987C7338099807B4E; // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Grip_FOV_81_81FAB6B74510C8ECDBFA2A993DD003EE;      // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Grip_Distance_82_A82CDDCD455DBFF35B1AE78AA6A5EB16; // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Grip_Height_83_30C771294405A2DEDCF811B4E44894C4;   // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Grip_EaseINSpeed_84_DB29D5A44CD805E9AD5E539FFBE20366; // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Grip_EaseOUTSpeed_85_1FDEEE014394BC051BB81EA04D7D627E; // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tokyo_Root_Height_50_17BB25F147C1BD0A99732B97CCB31F7D; // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tokyo_FOV_51_BA9DA77146BC46FC0FF1AC85AE01CD95;     // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tokyo_CameraLength_49_EF261474457AC7EED256C8ABE0C59DF9; // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraUPForward_42_7988B99F421C7B9B3700009C10390F04; // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Camera_Height_11_E2F49299478E772F4DCAF182B16C0B71; // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dungeon_RootHeight_93_19D2F6C14B39D1589BF6DC8038D1B543; // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dungeon_FOV_94_866EDE364F4D747506CBA48B30E4D35E;   // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dungeon_CameraLength_95_A51BC99E4CA044CA017820AA6EE498E9; // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DushShake_EaseINSpeed_100_53A25E4947CC5B1E72E39D8047079242; // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DushShake_EaseOUTSpeed_101_821FCFC841A0B4C767FD98AB30D08C8B; // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SP_CameraLength_107_21BD0D1B465D7432743D6F9236098F1A; // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SP_CameraFOV_108_02B7EC8C46C74FC8952D378A073C3EEA; // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraDownForward_111_BD1D741E472BA0DF667DBC9A9EDC5422; // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraUpBack_114_4BA4E41E49B88E689D9A89AC24516CE8; // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraDownForward_Tokyo_120_9011E35A4FAD214619FE669C4DFA18EF; // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraUpBack_Tokyo_121_C3554F5D4878B7282623D3BE88C61963; // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SP2_CameraLength_127_C30783CA4A188A244101879A5A04CC9F; // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SP2_CameraFOV_128_74A8E7CB48245583668617BF9B975751; // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPlayerCameraInitParam) == 0x000004, "Wrong alignment on FPlayerCameraInitParam");
static_assert(sizeof(FPlayerCameraInitParam) == 0x0000A4, "Wrong size on FPlayerCameraInitParam");
static_assert(offsetof(FPlayerCameraInitParam, Camera_Length_10_14F96AFB4BEF5E840E500FACEF3E2428) == 0x000000, "Member 'FPlayerCameraInitParam::Camera_Length_10_14F96AFB4BEF5E840E500FACEF3E2428' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Camera_FOV_12_706467AF40ACBCF117A47CBACC9E162F) == 0x000004, "Member 'FPlayerCameraInitParam::Camera_FOV_12_706467AF40ACBCF117A47CBACC9E162F' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Root_Height_14_423F7763457F4AE0AF3C5186082BF4A0) == 0x000008, "Member 'FPlayerCameraInitParam::Root_Height_14_423F7763457F4AE0AF3C5186082BF4A0' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Dush_FOV_62_8F488BB9482FBC38E091268FEC62E202) == 0x00000C, "Member 'FPlayerCameraInitParam::Dush_FOV_62_8F488BB9482FBC38E091268FEC62E202' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Dush_Distance_63_5AB5C32E41DFBC8168CB7DBFBF65CEBE) == 0x000010, "Member 'FPlayerCameraInitParam::Dush_Distance_63_5AB5C32E41DFBC8168CB7DBFBF65CEBE' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Dush_Height_64_1E3C2BE54BAE8D2F6EF2F483B7A54392) == 0x000014, "Member 'FPlayerCameraInitParam::Dush_Height_64_1E3C2BE54BAE8D2F6EF2F483B7A54392' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Dush_EsesInSpeed_65_F9826A7A4300F2FCC61BF9A74EFCF2AE) == 0x000018, "Member 'FPlayerCameraInitParam::Dush_EsesInSpeed_65_F9826A7A4300F2FCC61BF9A74EFCF2AE' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Dush_EsesOutSpeed_66_E6E224C547A5049AD22D40A940995EDF) == 0x00001C, "Member 'FPlayerCameraInitParam::Dush_EsesOutSpeed_66_E6E224C547A5049AD22D40A940995EDF' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Attack_FOV_36_94B4424445402A8C7EBB559D4B32ECA3) == 0x000020, "Member 'FPlayerCameraInitParam::Attack_FOV_36_94B4424445402A8C7EBB559D4B32ECA3' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Attack_Distance_37_8E6915124C23B1B6DD5B31867BFE0834) == 0x000024, "Member 'FPlayerCameraInitParam::Attack_Distance_37_8E6915124C23B1B6DD5B31867BFE0834' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Attack_Height_79_893D75FE40694C75021482B910D56BC2) == 0x000028, "Member 'FPlayerCameraInitParam::Attack_Height_79_893D75FE40694C75021482B910D56BC2' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Attack_EaseINSpeed_38_909591C645E70F8C4BD12ABA74DDE6C3) == 0x00002C, "Member 'FPlayerCameraInitParam::Attack_EaseINSpeed_38_909591C645E70F8C4BD12ABA74DDE6C3' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Attack_EaseOUTSpeed_39_2C5889B04BBB02469F945E97A044AD5E) == 0x000030, "Member 'FPlayerCameraInitParam::Attack_EaseOUTSpeed_39_2C5889B04BBB02469F945E97A044AD5E' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Slide_FOV_71_23AB49BF4F59E96B2BFDE48F90515176) == 0x000034, "Member 'FPlayerCameraInitParam::Slide_FOV_71_23AB49BF4F59E96B2BFDE48F90515176' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Slide_Distance_70_EE6082D94F1D3290335E70AF2B2BF936) == 0x000038, "Member 'FPlayerCameraInitParam::Slide_Distance_70_EE6082D94F1D3290335E70AF2B2BF936' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Slide_Height_68_65CAD0414CD5197022F9988F8B774528) == 0x00003C, "Member 'FPlayerCameraInitParam::Slide_Height_68_65CAD0414CD5197022F9988F8B774528' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Slide_EaseINSpeed_72_15C9C4B448088D27FD15979725BC627F) == 0x000040, "Member 'FPlayerCameraInitParam::Slide_EaseINSpeed_72_15C9C4B448088D27FD15979725BC627F' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Slide_EaseOUTSpeed_73_7094FFAA42724E8987C7338099807B4E) == 0x000044, "Member 'FPlayerCameraInitParam::Slide_EaseOUTSpeed_73_7094FFAA42724E8987C7338099807B4E' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Grip_FOV_81_81FAB6B74510C8ECDBFA2A993DD003EE) == 0x000048, "Member 'FPlayerCameraInitParam::Grip_FOV_81_81FAB6B74510C8ECDBFA2A993DD003EE' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Grip_Distance_82_A82CDDCD455DBFF35B1AE78AA6A5EB16) == 0x00004C, "Member 'FPlayerCameraInitParam::Grip_Distance_82_A82CDDCD455DBFF35B1AE78AA6A5EB16' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Grip_Height_83_30C771294405A2DEDCF811B4E44894C4) == 0x000050, "Member 'FPlayerCameraInitParam::Grip_Height_83_30C771294405A2DEDCF811B4E44894C4' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Grip_EaseINSpeed_84_DB29D5A44CD805E9AD5E539FFBE20366) == 0x000054, "Member 'FPlayerCameraInitParam::Grip_EaseINSpeed_84_DB29D5A44CD805E9AD5E539FFBE20366' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Grip_EaseOUTSpeed_85_1FDEEE014394BC051BB81EA04D7D627E) == 0x000058, "Member 'FPlayerCameraInitParam::Grip_EaseOUTSpeed_85_1FDEEE014394BC051BB81EA04D7D627E' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Tokyo_Root_Height_50_17BB25F147C1BD0A99732B97CCB31F7D) == 0x00005C, "Member 'FPlayerCameraInitParam::Tokyo_Root_Height_50_17BB25F147C1BD0A99732B97CCB31F7D' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Tokyo_FOV_51_BA9DA77146BC46FC0FF1AC85AE01CD95) == 0x000060, "Member 'FPlayerCameraInitParam::Tokyo_FOV_51_BA9DA77146BC46FC0FF1AC85AE01CD95' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Tokyo_CameraLength_49_EF261474457AC7EED256C8ABE0C59DF9) == 0x000064, "Member 'FPlayerCameraInitParam::Tokyo_CameraLength_49_EF261474457AC7EED256C8ABE0C59DF9' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, CameraUPForward_42_7988B99F421C7B9B3700009C10390F04) == 0x000068, "Member 'FPlayerCameraInitParam::CameraUPForward_42_7988B99F421C7B9B3700009C10390F04' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Camera_Height_11_E2F49299478E772F4DCAF182B16C0B71) == 0x00006C, "Member 'FPlayerCameraInitParam::Camera_Height_11_E2F49299478E772F4DCAF182B16C0B71' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Dungeon_RootHeight_93_19D2F6C14B39D1589BF6DC8038D1B543) == 0x000070, "Member 'FPlayerCameraInitParam::Dungeon_RootHeight_93_19D2F6C14B39D1589BF6DC8038D1B543' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Dungeon_FOV_94_866EDE364F4D747506CBA48B30E4D35E) == 0x000074, "Member 'FPlayerCameraInitParam::Dungeon_FOV_94_866EDE364F4D747506CBA48B30E4D35E' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, Dungeon_CameraLength_95_A51BC99E4CA044CA017820AA6EE498E9) == 0x000078, "Member 'FPlayerCameraInitParam::Dungeon_CameraLength_95_A51BC99E4CA044CA017820AA6EE498E9' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, DushShake_EaseINSpeed_100_53A25E4947CC5B1E72E39D8047079242) == 0x00007C, "Member 'FPlayerCameraInitParam::DushShake_EaseINSpeed_100_53A25E4947CC5B1E72E39D8047079242' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, DushShake_EaseOUTSpeed_101_821FCFC841A0B4C767FD98AB30D08C8B) == 0x000080, "Member 'FPlayerCameraInitParam::DushShake_EaseOUTSpeed_101_821FCFC841A0B4C767FD98AB30D08C8B' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, SP_CameraLength_107_21BD0D1B465D7432743D6F9236098F1A) == 0x000084, "Member 'FPlayerCameraInitParam::SP_CameraLength_107_21BD0D1B465D7432743D6F9236098F1A' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, SP_CameraFOV_108_02B7EC8C46C74FC8952D378A073C3EEA) == 0x000088, "Member 'FPlayerCameraInitParam::SP_CameraFOV_108_02B7EC8C46C74FC8952D378A073C3EEA' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, CameraDownForward_111_BD1D741E472BA0DF667DBC9A9EDC5422) == 0x00008C, "Member 'FPlayerCameraInitParam::CameraDownForward_111_BD1D741E472BA0DF667DBC9A9EDC5422' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, CameraUpBack_114_4BA4E41E49B88E689D9A89AC24516CE8) == 0x000090, "Member 'FPlayerCameraInitParam::CameraUpBack_114_4BA4E41E49B88E689D9A89AC24516CE8' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, CameraDownForward_Tokyo_120_9011E35A4FAD214619FE669C4DFA18EF) == 0x000094, "Member 'FPlayerCameraInitParam::CameraDownForward_Tokyo_120_9011E35A4FAD214619FE669C4DFA18EF' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, CameraUpBack_Tokyo_121_C3554F5D4878B7282623D3BE88C61963) == 0x000098, "Member 'FPlayerCameraInitParam::CameraUpBack_Tokyo_121_C3554F5D4878B7282623D3BE88C61963' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, SP2_CameraLength_127_C30783CA4A188A244101879A5A04CC9F) == 0x00009C, "Member 'FPlayerCameraInitParam::SP2_CameraLength_127_C30783CA4A188A244101879A5A04CC9F' has a wrong offset!");
static_assert(offsetof(FPlayerCameraInitParam, SP2_CameraFOV_128_74A8E7CB48245583668617BF9B975751) == 0x0000A0, "Member 'FPlayerCameraInitParam::SP2_CameraFOV_128_74A8E7CB48245583668617BF9B975751' has a wrong offset!");

}

