#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerDevilBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Project_structs.hpp"


namespace SDK::Params
{

// Function PlayerDevilBase.PlayerDevilBase_C.ExecuteUbergraph_PlayerDevilBase
// 0x02D8 (0x02D8 - 0x0000)
struct PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_ActionPadEvent_Key;                         // 0x0008(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenDebugMenu_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_104B[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_104C[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_104D[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DialogCtrl_C>     CallFunc_BPI_GetDialogWindowCtrl_OutActor;         // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_1;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IWasConfirmedByMouse_bConfirmed;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_104E[0x2];                                     // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IWasConfirmedByMouse_ItemIndex;           // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_DialogCtrl_C>     CallFunc_BPI_GetDialogWindowCtrl_OutActor_1;       // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_104F[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IWasConfirmedByMouse_bConfirmed_1;        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1050[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IWasConfirmedByMouse_ItemIndex_1;         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_2;                        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1051[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_2;              // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1052[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DialogCtrl_C>     CallFunc_BPI_GetDialogWindowCtrl_OutActor_2;       // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x00E8(0x0010)(ConstParm, ReferenceParm)
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_3;                        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionPadCheck_Success_2;               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1053[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_3;              // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1054[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DialogCtrl_C>     CallFunc_BPI_GetDialogWindowCtrl_OutActor_3;       // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_IGetDialogSelectedCursorPosition_OutIndex; // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1055[0x2];                                     // 0x0136(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_4;                        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_4;              // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1056[0x6];                                     // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DialogCtrl_C>     CallFunc_BPI_GetDialogWindowCtrl_OutActor_4;       // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_3;               // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IIsClosedDialogWindow_OutFinished;        // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1057[0x6];                                     // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_1;          // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_5;                        // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_5;              // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1058[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DialogCtrl_C>     CallFunc_BPI_GetDialogWindowCtrl_OutActor_5;       // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IIsClosedDialogWindow_OutFinished_1;      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_4;               // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1059[0x5];                                     // 0x01B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105A[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105B[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_1;                    // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_1;             // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_5;               // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105C[0x6];                                     // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_2;          // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105D[0x7];                                     // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105E[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue;                 // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FMouseCursorState                      CallFunc_PopShowMouseCursor_ReturnValue;           // 0x0278(0x0018)()
	bool                                          CallFunc_FadeOut_Black_ReturnValue;                // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105F[0x7];                                     // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapCommon_rerutn_2;                    // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenDebugMenu_ReturnValue_1;            // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1060[0x7];                                     // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_2;             // 0x02A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_CheckMapPause_IsPause;                // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x02BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1061[0x4];                                     // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_6;                        // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionPadCheck_Success_6;               // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1062[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_NewController;                        // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase) == 0x000008, "Wrong alignment on PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase");
static_assert(sizeof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase) == 0x0002D8, "Wrong size on PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, EntryPoint) == 0x000000, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, K2Node_ActionPadEvent_Key) == 0x000008, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::K2Node_ActionPadEvent_Key' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_IsOpenDebugMenu_ReturnValue) == 0x000020, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_IsOpenDebugMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_Get_ReturnValue) == 0x000028, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, K2Node_DynamicCast_AsBPI_UIManager) == 0x000038, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_BPI_GetDialogWindowCtrl_OutActor) == 0x000050, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_BPI_GetDialogWindowCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_Get_ReturnValue_1) == 0x000060, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000068, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_IWasConfirmedByMouse_bConfirmed) == 0x000079, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_IWasConfirmedByMouse_bConfirmed' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_IWasConfirmedByMouse_ItemIndex) == 0x00007C, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_IWasConfirmedByMouse_ItemIndex' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_BPI_GetDialogWindowCtrl_OutActor_1) == 0x000080, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_BPI_GetDialogWindowCtrl_OutActor_1' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_IsActionPadCheck_Success) == 0x000090, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_Conv_BoolToString_ReturnValue) == 0x000098, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_IWasConfirmedByMouse_bConfirmed_1) == 0x0000A8, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_IWasConfirmedByMouse_bConfirmed_1' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_IWasConfirmedByMouse_ItemIndex_1) == 0x0000AC, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_IWasConfirmedByMouse_ItemIndex_1' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_Get_ReturnValue_2) == 0x0000B0, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_IsActionPadCheck_Success_1) == 0x0000B8, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_IsActionPadCheck_Success_1' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, K2Node_DynamicCast_AsBPI_UIManager_2) == 0x0000C0, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::K2Node_DynamicCast_AsBPI_UIManager_2' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, K2Node_DynamicCast_bSuccess_2) == 0x0000D0, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_BPI_GetDialogWindowCtrl_OutActor_2) == 0x0000D8, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_BPI_GetDialogWindowCtrl_OutActor_2' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, K2Node_MakeArray_Array) == 0x0000E8, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_Get_ReturnValue_3) == 0x0000F8, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_Get_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_IsActionPadCheck_Success_2) == 0x000100, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_IsActionPadCheck_Success_2' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, K2Node_DynamicCast_AsBPI_UIManager_3) == 0x000108, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::K2Node_DynamicCast_AsBPI_UIManager_3' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, K2Node_DynamicCast_bSuccess_3) == 0x000118, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_BPI_GetDialogWindowCtrl_OutActor_3) == 0x000120, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_BPI_GetDialogWindowCtrl_OutActor_3' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_IGetDialogSelectedCursorPosition_OutIndex) == 0x000130, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_IGetDialogSelectedCursorPosition_OutIndex' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, K2Node_SwitchInteger_CmpSuccess) == 0x000134, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000135, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_Get_ReturnValue_4) == 0x000138, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_Get_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, K2Node_DynamicCast_AsBPI_UIManager_4) == 0x000140, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::K2Node_DynamicCast_AsBPI_UIManager_4' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, K2Node_DynamicCast_bSuccess_4) == 0x000150, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_MakeLiteralByte_ReturnValue) == 0x000151, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_BPI_GetDialogWindowCtrl_OutActor_4) == 0x000158, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_BPI_GetDialogWindowCtrl_OutActor_4' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_IsActionPadCheck_Success_3) == 0x000168, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_IsActionPadCheck_Success_3' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_IIsClosedDialogWindow_OutFinished) == 0x000169, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_IIsClosedDialogWindow_OutFinished' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_Conv_BoolToString_ReturnValue_1) == 0x000170, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_Conv_BoolToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_Get_ReturnValue_5) == 0x000180, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_Get_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, K2Node_DynamicCast_AsBPI_UIManager_5) == 0x000188, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::K2Node_DynamicCast_AsBPI_UIManager_5' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, K2Node_DynamicCast_bSuccess_5) == 0x000198, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_BPI_GetDialogWindowCtrl_OutActor_5) == 0x0001A0, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_BPI_GetDialogWindowCtrl_OutActor_5' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_IIsClosedDialogWindow_OutFinished_1) == 0x0001B0, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_IIsClosedDialogWindow_OutFinished_1' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_IsActionPadCheck_Success_4) == 0x0001B1, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_IsActionPadCheck_Success_4' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_BooleanOR_ReturnValue) == 0x0001B2, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_GetMapCommon_rerutn) == 0x0001B8, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_BooleanAND_ReturnValue) == 0x0001C0, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, K2Node_DynamicCast_AsBPI_Map_Common) == 0x0001C8, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, K2Node_DynamicCast_bSuccess_6) == 0x0001D8, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_GetMapCommon_rerutn_1) == 0x0001E0, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_GetMapCommon_rerutn_1' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, K2Node_DynamicCast_AsBPI_Map_Common_1) == 0x0001E8, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::K2Node_DynamicCast_AsBPI_Map_Common_1' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, K2Node_DynamicCast_bSuccess_7) == 0x0001F8, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_IsActionPadCheck_Success_5) == 0x0001F9, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_IsActionPadCheck_Success_5' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_Conv_BoolToString_ReturnValue_2) == 0x000200, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_Conv_BoolToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_BooleanOR_ReturnValue_1) == 0x000210, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_Concat_StrStr_ReturnValue) == 0x000218, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_BooleanAND_ReturnValue_1) == 0x000228, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000230, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000240, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000250, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_SpawnSound2D_ReturnValue) == 0x000260, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000268, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_PopShowMouseCursor_ReturnValue) == 0x000278, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_PopShowMouseCursor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_FadeOut_Black_ReturnValue) == 0x000290, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_FadeOut_Black_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_GetMapCommon_rerutn_2) == 0x000298, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_GetMapCommon_rerutn_2' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_IsOpenDebugMenu_ReturnValue_1) == 0x0002A0, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_IsOpenDebugMenu_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, K2Node_DynamicCast_AsBPI_Map_Common_2) == 0x0002A8, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::K2Node_DynamicCast_AsBPI_Map_Common_2' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, K2Node_DynamicCast_bSuccess_8) == 0x0002B8, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_Not_PreBool_ReturnValue_1) == 0x0002B9, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_BPI_CheckMapPause_IsPause) == 0x0002BA, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_BPI_CheckMapPause_IsPause' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_Not_PreBool_ReturnValue_2) == 0x0002BB, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_Get_ReturnValue_6) == 0x0002C0, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_Get_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, CallFunc_IsActionPadCheck_Success_6) == 0x0002C8, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::CallFunc_IsActionPadCheck_Success_6' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase, K2Node_Event_NewController) == 0x0002D0, "Member 'PlayerDevilBase_C_ExecuteUbergraph_PlayerDevilBase::K2Node_Event_NewController' has a wrong offset!");

// Function PlayerDevilBase.PlayerDevilBase_C.ReceivePossessed
// 0x0008 (0x0008 - 0x0000)
struct PlayerDevilBase_C_ReceivePossessed final
{
public:
	class AController*                            NewController;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerDevilBase_C_ReceivePossessed) == 0x000008, "Wrong alignment on PlayerDevilBase_C_ReceivePossessed");
static_assert(sizeof(PlayerDevilBase_C_ReceivePossessed) == 0x000008, "Wrong size on PlayerDevilBase_C_ReceivePossessed");
static_assert(offsetof(PlayerDevilBase_C_ReceivePossessed, NewController) == 0x000000, "Member 'PlayerDevilBase_C_ReceivePossessed::NewController' has a wrong offset!");

// Function PlayerDevilBase.PlayerDevilBase_C.ActPadEvt_Map_Traport_K2Node_ActionPadEvent_0
// 0x0018 (0x0018 - 0x0000)
struct PlayerDevilBase_C_ActPadEvt_Map_Traport_K2Node_ActionPadEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(PlayerDevilBase_C_ActPadEvt_Map_Traport_K2Node_ActionPadEvent_0) == 0x000008, "Wrong alignment on PlayerDevilBase_C_ActPadEvt_Map_Traport_K2Node_ActionPadEvent_0");
static_assert(sizeof(PlayerDevilBase_C_ActPadEvt_Map_Traport_K2Node_ActionPadEvent_0) == 0x000018, "Wrong size on PlayerDevilBase_C_ActPadEvt_Map_Traport_K2Node_ActionPadEvent_0");
static_assert(offsetof(PlayerDevilBase_C_ActPadEvt_Map_Traport_K2Node_ActionPadEvent_0, Key) == 0x000000, "Member 'PlayerDevilBase_C_ActPadEvt_Map_Traport_K2Node_ActionPadEvent_0::Key' has a wrong offset!");

// Function PlayerDevilBase.PlayerDevilBase_C.Start
// 0x0020 (0x0020 - 0x0000)
struct PlayerDevilBase_C_Start final
{
public:
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_ShowMapButtonHelp_dummy;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerDevilBase_C_Start) == 0x000008, "Wrong alignment on PlayerDevilBase_C_Start");
static_assert(sizeof(PlayerDevilBase_C_Start) == 0x000020, "Wrong size on PlayerDevilBase_C_Start");
static_assert(offsetof(PlayerDevilBase_C_Start, CallFunc_GetMapCommon_rerutn) == 0x000000, "Member 'PlayerDevilBase_C_Start::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_Start, K2Node_DynamicCast_AsBPI_Map_Common) == 0x000008, "Member 'PlayerDevilBase_C_Start::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_Start, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PlayerDevilBase_C_Start::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_Start, CallFunc_BPI_ShowMapButtonHelp_dummy) == 0x000019, "Member 'PlayerDevilBase_C_Start::CallFunc_BPI_ShowMapButtonHelp_dummy' has a wrong offset!");

// Function PlayerDevilBase.PlayerDevilBase_C.HoveringGrass
// 0x0060 (0x0060 - 0x0000)
struct PlayerDevilBase_C_HoveringGrass final
{
public:
	bool                                          IsHover;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1063[0xF];                                     // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventHoveringGrass_C*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerDevilBase_C_HoveringGrass) == 0x000010, "Wrong alignment on PlayerDevilBase_C_HoveringGrass");
static_assert(sizeof(PlayerDevilBase_C_HoveringGrass) == 0x000060, "Wrong size on PlayerDevilBase_C_HoveringGrass");
static_assert(offsetof(PlayerDevilBase_C_HoveringGrass, IsHover) == 0x000000, "Member 'PlayerDevilBase_C_HoveringGrass::IsHover' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_HoveringGrass, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'PlayerDevilBase_C_HoveringGrass::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDevilBase_C_HoveringGrass, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'PlayerDevilBase_C_HoveringGrass::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
