#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerDevilBaseParamStruct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct PlayerDevilBaseParamStruct.PlayerDevilBaseParamStruct
// 0x0034 (0x0034 - 0x0000)
struct FPlayerDevilBaseParamStruct final
{
public:
	float                                         VelocityMin_3_04F42B844724304D7142FDA75A4627D4;    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VelocityMax_6_A7CE934A49F75B60CA6153BB55C0F06E;    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VelocityMaxFallen_12_19D9810E4C2888FB87A7C8850DA33814; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotationSpeed_8_E501AFC64C98BF43E0BA59A6D78A7FFF;  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotationSpeedOnSpot_10_DE2A07634E23E446FBB36BB6E46F1BE8; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Acceleration_14_7D40C57140AB7D2B2D0831A5CA6898C5;  // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Deceleration_16_37BEDC654C579AD6B9BA7582B2EF89E5;  // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StepupHeightThreshold_27_5C8EDD31450BA226E25F85AC33ED388D; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FloatingIKEnable_19_748AFFA94A3D17829A01DA8526D1B0FA; // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45F7[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatingIKUpSpeed_24_540D88B0475FCF9C5717A5AA9B40E4B9; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatingIKDownSpeed_30_36002D9047E7533A821EF4836121DC54; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RunMotionRate_29_00BBB9E6452BED75AD78F6B426EC1F7F; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HoveringGrass_32_6556B2EF4F4C59EFE956A2A0D4391560; // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FPlayerDevilBaseParamStruct) == 0x000004, "Wrong alignment on FPlayerDevilBaseParamStruct");
static_assert(sizeof(FPlayerDevilBaseParamStruct) == 0x000034, "Wrong size on FPlayerDevilBaseParamStruct");
static_assert(offsetof(FPlayerDevilBaseParamStruct, VelocityMin_3_04F42B844724304D7142FDA75A4627D4) == 0x000000, "Member 'FPlayerDevilBaseParamStruct::VelocityMin_3_04F42B844724304D7142FDA75A4627D4' has a wrong offset!");
static_assert(offsetof(FPlayerDevilBaseParamStruct, VelocityMax_6_A7CE934A49F75B60CA6153BB55C0F06E) == 0x000004, "Member 'FPlayerDevilBaseParamStruct::VelocityMax_6_A7CE934A49F75B60CA6153BB55C0F06E' has a wrong offset!");
static_assert(offsetof(FPlayerDevilBaseParamStruct, VelocityMaxFallen_12_19D9810E4C2888FB87A7C8850DA33814) == 0x000008, "Member 'FPlayerDevilBaseParamStruct::VelocityMaxFallen_12_19D9810E4C2888FB87A7C8850DA33814' has a wrong offset!");
static_assert(offsetof(FPlayerDevilBaseParamStruct, RotationSpeed_8_E501AFC64C98BF43E0BA59A6D78A7FFF) == 0x00000C, "Member 'FPlayerDevilBaseParamStruct::RotationSpeed_8_E501AFC64C98BF43E0BA59A6D78A7FFF' has a wrong offset!");
static_assert(offsetof(FPlayerDevilBaseParamStruct, RotationSpeedOnSpot_10_DE2A07634E23E446FBB36BB6E46F1BE8) == 0x000010, "Member 'FPlayerDevilBaseParamStruct::RotationSpeedOnSpot_10_DE2A07634E23E446FBB36BB6E46F1BE8' has a wrong offset!");
static_assert(offsetof(FPlayerDevilBaseParamStruct, Acceleration_14_7D40C57140AB7D2B2D0831A5CA6898C5) == 0x000014, "Member 'FPlayerDevilBaseParamStruct::Acceleration_14_7D40C57140AB7D2B2D0831A5CA6898C5' has a wrong offset!");
static_assert(offsetof(FPlayerDevilBaseParamStruct, Deceleration_16_37BEDC654C579AD6B9BA7582B2EF89E5) == 0x000018, "Member 'FPlayerDevilBaseParamStruct::Deceleration_16_37BEDC654C579AD6B9BA7582B2EF89E5' has a wrong offset!");
static_assert(offsetof(FPlayerDevilBaseParamStruct, StepupHeightThreshold_27_5C8EDD31450BA226E25F85AC33ED388D) == 0x00001C, "Member 'FPlayerDevilBaseParamStruct::StepupHeightThreshold_27_5C8EDD31450BA226E25F85AC33ED388D' has a wrong offset!");
static_assert(offsetof(FPlayerDevilBaseParamStruct, FloatingIKEnable_19_748AFFA94A3D17829A01DA8526D1B0FA) == 0x000020, "Member 'FPlayerDevilBaseParamStruct::FloatingIKEnable_19_748AFFA94A3D17829A01DA8526D1B0FA' has a wrong offset!");
static_assert(offsetof(FPlayerDevilBaseParamStruct, FloatingIKUpSpeed_24_540D88B0475FCF9C5717A5AA9B40E4B9) == 0x000024, "Member 'FPlayerDevilBaseParamStruct::FloatingIKUpSpeed_24_540D88B0475FCF9C5717A5AA9B40E4B9' has a wrong offset!");
static_assert(offsetof(FPlayerDevilBaseParamStruct, FloatingIKDownSpeed_30_36002D9047E7533A821EF4836121DC54) == 0x000028, "Member 'FPlayerDevilBaseParamStruct::FloatingIKDownSpeed_30_36002D9047E7533A821EF4836121DC54' has a wrong offset!");
static_assert(offsetof(FPlayerDevilBaseParamStruct, RunMotionRate_29_00BBB9E6452BED75AD78F6B426EC1F7F) == 0x00002C, "Member 'FPlayerDevilBaseParamStruct::RunMotionRate_29_00BBB9E6452BED75AD78F6B426EC1F7F' has a wrong offset!");
static_assert(offsetof(FPlayerDevilBaseParamStruct, HoveringGrass_32_6556B2EF4F4C59EFE956A2A0D4391560) == 0x000030, "Member 'FPlayerDevilBaseParamStruct::HoveringGrass_32_6556B2EF4F4C59EFE956A2A0D4391560' has a wrong offset!");

}

