#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Project

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AtRichTextWidget_classes.hpp"
#include "Project_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_classes.hpp"
#include "MovieSceneTracks_classes.hpp"
#include "Foliage_classes.hpp"


namespace SDK
{

// Class Project.CustomPoseWeightTable
// 0x0050 (0x0078 - 0x0028)
class UCustomPoseWeightTable final : public UObject
{
public:
	TMap<class FName, float>                      Map;                                               // 0x0028(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomPoseWeightTable">();
	}
	static class UCustomPoseWeightTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomPoseWeightTable>();
	}
};
static_assert(alignof(UCustomPoseWeightTable) == 0x000008, "Wrong alignment on UCustomPoseWeightTable");
static_assert(sizeof(UCustomPoseWeightTable) == 0x000078, "Wrong size on UCustomPoseWeightTable");
static_assert(offsetof(UCustomPoseWeightTable, Map) == 0x000028, "Member 'UCustomPoseWeightTable::Map' has a wrong offset!");

// Class Project.BPL_Asset
// 0x0000 (0x0028 - 0x0028)
class UBPL_Asset final : public UBlueprintFunctionLibrary
{
public:
	static TSubclassOf<class AActor> GetBlueprintGeneratedActorClass(class UObject* BPAsset);
	static class UObject* LoadObjectBlocking(TSoftObjectPtr<class UObject> SoftObjectReference);
	static TSoftObjectPtr<class UCharaLipSync> SearchEventLipSync(const class FName Filename);
	static TSoftObjectPtr<class UCharaLipSync> SearchEventLipSyncEx(const class FName Filename, const class FName Path, const bool UsePath);
	static TSoftObjectPtr<class USoundAtomCue> SearchEventVoice(const class FName VoiceName);
	static TSoftObjectPtr<class USoundAtomCue> SearchEventVoiceEx(const class FName VoiceName, const class FName Path, const bool UsePath);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BPL_Asset">();
	}
	static class UBPL_Asset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPL_Asset>();
	}
};
static_assert(alignof(UBPL_Asset) == 0x000008, "Wrong alignment on UBPL_Asset");
static_assert(sizeof(UBPL_Asset) == 0x000028, "Wrong size on UBPL_Asset");

// Class Project.AchievementManager
// 0x0068 (0x0090 - 0x0028)
class UAchievementManager final : public UObject
{
public:
	uint8                                         Pad_1468[0x68];                                    // 0x0028(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAchievementManager* Get(const class UObject* WorldContextObject);

	void CallCached();
	void CallCheck(float _interval);
	void CallUnlock(const EAchievementFlag _flag, bool _priority, float _interval);
	void LockAchievements();
	void UpdateLatestUnlockList();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementManager">();
	}
	static class UAchievementManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementManager>();
	}
};
static_assert(alignof(UAchievementManager) == 0x000008, "Wrong alignment on UAchievementManager");
static_assert(sizeof(UAchievementManager) == 0x000090, "Wrong size on UAchievementManager");

// Class Project.BPL_DebugPad
// 0x0000 (0x0028 - 0x0028)
class UBPL_DebugPad final : public UBlueprintFunctionLibrary
{
public:
	static void RegisterSimultaneouslyInputEvent(class UObject* WorldContextObject, const struct FKey& Input1, const struct FKey& Input2, const TDelegate<void()>& Event);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BPL_DebugPad">();
	}
	static class UBPL_DebugPad* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPL_DebugPad>();
	}
};
static_assert(alignof(UBPL_DebugPad) == 0x000008, "Wrong alignment on UBPL_DebugPad");
static_assert(sizeof(UBPL_DebugPad) == 0x000028, "Wrong size on UBPL_DebugPad");

// Class Project.BPL_TalkUtils
// 0x0000 (0x0028 - 0x0028)
class UBPL_TalkUtils final : public UBlueprintFunctionLibrary
{
public:
	static EDevilTalkVoice GetStringToDevilTalkVoice(const class FString& String);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BPL_TalkUtils">();
	}
	static class UBPL_TalkUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPL_TalkUtils>();
	}
};
static_assert(alignof(UBPL_TalkUtils) == 0x000008, "Wrong alignment on UBPL_TalkUtils");
static_assert(sizeof(UBPL_TalkUtils) == 0x000028, "Wrong size on UBPL_TalkUtils");

// Class Project.BPL_Achievement
// 0x0000 (0x0028 - 0x0028)
class UBPL_Achievement final : public UBlueprintFunctionLibrary
{
public:
	static void AchievementIntervalChange_Normal(const class UObject* WorldContextObject, float _interval);
	static void AchievementIntervalChange_Priority(const class UObject* WorldContextObject, float _interval);
	static void InstallAchievement(const class UObject* WorldContextObject);
	static void LockAllAchievements(const class UObject* WorldContextObject);
	static void OutputLogConvertTrophyData();
	static void OutputLogSaveTrophyData();
	static void UnlockAchievement(const class UObject* WorldContextObject, const EAchievementFlag _flag, bool _priority);
	static void UnlockAchievement_Delay(const class UObject* WorldContextObject, const EAchievementFlag _flag, bool _priority, float _delay);
	static void UpdateLatestConvertTrophyData();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BPL_Achievement">();
	}
	static class UBPL_Achievement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPL_Achievement>();
	}
};
static_assert(alignof(UBPL_Achievement) == 0x000008, "Wrong alignment on UBPL_Achievement");
static_assert(sizeof(UBPL_Achievement) == 0x000028, "Wrong size on UBPL_Achievement");

// Class Project.MinimapFootprintManager
// 0x0068 (0x0090 - 0x0028)
class alignas(0x10) UMinimapFootprintManager final : public UObject
{
public:
	uint8                                         Pad_146F[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMinimapFootprintEntry>         M_Entries;                                         // 0x0030(0x0010)(BlueprintVisible, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_1470[0x50];                                    // 0x0040(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Reset();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MinimapFootprintManager">();
	}
	static class UMinimapFootprintManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMinimapFootprintManager>();
	}
};
static_assert(alignof(UMinimapFootprintManager) == 0x000010, "Wrong alignment on UMinimapFootprintManager");
static_assert(sizeof(UMinimapFootprintManager) == 0x000090, "Wrong size on UMinimapFootprintManager");
static_assert(offsetof(UMinimapFootprintManager, M_Entries) == 0x000030, "Member 'UMinimapFootprintManager::M_Entries' has a wrong offset!");

// Class Project.BPL_DebugUtils
// 0x0000 (0x0028 - 0x0028)
class UBPL_DebugUtils final : public UBlueprintFunctionLibrary
{
public:
	static void ClipboardCopy(const class FString& Str);
	static void ClipboardPaste(class FString* Dest);
	static bool DebugFirstInit();
	static void DisableProjectDebugCamera();
	static EDebugFlag EDebugFlag_FromString(const class FString& EnumString);
	static void EnableProjectDebugCamera(const struct FVector& Location, const struct FRotator& Rotation, const struct FTransform& Transform);
	static void GetCollisionProfileNames(TArray<class FString>* CollisionProfileNames);
	static void ProjectConsoleCommand(const class FString& ConsoleCommand);
	static class AProjectDebugCameraController* ProjectDebugCameraGet();
	static struct FTransform ProjectDebugCameraGetTransform();
	static bool ProjectDebugCameraIsEnabled();
	static void ProjectDebugCameraSetDisplay(bool bEnabled);
	static bool ProjectDebugFlagGet(EDebugFlag DebugFlag);
	static bool ProjectDebugFlagSet(EDebugFlag DebugFlag, bool Value);
	static bool ProjectDebugFlagToggle(EDebugFlag DebugFlag);
	static struct FProjectSubLevelStatus ProjectDebugGetLevelStatus(class UObject* WorldContextObject, const class FName& DebugMenuPath);
	static struct FProjectSubLevelStatus ProjectDebugToggleLevelLoad(class UObject* WorldContextObject, const class FName& DebugMenuPath);
	static struct FProjectSubLevelStatus ProjectDebugToggleVolumetricLightmap(class UObject* WorldContextObject, const class FName& DebugMenuPath);
	static void SaveStatsInfo(const class FString& DirectoryPath, const class FString& StatsGroupName);
	static bool ScreenCapture(int32 ScreenWidth, int32 ScreenHeight, const class FString& Filename, bool bAddDateTime, bool bNotFileCompress);
	static void Screenshot(const class FString& DirectoryPath, const class FString& Filename, bool bAddDateTimeToFileName, bool bShowUI);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BPL_DebugUtils">();
	}
	static class UBPL_DebugUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPL_DebugUtils>();
	}
};
static_assert(alignof(UBPL_DebugUtils) == 0x000008, "Wrong alignment on UBPL_DebugUtils");
static_assert(sizeof(UBPL_DebugUtils) == 0x000028, "Wrong size on UBPL_DebugUtils");

// Class Project.BPL_AchievementCounter
// 0x0000 (0x0028 - 0x0028)
class UBPL_AchievementCounter final : public UBlueprintFunctionLibrary
{
public:
	static void AddUtsusemiUnionCounter(int32* _utsusemiCounter);
	static void CountUpUtsusemiUnionCount();
	static void GetCurrentBattleCounter(uint8* _bunreiKill, uint8* _weak, uint8* _missBlockRefAbs, uint8* _useMagatsuhi);
	static void GetCurrentTalkCounter(int32* _ScoutSuccess, int32* _PaidMoney);
	static int32 GetDevilStatueFlagCount();
	static int32 GetLearningGodParameterCounter();
	static int32 GetSubQuestClearCounter();
	static int32 GetUtsusemiUnionCounter();
	static void SetBunreiKillCounter(uint8 _killCount);
	static void SetMissEtcCounter(uint8 _missEtcCount);
	static void SetPaidMoneyCounter(int32 _paidMoneyCount);
	static void SetScoutSuccessCounter(int32 _scoutSuccessCount);
	static void SetUseMagatsuhiCounter(uint8 _useMagatsuhiCount);
	static void SetWeakCounter(uint8 _weakCount);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BPL_AchievementCounter">();
	}
	static class UBPL_AchievementCounter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPL_AchievementCounter>();
	}
};
static_assert(alignof(UBPL_AchievementCounter) == 0x000008, "Wrong alignment on UBPL_AchievementCounter");
static_assert(sizeof(UBPL_AchievementCounter) == 0x000028, "Wrong size on UBPL_AchievementCounter");

// Class Project.BPL_DownloadContent
// 0x0000 (0x0028 - 0x0028)
class UBPL_DownloadContent final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BPL_DownloadContent">();
	}
	static class UBPL_DownloadContent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPL_DownloadContent>();
	}
};
static_assert(alignof(UBPL_DownloadContent) == 0x000008, "Wrong alignment on UBPL_DownloadContent");
static_assert(sizeof(UBPL_DownloadContent) == 0x000028, "Wrong size on UBPL_DownloadContent");

// Class Project.StatusDevilModelTblData
// 0x0058 (0x0080 - 0x0028)
class UStatusDevilModelTblData final : public UObject
{
public:
	uint8                                         Pad_1475[0x10];                                    // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             M_InTableData;                                     // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             M_OutTableData;                                    // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScriptMessageAsset*                    M_DevilNameMess;                                   // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FText>                           M_DevilNameArray;                                  // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         M_StartDevilId;                                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         M_EndDevilId;                                      // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          M_IsCallCreate;                                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1476[0x17];                                    // 0x0069(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StatusDevilModelTblData">();
	}
	static class UStatusDevilModelTblData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStatusDevilModelTblData>();
	}
};
static_assert(alignof(UStatusDevilModelTblData) == 0x000008, "Wrong alignment on UStatusDevilModelTblData");
static_assert(sizeof(UStatusDevilModelTblData) == 0x000080, "Wrong size on UStatusDevilModelTblData");
static_assert(offsetof(UStatusDevilModelTblData, M_InTableData) == 0x000038, "Member 'UStatusDevilModelTblData::M_InTableData' has a wrong offset!");
static_assert(offsetof(UStatusDevilModelTblData, M_OutTableData) == 0x000040, "Member 'UStatusDevilModelTblData::M_OutTableData' has a wrong offset!");
static_assert(offsetof(UStatusDevilModelTblData, M_DevilNameMess) == 0x000048, "Member 'UStatusDevilModelTblData::M_DevilNameMess' has a wrong offset!");
static_assert(offsetof(UStatusDevilModelTblData, M_DevilNameArray) == 0x000050, "Member 'UStatusDevilModelTblData::M_DevilNameArray' has a wrong offset!");
static_assert(offsetof(UStatusDevilModelTblData, M_StartDevilId) == 0x000060, "Member 'UStatusDevilModelTblData::M_StartDevilId' has a wrong offset!");
static_assert(offsetof(UStatusDevilModelTblData, M_EndDevilId) == 0x000064, "Member 'UStatusDevilModelTblData::M_EndDevilId' has a wrong offset!");
static_assert(offsetof(UStatusDevilModelTblData, M_IsCallCreate) == 0x000068, "Member 'UStatusDevilModelTblData::M_IsCallCreate' has a wrong offset!");

// Class Project.ActivityManager
// 0x0070 (0x0098 - 0x0028)
class UActivityManager final : public UObject
{
public:
	uint8                                         Pad_1477[0x70];                                    // 0x0028(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UActivityManager* Get(const class UObject* WorldContextObject);

	EActivityType GetCardType();
	void ResetCardType();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivityManager">();
	}
	static class UActivityManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityManager>();
	}
};
static_assert(alignof(UActivityManager) == 0x000008, "Wrong alignment on UActivityManager");
static_assert(sizeof(UActivityManager) == 0x000098, "Wrong size on UActivityManager");

// Class Project.BPL_DrawDebugPause
// 0x0000 (0x0028 - 0x0028)
class UBPL_DrawDebugPause final : public UBlueprintFunctionLibrary
{
public:
	static void DrawDebugArrowWhenPaused(class UObject* WorldContextObject, const struct FVector& LineStart, const struct FVector& LineEnd, float ArrowSize, const struct FLinearColor& LineColor, float Thickness);
	static void DrawDebugBoxWhenPaused(class UObject* WorldContextObject, const struct FVector& Center, const struct FVector& Extent, const struct FLinearColor& LineColor, const struct FRotator& Rotation, float Thickness);
	static void DrawDebugCapsuleWhenPaused(class UObject* WorldContextObject, const struct FVector& Center, float HalfHeight, float Radius, const struct FRotator& Rotation, const struct FLinearColor& LineColor, float Thickness);
	static void DrawDebugCircleWhenPaused(class UObject* WorldContextObject, const struct FVector& Center, float Radius, int32 NumSegments, const struct FLinearColor& LineColor, float Thickness, const struct FVector& YAxis, const struct FVector& ZAxis, bool bDrawAxis);
	static void DrawDebugConeInDegreesWhenPaused(class UObject* WorldContextObject, const struct FVector& Origin, const struct FVector& Direction, float Length, float AngleWidth, float AngleHeight, int32 NumSides, const struct FLinearColor& LineColor, float Thickness);
	static void DrawDebugConeWhenPaused(class UObject* WorldContextObject, const struct FVector& Origin, const struct FVector& Direction, float Length, float AngleWidth, float AngleHeight, int32 NumSides, const struct FLinearColor& LineColor, float Thickness);
	static void DrawDebugCoordinateSystemWhenPaused(class UObject* WorldContextObject, const struct FVector& AxisLoc, const struct FRotator& AxisRot, float Scale, float Thickness);
	static void DrawDebugCylinderWhenPaused(class UObject* WorldContextObject, const struct FVector& Start, const struct FVector& End, float Radius, int32 Segments, const struct FLinearColor& LineColor, float Thickness);
	static void DrawDebugLineWhenPaused(class UObject* WorldContextObject, const struct FVector& LineStart, const struct FVector& LineEnd, const struct FLinearColor& LineColor, float Thickness);
	static void DrawDebugPointWhenPaused(class UObject* WorldContextObject, const struct FVector& Position, float Size, const struct FLinearColor& PointColor);
	static void DrawDebugSphereWhenPaused(class UObject* WorldContextObject, const struct FVector& Center, float Radius, int32 Segments, const struct FLinearColor& LineColor, float Thickness);
	static void DrawDebugStringWhenPaused(class UObject* WorldContextObject, const struct FVector& TextLocation, const class FString& Text, const struct FLinearColor& TextColor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BPL_DrawDebugPause">();
	}
	static class UBPL_DrawDebugPause* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPL_DrawDebugPause>();
	}
};
static_assert(alignof(UBPL_DrawDebugPause) == 0x000008, "Wrong alignment on UBPL_DrawDebugPause");
static_assert(sizeof(UBPL_DrawDebugPause) == 0x000028, "Wrong size on UBPL_DrawDebugPause");

// Class Project.BPL_Activity
// 0x0000 (0x0028 - 0x0028)
class UBPL_Activity final : public UBlueprintFunctionLibrary
{
public:
	static void ActivityAvailabilityChange(const class FString& ActivityId, bool Enable);
	static void ActivityEnd(const class FString& ActivityId);
	static void ActivityResume(const class FString& ActivityId, const class FString& InProgressTask, const TArray<class FString>& InCompletedTasks);
	static void ActivityStart(const class FString& ActivityId);
	static void ActivityTerminate();
	static class FString ConvertActivityId(const EActivityType _actType, const EActivityTaskID _actTask);
	static void FinishActivity(const EActivityType _activityType, const class UObject* WorldContextObject);
	static EActivityType GetActivityCardType(const class UObject* WorldContextObject);
	static EActivityTaskID GetProgressActivityID(const class UObject* WorldContextObject);
	static void InstallActivity(class UDataTable* _table, const class UObject* WorldContextObject);
	static bool IsActivityRequest(const class UObject* WorldContextObject);
	static void LoadActivity(const EActivityType _actType, const EActivityTaskID _actTask, const class UObject* WorldContextObject);
	static TArray<class FString> MakeCompletedTasksList(const EActivityType _actType, const EActivityTaskID _actTask);
	static void ResetActivities(const class UObject* WorldContextObject);
	static void ResetActivityAvailability(EActivityType _activityType);
	static void ResetActivityRequest(const class UObject* WorldContextObject);
	static void SetActivityFromId(EActivityType _activity, EActivityTaskID _task, const class UObject* WorldContextObject);
	static void SetActivityFromMapEvent(int32 _mapEventID, const class UObject* WorldContextObject);
	static void StartActivity(const EActivityType _activityType, const class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BPL_Activity">();
	}
	static class UBPL_Activity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPL_Activity>();
	}
};
static_assert(alignof(UBPL_Activity) == 0x000008, "Wrong alignment on UBPL_Activity");
static_assert(sizeof(UBPL_Activity) == 0x000028, "Wrong size on UBPL_Activity");

// Class Project.BPL_EventFlag
// 0x0000 (0x0028 - 0x0028)
class UBPL_EventFlag final : public UBlueprintFunctionLibrary
{
public:
	static bool CheckEventFlag(class FName Param_Name);
	static bool CheckEventFlagValue(int32 Flag);
	static void ClearAllEventFlag();
	static int32 NameToValue(const class FName& FlagName);
	static void SetEventFlag(class FName Param_Name, bool Sw);
	static void SetEventFlagValue(int32 Flag, bool Sw);
	static class FName ValueToName(int32 FlagValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BPL_EventFlag">();
	}
	static class UBPL_EventFlag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPL_EventFlag>();
	}
};
static_assert(alignof(UBPL_EventFlag) == 0x000008, "Wrong alignment on UBPL_EventFlag");
static_assert(sizeof(UBPL_EventFlag) == 0x000028, "Wrong size on UBPL_EventFlag");

// Class Project.BPL_Analyze
// 0x0000 (0x0028 - 0x0028)
class UBPL_Analyze final : public UBlueprintFunctionLibrary
{
public:
	static void Analyze_AllClearByReincarnation();
	static void Analyze_AllClearByRenewal();
	static bool Analyze_CheckIsOpenAnalyze(const int32 DevilID);
	static bool Analyze_CheckIsOpenAnalyzeArg(const int32 DevilID, struct FAnalyzeData* Data);
	static bool Analyze_CheckIsOpenDefenceAisyou(const int32 DevilID, const E_ATTRIBUTE_TYPE Type);
	static bool Analyze_CheckIsOpenDefenceAisyouArg(const int32 DevilID, const E_ATTRIBUTE_TYPE Type, struct FAnalyzeData* Data);
	static bool Analyze_CheckIsOpenSkill(const int32 DevilID, const int32 SkillId);
	static bool Analyze_CheckIsOpenSkillArg(const int32 DevilID, const int32 SkillId, struct FAnalyzeData* Data);
	static bool Analyze_CheckIsOpenSkillTekisei(const int32 DevilID, const E_SKILL_TEKISEI_CATEGORY Category);
	static bool Analyze_CheckIsOpenSkillTekiseiArg(const int32 DevilID, const E_SKILL_TEKISEI_CATEGORY Category, struct FAnalyzeData* Data);
	static bool Analyze_CheckIsOpenUniqueSkill(const int32 DevilID);
	static bool Analyze_CheckIsOpenUniqueSkillArg(const int32 DevilID, struct FAnalyzeData* Data);
	static void Analyze_Clear(const int32 DevilID);
	static struct FAnalyzeData Analyze_GetAnalyzeData(const int32 DevilID);
	static bool Analyze_IsNewIconFlagOn(const int32 DevilID);
	static void Analyze_OpenAutoSkill(const int32 DevilID, const int32 UseAutoSkillId);
	static void Analyze_OpenAutoSkillArg(const int32 DevilID, const int32 UseAutoSkillId, struct FAnalyzeData* Data, const int32& SwapSkillID);
	static void Analyze_OpenDefenceAishou(const int32 DevilID, const int32 HitSkillId);
	static void Analyze_OpenDefenceAishouArg(const int32 DevilID, const int32 HitSkillId, struct FAnalyzeData* Data);
	static void Analyze_OpenDefenceAishouAttr(const int32 DevilID, const E_ATTRIBUTE_TYPE Attr);
	static void Analyze_OpenDefenceAishouAttrArg(const int32 DevilID, const E_ATTRIBUTE_TYPE Attr, struct FAnalyzeData* Data);
	static void Analyze_OpenSkill(const int32 DevilID, const int32 UseSkillId);
	static void Analyze_OpenSkillArg(const int32 DevilID, const int32 UseSkillId, struct FAnalyzeData* Data, const int32& SwapSkillID);
	static void Analyze_OpenSkillTekisei(const int32 DevilID, const E_SKILL_TEKISEI_CATEGORY Category);
	static void Analyze_OpenSkillTekiseiArg(const int32 DevilID, const E_SKILL_TEKISEI_CATEGORY Category, struct FAnalyzeData* Data);
	static void Analyze_OpenUniqueSkill(const int32 DevilID);
	static void Analyze_OpenUniqueSkillArg(const int32 DevilID, struct FAnalyzeData* Data);
	static void Analyze_ResetNewIconFlag(const int32 DevilID);
	static void Analyze_SetNewIconFlag(const int32 DevilID);
	static void Analyze_SetOpenFlag(const int32 DevilID, bool IsOpen);
	static void Analyze_SetOpenFlagArg(const int32 DevilID, bool IsOpen, struct FAnalyzeData* Data);
	static void Analyze_TakeOverDefenceAishou(const int32 RootDevilId, const int32 TargetDevilId);
	static void Analyze_TakeOverDefenceAishouArg(const int32 RootDevilId, const int32 TargetDevilId, struct FAnalyzeData* RootData, struct FAnalyzeData* TargetData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BPL_Analyze">();
	}
	static class UBPL_Analyze* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPL_Analyze>();
	}
};
static_assert(alignof(UBPL_Analyze) == 0x000008, "Wrong alignment on UBPL_Analyze");
static_assert(sizeof(UBPL_Analyze) == 0x000028, "Wrong size on UBPL_Analyze");

// Class Project.SysFlagEditor
// 0x0000 (0x0220 - 0x0220)
class ASysFlagEditor final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SysFlagEditor">();
	}
	static class ASysFlagEditor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASysFlagEditor>();
	}
};
static_assert(alignof(ASysFlagEditor) == 0x000008, "Wrong alignment on ASysFlagEditor");
static_assert(sizeof(ASysFlagEditor) == 0x000220, "Wrong size on ASysFlagEditor");

// Class Project.AnimationCameraComponent
// 0x0040 (0x0810 - 0x07D0)
class UAnimationCameraComponent final : public UCameraComponent
{
public:
	float                                         FovAdjuster;                                       // 0x07D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14A7[0x4];                                     // 0x07D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraAnimationAsset*                  Animation;                                         // 0x07D8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14A8[0x30];                                    // 0x07E0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void PlayAnimation(class UCameraAnimationAsset* InAnimation, class UCameraAnimationAsset* InAnimation2nd, TDelegate<void(float OverrunSec)> OnEndPlay, ECameraAnimationSpace InPlaySpace, float InPlayRate, float InLerpAlpha, bool bInLoop, float InPlayStartPosition);
	void SetPlayRate(float InPlayRate);
	void StopAnimation();
	void UpdateAnimation(float DeltaTime);

	float GetCurrentTime() const;
	bool IsPlaying() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimationCameraComponent">();
	}
	static class UAnimationCameraComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimationCameraComponent>();
	}
};
static_assert(alignof(UAnimationCameraComponent) == 0x000010, "Wrong alignment on UAnimationCameraComponent");
static_assert(sizeof(UAnimationCameraComponent) == 0x000810, "Wrong size on UAnimationCameraComponent");
static_assert(offsetof(UAnimationCameraComponent, FovAdjuster) == 0x0007D0, "Member 'UAnimationCameraComponent::FovAdjuster' has a wrong offset!");
static_assert(offsetof(UAnimationCameraComponent, Animation) == 0x0007D8, "Member 'UAnimationCameraComponent::Animation' has a wrong offset!");

// Class Project.AnimNotify_MotionHead
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_MotionHead final : public UAnimNotify
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_MotionHead">();
	}
	static class UAnimNotify_MotionHead* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_MotionHead>();
	}
};
static_assert(alignof(UAnimNotify_MotionHead) == 0x000008, "Wrong alignment on UAnimNotify_MotionHead");
static_assert(sizeof(UAnimNotify_MotionHead) == 0x000038, "Wrong size on UAnimNotify_MotionHead");

// Class Project.BPL_AogamiDebrisData
// 0x0000 (0x0028 - 0x0028)
class UBPL_AogamiDebrisData final : public UBlueprintFunctionLibrary
{
public:
	static const struct FAogamiDebrisData GetAogamiDebrisData(int32 MapId, int32 Param_Index);
	static const struct FAogamiDebrisData GetAogamiDebrisData_FromTableIndex(int32 TableIndex);
	static int32 GetAogamiDebrisTableIndex(int32 MapId, int32 Param_Index);
	static int32 GetAogamiDebrisTableMax();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BPL_AogamiDebrisData">();
	}
	static class UBPL_AogamiDebrisData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPL_AogamiDebrisData>();
	}
};
static_assert(alignof(UBPL_AogamiDebrisData) == 0x000008, "Wrong alignment on UBPL_AogamiDebrisData");
static_assert(sizeof(UBPL_AogamiDebrisData) == 0x000028, "Wrong size on UBPL_AogamiDebrisData");

// Class Project.AtomExpand
// 0x0000 (0x0028 - 0x0028)
class UAtomExpand final : public UBlueprintFunctionLibrary
{
public:
	static bool IsInCategory(class USoundAtomCue* Cue, const class FString& CategoryName);
	static bool IsPreparedStreamSound(class UAtomComponent* Comp);
	static class UAtomComponent* PlaySound2DRooted(const class UObject* WorldContextObject, class USoundAtomCue* Cue, bool bAutoDestroy);
	static void PrepareStreamSound(class UAtomComponent* Comp);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomExpand">();
	}
	static class UAtomExpand* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomExpand>();
	}
};
static_assert(alignof(UAtomExpand) == 0x000008, "Wrong alignment on UAtomExpand");
static_assert(sizeof(UAtomExpand) == 0x000028, "Wrong size on UAtomExpand");

// Class Project.UIListCursor
// 0x0018 (0x0040 - 0x0028)
class UUIListCursor final : public UObject
{
public:
	uint8                                         Pad_14AF[0x14];                                    // 0x0028(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          M_IsLimitLock;                                     // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14B0[0x3];                                     // 0x003D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddItemNum(int32 Add);
	struct FUIListCursorData GetCursorData();
	int32 GetNowIndex();
	void Init(int32 Param_Index, int32 TopIndex, int32 ViewMax, int32 ItemNum);
	bool IsLimitLock();
	bool MoveCursor(int32 Add, int32 Set, bool IsLimitStop);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIListCursor">();
	}
	static class UUIListCursor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIListCursor>();
	}
};
static_assert(alignof(UUIListCursor) == 0x000008, "Wrong alignment on UUIListCursor");
static_assert(sizeof(UUIListCursor) == 0x000040, "Wrong size on UUIListCursor");
static_assert(offsetof(UUIListCursor, M_IsLimitLock) == 0x00003C, "Member 'UUIListCursor::M_IsLimitLock' has a wrong offset!");

// Class Project.BattleActorComponentBase
// 0x0000 (0x00B0 - 0x00B0)
class UBattleActorComponentBase : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattleActorComponentBase">();
	}
	static class UBattleActorComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleActorComponentBase>();
	}
};
static_assert(alignof(UBattleActorComponentBase) == 0x000008, "Wrong alignment on UBattleActorComponentBase");
static_assert(sizeof(UBattleActorComponentBase) == 0x0000B0, "Wrong size on UBattleActorComponentBase");

// Class Project.BattleActionTaskFactoryBase
// 0x0000 (0x00B0 - 0x00B0)
class UBattleActionTaskFactoryBase : public UBattleActorComponentBase
{
public:
	void AddPoolTaskListInner(TMap<int32, struct FBattleTaskArray>& InTaskListValue, int32 InKey, class ABattleActorBase*& InTask);
	int32 FindPoolTaskListKeyInner(TMap<int32, struct FBattleIntegerArray>& InTaskListKey, TArray<int32>& InWaitTaskList, int32* OutKeyLength);
	int32 FindReadyPoolTaskListInner(TMap<int32, struct FBattleIntegerArray>& InTaskListKey, TArray<int32>& InPopedTaskList, const TArray<uint8>& InValidArray);
	bool IsTerminalTaskInner(const TMap<int32, struct FBattleIntegerArray>& InTaskListKey, int32 InPecID);
	bool OutputDebugInfo(class FString& Data, TArray<struct FDebugBattleTaskInfo>& TaskInfo, const class FString& Path, const class FString& Filename);
	void RemoveTaskFromPoolInner(TMap<int32, struct FBattleTaskArray>& InTaskListValue, class ABattleActorBase*& InTask);
	void TaskSort(TArray<class ABattleActorBase*>& Tasks, bool IsOldSystem);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattleActionTaskFactoryBase">();
	}
	static class UBattleActionTaskFactoryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleActionTaskFactoryBase>();
	}
};
static_assert(alignof(UBattleActionTaskFactoryBase) == 0x000008, "Wrong alignment on UBattleActionTaskFactoryBase");
static_assert(sizeof(UBattleActionTaskFactoryBase) == 0x0000B0, "Wrong size on UBattleActionTaskFactoryBase");

// Class Project.PopUpIconManager
// 0x0020 (0x0048 - 0x0028)
class UPopUpIconManager final : public UObject
{
public:
	uint8                                         Pad_14B7[0x10];                                    // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPopUpIconEntry>                M_RenderEntries;                                   // 0x0038(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	static class UPopUpIconManager* GetPopUpIconManager(const class UObject* WorldContextObject);

	TArray<struct FPopUpIconEntry> GetRenderEntries();
	bool Register(class ACustomPawn* Owner, E_POP_UP_ICON_TYPE IconType);
	bool UnregisterByIndex(int32 Param_Index);
	bool UnregisterByOwner(const class ACustomPawn* Owner);
	void UpdateRender(const struct FVector& PlayerLocation, const class UObject* WorldContextObject);

	int32 CountShowingEntriesMax() const;
	int32 GetRenderEntriesMax() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PopUpIconManager">();
	}
	static class UPopUpIconManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPopUpIconManager>();
	}
};
static_assert(alignof(UPopUpIconManager) == 0x000008, "Wrong alignment on UPopUpIconManager");
static_assert(sizeof(UPopUpIconManager) == 0x000048, "Wrong size on UPopUpIconManager");
static_assert(offsetof(UPopUpIconManager, M_RenderEntries) == 0x000038, "Member 'UPopUpIconManager::M_RenderEntries' has a wrong offset!");

// Class Project.BattleActorBase
// 0x0010 (0x0230 - 0x0220)
class ABattleActorBase : public AActor
{
public:
	int32                                         SortWeight;                                        // 0x0220(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SortWeight_WaitSec;                                // 0x0224(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         M_ElapsedSec;                                      // 0x0228(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_14BC[0x4];                                     // 0x022C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FString DebugWriteTaskInfo(int32 PecID, int32 Step, int32 UpdateTimes, float ElapsedTime, bool IsTerminal, TArray<int32>& WaitTaskList, struct FBtlTaskDesc& Desc, struct FDebugBattleTaskInfo* TaskInfo, bool IsOutputLog);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattleActorBase">();
	}
	static class ABattleActorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABattleActorBase>();
	}
};
static_assert(alignof(ABattleActorBase) == 0x000008, "Wrong alignment on ABattleActorBase");
static_assert(sizeof(ABattleActorBase) == 0x000230, "Wrong size on ABattleActorBase");
static_assert(offsetof(ABattleActorBase, SortWeight) == 0x000220, "Member 'ABattleActorBase::SortWeight' has a wrong offset!");
static_assert(offsetof(ABattleActorBase, SortWeight_WaitSec) == 0x000224, "Member 'ABattleActorBase::SortWeight_WaitSec' has a wrong offset!");
static_assert(offsetof(ABattleActorBase, M_ElapsedSec) == 0x000228, "Member 'ABattleActorBase::M_ElapsedSec' has a wrong offset!");

// Class Project.BattleAICommandBase
// 0x0000 (0x00B0 - 0x00B0)
class UBattleAICommandBase : public UActorComponent
{
public:
	bool AIBaseChk_ENMakraID(int32 DevilID);
	bool AIBaseChk_ENTetraID(int32 DevilID);
	bool AIBaseChk_ENUsedSkillIDTurn(int32 SkillId, int32 Turn);
	bool AIBaseChk_MyAtcAbsorptionBefTurn(int32 MyPartyIndex, E_ATTRIBUTE_TYPE Attr);
	bool AIBaseChk_MyAtcBlockBefTurn(int32 MyPartyIndex, E_ATTRIBUTE_TYPE Attr);
	bool AIBaseChk_MyAtcReflectionBefTurn(int32 MyPartyIndex, E_ATTRIBUTE_TYPE Attr);
	bool AIBaseChk_MyDmgAishouBefTurn(int32 MyPartyIndex, E_ATTRIBUTE_TYPE Attr);
	bool AIBaseChk_MyUsedSkillIDTurn(int32 MyPartyIndex, int32 SkillId, int32 Turn);
	bool AIBaseChk_PLAishouAbsorption(int32 N);
	bool AIBaseChk_PLAishouBlock(int32 N);
	bool AIBaseChk_PLAishouReflection(int32 N);
	bool AIBaseChk_PLChohatsu();
	bool AIBaseChk_PLGuard();
	bool AIBaseChk_PLMakra();
	bool AIBaseChk_PLNotGuard();
	bool AIBaseChk_PLNotMakra();
	bool AIBaseChk_PLNotTetra();
	bool AIBaseChk_PLTetra();
	bool AIBaseChk_PLValidAttr(int32 DevilID, E_ATTRIBUTE_TYPE Attr);
	bool AIBaseChk_PLValidSkillID(int32 DevilID, int32 SkillId);
	bool AIBaseChk_VailAttrDevilID_ENAnalyze(int32 DevilID, E_ATTRIBUTE_TYPE Attr);
	bool AIBaseChk_VailAttrDevilID_ENAnalyze2(int32 DevilID, E_ATTRIBUTE_TYPE Attr);
	bool AIBaseChk_VailSkillDevilID_ENAnalyze(int32 DevilID, int32 SkillId);
	bool AIBaseChk_VailSkillDevilID_ENAnalyze2(int32 DevilID, int32 SkillId);
	TArray<E_ATTRIBUTE_TYPE> AIBaseGet_AishouChangeAll(const int32& MyPartyIndex);
	TArray<E_ATTRIBUTE_TYPE> AIBaseGet_AishouChangeThisTurn(const int32& MyPartyIndex);
	int32 AIBaseGet_AttackSkillID(int32 MyPartyIndex, bool IsAll);
	int32 AIBaseGet_ChargeSkillID(int32 MyPartyIndex);
	int32 AIBaseGet_HojoSkillIDNotCharge(int32 MyPartyIndex);
	int32 AIBaseGet_HojoSkillValidTarget(int32 MyPartyIndex, int32 SkillId);
	int32 AIBaseGet_HPHealSkillID(int32 MyPartyIndex);
	int32 AIBaseGet_MagatsuhiDevilNum();
	int32 AIBaseGet_MagicChargeEffectiveSkillID(int32 MyPartyIndex);
	int32 AIBaseGet_MyDmgAishouMinusBefTurn(int32 MyPartyIndex);
	int32 AIBaseGet_PhysicalChargeEffectiveSkillID(int32 MyPartyIndex);
	int32 AIBaseGet_PLAishouAbsorption(E_ATTRIBUTE_TYPE N);
	int32 AIBaseGet_PLAishouBlock(E_ATTRIBUTE_TYPE N);
	int32 AIBaseGet_PLAishouFlat(E_ATTRIBUTE_TYPE N);
	int32 AIBaseGet_PLAishouMinus(E_ATTRIBUTE_TYPE N);
	int32 AIBaseGet_PLAishouPlus(E_ATTRIBUTE_TYPE N);
	int32 AIBaseGet_PLAishouReflection(E_ATTRIBUTE_TYPE N);
	int32 AIBaseGet_PLNumValidAttrENAnalyze(E_ATTRIBUTE_TYPE Attr);
	int32 AIBaseGet_PLNumValidAttrENAnalyze2(E_ATTRIBUTE_TYPE Attr);
	int32 AIBaseGet_PLNumValidSkillENAnalyze(int32 SkillId);
	int32 AIBaseGet_PLNumValidSkillENAnalyze2(int32 SkillId);
	int32 AIBaseGet_PLPrvoke();
	int32 AIBaseGet_PLShieldNum(E_ATTRIBUTE_TYPE Attr);
	int32 AIBaseGet_PLValidAttrNum(E_ATTRIBUTE_TYPE Attr);
	int32 AIBaseGet_PLValidSkillNum(int32 SkillId);
	int32 AIBaseGet_SkillIDBySkillType(int32 MyPartyIndex, E_SKILL_TYPE SkillType);
	int32 AIBaseGet_TarPLChohatsu_ENAnalyze();
	int32 AIBaseGet_UpliftRate(bool IsEnemySurpriseTurn);
	E_BTL_CNT AIBaseGetBadStatusToBtlCnt(E_BAD_STATUS bst);
	E_BTL_CNT AIBaseGetEfficacyToBtlCnt(E_EFFICACY_BD Efficacy);
	TArray<uint8> AIBaseTar_Common(int32 ActorIndex, E_BTL_AI_TAR Type, int32 Value, int32 Value2);
	void AIBaseTar_GetTargetSideArea(E_BTL_SIDE ActorSide, E_SKILL_TARGET SkillTarget, E_BTL_SIDE* TargetSide, E_BTL_AI_AREA* Area);
	int32 AIBaseTar_Provoke(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide);
	TArray<uint8> AIBaseTar_SetProvoke(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide);
	TArray<uint8> AIBaseTar_SetRenzokuSkill(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 PartyIndex);
	TArray<uint8> AIBaseTar_SetTarAishouAbsorption(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 N);
	TArray<uint8> AIBaseTar_SetTarAishouBlock(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 N);
	TArray<uint8> AIBaseTar_SetTarAishouNotAbsorption(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 N);
	TArray<uint8> AIBaseTar_SetTarAishouNotBlock(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 N);
	TArray<uint8> AIBaseTar_SetTarAllEnemy();
	TArray<uint8> AIBaseTar_SetTarAutoBattle(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide);
	TArray<uint8> AIBaseTar_SetTargetAI(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide);
	TArray<uint8> AIBaseTar_SetTargetAishouFlat(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 Aishou);
	TArray<uint8> AIBaseTar_SetTargetAishouMinus(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 Aishou);
	TArray<uint8> AIBaseTar_SetTargetAishouNotFlat(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 Aishou);
	TArray<uint8> AIBaseTar_SetTargetAishouNotMinus(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 Aishou);
	TArray<uint8> AIBaseTar_SetTargetAishouNotPlus(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 Aishou);
	TArray<uint8> AIBaseTar_SetTargetAishouNotReflection(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 N);
	TArray<uint8> AIBaseTar_SetTargetAishouPlus(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 Aishou);
	TArray<uint8> AIBaseTar_SetTargetAishouReflection(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 N);
	TArray<uint8> AIBaseTar_SetTargetBadStatus(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 bst);
	TArray<uint8> AIBaseTar_SetTargetHojoAI(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 SkillId);
	TArray<uint8> AIBaseTar_SetTargetHojoMAX(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 Efficacy);
	TArray<uint8> AIBaseTar_SetTargetHojoMIN(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 Efficacy);
	TArray<uint8> AIBaseTar_SetTargetHPMAX(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide);
	TArray<uint8> AIBaseTar_SetTargetHPMAXn(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 N);
	TArray<uint8> AIBaseTar_SetTargetHPMIN(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide);
	TArray<uint8> AIBaseTar_SetTargetHPPerc(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 N);
	TArray<uint8> AIBaseTar_SetTargetHPRatioMAX(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide);
	TArray<uint8> AIBaseTar_SetTargetHPRatioMIN(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide);
	TArray<uint8> AIBaseTar_SetTargetID(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 ID);
	TArray<uint8> AIBaseTar_SetTargetNotBadStatus(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 bst);
	TArray<uint8> AIBaseTar_SetTargetNotBadStatus2(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 bst, int32 Num);
	TArray<uint8> AIBaseTar_SetTargetNotCritical(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide);
	TArray<uint8> AIBaseTar_SetTargetNotID(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 ID);
	TArray<uint8> AIBaseTar_SetTargetNotPartyIndex(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 PartyIndex);
	TArray<uint8> AIBaseTar_SetTargetPartyIndex(const TArray<struct FBtlParty>& PartyArray, int32 PartyIndex);
	TArray<uint8> AIBaseTar_SetTargetRandom(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide);
	TArray<uint8> AIBaseTar_SetTargetRecCounter(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide);
	TArray<uint8> AIBaseTar_SetTargetRecCritical(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide);
	TArray<uint8> AIBaseTar_SetTargetSelf(const struct FBtlParty& Actor);
	TArray<uint8> AIBaseTar_SetTargetSelfSideOther(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 SelfIndex);
	TArray<uint8> AIBaseTar_SetTargetSmart(int32 ActorIndex, const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide);
	TArray<uint8> AIBaseTar_SetTargetWeak(int32 ActorIndex, const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide);
	TArray<uint8> AIBaseTar_SetTarGuard(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 N);
	TArray<uint8> AIBaseTar_SetTarMaka(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 N);
	TArray<uint8> AIBaseTar_SetTarNotGuard(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 N);
	TArray<uint8> AIBaseTar_SetTarNotMaka(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 N);
	TArray<uint8> AIBaseTar_SetTarNotTetra(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 N);
	TArray<uint8> AIBaseTar_SetTarTetra(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 N);
	TArray<uint8> AIBaseTar_SetValidSkill(const TArray<struct FBtlParty>& PartyArray, E_BTL_SIDE TargetSide, int32 SkillId);
	bool CheckAishouFlat(int32 TargetAishou);
	bool CheckAishouMinus(int32 TargetAishou);
	bool CheckAishouNotFlat(int32 TargetAishou);
	bool CheckAishouNotMinus(int32 TargetAishou);
	bool CheckAishouNotPlus(int32 TargetAishou);
	bool CheckAishouPlus(int32 TargetAishou);
	bool CheckEnemySidePartyData(const struct FBtlParty& Party, const E_BTL_SIDE& TargetSide);
	bool CheckExistPartyData(const struct FBtlParty& Party);
	bool CheckPlayerSidePartyData(const struct FBtlParty& Party, const E_BTL_SIDE& TargetSide);
	bool Chk_BattleEventFlag();
	bool Chk_BattleEventFlag2();
	bool Chk_SummonPositionDevilID(int32 SummonIndex, int32 DevilID);
	int32 GetElectrificationNum();
	TArray<int32> GetEmptyPosSummonDevilId(int32 DevilID_0, int32 DevilID_1, int32 DevilID_2, int32 DevilID_3, bool IsExclusionLeader);
	bool OptUpLifting_TurnEnd(int32 DevilID);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattleAICommandBase">();
	}
	static class UBattleAICommandBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleAICommandBase>();
	}
};
static_assert(alignof(UBattleAICommandBase) == 0x000008, "Wrong alignment on UBattleAICommandBase");
static_assert(sizeof(UBattleAICommandBase) == 0x0000B0, "Wrong size on UBattleAICommandBase");

// Class Project.UICalc
// 0x0000 (0x0028 - 0x0028)
class UUICalc final : public UBlueprintFunctionLibrary
{
public:
	static TArray<struct FUICalcRectCheck> CalcRect_SlideSide(const TArray<struct FUICalcRectCheck>& Rect);
	static TArray<struct FUICalcRectCheck> CalcRect_Sort_MinPostionX(const TArray<struct FUICalcRectCheck>& Rect);
	static TArray<struct FUICalcRectCheck> CalcRectNoOverlaid(const TArray<struct FUICalcRectCheck>& Rect, const struct FVector2D& ScreenSize);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UICalc">();
	}
	static class UUICalc* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUICalc>();
	}
};
static_assert(alignof(UUICalc) == 0x000008, "Wrong alignment on UUICalc");
static_assert(sizeof(UUICalc) == 0x000028, "Wrong size on UUICalc");

// Class Project.BPL_AsyncLib
// 0x0000 (0x0028 - 0x0028)
class UBPL_AsyncLib final : public UBlueprintFunctionLibrary
{
public:
	static bool CheckAddGaugeSkill(const struct FSkillBaseData& Skill);
	static bool CheckAidClearSkill(const struct FSkillBaseData& Skill);
	static bool CheckAnalyzeSkill(const struct FSkillBaseData& Skill);
	static bool CheckBstCureSkill(const struct FSkillBaseData& Skill, const struct FBtlParty& Player);
	static bool CheckBstSkill(const struct FSkillBaseData& Skill);
	static bool CheckChargeSkill(const struct FSkillBaseData& Skill);
	static bool CheckDamageCutSkill(const struct FSkillBaseData& Skill);
	static bool CheckHPCureItem(const struct FUseItemData& Item);
	static bool CheckHPCureSkill(const struct FSkillBaseData& Skill);
	static bool CheckKajyandaSkill(const struct FSkillBaseData& Skill);
	static bool CheckKarnSkill(const struct FSkillBaseData& Skill);
	static bool CheckMPCureItem(const struct FUseItemData& Item);
	static bool CheckMPCureSkill(const struct FSkillBaseData& Skill);
	static bool CheckPass(const struct FSkillBaseData& Skill);
	static bool CheckPressIcon(const struct FSkillBaseData& Skill);
	static bool CheckPrevTurnAvoid(const struct FSkillBaseData& Skill);
	static bool CheckProvokeSkill(const struct FSkillBaseData& Skill);
	static bool CheckRecomeSkill(const struct FSkillBaseData& Skill);
	static TArray<int32> GetAddMagatsuhiSkillId(const struct FBtlParty& Player, const TArray<struct FBtlParty>& PartyAll);
	static E_BTL_CNT GetBarrierType(const uint8 barrier, const E_ATTRIBUTE_TYPE Attr);
	static int32 GetRecoveryHPUpRate(const struct FSkillBaseData& Skill, const struct FBtlParty& Player, const struct FBtlParty& Party);
	static int32 GetSkillBarrierCount(const struct FSkillBaseData& Skill, const struct FBtlParty& Player, const struct FBtlParty& Party);
	static bool IsUsedAddGaugeSkill(class UObject* MainWork, const struct FSkillBaseData& Skill, const int32& PlayerUpliftingGauge);
	static bool IsUsedAidClearSkill(const struct FSkillBaseData& Skill, const struct FBtlParty& Player, const struct FBtlParty& Party);
	static bool IsUsedAnalyzeSkill(const struct FSkillBaseData& Skill, const struct FBtlParty& Party);
	static bool IsUsedBstCureSkill(const struct FSkillBaseData& Skill, const struct FBtlParty& Party);
	static bool IsUsedBstSkill(const struct FSkillBaseData& Skill, const struct FBtlParty& Party);
	static bool IsUsedChargeSkill(const struct FSkillBaseData& Skill, const struct FBtlParty& Party);
	static bool IsUsedDamageCutSkill(const struct FSkillBaseData& Skill, const struct FBtlParty& Party);
	static bool IsUsedHPCureItem(const struct FUseItemData& Skill, const struct FBtlParty& Player, const struct FBtlParty& Party);
	static bool IsUsedHPCureSkill(const struct FSkillBaseData& Skill, const struct FBtlParty& Player, const struct FBtlParty& Party);
	static bool IsUsedItem(const struct FUseItemData& Item, const struct FBtlParty& Player, const struct FBtlParty& Party);
	static bool IsUsedKajyandaSkill(const struct FSkillBaseData& Skill, const struct FBtlParty& Player, const struct FBtlParty& Party);
	static bool IsUsedKajyandaSkillCommon(const struct FBtlParty& Player, const struct FBtlParty& Party, const int32 KajyanndaValue, const int32 KajyanndaTurn, const E_BTL_CNT KajyandaType, const E_BTL_CNT KajyandaTurnType);
	static bool IsUsedKarnSkill(const struct FSkillBaseData& Skill, const struct FBtlParty& Player, const struct FBtlParty& Party);
	static bool IsUsedMPCureItem(const struct FUseItemData& Skill, const struct FBtlParty& Player, const struct FBtlParty& Party);
	static bool IsUsedMPCureSkill(const struct FSkillBaseData& Skill, const struct FBtlParty& Party);
	static bool IsUsedPass(class UObject* MainWork, const struct FSkillBaseData& Skill, const struct FBtlParty& Player);
	static bool IsUsedPressIcon(class UObject* MainWork, const struct FSkillBaseData& Skill, const struct FBtlParty& Player);
	static bool IsUsedPrevTurnAvoid(const struct FSkillBaseData& Skill, const struct FBtlParty& Player);
	static bool IsUsedProvokeSkill(const struct FSkillBaseData& Skill, const struct FBtlParty& Party);
	static bool IsUsedRecomeSkill(const struct FSkillBaseData& Skill, const struct FBtlParty& Party);
	static bool IsUsedSkill(class UObject* MainWork, const struct FSkillBaseData& Skill, const struct FBtlParty& Player, const struct FBtlParty& Party);
	static bool IsUsedSkillStock(const struct FSkillBaseData& Skill, const struct FBtlParty& Player, const struct FBtlParty& Party);
	static bool IsUseItemCommand(class UObject* MainWork, const struct FUseItemData& Item, const struct FBtlParty& Player, const TArray<struct FBtlParty>& PartyAll, bool IsEscape, bool IsUse);
	static bool IsUseItemCommandMainWork(class UObject* MainWork, const struct FUseItemData& Item, const struct FBtlParty& Player, bool IsEscape, bool IsUse);
	static bool IsUseItemTargetSelect(class UObject* MainWork, const struct FUseItemData& Item, const struct FBtlParty& User, const struct FBtlParty& Target, bool IsUse);
	static bool IsUseSkillCommand(class UObject* MainWork, const struct FSkillBaseData& Skill, const struct FBtlParty& Player, const TArray<struct FBtlParty>& PartyAll, bool IsEscape);
	static bool IsUseSkillTargetSelect(class UObject* MainWork, const struct FSkillBaseData& Skill, const struct FBtlParty& User, const struct FBtlParty& Target, bool IsUse);
	static void SettleCriticalFunc(class ABattleMainWorkBase* BattleMain, const struct FBtlParty& Player, const TArray<struct FBtlParty>& Enemy, const TArray<struct FBtlParty>& PartyAll, TArray<struct FSkillCriticalValueOne>* Result, bool* bFinished);
	static bool SettleCriticalSkill(const struct FBtlParty& Player, const struct FBtlParty& Enemy, int32 SkillId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BPL_AsyncLib">();
	}
	static class UBPL_AsyncLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPL_AsyncLib>();
	}
};
static_assert(alignof(UBPL_AsyncLib) == 0x000008, "Wrong alignment on UBPL_AsyncLib");
static_assert(sizeof(UBPL_AsyncLib) == 0x000028, "Wrong size on UBPL_AsyncLib");

// Class Project.BattleAsyncTaskWorkComponent
// 0x0018 (0x00C8 - 0x00B0)
class UBattleAsyncTaskWorkComponent : public UBattleActorComponentBase
{
public:
	bool                                          M_IsFinished;                                      // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_155D[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSkillCriticalValueOne>         M_Result;                                          // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	void MakeSettleCriticalWork(class ABattleMainWorkBase* BattleMain, const struct FBtlParty& Player, const TArray<struct FBtlParty>& Enemy, const TArray<struct FBtlParty>& PartyAll);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattleAsyncTaskWorkComponent">();
	}
	static class UBattleAsyncTaskWorkComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleAsyncTaskWorkComponent>();
	}
};
static_assert(alignof(UBattleAsyncTaskWorkComponent) == 0x000008, "Wrong alignment on UBattleAsyncTaskWorkComponent");
static_assert(sizeof(UBattleAsyncTaskWorkComponent) == 0x0000C8, "Wrong size on UBattleAsyncTaskWorkComponent");
static_assert(offsetof(UBattleAsyncTaskWorkComponent, M_IsFinished) == 0x0000B0, "Member 'UBattleAsyncTaskWorkComponent::M_IsFinished' has a wrong offset!");
static_assert(offsetof(UBattleAsyncTaskWorkComponent, M_Result) == 0x0000B8, "Member 'UBattleAsyncTaskWorkComponent::M_Result' has a wrong offset!");

// Class Project.BPL_BattleAttack
// 0x0000 (0x0028 - 0x0028)
class UBPL_BattleAttack final : public UBlueprintFunctionLibrary
{
public:
	static bool BtlAttackCheckAttr(const struct FBtlAttack& PData, E_ATTRIBUTE_TYPE CheckAttr);
	static void BtlAttackGetTekiseiValue(const struct FBtlParty& Player, const struct FBtlAttack& PData, E_SKILL_TEKISEI_EFT_TYPE CheckType, int32* RetValue, E_SKILL_TEKISEI_CATEGORY* RetCateg);
	static bool BtlAttackIsHaveAtrAttr(const struct FBtlAttack& PData, E_ATTRIBUTE_TYPE InAttr);
	static bool BtlAttackIsMasicalAttack(const struct FBtlAttack& PData);
	static bool BtlAttackIsPhysicalAttack(const struct FBtlAttack& PData);
	static bool BtlAttackIsRecome(const struct FBtlAttack& PData);
	static bool BtlAttackIsRecoverySkill(const struct FBtlAttack& PData);
	static bool BtlAttackIsSummon(const struct FBtlAttack& PData);
	static struct FBtlAttack MakeUpBattleAttackData(const struct FBtlParty& Player);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BPL_BattleAttack">();
	}
	static class UBPL_BattleAttack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPL_BattleAttack>();
	}
};
static_assert(alignof(UBPL_BattleAttack) == 0x000008, "Wrong alignment on UBPL_BattleAttack");
static_assert(sizeof(UBPL_BattleAttack) == 0x000028, "Wrong size on UBPL_BattleAttack");

// Class Project.BPL_BattleBossFlag
// 0x0000 (0x0028 - 0x0028)
class UBPL_BattleBossFlag final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BPL_BattleBossFlag">();
	}
	static class UBPL_BattleBossFlag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPL_BattleBossFlag>();
	}
};
static_assert(alignof(UBPL_BattleBossFlag) == 0x000008, "Wrong alignment on UBPL_BattleBossFlag");
static_assert(sizeof(UBPL_BattleBossFlag) == 0x000028, "Wrong size on UBPL_BattleBossFlag");

// Class Project.UniteCharaPanelCtrlBase
// 0x02D0 (0x04F0 - 0x0220)
class AUniteCharaPanelCtrlBase final : public AActor
{
public:
	uint8                                         Pad_1568[0x2D0];                                   // 0x0220(0x02D0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 AddPartyListFlag(int32 InIndex, E_UNITECHARAPANELFLAG InType, int32 InCursorOffset);
	bool ApplyCharaPanelCursorCtrl(E_UNITECHARAPANEL_MENUTYPE InType);
	bool BackUpForSortPartyData(int32 InIndex, int32 InOffset);
	void BIESetFadeOutPanelAnimation(int32 InIndex);
	void BIESetInitializePanelAnimation(int32 InIndex);
	void BIESetUniteCharaPanelUnselectablePanelOff(int32 InIndex);
	void BIESetUniteCharaPanelUnselectablePanelOn(int32 InIndex);
	int32 CalcDevilBookCost(int32 InIndex, int32 InMode, int32 InType);
	void CalcDevilBookCursorPositionByDataIndex(int32 InDataIndex, int32* OutCursorOffset, int32* OutCursorPosition);
	struct FUniteCharaPanelParamData CalcDevilBookPanelParam(int32 InIndex, int32 InMode, int32 InType);
	struct FUniteCharaPanelParamData CalcDevilBookPanelParamByDevilId(int32 InDevilId);
	int32 CalcFResultDevilExpByCursorOffset(int32 InCursorOffset, int32 InIndex, int32 InType);
	struct FVector2D CalcFusionCombineAnimationPos(const struct FVector2D& InStartPos, const struct FVector2D& InEndPos, float InRate);
	int32 CalcScrollBarClickedByDevilBook(float InRate, int32 InOffsetType);
	int32 CalcScrollBarClickedByParty(float InRate, int32 InType);
	int32 CalcScrollBarClickedBySearchFusion(float InRate, int32 InOffsetType);
	int32 CalcScrollBarClickedBySpecialFusion(float InRate, int32 InOffsetType);
	int32 CalcScrollBarClickedByUtsusemi(float InRate, int32 InOffsetType);
	void CalcSearchFusionCursorPositionByDataIndex(int32 InDataIndex, int32* OutCursorOffset, int32* OutCursorPosition);
