#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProjectPlayerCameraManager

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ProjectPlayerCameraManager.ProjectPlayerCameraManager_C.ExecuteUbergraph_ProjectPlayerCameraManager
// 0x02E0 (0x02E0 - 0x0000)
struct ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D2[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerBase_C*                          K2Node_DynamicCast_AsPlayer_Base;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D3[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLookInputIgnored_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D4[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D5[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraShakeBase*                       CallFunc_StartCameraShake_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_2;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D6[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_FOV;                                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Distance;                             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Height;                               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_3;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           K2Node_DynamicCast_AsChara_Base;                   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_6;                    // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D7[0xD];                                     // 0x00A3(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_4;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26D8[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetComponentsByTag_ReturnValue;           // 0x0118(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_5;              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerBase_C*                          K2Node_DynamicCast_AsPlayer_Base_1;                // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D9[0x6];                                     // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_6;              // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26DA[0x3];                                     // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0190(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_26DB[0x8];                                     // 0x0218(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x0220(0x0030)(IsPlainOldData, NoDestructor)
	class UCameraShakeBase*                       CallFunc_StartCameraShake_ReturnValue_1;           // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_ForceKeepVisible;                     // 0x027D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26DC[0x2];                                     // 0x027E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_7;              // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomSpringArmComponent*              CallFunc_GetPlayerSpringArm_PlayerSpringArmComponent; // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerBase_C*                          K2Node_DynamicCast_AsPlayer_Base_2;                // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_7;                    // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_8;                    // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26DD[0x5];                                     // 0x029B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACustomPlayerController*                K2Node_DynamicCast_AsCustom_Player_Controller;     // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsProjectMoveInputIgnored_ReturnValue;    // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26DE[0x6];                                     // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_8;              // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager) == 0x000010, "Wrong alignment on ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager");
static_assert(sizeof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager) == 0x0002E0, "Wrong size on ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, EntryPoint) == 0x000000, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_DynamicCast_AsPlayer_Base) == 0x000010, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_DynamicCast_AsPlayer_Base' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_IsLookInputIgnored_ReturnValue) == 0x000028, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_IsLookInputIgnored_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_GetPlayerController_ReturnValue_1) == 0x000030, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_GetViewTarget_ReturnValue) == 0x000038, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000040, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000048, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_FInterpTo_ReturnValue) == 0x00004C, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_Subtract_IntInt_ReturnValue) == 0x000050, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_Clamp_ReturnValue) == 0x000054, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_StartCameraShake_ReturnValue) == 0x000058, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_StartCameraShake_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_GetPlayerController_ReturnValue_2) == 0x000060, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_GetPlayerPawn_ReturnValue_2) == 0x000068, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_GetPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_GetViewTarget_ReturnValue_1) == 0x000070, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_GetViewTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x000078, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_SwitchEnum_CmpSuccess_1) == 0x000080, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_SwitchEnum_CmpSuccess_2) == 0x000081, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_SwitchEnum_CmpSuccess_3) == 0x000082, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_SwitchEnum_CmpSuccess_4) == 0x000083, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_Event_FOV) == 0x000084, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_Event_FOV' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_Event_Distance) == 0x000088, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_Event_Distance' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_Event_Height) == 0x00008C, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_Event_Height' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_GetPlayerPawn_ReturnValue_3) == 0x000090, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_GetPlayerPawn_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_DynamicCast_AsChara_Base) == 0x000098, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_DynamicCast_AsChara_Base' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_SwitchEnum_CmpSuccess_5) == 0x0000A1, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_SwitchEnum_CmpSuccess_5' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_SwitchEnum_CmpSuccess_6) == 0x0000A2, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_SwitchEnum_CmpSuccess_6' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_GetSocketTransform_ReturnValue) == 0x0000B0, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_BreakTransform_Location) == 0x0000E0, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_BreakTransform_Rotation) == 0x0000EC, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_BreakTransform_Scale) == 0x0000F8, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_Add_FloatFloat_ReturnValue) == 0x000104, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_GetPlayerPawn_ReturnValue_4) == 0x000108, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_GetPlayerPawn_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000110, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_GetComponentsByTag_ReturnValue) == 0x000118, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_Array_Get_Item) == 0x000128, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000130, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_BreakVector_X) == 0x000134, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_BreakVector_Y) == 0x000138, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_BreakVector_Z) == 0x00013C, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_GetPlayerPawn_ReturnValue_5) == 0x000140, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_GetPlayerPawn_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_DynamicCast_AsPlayer_Base_1) == 0x000148, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_DynamicCast_AsPlayer_Base_1' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_DynamicCast_bSuccess_2) == 0x000150, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000151, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_GetPlayerPawn_ReturnValue_6) == 0x000158, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_GetPlayerPawn_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_GetComponentByClass_ReturnValue) == 0x000160, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_BreakVector_X_1) == 0x000168, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_BreakVector_Y_1) == 0x00016C, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_BreakVector_Z_1) == 0x000170, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_IsValid_ReturnValue) == 0x000174, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_SelectFloat_ReturnValue) == 0x000178, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x00017C, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_Add_FloatFloat_ReturnValue_4) == 0x000180, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_Add_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_MakeVector_ReturnValue) == 0x000184, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000190, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_GetSocketTransform_ReturnValue_1) == 0x000220, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_GetSocketTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_StartCameraShake_ReturnValue_1) == 0x000250, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_StartCameraShake_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_BreakTransform_Location_1) == 0x000258, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_BreakTransform_Rotation_1) == 0x000264, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_BreakTransform_Scale_1) == 0x000270, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_NotEqual_VectorVector_ReturnValue) == 0x00027C, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_NotEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_Event_ForceKeepVisible) == 0x00027D, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_Event_ForceKeepVisible' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_GetPlayerPawn_ReturnValue_7) == 0x000280, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_GetPlayerPawn_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_GetPlayerSpringArm_PlayerSpringArmComponent) == 0x000288, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_GetPlayerSpringArm_PlayerSpringArmComponent' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_DynamicCast_AsPlayer_Base_2) == 0x000290, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_DynamicCast_AsPlayer_Base_2' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_DynamicCast_bSuccess_3) == 0x000298, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_SwitchEnum_CmpSuccess_7) == 0x000299, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_SwitchEnum_CmpSuccess_7' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_SwitchEnum_CmpSuccess_8) == 0x00029A, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_SwitchEnum_CmpSuccess_8' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_GetPlayerController_ReturnValue_3) == 0x0002A0, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_DynamicCast_AsCustom_Player_Controller) == 0x0002A8, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_DynamicCast_AsCustom_Player_Controller' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, K2Node_DynamicCast_bSuccess_4) == 0x0002B0, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_IsProjectMoveInputIgnored_ReturnValue) == 0x0002B1, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_IsProjectMoveInputIgnored_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_GetPlayerPawn_ReturnValue_8) == 0x0002B8, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_GetPlayerPawn_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_GetVelocity_ReturnValue) == 0x0002C0, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_VSize_ReturnValue) == 0x0002CC, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0002D0, "Member 'ProjectPlayerCameraManager_C_ExecuteUbergraph_ProjectPlayerCameraManager::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function ProjectPlayerCameraManager.ProjectPlayerCameraManager_C.SetForceKeepMeshesVisible
// 0x0001 (0x0001 - 0x0000)
struct ProjectPlayerCameraManager_C_SetForceKeepMeshesVisible final
{
public:
	bool                                          Param_ForceKeepVisible;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProjectPlayerCameraManager_C_SetForceKeepMeshesVisible) == 0x000001, "Wrong alignment on ProjectPlayerCameraManager_C_SetForceKeepMeshesVisible");
static_assert(sizeof(ProjectPlayerCameraManager_C_SetForceKeepMeshesVisible) == 0x000001, "Wrong size on ProjectPlayerCameraManager_C_SetForceKeepMeshesVisible");
static_assert(offsetof(ProjectPlayerCameraManager_C_SetForceKeepMeshesVisible, Param_ForceKeepVisible) == 0x000000, "Member 'ProjectPlayerCameraManager_C_SetForceKeepMeshesVisible::Param_ForceKeepVisible' has a wrong offset!");

// Function ProjectPlayerCameraManager.ProjectPlayerCameraManager_C.MapCameraForce_IN
// 0x000C (0x000C - 0x0000)
struct ProjectPlayerCameraManager_C_MapCameraForce_IN final
{
public:
	float                                         FOV;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Height;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProjectPlayerCameraManager_C_MapCameraForce_IN) == 0x000004, "Wrong alignment on ProjectPlayerCameraManager_C_MapCameraForce_IN");
static_assert(sizeof(ProjectPlayerCameraManager_C_MapCameraForce_IN) == 0x00000C, "Wrong size on ProjectPlayerCameraManager_C_MapCameraForce_IN");
static_assert(offsetof(ProjectPlayerCameraManager_C_MapCameraForce_IN, FOV) == 0x000000, "Member 'ProjectPlayerCameraManager_C_MapCameraForce_IN::FOV' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_MapCameraForce_IN, Distance) == 0x000004, "Member 'ProjectPlayerCameraManager_C_MapCameraForce_IN::Distance' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_MapCameraForce_IN, Height) == 0x000008, "Member 'ProjectPlayerCameraManager_C_MapCameraForce_IN::Height' has a wrong offset!");

// Function ProjectPlayerCameraManager.ProjectPlayerCameraManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ProjectPlayerCameraManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProjectPlayerCameraManager_C_ReceiveTick) == 0x000004, "Wrong alignment on ProjectPlayerCameraManager_C_ReceiveTick");
static_assert(sizeof(ProjectPlayerCameraManager_C_ReceiveTick) == 0x000004, "Wrong size on ProjectPlayerCameraManager_C_ReceiveTick");
static_assert(offsetof(ProjectPlayerCameraManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ProjectPlayerCameraManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function ProjectPlayerCameraManager.ProjectPlayerCameraManager_C.GetNowCameraPos
// 0x000C (0x000C - 0x0000)
struct ProjectPlayerCameraManager_C_GetNowCameraPos final
{
public:
	float                                         Param_Now_FOV;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_Now_Distance;                                // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_Now_Height;                                  // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProjectPlayerCameraManager_C_GetNowCameraPos) == 0x000004, "Wrong alignment on ProjectPlayerCameraManager_C_GetNowCameraPos");
static_assert(sizeof(ProjectPlayerCameraManager_C_GetNowCameraPos) == 0x00000C, "Wrong size on ProjectPlayerCameraManager_C_GetNowCameraPos");
static_assert(offsetof(ProjectPlayerCameraManager_C_GetNowCameraPos, Param_Now_FOV) == 0x000000, "Member 'ProjectPlayerCameraManager_C_GetNowCameraPos::Param_Now_FOV' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_GetNowCameraPos, Param_Now_Distance) == 0x000004, "Member 'ProjectPlayerCameraManager_C_GetNowCameraPos::Param_Now_Distance' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_GetNowCameraPos, Param_Now_Height) == 0x000008, "Member 'ProjectPlayerCameraManager_C_GetNowCameraPos::Param_Now_Height' has a wrong offset!");

// Function ProjectPlayerCameraManager.ProjectPlayerCameraManager_C.InitNowCameraPos
// 0x000C (0x000C - 0x0000)
struct ProjectPlayerCameraManager_C_InitNowCameraPos final
{
public:
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProjectPlayerCameraManager_C_InitNowCameraPos) == 0x000004, "Wrong alignment on ProjectPlayerCameraManager_C_InitNowCameraPos");
static_assert(sizeof(ProjectPlayerCameraManager_C_InitNowCameraPos) == 0x00000C, "Wrong size on ProjectPlayerCameraManager_C_InitNowCameraPos");
static_assert(offsetof(ProjectPlayerCameraManager_C_InitNowCameraPos, CallFunc_FTrunc_ReturnValue) == 0x000000, "Member 'ProjectPlayerCameraManager_C_InitNowCameraPos::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_InitNowCameraPos, CallFunc_FTrunc_ReturnValue_1) == 0x000004, "Member 'ProjectPlayerCameraManager_C_InitNowCameraPos::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_InitNowCameraPos, CallFunc_FTrunc_ReturnValue_2) == 0x000008, "Member 'ProjectPlayerCameraManager_C_InitNowCameraPos::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");

// Function ProjectPlayerCameraManager.ProjectPlayerCameraManager_C.UpdateDistance
// 0x0018 (0x0018 - 0x0000)
struct ProjectPlayerCameraManager_C_UpdateDistance final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26DF[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomSpringArmComponent*              CallFunc_GetPlayerSpringArm_PlayerSpringArmComponent; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProjectPlayerCameraManager_C_UpdateDistance) == 0x000008, "Wrong alignment on ProjectPlayerCameraManager_C_UpdateDistance");
static_assert(sizeof(ProjectPlayerCameraManager_C_UpdateDistance) == 0x000018, "Wrong size on ProjectPlayerCameraManager_C_UpdateDistance");
static_assert(offsetof(ProjectPlayerCameraManager_C_UpdateDistance, DeltaTime) == 0x000000, "Member 'ProjectPlayerCameraManager_C_UpdateDistance::DeltaTime' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_UpdateDistance, CallFunc_GetPlayerSpringArm_PlayerSpringArmComponent) == 0x000008, "Member 'ProjectPlayerCameraManager_C_UpdateDistance::CallFunc_GetPlayerSpringArm_PlayerSpringArmComponent' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_UpdateDistance, CallFunc_Add_FloatFloat_ReturnValue) == 0x000010, "Member 'ProjectPlayerCameraManager_C_UpdateDistance::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_UpdateDistance, CallFunc_FInterpTo_ReturnValue) == 0x000014, "Member 'ProjectPlayerCameraManager_C_UpdateDistance::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");

// Function ProjectPlayerCameraManager.ProjectPlayerCameraManager_C.UpdateFOV
// 0x0030 (0x0030 - 0x0000)
struct ProjectPlayerCameraManager_C_UpdateFOV final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26E0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26E1[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProjectPlayerCameraManager_C_UpdateFOV) == 0x000008, "Wrong alignment on ProjectPlayerCameraManager_C_UpdateFOV");
static_assert(sizeof(ProjectPlayerCameraManager_C_UpdateFOV) == 0x000030, "Wrong size on ProjectPlayerCameraManager_C_UpdateFOV");
static_assert(offsetof(ProjectPlayerCameraManager_C_UpdateFOV, DeltaTime) == 0x000000, "Member 'ProjectPlayerCameraManager_C_UpdateFOV::DeltaTime' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_UpdateFOV, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'ProjectPlayerCameraManager_C_UpdateFOV::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_UpdateFOV, CallFunc_Add_FloatFloat_ReturnValue) == 0x000010, "Member 'ProjectPlayerCameraManager_C_UpdateFOV::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_UpdateFOV, CallFunc_GetViewTarget_ReturnValue) == 0x000018, "Member 'ProjectPlayerCameraManager_C_UpdateFOV::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_UpdateFOV, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'ProjectPlayerCameraManager_C_UpdateFOV::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_UpdateFOV, CallFunc_FInterpTo_ReturnValue) == 0x000028, "Member 'ProjectPlayerCameraManager_C_UpdateFOV::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");

// Function ProjectPlayerCameraManager.ProjectPlayerCameraManager_C.UpdateHeight
// 0x0100 (0x0100 - 0x0000)
struct ProjectPlayerCameraManager_C_UpdateHeight final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_PelvisOffsetZ;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerBase_C*                          K2Node_DynamicCast_AsPlayer_Base;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26E2[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetComponentsByTag_ReturnValue;           // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0074(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ProjectPlayerCameraManager_C_UpdateHeight) == 0x000008, "Wrong alignment on ProjectPlayerCameraManager_C_UpdateHeight");
static_assert(sizeof(ProjectPlayerCameraManager_C_UpdateHeight) == 0x000100, "Wrong size on ProjectPlayerCameraManager_C_UpdateHeight");
static_assert(offsetof(ProjectPlayerCameraManager_C_UpdateHeight, DeltaTime) == 0x000000, "Member 'ProjectPlayerCameraManager_C_UpdateHeight::DeltaTime' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_UpdateHeight, L_PelvisOffsetZ) == 0x000004, "Member 'ProjectPlayerCameraManager_C_UpdateHeight::L_PelvisOffsetZ' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_UpdateHeight, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'ProjectPlayerCameraManager_C_UpdateHeight::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_UpdateHeight, K2Node_DynamicCast_AsPlayer_Base) == 0x000010, "Member 'ProjectPlayerCameraManager_C_UpdateHeight::K2Node_DynamicCast_AsPlayer_Base' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_UpdateHeight, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ProjectPlayerCameraManager_C_UpdateHeight::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_UpdateHeight, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'ProjectPlayerCameraManager_C_UpdateHeight::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_UpdateHeight, CallFunc_Add_FloatFloat_ReturnValue) == 0x00001C, "Member 'ProjectPlayerCameraManager_C_UpdateHeight::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectPlayerCameraManager_C_UpdateHeight, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000020, "Member 'ProjectPlayerCameraManager_C_UpdateHeight::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
