#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProjectGameInstance

#include "Basic.hpp"

#include "ST_LightParam_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DaathTypeList_structs.hpp"
#include "Engine_structs.hpp"
#include "E_ROM_TYPE_structs.hpp"
#include "LoadOnlyResident_ST_structs.hpp"
#include "DebugPlayerTraceCounter_structs.hpp"
#include "MapBEffectParamType_structs.hpp"
#include "Project_structs.hpp"
#include "Project_classes.hpp"
#include "E_PLAYER_MANAGER_TYPE_structs.hpp"
#include "E_MAP_PLAYER_TYPE_structs.hpp"
#include "E_MAP_DEBUG_MES_TYPE_structs.hpp"
#include "E_MAP_SYSTEMRESIDENT_ID_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ProjectGameInstance.ProjectGameInstance_C
// 0x0540 (0x1F30 - 0x19F0)
class UProjectGameInstance_C final : public UProjectGameInstanceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x19F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         M_BattleState;                                     // 0x19F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F2D[0x7];                                     // 0x19F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TestBtlCameraHome;                                 // 0x1A00(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<bool>                                  TestFlag;                                          // 0x1A30(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsLmap;                                            // 0x1A40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          GameInit;                                          // 0x1A41(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          M_TestMapEvent;                                    // 0x1A42(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F2E[0x5];                                     // 0x1A43(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CustomGameMode;                                    // 0x1A48(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CustomGameModeIndex;                               // 0x1A58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F2F[0x4];                                     // 0x1A5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 M_MapCommon;                                       // 0x1A60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F30[0x8];                                     // 0x1A68(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             M_SetBtlResultCameraPos;                           // 0x1A70(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             M_SetBtlResultCameraPos0;                          // 0x1AA0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsMapChange;                                       // 0x1AD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F31[0x3];                                     // 0x1AD1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         M_WarpPoint;                                       // 0x1AD4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEncount;                                         // 0x1AD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEventView;                                       // 0x1AD9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F32[0x2];                                     // 0x1ADA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EventViewID;                                       // 0x1ADC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoadMap;                                         // 0x1AE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F33[0x7];                                     // 0x1AE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 M_BattleMain;                                      // 0x1AE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                M_CharaTable;                                      // 0x1AF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EventReservID;                                     // 0x1AF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         M_FromEvent;                                       // 0x1AFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         M_OtherMapReturn;                                  // 0x1B00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F34[0x4];                                     // 0x1B04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLoadOnlyResident_ST>           NextMapList;                                       // 0x1B08(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          NextMapLoadStart;                                  // 0x1B18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NextMapLoadEnd;                                    // 0x1B19(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F35[0x6];                                     // 0x1B1A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLoadOnlyResident_ST                   MapStartList;                                      // 0x1B20(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsMapStartLoad;                                    // 0x1B50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsLoadLevel;                                       // 0x1B51(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F36[0x6];                                     // 0x1B52(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APawn*>                          GamePlayer;                                        // 0x1B58(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          IsEventView_ContinueOn;                            // 0x1B68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEventView_DaathResetPlyPos;                      // 0x1B69(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsTrace;                                           // 0x1B6A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F37[0x5];                                     // 0x1B6B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJsonDataCtrl*                          JsonData;                                          // 0x1B70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 JsonFileName;                                      // 0x1B78(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	E_ROM_TYPE                                    ROMTYPE;                                           // 0x1B88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F38[0x3];                                     // 0x1B89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugPlayerTraceCounter               TraceCounter;                                      // 0x1B8C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                M_DevilAssetTable;                                 // 0x1B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DaathIntensity_Eff;                                // 0x1BA0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_LightParam                         LightParam;                                        // 0x1BB0(0x0318)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDaathTypeList                                NowDaathLightType;                                 // 0x1EC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F39[0x7];                                     // 0x1EC9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 KeyFreeEvent;                                      // 0x1ED0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDaathTypeList                                TempDaathLightType;                                // 0x1ED8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F3A[0x3];                                     // 0x1ED9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DaathLightHIt;                                     // 0x1EDC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 M_MapUICommon;                                     // 0x1EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEventView_Simple;                                // 0x1EE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EDaathTypeList                                PrevDaathLightType;                                // 0x1EE9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F3B[0x6];                                     // 0x1EEA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDlcTableData*                          DlcTable;                                          // 0x1EF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMapBEffectParamType                          NowMapBEffectParamType;                            // 0x1EF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMapBEffectParamType                          PrevMapBEffectParamType;                           // 0x1EF9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F3C[0x6];                                     // 0x1EFA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPrimaryAssetId>                PreloadLevelList;                                  // 0x1F00(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AEventBase*                             EventBase;                                         // 0x1F10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsScreenShot;                                      // 0x1F18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F3D[0x7];                                     // 0x1F19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 EncountScene;                                      // 0x1F20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ProjectGameInstance(int32 EntryPoint);
	void BPI_ClearPreloadLevelList();
	void BPI_SetPreloadLevelList(const TArray<struct FPrimaryAssetId>& Param_PreloadLevelList);
	void BPI_SetMapUICtrl(class AActor* MapUICommon);
	void BI_SetMapChange(bool Param_IsMapChange, int32 WarpPoint, int32 FromEvent, int32 OtherMapReturn);
	void JsonCounterAdd(int32 EncountAdd, int32 MagatukaNum);
	void BI_SetDevilAssetTable(class UObject* CharaTable);
	void SetJsonFile(const class FString& Json);
	void SetJsonData(class UJsonDataCtrl* Json);
	void StartDebugGameTrace(bool IsEnable);
	void OnDestroyed______0(class AActor* DestroyedActor);
	void BPI_SetGamePlayer(const TArray<class APawn*>& In);
	void GameFirstInitEvent();
	void SetLoadLevelGame(bool Enable);
	void SetMapStartLoadFlag(bool Enable);
