#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RigRailData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// UserDefinedStruct RigRailData.RigRailData
// 0x0090 (0x0090 - 0x0000)
struct FRigRailData final
{
public:
	class FString                                 Memo_49_3F016A3B43967E8CF1E7BCA38D8C6ABD;          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FTransform                             RailOffsetTransform_27_A04162614E2DBB288D3F8E9F42052C94; // 0x0010(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class FName                                   RailOffsetOriginSocket_52_312C8FBE48BDE0272A33B1A7C6BDB10E; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCustomSplinePoint>             SplinePoint_46_29C19D53491934C479A57E91758C943E;   // 0x0048(0x0010)(Edit, BlueprintVisible)
	struct FRigRailPlayInfo                       PlayInfo_45_03BD7B2C4252D44C591FAFB10B82E387;      // 0x0058(0x0034)(Edit, BlueprintVisible, NoDestructor)
};
static_assert(alignof(FRigRailData) == 0x000010, "Wrong alignment on FRigRailData");
static_assert(sizeof(FRigRailData) == 0x000090, "Wrong size on FRigRailData");
static_assert(offsetof(FRigRailData, Memo_49_3F016A3B43967E8CF1E7BCA38D8C6ABD) == 0x000000, "Member 'FRigRailData::Memo_49_3F016A3B43967E8CF1E7BCA38D8C6ABD' has a wrong offset!");
static_assert(offsetof(FRigRailData, RailOffsetTransform_27_A04162614E2DBB288D3F8E9F42052C94) == 0x000010, "Member 'FRigRailData::RailOffsetTransform_27_A04162614E2DBB288D3F8E9F42052C94' has a wrong offset!");
static_assert(offsetof(FRigRailData, RailOffsetOriginSocket_52_312C8FBE48BDE0272A33B1A7C6BDB10E) == 0x000040, "Member 'FRigRailData::RailOffsetOriginSocket_52_312C8FBE48BDE0272A33B1A7C6BDB10E' has a wrong offset!");
static_assert(offsetof(FRigRailData, SplinePoint_46_29C19D53491934C479A57E91758C943E) == 0x000048, "Member 'FRigRailData::SplinePoint_46_29C19D53491934C479A57E91758C943E' has a wrong offset!");
static_assert(offsetof(FRigRailData, PlayInfo_45_03BD7B2C4252D44C591FAFB10B82E387) == 0x000058, "Member 'FRigRailData::PlayInfo_45_03BD7B2C4252D44C591FAFB10B82E387' has a wrong offset!");

}

