#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RyuketsuFastL_ST

#include "Basic.hpp"

#include "RyuketsuFastM_ST_structs.hpp"


namespace SDK
{

// UserDefinedStruct RyuketsuFastL_ST.RyuketsuFastL_ST
// 0x0040 (0x0040 - 0x0000)
struct FRyuketsuFastL_ST final
{
public:
	class FName                                   Label_2_EC2F015C435A04AC99A27BAF50BB1FA7;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text_9_1C4B1C54408237F5F97EAEA467BE5DF7;           // 0x0008(0x0018)(Edit, BlueprintVisible)
	TArray<struct FRyuketsuFastM_ST>              MidList_6_8F8F9C1A47FE4207E6F7F39A3CB3ED1A;        // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         MapID_12_AA7858C046AAE6472F446DA2737D522C;         // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Top_AreaID_15_8BEEF36A431B29AD245CEB9CF7A2E0A7;    // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Top_MinimapAreaID_19_8139748744346BFC0F50C3B94C6C4BAD; // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Top_RyuketsuID_16_CD204B4C406CB2183486E09408C65DA5; // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FRyuketsuFastL_ST) == 0x000008, "Wrong alignment on FRyuketsuFastL_ST");
static_assert(sizeof(FRyuketsuFastL_ST) == 0x000040, "Wrong size on FRyuketsuFastL_ST");
static_assert(offsetof(FRyuketsuFastL_ST, Label_2_EC2F015C435A04AC99A27BAF50BB1FA7) == 0x000000, "Member 'FRyuketsuFastL_ST::Label_2_EC2F015C435A04AC99A27BAF50BB1FA7' has a wrong offset!");
static_assert(offsetof(FRyuketsuFastL_ST, Text_9_1C4B1C54408237F5F97EAEA467BE5DF7) == 0x000008, "Member 'FRyuketsuFastL_ST::Text_9_1C4B1C54408237F5F97EAEA467BE5DF7' has a wrong offset!");
static_assert(offsetof(FRyuketsuFastL_ST, MidList_6_8F8F9C1A47FE4207E6F7F39A3CB3ED1A) == 0x000020, "Member 'FRyuketsuFastL_ST::MidList_6_8F8F9C1A47FE4207E6F7F39A3CB3ED1A' has a wrong offset!");
static_assert(offsetof(FRyuketsuFastL_ST, MapID_12_AA7858C046AAE6472F446DA2737D522C) == 0x000030, "Member 'FRyuketsuFastL_ST::MapID_12_AA7858C046AAE6472F446DA2737D522C' has a wrong offset!");
static_assert(offsetof(FRyuketsuFastL_ST, Top_AreaID_15_8BEEF36A431B29AD245CEB9CF7A2E0A7) == 0x000034, "Member 'FRyuketsuFastL_ST::Top_AreaID_15_8BEEF36A431B29AD245CEB9CF7A2E0A7' has a wrong offset!");
static_assert(offsetof(FRyuketsuFastL_ST, Top_MinimapAreaID_19_8139748744346BFC0F50C3B94C6C4BAD) == 0x000038, "Member 'FRyuketsuFastL_ST::Top_MinimapAreaID_19_8139748744346BFC0F50C3B94C6C4BAD' has a wrong offset!");
static_assert(offsetof(FRyuketsuFastL_ST, Top_RyuketsuID_16_CD204B4C406CB2183486E09408C65DA5) == 0x00003C, "Member 'FRyuketsuFastL_ST::Top_RyuketsuID_16_CD204B4C406CB2183486E09408C65DA5' has a wrong offset!");

}

