#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SplineCompPointInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct SplineCompPointInfo.SplineCompPointInfo
// 0x0034 (0x0034 - 0x0000)
struct FSplineCompPointInfo final
{
public:
	struct FVector                                Location_6_F0395CB3471796DA6152C8804F24D9B9;       // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotate_8_B14F516640FD2AC4CF1920BEE6C4DC89;         // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                ArriveTangent_9_1AAB8823486243B309E47DB72A917192;  // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LeaveTangent_10_010851F5480C9F05D7039C93484E0026;  // 0x0024(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplinePointType                              PointType_12_25022C0C4429671EFAC903BA7EBBF13E;     // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSplineCompPointInfo) == 0x000004, "Wrong alignment on FSplineCompPointInfo");
static_assert(sizeof(FSplineCompPointInfo) == 0x000034, "Wrong size on FSplineCompPointInfo");
static_assert(offsetof(FSplineCompPointInfo, Location_6_F0395CB3471796DA6152C8804F24D9B9) == 0x000000, "Member 'FSplineCompPointInfo::Location_6_F0395CB3471796DA6152C8804F24D9B9' has a wrong offset!");
static_assert(offsetof(FSplineCompPointInfo, Rotate_8_B14F516640FD2AC4CF1920BEE6C4DC89) == 0x00000C, "Member 'FSplineCompPointInfo::Rotate_8_B14F516640FD2AC4CF1920BEE6C4DC89' has a wrong offset!");
static_assert(offsetof(FSplineCompPointInfo, ArriveTangent_9_1AAB8823486243B309E47DB72A917192) == 0x000018, "Member 'FSplineCompPointInfo::ArriveTangent_9_1AAB8823486243B309E47DB72A917192' has a wrong offset!");
static_assert(offsetof(FSplineCompPointInfo, LeaveTangent_10_010851F5480C9F05D7039C93484E0026) == 0x000024, "Member 'FSplineCompPointInfo::LeaveTangent_10_010851F5480C9F05D7039C93484E0026' has a wrong offset!");
static_assert(offsetof(FSplineCompPointInfo, PointType_12_25022C0C4429671EFAC903BA7EBBF13E) == 0x000030, "Member 'FSplineCompPointInfo::PointType_12_25022C0C4429671EFAC903BA7EBBF13E' has a wrong offset!");

}

