#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_AmuletTutorialMsgInfo

#include "Basic.hpp"

#include "E_AmuletTutorial_MsgType_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_AmuletTutorialMsgInfo.ST_AmuletTutorialMsgInfo
// 0x001C (0x001C - 0x0000)
struct FST_AmuletTutorialMsgInfo final
{
public:
	E_AmuletTutorial_MsgType                      AmuletType_15_3C0FA4114BC9AD78CB952FBB5781AC36;    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A9[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ItemID_18_96BC327B47AA5E7C886304B2EBF0B1F2;        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MsgLabel_Title_8_AC2389134F41B62BC98662B6D80A57C9; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MsgLabel_MainText_9_E41006F2489D3AD41680B0BEF7B0D3A5; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsReifu_20_2126062749ADD47536D8A19F0A8C415A;       // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FST_AmuletTutorialMsgInfo) == 0x000004, "Wrong alignment on FST_AmuletTutorialMsgInfo");
static_assert(sizeof(FST_AmuletTutorialMsgInfo) == 0x00001C, "Wrong size on FST_AmuletTutorialMsgInfo");
static_assert(offsetof(FST_AmuletTutorialMsgInfo, AmuletType_15_3C0FA4114BC9AD78CB952FBB5781AC36) == 0x000000, "Member 'FST_AmuletTutorialMsgInfo::AmuletType_15_3C0FA4114BC9AD78CB952FBB5781AC36' has a wrong offset!");
static_assert(offsetof(FST_AmuletTutorialMsgInfo, ItemID_18_96BC327B47AA5E7C886304B2EBF0B1F2) == 0x000004, "Member 'FST_AmuletTutorialMsgInfo::ItemID_18_96BC327B47AA5E7C886304B2EBF0B1F2' has a wrong offset!");
static_assert(offsetof(FST_AmuletTutorialMsgInfo, MsgLabel_Title_8_AC2389134F41B62BC98662B6D80A57C9) == 0x000008, "Member 'FST_AmuletTutorialMsgInfo::MsgLabel_Title_8_AC2389134F41B62BC98662B6D80A57C9' has a wrong offset!");
static_assert(offsetof(FST_AmuletTutorialMsgInfo, MsgLabel_MainText_9_E41006F2489D3AD41680B0BEF7B0D3A5) == 0x000010, "Member 'FST_AmuletTutorialMsgInfo::MsgLabel_MainText_9_E41006F2489D3AD41680B0BEF7B0D3A5' has a wrong offset!");
static_assert(offsetof(FST_AmuletTutorialMsgInfo, IsReifu_20_2126062749ADD47536D8A19F0A8C415A) == 0x000018, "Member 'FST_AmuletTutorialMsgInfo::IsReifu_20_2126062749ADD47536D8A19F0A8C415A' has a wrong offset!");

}

