#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_CampQuest_SlotInfo

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_CampQuest_SlotInfo.ST_CampQuest_SlotInfo
// 0x0008 (0x0008 - 0x0000)
struct FST_CampQuest_SlotInfo final
{
public:
	int32                                         MsgID_24_1AEB67E44F07D7315E9ABF9B7DE77A22;         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MISSION_TYPE                                QuestType_40_94AA8BD2426C3516078ECCAF38D6A30E;     // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CAMP_QUEST_PROGRESS_STATE                   QuestProgress_41_3F5083C64CA9C858608C838B75013287; // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNewIcon_34_4E5B92FE4AAE29CE4AF643A40AE94EDC;     // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsUpdateIcon_36_9096815A4927C6FD88DE09991D51B76F;  // 0x0007(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FST_CampQuest_SlotInfo) == 0x000004, "Wrong alignment on FST_CampQuest_SlotInfo");
static_assert(sizeof(FST_CampQuest_SlotInfo) == 0x000008, "Wrong size on FST_CampQuest_SlotInfo");
static_assert(offsetof(FST_CampQuest_SlotInfo, MsgID_24_1AEB67E44F07D7315E9ABF9B7DE77A22) == 0x000000, "Member 'FST_CampQuest_SlotInfo::MsgID_24_1AEB67E44F07D7315E9ABF9B7DE77A22' has a wrong offset!");
static_assert(offsetof(FST_CampQuest_SlotInfo, QuestType_40_94AA8BD2426C3516078ECCAF38D6A30E) == 0x000004, "Member 'FST_CampQuest_SlotInfo::QuestType_40_94AA8BD2426C3516078ECCAF38D6A30E' has a wrong offset!");
static_assert(offsetof(FST_CampQuest_SlotInfo, QuestProgress_41_3F5083C64CA9C858608C838B75013287) == 0x000005, "Member 'FST_CampQuest_SlotInfo::QuestProgress_41_3F5083C64CA9C858608C838B75013287' has a wrong offset!");
static_assert(offsetof(FST_CampQuest_SlotInfo, IsNewIcon_34_4E5B92FE4AAE29CE4AF643A40AE94EDC) == 0x000006, "Member 'FST_CampQuest_SlotInfo::IsNewIcon_34_4E5B92FE4AAE29CE4AF643A40AE94EDC' has a wrong offset!");
static_assert(offsetof(FST_CampQuest_SlotInfo, IsUpdateIcon_36_9096815A4927C6FD88DE09991D51B76F) == 0x000007, "Member 'FST_CampQuest_SlotInfo::IsUpdateIcon_36_9096815A4927C6FD88DE09991D51B76F' has a wrong offset!");

}

