#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_DevilPostData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ST_DevilPostData.ST_DevilPostData
// 0x0020 (0x0020 - 0x0000)
struct FST_DevilPostData final
{
public:
	int32                                         ValidArea_2_89B2013A46C3311009788BA973357A3F;      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         VerticalMax_29_ACFD4C4748E7698D01FF0783CC68CDF0;   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HorizontalMax_30_9FA0489E4ADB836F43B808960BDB899B; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TallMax_31_B39901AE436A2DE321604FA4BE134B06;       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 PostChip_22_42620B8B4A967D3AE1110B808990335E;      // 0x0010(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FST_DevilPostData) == 0x000008, "Wrong alignment on FST_DevilPostData");
static_assert(sizeof(FST_DevilPostData) == 0x000020, "Wrong size on FST_DevilPostData");
static_assert(offsetof(FST_DevilPostData, ValidArea_2_89B2013A46C3311009788BA973357A3F) == 0x000000, "Member 'FST_DevilPostData::ValidArea_2_89B2013A46C3311009788BA973357A3F' has a wrong offset!");
static_assert(offsetof(FST_DevilPostData, VerticalMax_29_ACFD4C4748E7698D01FF0783CC68CDF0) == 0x000004, "Member 'FST_DevilPostData::VerticalMax_29_ACFD4C4748E7698D01FF0783CC68CDF0' has a wrong offset!");
static_assert(offsetof(FST_DevilPostData, HorizontalMax_30_9FA0489E4ADB836F43B808960BDB899B) == 0x000008, "Member 'FST_DevilPostData::HorizontalMax_30_9FA0489E4ADB836F43B808960BDB899B' has a wrong offset!");
static_assert(offsetof(FST_DevilPostData, TallMax_31_B39901AE436A2DE321604FA4BE134B06) == 0x00000C, "Member 'FST_DevilPostData::TallMax_31_B39901AE436A2DE321604FA4BE134B06' has a wrong offset!");
static_assert(offsetof(FST_DevilPostData, PostChip_22_42620B8B4A967D3AE1110B808990335E) == 0x000010, "Member 'FST_DevilPostData::PostChip_22_42620B8B4A967D3AE1110B808990335E' has a wrong offset!");

}

