#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_MapB_EffectParam

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_MapB_EffectParam.ST_MapB_EffectParam
// 0x0074 (0x0074 - 0x0000)
struct FST_MapB_EffectParam final
{
public:
	struct FLinearColor                           EFF_Color_148_2C46BB9942282F75EA236EB06A490E08;    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EFF_ShadowColor_149_B50D765145043BCC77D492BD65B50583; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EFF_Water_Color_259_A4D34D19423D39449F2A70A54E0EC37F; // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EFF_Water_ShadowColor_260_7C27D20742809A653D0AF6A3B8B0111F; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EFF_Foliage_Color_265_8B473BE34698FE4C5783B5B79338BBFE; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EFF_Foliage_ShadowColor_266_409690B6409DBBB58B6173961BD632AD; // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EFF_Dust_Color_269_4A2917184B7A284E8A155893BEA0EFF5; // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableShadow_274_690E129A4A2A31BBEDC32FB25B8CDF4C; // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FST_MapB_EffectParam) == 0x000004, "Wrong alignment on FST_MapB_EffectParam");
static_assert(sizeof(FST_MapB_EffectParam) == 0x000074, "Wrong size on FST_MapB_EffectParam");
static_assert(offsetof(FST_MapB_EffectParam, EFF_Color_148_2C46BB9942282F75EA236EB06A490E08) == 0x000000, "Member 'FST_MapB_EffectParam::EFF_Color_148_2C46BB9942282F75EA236EB06A490E08' has a wrong offset!");
static_assert(offsetof(FST_MapB_EffectParam, EFF_ShadowColor_149_B50D765145043BCC77D492BD65B50583) == 0x000010, "Member 'FST_MapB_EffectParam::EFF_ShadowColor_149_B50D765145043BCC77D492BD65B50583' has a wrong offset!");
static_assert(offsetof(FST_MapB_EffectParam, EFF_Water_Color_259_A4D34D19423D39449F2A70A54E0EC37F) == 0x000020, "Member 'FST_MapB_EffectParam::EFF_Water_Color_259_A4D34D19423D39449F2A70A54E0EC37F' has a wrong offset!");
static_assert(offsetof(FST_MapB_EffectParam, EFF_Water_ShadowColor_260_7C27D20742809A653D0AF6A3B8B0111F) == 0x000030, "Member 'FST_MapB_EffectParam::EFF_Water_ShadowColor_260_7C27D20742809A653D0AF6A3B8B0111F' has a wrong offset!");
static_assert(offsetof(FST_MapB_EffectParam, EFF_Foliage_Color_265_8B473BE34698FE4C5783B5B79338BBFE) == 0x000040, "Member 'FST_MapB_EffectParam::EFF_Foliage_Color_265_8B473BE34698FE4C5783B5B79338BBFE' has a wrong offset!");
static_assert(offsetof(FST_MapB_EffectParam, EFF_Foliage_ShadowColor_266_409690B6409DBBB58B6173961BD632AD) == 0x000050, "Member 'FST_MapB_EffectParam::EFF_Foliage_ShadowColor_266_409690B6409DBBB58B6173961BD632AD' has a wrong offset!");
static_assert(offsetof(FST_MapB_EffectParam, EFF_Dust_Color_269_4A2917184B7A284E8A155893BEA0EFF5) == 0x000060, "Member 'FST_MapB_EffectParam::EFF_Dust_Color_269_4A2917184B7A284E8A155893BEA0EFF5' has a wrong offset!");
static_assert(offsetof(FST_MapB_EffectParam, EnableShadow_274_690E129A4A2A31BBEDC32FB25B8CDF4C) == 0x000070, "Member 'FST_MapB_EffectParam::EnableShadow_274_690E129A4A2A31BBEDC32FB25B8CDF4C' has a wrong offset!");

}

