#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_StCameraSetUp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_StCameraSetUp.ST_StCameraSetUp
// 0x0030 (0x0030 - 0x0000)
struct FST_StCameraSetUp final
{
public:
	int32                                         DevilID_6_FAE519B140DA0756EABB94B12A40963D;        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Pos_20_8B57EFBC4128EF74F26243977FA0A16E;           // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rot_8_D44A797D40EB11429886489DFEF39310;            // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Spot_intensity_22_23AC367F40CCE7A11E3345B4C091C82E; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Spot_color_15_903A4B8B4EBC7506A8D16790DAF82298;    // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_StCameraSetUp) == 0x000004, "Wrong alignment on FST_StCameraSetUp");
static_assert(sizeof(FST_StCameraSetUp) == 0x000030, "Wrong size on FST_StCameraSetUp");
static_assert(offsetof(FST_StCameraSetUp, DevilID_6_FAE519B140DA0756EABB94B12A40963D) == 0x000000, "Member 'FST_StCameraSetUp::DevilID_6_FAE519B140DA0756EABB94B12A40963D' has a wrong offset!");
static_assert(offsetof(FST_StCameraSetUp, Pos_20_8B57EFBC4128EF74F26243977FA0A16E) == 0x000004, "Member 'FST_StCameraSetUp::Pos_20_8B57EFBC4128EF74F26243977FA0A16E' has a wrong offset!");
static_assert(offsetof(FST_StCameraSetUp, Rot_8_D44A797D40EB11429886489DFEF39310) == 0x000010, "Member 'FST_StCameraSetUp::Rot_8_D44A797D40EB11429886489DFEF39310' has a wrong offset!");
static_assert(offsetof(FST_StCameraSetUp, Spot_intensity_22_23AC367F40CCE7A11E3345B4C091C82E) == 0x00001C, "Member 'FST_StCameraSetUp::Spot_intensity_22_23AC367F40CCE7A11E3345B4C091C82E' has a wrong offset!");
static_assert(offsetof(FST_StCameraSetUp, Spot_color_15_903A4B8B4EBC7506A8D16790DAF82298) == 0x000020, "Member 'FST_StCameraSetUp::Spot_color_15_903A4B8B4EBC7506A8D16790DAF82298' has a wrong offset!");

}

