#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_StBattleCameraSetUp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_StBattleCameraSetUp.ST_StBattleCameraSetUp
// 0x002C (0x002C - 0x0000)
struct FST_StBattleCameraSetUp final
{
public:
	int32                                         DevilId_9_8C0340A64A890D9C2F1AAFBB1B4A9E38;        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CAM_Talk_2_7F63F6B94ADF92264876418CFE5FB4C8;       // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EyeOffset_4_7730D0344689F4A22CD70795324E94DD;      // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LookOffset_6_A86A184B49612156E02A419BF78C2D57;     // 0x001C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraScale_12_0BAFB56A4B776DC086D8DAA38E50A625;   // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_StBattleCameraSetUp) == 0x000004, "Wrong alignment on FST_StBattleCameraSetUp");
static_assert(sizeof(FST_StBattleCameraSetUp) == 0x00002C, "Wrong size on FST_StBattleCameraSetUp");
static_assert(offsetof(FST_StBattleCameraSetUp, DevilId_9_8C0340A64A890D9C2F1AAFBB1B4A9E38) == 0x000000, "Member 'FST_StBattleCameraSetUp::DevilId_9_8C0340A64A890D9C2F1AAFBB1B4A9E38' has a wrong offset!");
static_assert(offsetof(FST_StBattleCameraSetUp, CAM_Talk_2_7F63F6B94ADF92264876418CFE5FB4C8) == 0x000004, "Member 'FST_StBattleCameraSetUp::CAM_Talk_2_7F63F6B94ADF92264876418CFE5FB4C8' has a wrong offset!");
static_assert(offsetof(FST_StBattleCameraSetUp, EyeOffset_4_7730D0344689F4A22CD70795324E94DD) == 0x000010, "Member 'FST_StBattleCameraSetUp::EyeOffset_4_7730D0344689F4A22CD70795324E94DD' has a wrong offset!");
static_assert(offsetof(FST_StBattleCameraSetUp, LookOffset_6_A86A184B49612156E02A419BF78C2D57) == 0x00001C, "Member 'FST_StBattleCameraSetUp::LookOffset_6_A86A184B49612156E02A419BF78C2D57' has a wrong offset!");
static_assert(offsetof(FST_StBattleCameraSetUp, CameraScale_12_0BAFB56A4B776DC086D8DAA38E50A625) == 0x000028, "Member 'FST_StBattleCameraSetUp::CameraScale_12_0BAFB56A4B776DC086D8DAA38E50A625' has a wrong offset!");

}

