#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_TalkCameraOffset

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ST_TalkCameraOffset.ST_TalkCameraOffset
// 0x0028 (0x0028 - 0x0000)
struct FST_TalkCameraOffset final
{
public:
	int32                                         DevilId_9_8C0340A64A890D9C2F1AAFBB1B4A9E38;        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EyeOffset_X_18_7730D0344689F4A22CD70795324E94DD;   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EyeOffset_Y_20_A86A184B49612156E02A419BF78C2D57;   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EyeOffset_Z_21_620A3F37476072D48B6531B4FF332616;   // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LookOffset_X_22_F20ABEE2459802CBC37C9F884D7702CC;  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LookOffset_Y_23_DD3F46574885E6F8CB0F849B06DBFB91;  // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LookOffset_Z_24_587AD18940879791E8A3919C4CAD1B23;  // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DyingOffset_X_34_58265FA5495C405C0284AFA464D9EDF3; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DyingOffset_Y_35_24852BA2491BB0AE2B8B2CB860C5F555; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DyingOffset_Z_36_267406C348C981BAED49D3894691FF95; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_TalkCameraOffset) == 0x000004, "Wrong alignment on FST_TalkCameraOffset");
static_assert(sizeof(FST_TalkCameraOffset) == 0x000028, "Wrong size on FST_TalkCameraOffset");
static_assert(offsetof(FST_TalkCameraOffset, DevilId_9_8C0340A64A890D9C2F1AAFBB1B4A9E38) == 0x000000, "Member 'FST_TalkCameraOffset::DevilId_9_8C0340A64A890D9C2F1AAFBB1B4A9E38' has a wrong offset!");
static_assert(offsetof(FST_TalkCameraOffset, EyeOffset_X_18_7730D0344689F4A22CD70795324E94DD) == 0x000004, "Member 'FST_TalkCameraOffset::EyeOffset_X_18_7730D0344689F4A22CD70795324E94DD' has a wrong offset!");
static_assert(offsetof(FST_TalkCameraOffset, EyeOffset_Y_20_A86A184B49612156E02A419BF78C2D57) == 0x000008, "Member 'FST_TalkCameraOffset::EyeOffset_Y_20_A86A184B49612156E02A419BF78C2D57' has a wrong offset!");
static_assert(offsetof(FST_TalkCameraOffset, EyeOffset_Z_21_620A3F37476072D48B6531B4FF332616) == 0x00000C, "Member 'FST_TalkCameraOffset::EyeOffset_Z_21_620A3F37476072D48B6531B4FF332616' has a wrong offset!");
static_assert(offsetof(FST_TalkCameraOffset, LookOffset_X_22_F20ABEE2459802CBC37C9F884D7702CC) == 0x000010, "Member 'FST_TalkCameraOffset::LookOffset_X_22_F20ABEE2459802CBC37C9F884D7702CC' has a wrong offset!");
static_assert(offsetof(FST_TalkCameraOffset, LookOffset_Y_23_DD3F46574885E6F8CB0F849B06DBFB91) == 0x000014, "Member 'FST_TalkCameraOffset::LookOffset_Y_23_DD3F46574885E6F8CB0F849B06DBFB91' has a wrong offset!");
static_assert(offsetof(FST_TalkCameraOffset, LookOffset_Z_24_587AD18940879791E8A3919C4CAD1B23) == 0x000018, "Member 'FST_TalkCameraOffset::LookOffset_Z_24_587AD18940879791E8A3919C4CAD1B23' has a wrong offset!");
static_assert(offsetof(FST_TalkCameraOffset, DyingOffset_X_34_58265FA5495C405C0284AFA464D9EDF3) == 0x00001C, "Member 'FST_TalkCameraOffset::DyingOffset_X_34_58265FA5495C405C0284AFA464D9EDF3' has a wrong offset!");
static_assert(offsetof(FST_TalkCameraOffset, DyingOffset_Y_35_24852BA2491BB0AE2B8B2CB860C5F555) == 0x000020, "Member 'FST_TalkCameraOffset::DyingOffset_Y_35_24852BA2491BB0AE2B8B2CB860C5F555' has a wrong offset!");
static_assert(offsetof(FST_TalkCameraOffset, DyingOffset_Z_36_267406C348C981BAED49D3894691FF95) == 0x000024, "Member 'FST_TalkCameraOffset::DyingOffset_Z_36_267406C348C981BAED49D3894691FF95' has a wrong offset!");

}

