#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_ViewList

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ST_ViewList.ST_ViewList
// 0x0028 (0x0028 - 0x0000)
struct FST_ViewList final
{
public:
	class FString                                 Profaile_8_A59615FE4580257ACC2B129490BD5ED4;       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Name_7_1D2A92DD4D3D17D7807F878421AA5F7D;           // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                Obj_9_E13C82FD42B58BA54C5A27AC4B0A5379;            // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_ViewList) == 0x000008, "Wrong alignment on FST_ViewList");
static_assert(sizeof(FST_ViewList) == 0x000028, "Wrong size on FST_ViewList");
static_assert(offsetof(FST_ViewList, Profaile_8_A59615FE4580257ACC2B129490BD5ED4) == 0x000000, "Member 'FST_ViewList::Profaile_8_A59615FE4580257ACC2B129490BD5ED4' has a wrong offset!");
static_assert(offsetof(FST_ViewList, Name_7_1D2A92DD4D3D17D7807F878421AA5F7D) == 0x000010, "Member 'FST_ViewList::Name_7_1D2A92DD4D3D17D7807F878421AA5F7D' has a wrong offset!");
static_assert(offsetof(FST_ViewList, Obj_9_E13C82FD42B58BA54C5A27AC4B0A5379) == 0x000020, "Member 'FST_ViewList::Obj_9_E13C82FD42B58BA54C5A27AC4B0A5379' has a wrong offset!");

}

