#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SymbolActPattern

#include "Basic.hpp"

#include "E_Symbol_ActPattern_structs.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// UserDefinedStruct SymbolActPattern.SymbolActPattern
// 0x0014 (0x0014 - 0x0000)
struct FSymbolActPattern final
{
public:
	E_Symbol_ActPattern                           ActPattern_8_20261F4D40405425EC4D0199F424B5DB;     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_640B[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NextSec_15_4A68E5C0492C7E955FD1E9BAD4444C0E;       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NextSecRandom_18_0DF23DB941A9BFEAB82B32A3A6DA2365; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value_7_A49C42E9410B9E86FDA084A0BE7A6077;          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CHARA_MOTION_ID                             Motion_14_3BAF9ED54752D9E8F296BAA1DE9E3410;        // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSymbolActPattern) == 0x000004, "Wrong alignment on FSymbolActPattern");
static_assert(sizeof(FSymbolActPattern) == 0x000014, "Wrong size on FSymbolActPattern");
static_assert(offsetof(FSymbolActPattern, ActPattern_8_20261F4D40405425EC4D0199F424B5DB) == 0x000000, "Member 'FSymbolActPattern::ActPattern_8_20261F4D40405425EC4D0199F424B5DB' has a wrong offset!");
static_assert(offsetof(FSymbolActPattern, NextSec_15_4A68E5C0492C7E955FD1E9BAD4444C0E) == 0x000004, "Member 'FSymbolActPattern::NextSec_15_4A68E5C0492C7E955FD1E9BAD4444C0E' has a wrong offset!");
static_assert(offsetof(FSymbolActPattern, NextSecRandom_18_0DF23DB941A9BFEAB82B32A3A6DA2365) == 0x000008, "Member 'FSymbolActPattern::NextSecRandom_18_0DF23DB941A9BFEAB82B32A3A6DA2365' has a wrong offset!");
static_assert(offsetof(FSymbolActPattern, Value_7_A49C42E9410B9E86FDA084A0BE7A6077) == 0x00000C, "Member 'FSymbolActPattern::Value_7_A49C42E9410B9E86FDA084A0BE7A6077' has a wrong offset!");
static_assert(offsetof(FSymbolActPattern, Motion_14_3BAF9ED54752D9E8F296BAA1DE9E3410) == 0x000010, "Member 'FSymbolActPattern::Motion_14_3BAF9ED54752D9E8F296BAA1DE9E3410' has a wrong offset!");

}

