#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TalkMythAssetInfo

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct TalkMythAssetInfo.TalkMythAssetInfo
// 0x0058 (0x0058 - 0x0000)
struct FTalkMythAssetInfo final
{
public:
	int32                                         MythId_2_73C5D41748FE07BE216A60A54BCD2AAA;         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UScriptMessageAsset>     ScrMsg_7_16795F5E4A4BCF02E85605BE413EF1B2;         // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 ProcessTable_12_507F597048A5B110A8EE2090259DD6BC;  // 0x0030(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FTalkMythAssetInfo) == 0x000008, "Wrong alignment on FTalkMythAssetInfo");
static_assert(sizeof(FTalkMythAssetInfo) == 0x000058, "Wrong size on FTalkMythAssetInfo");
static_assert(offsetof(FTalkMythAssetInfo, MythId_2_73C5D41748FE07BE216A60A54BCD2AAA) == 0x000000, "Member 'FTalkMythAssetInfo::MythId_2_73C5D41748FE07BE216A60A54BCD2AAA' has a wrong offset!");
static_assert(offsetof(FTalkMythAssetInfo, ScrMsg_7_16795F5E4A4BCF02E85605BE413EF1B2) == 0x000008, "Member 'FTalkMythAssetInfo::ScrMsg_7_16795F5E4A4BCF02E85605BE413EF1B2' has a wrong offset!");
static_assert(offsetof(FTalkMythAssetInfo, ProcessTable_12_507F597048A5B110A8EE2090259DD6BC) == 0x000030, "Member 'FTalkMythAssetInfo::ProcessTable_12_507F597048A5B110A8EE2090259DD6BC' has a wrong offset!");

}

