#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TalkAssetInfo

#include "Basic.hpp"

#include "Project_structs.hpp"


namespace SDK
{

// UserDefinedStruct TalkAssetInfo.TalkAssetInfo
// 0x0058 (0x0058 - 0x0000)
struct FTalkAssetInfo final
{
public:
	TSoftObjectPtr<class UObject>                 ToneTable_4_17BB439D49E320B28784C183C9AB5D2C;      // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UScriptMessageAsset>     ScrMsg_5_32ABEE734F77444F8D51CDB36547EBFF;         // 0x0028(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	E_TALK_TONE_TYPE                              ToneType_8_1847A0554316FD7108A138A09FB470CF;       // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FTalkAssetInfo) == 0x000008, "Wrong alignment on FTalkAssetInfo");
static_assert(sizeof(FTalkAssetInfo) == 0x000058, "Wrong size on FTalkAssetInfo");
static_assert(offsetof(FTalkAssetInfo, ToneTable_4_17BB439D49E320B28784C183C9AB5D2C) == 0x000000, "Member 'FTalkAssetInfo::ToneTable_4_17BB439D49E320B28784C183C9AB5D2C' has a wrong offset!");
static_assert(offsetof(FTalkAssetInfo, ScrMsg_5_32ABEE734F77444F8D51CDB36547EBFF) == 0x000028, "Member 'FTalkAssetInfo::ScrMsg_5_32ABEE734F77444F8D51CDB36547EBFF' has a wrong offset!");
static_assert(offsetof(FTalkAssetInfo, ToneType_8_1847A0554316FD7108A138A09FB470CF) == 0x000050, "Member 'FTalkAssetInfo::ToneType_8_1847A0554316FD7108A138A09FB470CF' has a wrong offset!");

}

