#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TokyoMapPlayerCameraManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TokyoMapPlayerCameraManager.TokyoMapPlayerCameraManager_C
// 0x0040 (0x2850 - 0x2810)
class ATokyoMapPlayerCameraManager_C final : public APlayerCameraManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2810(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FRotator                               DesiredRotation;                                   // 0x2818(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CurrentRotation;                                   // 0x2824(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         DesiredDistance;                                   // 0x2830(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentDistance;                                   // 0x2834(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DesiredFOV;                                        // 0x2838(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentFOV;                                        // 0x283C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultDistance;                                   // 0x2840(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TokyoMapPlayerCameraManager(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void AddYawInput(float Val);
	void AddPitchInput(float Val);
	void GetForwardVector(struct FVector* Return_Value);
	struct FVector GetRightVector();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TokyoMapPlayerCameraManager_C">();
	}
	static class ATokyoMapPlayerCameraManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATokyoMapPlayerCameraManager_C>();
	}
};
static_assert(alignof(ATokyoMapPlayerCameraManager_C) == 0x000010, "Wrong alignment on ATokyoMapPlayerCameraManager_C");
static_assert(sizeof(ATokyoMapPlayerCameraManager_C) == 0x002850, "Wrong size on ATokyoMapPlayerCameraManager_C");
static_assert(offsetof(ATokyoMapPlayerCameraManager_C, UberGraphFrame) == 0x002810, "Member 'ATokyoMapPlayerCameraManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATokyoMapPlayerCameraManager_C, DesiredRotation) == 0x002818, "Member 'ATokyoMapPlayerCameraManager_C::DesiredRotation' has a wrong offset!");
static_assert(offsetof(ATokyoMapPlayerCameraManager_C, CurrentRotation) == 0x002824, "Member 'ATokyoMapPlayerCameraManager_C::CurrentRotation' has a wrong offset!");
static_assert(offsetof(ATokyoMapPlayerCameraManager_C, DesiredDistance) == 0x002830, "Member 'ATokyoMapPlayerCameraManager_C::DesiredDistance' has a wrong offset!");
static_assert(offsetof(ATokyoMapPlayerCameraManager_C, CurrentDistance) == 0x002834, "Member 'ATokyoMapPlayerCameraManager_C::CurrentDistance' has a wrong offset!");
static_assert(offsetof(ATokyoMapPlayerCameraManager_C, DesiredFOV) == 0x002838, "Member 'ATokyoMapPlayerCameraManager_C::DesiredFOV' has a wrong offset!");
static_assert(offsetof(ATokyoMapPlayerCameraManager_C, CurrentFOV) == 0x00283C, "Member 'ATokyoMapPlayerCameraManager_C::CurrentFOV' has a wrong offset!");
static_assert(offsetof(ATokyoMapPlayerCameraManager_C, DefaultDistance) == 0x002840, "Member 'ATokyoMapPlayerCameraManager_C::DefaultDistance' has a wrong offset!");

}

