#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TokyoMapPlayerController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Project_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TokyoMapPlayerController.TokyoMapPlayerController_C
// 0x0028 (0x06C0 - 0x0698)
class ATokyoMapPlayerController_C final : public APadController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0698(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         MapIn_ChangeScale_60B5B2D24F43930C7A0AC5A777F73771; // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MapIn__Direction_60B5B2D24F43930C7A0AC5A777F73771; // 0x06A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5693[0x3];                                     // 0x06A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MapIn;                                             // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       PlayerCamera;                                      // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StopInput;                                         // 0x06B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsMoving;                                          // 0x06B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsDash;                                            // 0x06BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          WaitGameStart;                                     // 0x06BB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_TokyoMapPlayerController(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void InpAxisEvt_MoveRight_K2Node_InputAxisEvent_2(float AxisValue);
	void InpAxisEvt_MoveForward_K2Node_InputAxisEvent_0(float AxisValue);
	void ReceiveBeginPlay();
	void MapIn__UpdateFunc();
	void MapIn__FinishedFunc();
	void CalcDash();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TokyoMapPlayerController_C">();
	}
	static class ATokyoMapPlayerController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATokyoMapPlayerController_C>();
	}
};
static_assert(alignof(ATokyoMapPlayerController_C) == 0x000008, "Wrong alignment on ATokyoMapPlayerController_C");
static_assert(sizeof(ATokyoMapPlayerController_C) == 0x0006C0, "Wrong size on ATokyoMapPlayerController_C");
static_assert(offsetof(ATokyoMapPlayerController_C, UberGraphFrame) == 0x000698, "Member 'ATokyoMapPlayerController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATokyoMapPlayerController_C, MapIn_ChangeScale_60B5B2D24F43930C7A0AC5A777F73771) == 0x0006A0, "Member 'ATokyoMapPlayerController_C::MapIn_ChangeScale_60B5B2D24F43930C7A0AC5A777F73771' has a wrong offset!");
static_assert(offsetof(ATokyoMapPlayerController_C, MapIn__Direction_60B5B2D24F43930C7A0AC5A777F73771) == 0x0006A4, "Member 'ATokyoMapPlayerController_C::MapIn__Direction_60B5B2D24F43930C7A0AC5A777F73771' has a wrong offset!");
static_assert(offsetof(ATokyoMapPlayerController_C, MapIn) == 0x0006A8, "Member 'ATokyoMapPlayerController_C::MapIn' has a wrong offset!");
static_assert(offsetof(ATokyoMapPlayerController_C, PlayerCamera) == 0x0006B0, "Member 'ATokyoMapPlayerController_C::PlayerCamera' has a wrong offset!");
static_assert(offsetof(ATokyoMapPlayerController_C, StopInput) == 0x0006B8, "Member 'ATokyoMapPlayerController_C::StopInput' has a wrong offset!");
static_assert(offsetof(ATokyoMapPlayerController_C, IsMoving) == 0x0006B9, "Member 'ATokyoMapPlayerController_C::IsMoving' has a wrong offset!");
static_assert(offsetof(ATokyoMapPlayerController_C, IsDash) == 0x0006BA, "Member 'ATokyoMapPlayerController_C::IsDash' has a wrong offset!");
static_assert(offsetof(ATokyoMapPlayerController_C, WaitGameStart) == 0x0006BB, "Member 'ATokyoMapPlayerController_C::WaitGameStart' has a wrong offset!");

}

