#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIStatusCtrlDataObjBtl

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UIStatusCtrlDataObjBtl.UIStatusCtrlDataObjBtl_C.ExecuteUbergraph_UIStatusCtrlDataObjBtl
// 0x0340 (0x0340 - 0x0000)
struct UIStatusCtrlDataObjBtl_C_ExecuteUbergraph_UIStatusCtrlDataObjBtl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Index;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_Select_Default;                             // 0x0010(0x0010)(ReferenceParm)
	struct FBtlParty                              CallFunc_BI_GetPartyData_retValue;                 // 0x0020(0x0320)()
};
static_assert(alignof(UIStatusCtrlDataObjBtl_C_ExecuteUbergraph_UIStatusCtrlDataObjBtl) == 0x000010, "Wrong alignment on UIStatusCtrlDataObjBtl_C_ExecuteUbergraph_UIStatusCtrlDataObjBtl");
static_assert(sizeof(UIStatusCtrlDataObjBtl_C_ExecuteUbergraph_UIStatusCtrlDataObjBtl) == 0x000340, "Wrong size on UIStatusCtrlDataObjBtl_C_ExecuteUbergraph_UIStatusCtrlDataObjBtl");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_ExecuteUbergraph_UIStatusCtrlDataObjBtl, EntryPoint) == 0x000000, "Member 'UIStatusCtrlDataObjBtl_C_ExecuteUbergraph_UIStatusCtrlDataObjBtl::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_ExecuteUbergraph_UIStatusCtrlDataObjBtl, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'UIStatusCtrlDataObjBtl_C_ExecuteUbergraph_UIStatusCtrlDataObjBtl::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_ExecuteUbergraph_UIStatusCtrlDataObjBtl, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000005, "Member 'UIStatusCtrlDataObjBtl_C_ExecuteUbergraph_UIStatusCtrlDataObjBtl::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_ExecuteUbergraph_UIStatusCtrlDataObjBtl, CallFunc_BooleanOR_ReturnValue) == 0x000006, "Member 'UIStatusCtrlDataObjBtl_C_ExecuteUbergraph_UIStatusCtrlDataObjBtl::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_ExecuteUbergraph_UIStatusCtrlDataObjBtl, K2Node_Event_Index) == 0x000008, "Member 'UIStatusCtrlDataObjBtl_C_ExecuteUbergraph_UIStatusCtrlDataObjBtl::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_ExecuteUbergraph_UIStatusCtrlDataObjBtl, Temp_int_Variable) == 0x00000C, "Member 'UIStatusCtrlDataObjBtl_C_ExecuteUbergraph_UIStatusCtrlDataObjBtl::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_ExecuteUbergraph_UIStatusCtrlDataObjBtl, K2Node_Select_Default) == 0x000010, "Member 'UIStatusCtrlDataObjBtl_C_ExecuteUbergraph_UIStatusCtrlDataObjBtl::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_ExecuteUbergraph_UIStatusCtrlDataObjBtl, CallFunc_BI_GetPartyData_retValue) == 0x000020, "Member 'UIStatusCtrlDataObjBtl_C_ExecuteUbergraph_UIStatusCtrlDataObjBtl::CallFunc_BI_GetPartyData_retValue' has a wrong offset!");

// Function UIStatusCtrlDataObjBtl.UIStatusCtrlDataObjBtl_C.UpdateCurrent
// 0x0004 (0x0004 - 0x0000)
struct UIStatusCtrlDataObjBtl_C_UpdateCurrent final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIStatusCtrlDataObjBtl_C_UpdateCurrent) == 0x000004, "Wrong alignment on UIStatusCtrlDataObjBtl_C_UpdateCurrent");
static_assert(sizeof(UIStatusCtrlDataObjBtl_C_UpdateCurrent) == 0x000004, "Wrong size on UIStatusCtrlDataObjBtl_C_UpdateCurrent");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_UpdateCurrent, Param_Index) == 0x000000, "Member 'UIStatusCtrlDataObjBtl_C_UpdateCurrent::Param_Index' has a wrong offset!");

// Function UIStatusCtrlDataObjBtl.UIStatusCtrlDataObjBtl_C.Initialize
// 0x03D0 (0x03D0 - 0x0000)
struct UIStatusCtrlDataObjBtl_C_Initialize final
{
public:
	TScriptInterface<class IBPI_BattleParty_C>    M_BpiBtlParty;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FBtlParty                              CallFunc_BI_GetPartyData_retValue;                 // 0x0010(0x0320)()
	TArray<int32>                                 CallFunc_BI_GetSideActList_retValue;               // 0x0330(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0340(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x034C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0364(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorInt_ReturnValue;           // 0x0370(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x037C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0390(0x0030)(IsPlainOldData, NoDestructor)
	TArray<int32>                                 CallFunc_BI_GetSideActList_retValue_1;             // 0x03C0(0x0010)(ReferenceParm)
};
static_assert(alignof(UIStatusCtrlDataObjBtl_C_Initialize) == 0x000010, "Wrong alignment on UIStatusCtrlDataObjBtl_C_Initialize");
static_assert(sizeof(UIStatusCtrlDataObjBtl_C_Initialize) == 0x0003D0, "Wrong size on UIStatusCtrlDataObjBtl_C_Initialize");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_Initialize, M_BpiBtlParty) == 0x000000, "Member 'UIStatusCtrlDataObjBtl_C_Initialize::M_BpiBtlParty' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_Initialize, CallFunc_BI_GetPartyData_retValue) == 0x000010, "Member 'UIStatusCtrlDataObjBtl_C_Initialize::CallFunc_BI_GetPartyData_retValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_Initialize, CallFunc_BI_GetSideActList_retValue) == 0x000330, "Member 'UIStatusCtrlDataObjBtl_C_Initialize::CallFunc_BI_GetSideActList_retValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_Initialize, CallFunc_BreakTransform_Location) == 0x000340, "Member 'UIStatusCtrlDataObjBtl_C_Initialize::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_Initialize, CallFunc_BreakTransform_Rotation) == 0x00034C, "Member 'UIStatusCtrlDataObjBtl_C_Initialize::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_Initialize, CallFunc_BreakTransform_Scale) == 0x000358, "Member 'UIStatusCtrlDataObjBtl_C_Initialize::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_Initialize, CallFunc_GetForwardVector_ReturnValue) == 0x000364, "Member 'UIStatusCtrlDataObjBtl_C_Initialize::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_Initialize, CallFunc_Multiply_VectorInt_ReturnValue) == 0x000370, "Member 'UIStatusCtrlDataObjBtl_C_Initialize::CallFunc_Multiply_VectorInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_Initialize, CallFunc_Add_VectorVector_ReturnValue) == 0x00037C, "Member 'UIStatusCtrlDataObjBtl_C_Initialize::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_Initialize, CallFunc_MakeTransform_ReturnValue) == 0x000390, "Member 'UIStatusCtrlDataObjBtl_C_Initialize::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_Initialize, CallFunc_BI_GetSideActList_retValue_1) == 0x0003C0, "Member 'UIStatusCtrlDataObjBtl_C_Initialize::CallFunc_BI_GetSideActList_retValue_1' has a wrong offset!");

// Function UIStatusCtrlDataObjBtl.UIStatusCtrlDataObjBtl_C.Initialize_CampLike
// 0x0010 (0x0010 - 0x0000)
struct UIStatusCtrlDataObjBtl_C_Initialize_CampLike final
{
public:
	TScriptInterface<class IBPI_BattleParty_C>    _____;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIStatusCtrlDataObjBtl_C_Initialize_CampLike) == 0x000008, "Wrong alignment on UIStatusCtrlDataObjBtl_C_Initialize_CampLike");
static_assert(sizeof(UIStatusCtrlDataObjBtl_C_Initialize_CampLike) == 0x000010, "Wrong size on UIStatusCtrlDataObjBtl_C_Initialize_CampLike");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_Initialize_CampLike, _____) == 0x000000, "Member 'UIStatusCtrlDataObjBtl_C_Initialize_CampLike::_____' has a wrong offset!");

// Function UIStatusCtrlDataObjBtl.UIStatusCtrlDataObjBtl_C.RemoveDeadEnemy
// 0x001C (0x001C - 0x0000)
struct UIStatusCtrlDataObjBtl_C_RemoveDeadEnemy final
{
public:
	int32                                         Lo_Index;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BI_IsInField_retValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIStatusCtrlDataObjBtl_C_RemoveDeadEnemy) == 0x000004, "Wrong alignment on UIStatusCtrlDataObjBtl_C_RemoveDeadEnemy");
static_assert(sizeof(UIStatusCtrlDataObjBtl_C_RemoveDeadEnemy) == 0x00001C, "Wrong size on UIStatusCtrlDataObjBtl_C_RemoveDeadEnemy");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_RemoveDeadEnemy, Lo_Index) == 0x000000, "Member 'UIStatusCtrlDataObjBtl_C_RemoveDeadEnemy::Lo_Index' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_RemoveDeadEnemy, Temp_int_Variable) == 0x000004, "Member 'UIStatusCtrlDataObjBtl_C_RemoveDeadEnemy::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_RemoveDeadEnemy, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'UIStatusCtrlDataObjBtl_C_RemoveDeadEnemy::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_RemoveDeadEnemy, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'UIStatusCtrlDataObjBtl_C_RemoveDeadEnemy::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_RemoveDeadEnemy, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'UIStatusCtrlDataObjBtl_C_RemoveDeadEnemy::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_RemoveDeadEnemy, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000014, "Member 'UIStatusCtrlDataObjBtl_C_RemoveDeadEnemy::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_RemoveDeadEnemy, CallFunc_BI_IsInField_retValue) == 0x000018, "Member 'UIStatusCtrlDataObjBtl_C_RemoveDeadEnemy::CallFunc_BI_IsInField_retValue' has a wrong offset!");

// Function UIStatusCtrlDataObjBtl.UIStatusCtrlDataObjBtl_C.CreateStockList
// 0x0030 (0x0030 - 0x0000)
struct UIStatusCtrlDataObjBtl_C_CreateStockList final
{
public:
	int32                                         Lo_ListIndex;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_LastIndex;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_Index;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BI_IsStock_retValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BI_const_GetStockLoopMax_retValue;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BI_const_GetStockStart_retValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIStatusCtrlDataObjBtl_C_CreateStockList) == 0x000004, "Wrong alignment on UIStatusCtrlDataObjBtl_C_CreateStockList");
static_assert(sizeof(UIStatusCtrlDataObjBtl_C_CreateStockList) == 0x000030, "Wrong size on UIStatusCtrlDataObjBtl_C_CreateStockList");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_CreateStockList, Lo_ListIndex) == 0x000000, "Member 'UIStatusCtrlDataObjBtl_C_CreateStockList::Lo_ListIndex' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_CreateStockList, Lo_LastIndex) == 0x000004, "Member 'UIStatusCtrlDataObjBtl_C_CreateStockList::Lo_LastIndex' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_CreateStockList, Lo_Index) == 0x000008, "Member 'UIStatusCtrlDataObjBtl_C_CreateStockList::Lo_Index' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_CreateStockList, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'UIStatusCtrlDataObjBtl_C_CreateStockList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_CreateStockList, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'UIStatusCtrlDataObjBtl_C_CreateStockList::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_CreateStockList, CallFunc_BI_IsStock_retValue) == 0x000014, "Member 'UIStatusCtrlDataObjBtl_C_CreateStockList::CallFunc_BI_IsStock_retValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_CreateStockList, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000015, "Member 'UIStatusCtrlDataObjBtl_C_CreateStockList::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_CreateStockList, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'UIStatusCtrlDataObjBtl_C_CreateStockList::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_CreateStockList, Temp_int_Variable) == 0x00001C, "Member 'UIStatusCtrlDataObjBtl_C_CreateStockList::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_CreateStockList, CallFunc_Add_IntInt_ReturnValue_2) == 0x000020, "Member 'UIStatusCtrlDataObjBtl_C_CreateStockList::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_CreateStockList, Temp_int_Variable_1) == 0x000024, "Member 'UIStatusCtrlDataObjBtl_C_CreateStockList::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_CreateStockList, CallFunc_BI_const_GetStockLoopMax_retValue) == 0x000028, "Member 'UIStatusCtrlDataObjBtl_C_CreateStockList::CallFunc_BI_const_GetStockLoopMax_retValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_CreateStockList, CallFunc_BI_const_GetStockStart_retValue) == 0x00002C, "Member 'UIStatusCtrlDataObjBtl_C_CreateStockList::CallFunc_BI_const_GetStockStart_retValue' has a wrong offset!");

// Function UIStatusCtrlDataObjBtl.UIStatusCtrlDataObjBtl_C.GetGroup_Test
// 0x0004 (0x0004 - 0x0000)
struct UIStatusCtrlDataObjBtl_C_GetGroup_Test final
{
public:
	int32                                         Param_M_ListType;                                  // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIStatusCtrlDataObjBtl_C_GetGroup_Test) == 0x000004, "Wrong alignment on UIStatusCtrlDataObjBtl_C_GetGroup_Test");
static_assert(sizeof(UIStatusCtrlDataObjBtl_C_GetGroup_Test) == 0x000004, "Wrong size on UIStatusCtrlDataObjBtl_C_GetGroup_Test");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_GetGroup_Test, Param_M_ListType) == 0x000000, "Member 'UIStatusCtrlDataObjBtl_C_GetGroup_Test::Param_M_ListType' has a wrong offset!");

// Function UIStatusCtrlDataObjBtl.UIStatusCtrlDataObjBtl_C.SetCurrentFromPartyIndex
// 0x0050 (0x0050 - 0x0000)
struct UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex final
{
public:
	int32                                         PartyIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_2;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex) == 0x000004, "Wrong alignment on UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex");
static_assert(sizeof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex) == 0x000050, "Wrong size on UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, PartyIndex) == 0x000000, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::PartyIndex' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, Temp_int_Variable) == 0x000004, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, Temp_int_Variable_1) == 0x00000C, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, Temp_int_Variable_2) == 0x000014, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, CallFunc_Add_IntInt_ReturnValue_2) == 0x000018, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00001C, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00001D, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, CallFunc_Array_Length_ReturnValue_1) == 0x000024, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000029, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, CallFunc_Array_LastIndex_ReturnValue) == 0x00002C, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, CallFunc_Array_LastIndex_ReturnValue_1) == 0x000030, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::CallFunc_Array_LastIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000034, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, CallFunc_Array_Length_ReturnValue_2) == 0x000038, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, CallFunc_Array_LastIndex_ReturnValue_2) == 0x00003C, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::CallFunc_Array_LastIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000040, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000041, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, Temp_int_Variable_3) == 0x000044, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, CallFunc_Add_IntInt_ReturnValue_3) == 0x000048, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00004C, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x00004D, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");

// Function UIStatusCtrlDataObjBtl.UIStatusCtrlDataObjBtl_C.PrepareModel
// 0x0068 (0x0068 - 0x0000)
struct UIStatusCtrlDataObjBtl_C_PrepareModel final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharaBaseAccessor_C> CallFunc_BI_GetPartyUnit_retValue;                 // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharaBaseAccessor_C> CallFunc_BI_GetPartyUnit_retValue_1;               // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor_1;                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIStatusCtrlDataObjBtl_C_PrepareModel) == 0x000008, "Wrong alignment on UIStatusCtrlDataObjBtl_C_PrepareModel");
static_assert(sizeof(UIStatusCtrlDataObjBtl_C_PrepareModel) == 0x000068, "Wrong size on UIStatusCtrlDataObjBtl_C_PrepareModel");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_PrepareModel, Temp_int_Variable) == 0x000000, "Member 'UIStatusCtrlDataObjBtl_C_PrepareModel::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_PrepareModel, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'UIStatusCtrlDataObjBtl_C_PrepareModel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_PrepareModel, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UIStatusCtrlDataObjBtl_C_PrepareModel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_PrepareModel, Temp_int_Variable_1) == 0x00000C, "Member 'UIStatusCtrlDataObjBtl_C_PrepareModel::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_PrepareModel, CallFunc_Array_LastIndex_ReturnValue) == 0x000010, "Member 'UIStatusCtrlDataObjBtl_C_PrepareModel::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_PrepareModel, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000014, "Member 'UIStatusCtrlDataObjBtl_C_PrepareModel::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_PrepareModel, CallFunc_BI_GetPartyUnit_retValue) == 0x000018, "Member 'UIStatusCtrlDataObjBtl_C_PrepareModel::CallFunc_BI_GetPartyUnit_retValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_PrepareModel, K2Node_DynamicCast_AsActor) == 0x000028, "Member 'UIStatusCtrlDataObjBtl_C_PrepareModel::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_PrepareModel, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'UIStatusCtrlDataObjBtl_C_PrepareModel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_PrepareModel, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'UIStatusCtrlDataObjBtl_C_PrepareModel::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_PrepareModel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000038, "Member 'UIStatusCtrlDataObjBtl_C_PrepareModel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_PrepareModel, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000039, "Member 'UIStatusCtrlDataObjBtl_C_PrepareModel::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_PrepareModel, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00003A, "Member 'UIStatusCtrlDataObjBtl_C_PrepareModel::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_PrepareModel, CallFunc_BooleanOR_ReturnValue) == 0x00003B, "Member 'UIStatusCtrlDataObjBtl_C_PrepareModel::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_PrepareModel, CallFunc_Array_LastIndex_ReturnValue_1) == 0x00003C, "Member 'UIStatusCtrlDataObjBtl_C_PrepareModel::CallFunc_Array_LastIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_PrepareModel, CallFunc_BI_GetPartyUnit_retValue_1) == 0x000040, "Member 'UIStatusCtrlDataObjBtl_C_PrepareModel::CallFunc_BI_GetPartyUnit_retValue_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_PrepareModel, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000050, "Member 'UIStatusCtrlDataObjBtl_C_PrepareModel::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_PrepareModel, K2Node_DynamicCast_AsActor_1) == 0x000058, "Member 'UIStatusCtrlDataObjBtl_C_PrepareModel::K2Node_DynamicCast_AsActor_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_PrepareModel, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'UIStatusCtrlDataObjBtl_C_PrepareModel::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_PrepareModel, CallFunc_Array_Length_ReturnValue_1) == 0x000064, "Member 'UIStatusCtrlDataObjBtl_C_PrepareModel::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");

// Function UIStatusCtrlDataObjBtl.UIStatusCtrlDataObjBtl_C.GetCurrentPartyIndex
// 0x0018 (0x0018 - 0x0000)
struct UIStatusCtrlDataObjBtl_C_GetCurrentPartyIndex final
{
public:
	int32                                         PartyIndex;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_Select_Default;                             // 0x0008(0x0010)(ReferenceParm)
};
static_assert(alignof(UIStatusCtrlDataObjBtl_C_GetCurrentPartyIndex) == 0x000008, "Wrong alignment on UIStatusCtrlDataObjBtl_C_GetCurrentPartyIndex");
static_assert(sizeof(UIStatusCtrlDataObjBtl_C_GetCurrentPartyIndex) == 0x000018, "Wrong size on UIStatusCtrlDataObjBtl_C_GetCurrentPartyIndex");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_GetCurrentPartyIndex, PartyIndex) == 0x000000, "Member 'UIStatusCtrlDataObjBtl_C_GetCurrentPartyIndex::PartyIndex' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_GetCurrentPartyIndex, Temp_int_Variable) == 0x000004, "Member 'UIStatusCtrlDataObjBtl_C_GetCurrentPartyIndex::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_GetCurrentPartyIndex, K2Node_Select_Default) == 0x000008, "Member 'UIStatusCtrlDataObjBtl_C_GetCurrentPartyIndex::K2Node_Select_Default' has a wrong offset!");

// Function UIStatusCtrlDataObjBtl.UIStatusCtrlDataObjBtl_C.SetCurrentFromPartyIndex_AnalyzeItem
// 0x0004 (0x0004 - 0x0000)
struct UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_AnalyzeItem final
{
public:
	int32                                         PartyIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_AnalyzeItem) == 0x000004, "Wrong alignment on UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_AnalyzeItem");
static_assert(sizeof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_AnalyzeItem) == 0x000004, "Wrong size on UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_AnalyzeItem");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_AnalyzeItem, PartyIndex) == 0x000000, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_AnalyzeItem::PartyIndex' has a wrong offset!");

// Function UIStatusCtrlDataObjBtl.UIStatusCtrlDataObjBtl_C.RebuildCharaList
// 0x0038 (0x0038 - 0x0000)
struct UIStatusCtrlDataObjBtl_C_RebuildCharaList final
{
public:
	TArray<uint8>                                 EnemyList;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<uint8>                                 PartyList;                                         // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<uint8>                                 StockList;                                         // 0x0020(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIStatusCtrlDataObjBtl_C_RebuildCharaList) == 0x000008, "Wrong alignment on UIStatusCtrlDataObjBtl_C_RebuildCharaList");
static_assert(sizeof(UIStatusCtrlDataObjBtl_C_RebuildCharaList) == 0x000038, "Wrong size on UIStatusCtrlDataObjBtl_C_RebuildCharaList");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_RebuildCharaList, EnemyList) == 0x000000, "Member 'UIStatusCtrlDataObjBtl_C_RebuildCharaList::EnemyList' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_RebuildCharaList, PartyList) == 0x000010, "Member 'UIStatusCtrlDataObjBtl_C_RebuildCharaList::PartyList' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_RebuildCharaList, StockList) == 0x000020, "Member 'UIStatusCtrlDataObjBtl_C_RebuildCharaList::StockList' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_RebuildCharaList, ReturnValue) == 0x000030, "Member 'UIStatusCtrlDataObjBtl_C_RebuildCharaList::ReturnValue' has a wrong offset!");

// Function UIStatusCtrlDataObjBtl.UIStatusCtrlDataObjBtl_C.SetCurrentFromPartyIndex_New
// 0x0054 (0x0054 - 0x0000)
struct UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New final
{
public:
	int32                                         Type;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BtlPartyIndex;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_2;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New) == 0x000004, "Wrong alignment on UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New");
static_assert(sizeof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New) == 0x000054, "Wrong size on UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, Type) == 0x000000, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::Type' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, BtlPartyIndex) == 0x000004, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::BtlPartyIndex' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, CallFunc_Array_LastIndex_ReturnValue) == 0x000010, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, CallFunc_Greater_IntInt_ReturnValue) == 0x000014, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, CallFunc_Array_Length_ReturnValue_1) == 0x000018, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, CallFunc_Array_LastIndex_ReturnValue_1) == 0x00001C, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::CallFunc_Array_LastIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000020, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, CallFunc_Array_Length_ReturnValue_2) == 0x000024, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, CallFunc_Array_LastIndex_ReturnValue_2) == 0x000028, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::CallFunc_Array_LastIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, CallFunc_Greater_IntInt_ReturnValue_2) == 0x00002C, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, Temp_int_Variable) == 0x000030, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000034, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000035, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, Temp_int_Variable_1) == 0x00003C, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000040, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000041, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, Temp_int_Variable_2) == 0x000048, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00004C, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x00004D, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New, CallFunc_Add_IntInt_ReturnValue_2) == 0x000050, "Member 'UIStatusCtrlDataObjBtl_C_SetCurrentFromPartyIndex_New::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function UIStatusCtrlDataObjBtl.UIStatusCtrlDataObjBtl_C.ConvertNkmIndex2BtlPartyIndex
// 0x0040 (0x0040 - 0x0000)
struct UIStatusCtrlDataObjBtl_C_ConvertNkmIndex2BtlPartyIndex final
{
public:
	TArray<int32>                                 InputPin;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Lo_NkmIndex;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_Index;                                          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerPanelPositionInBattle_ReturnValue; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BI_GetBattlePartyIndexByNkmIndex_OutPartyIndex; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BI_GetBattlePartyIndexByNkmIndex_OutPartyIndex_1; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BI_GetBattlePartyIndexByNkmIndex_OutPartyIndex_2; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
