#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIStatusCtrlDataObjBtl

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Project_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UIStatusCtrlDataObjBtl.UIStatusCtrlDataObjBtl_C
// 0x0098 (0x0250 - 0x01B8)
class UUIStatusCtrlDataObjBtl_C final : public UUIStatusCtrlDataObjBtlBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TScriptInterface<class IBPI_BattleParty_C>    M_BattleParty;                                     // 0x01C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          M_Initialized;                                     // 0x01D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54DA[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 M_EnemyList;                                       // 0x01D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 M_PartyList;                                       // 0x01E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 M_StockList;                                       // 0x01F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         M_ListType;                                        // 0x0208(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54DB[0x4];                                     // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             M_SpawnTransform;                                  // 0x0210(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<int32>                                 M_AnalyzeItemTarget;                               // 0x0240(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_UIStatusCtrlDataObjBtl(int32 EntryPoint);
	void UpdateCurrent(int32 Param_Index);
	void Initialize(TScriptInterface<class IBPI_BattleParty_C> M_BpiBtlParty);
	void Initialize_CampLike(TScriptInterface<class IBPI_BattleParty_C> _____);
	void Finalize();
	void RemoveDeadEnemy();
	void CreateStockList();
	void GetGroup_Test(int32* Param_M_ListType);
	void SetCurrentFromPartyIndex(int32 PartyIndex);
	void PrepareModel();
	void GetCurrentPartyIndex(int32* PartyIndex);
	void SetCurrentFromPartyIndex_AnalyzeItem(int32 PartyIndex);
	void SetSimpleEmptyData();
	bool RebuildCharaList(const TArray<uint8>& EnemyList, const TArray<uint8>& PartyList, const TArray<uint8>& StockList);
	void SetCurrentFromPartyIndex_New(int32 Type, int32 BtlPartyIndex);
	void ConvertNkmIndex2BtlPartyIndex(TArray<int32>& InputPin);
	void GetAnalyzeData(const int32 Param_Index, struct FAnalyzeData* AnalyzeData);
	bool UseDedicatedAnalyzeData(const int32 Param_Index);
	bool UseDedicatedDropData(const int32 Param_Index);
	TArray<int32> GetMagatsuhiSkillData(const int32 Param_Index);
	TArray<int32> GetDedicatedDropData(const int32 Param_Index);
	TArray<int32> GetMagaSkillSupporters(const int32 Param_Index);
	bool IsBossChallangeMode();

	int32 GetListMax() const;
	int32 GetDevilIDFromIndex(const int32 Param_Index) const;
	const struct FTransform GetModelSpawnTransform() const;
	bool IsDyingMotion() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIStatusCtrlDataObjBtl_C">();
	}
	static class UUIStatusCtrlDataObjBtl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIStatusCtrlDataObjBtl_C>();
	}
};
static_assert(alignof(UUIStatusCtrlDataObjBtl_C) == 0x000010, "Wrong alignment on UUIStatusCtrlDataObjBtl_C");
static_assert(sizeof(UUIStatusCtrlDataObjBtl_C) == 0x000250, "Wrong size on UUIStatusCtrlDataObjBtl_C");
static_assert(offsetof(UUIStatusCtrlDataObjBtl_C, UberGraphFrame) == 0x0001B8, "Member 'UUIStatusCtrlDataObjBtl_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIStatusCtrlDataObjBtl_C, M_BattleParty) == 0x0001C0, "Member 'UUIStatusCtrlDataObjBtl_C::M_BattleParty' has a wrong offset!");
static_assert(offsetof(UUIStatusCtrlDataObjBtl_C, M_Initialized) == 0x0001D0, "Member 'UUIStatusCtrlDataObjBtl_C::M_Initialized' has a wrong offset!");
static_assert(offsetof(UUIStatusCtrlDataObjBtl_C, M_EnemyList) == 0x0001D8, "Member 'UUIStatusCtrlDataObjBtl_C::M_EnemyList' has a wrong offset!");
static_assert(offsetof(UUIStatusCtrlDataObjBtl_C, M_PartyList) == 0x0001E8, "Member 'UUIStatusCtrlDataObjBtl_C::M_PartyList' has a wrong offset!");
static_assert(offsetof(UUIStatusCtrlDataObjBtl_C, M_StockList) == 0x0001F8, "Member 'UUIStatusCtrlDataObjBtl_C::M_StockList' has a wrong offset!");
static_assert(offsetof(UUIStatusCtrlDataObjBtl_C, M_ListType) == 0x000208, "Member 'UUIStatusCtrlDataObjBtl_C::M_ListType' has a wrong offset!");
static_assert(offsetof(UUIStatusCtrlDataObjBtl_C, M_SpawnTransform) == 0x000210, "Member 'UUIStatusCtrlDataObjBtl_C::M_SpawnTransform' has a wrong offset!");
static_assert(offsetof(UUIStatusCtrlDataObjBtl_C, M_AnalyzeItemTarget) == 0x000240, "Member 'UUIStatusCtrlDataObjBtl_C::M_AnalyzeItemTarget' has a wrong offset!");

}

