#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BtlCommandMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_BtlCommandMenu.WB_BtlCommandMenu_C
// 0x00F0 (0x0350 - 0x0260)
class UWB_BtlCommandMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanelBG;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanelMenuParts;                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayer_BG;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayer_Cursor;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayer_Pos;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayer_Title;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWB_BtlCommandMenuPart_C*>       MenuParts;                                         // 0x0298(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FVector2D                              RippleOffset;                                      // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInitialized;                                     // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A92[0x3];                                     // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CursorIndex;                                       // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CursorMovable;                                     // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsInputEnable;                                     // 0x02B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A93[0x6];                                     // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<E_BTL_UI_COMMAND, class UWB_BtlCommandMenuPart_C*> MenuPool;                                          // 0x02C0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FVector2D                              MenuOrigin;                                        // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRegistered;                                      // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          M_IsDisappeared;                                   // 0x0319(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A94[0x6];                                     // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             Evt_OnListHovered;                                 // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             Evt_OnListClicked;                                 // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             Evt_OnListUnHovered;                               // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Evt_OnListHovered__DelegateSignature(int32 ShiftIndex);
	void Evt_OnListClicked__DelegateSignature(E_BTL_UI_COMMAND Command);
	void Evt_OnListUnHovered__DelegateSignature();
	void ExecuteUbergraph_WB_BtlCommandMenu(int32 EntryPoint);
	void InitDisappeared();
	void Disappear(float Rate, bool Immediately);
	void Appear(float Rate, bool Immediately);
	void Start_Cursor_Input();
	void Start_Cursor_Anim();
	void BndEvt__SsPlayer_Title_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void CallTick(float Delta);
	void InitWidget();
	void AddMenu(E_BTL_UI_COMMAND Menu, bool Selectable);
	void DecidePos();
	void PlayTitleAnim(int32 AnimIndex, bool IsLoop);
	void PlayBG_Anim(int32 AnimIndex, bool IsLoop);
	void PlayCursorAnim(int32 AnimIndex, bool IsLoop);
	void SlideOut();
	void SlideIn();
	void CursorCtrl(int32 Direction, bool* CursorMoved);
	void DecideCursor();
	void GetResult(E_BTL_UI_COMMAND* Return, bool* Selectable);
	void CreateMenu();
	void RegisterMenu(struct FBtlParty& PartyData, E_BTL_UI_COMMAND InitialCursor, bool ExistNkm, bool Escapable, bool IsBlock, bool IsHeroSleeped, bool IsHero, bool IsGuest);
	void DecideMenuPos(int32 MenuIndex, class UWidget* Widget);
	void CreateMenuList(TArray<E_BTL_UI_COMMAND>& Menu, TArray<bool>& Selectable, bool IsHero, bool ExistNkm, bool Escapable, bool IsBlock, bool IsHeroSleeped, bool IsGuest);
	void CreateMenuList_Nkm(TArray<E_BTL_UI_COMMAND>& Menu, TArray<bool>& Selectable);
	void Constructinit(class USsPlayerWidget*& SsPlayer);
	void IsAllSlideInFinished(bool* Finished);
	void SideInImmediately();
	void DebugCheckDisappeared();
	void OnListHovered(E_BTL_UI_COMMAND Result);
	void OnListClicked(E_BTL_UI_COMMAND Result);
	void OnListUnHovered();
	void MouseWheel(float MouseWheelDelta);
	void IsDisappeared(bool* Param_IsDisappeared);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_BtlCommandMenu_C">();
	}
	static class UWB_BtlCommandMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_BtlCommandMenu_C>();
	}
};
static_assert(alignof(UWB_BtlCommandMenu_C) == 0x000008, "Wrong alignment on UWB_BtlCommandMenu_C");
static_assert(sizeof(UWB_BtlCommandMenu_C) == 0x000350, "Wrong size on UWB_BtlCommandMenu_C");
static_assert(offsetof(UWB_BtlCommandMenu_C, UberGraphFrame) == 0x000260, "Member 'UWB_BtlCommandMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_BtlCommandMenu_C, CanvasPanelBG) == 0x000268, "Member 'UWB_BtlCommandMenu_C::CanvasPanelBG' has a wrong offset!");
static_assert(offsetof(UWB_BtlCommandMenu_C, CanvasPanelMenuParts) == 0x000270, "Member 'UWB_BtlCommandMenu_C::CanvasPanelMenuParts' has a wrong offset!");
static_assert(offsetof(UWB_BtlCommandMenu_C, SsPlayer_BG) == 0x000278, "Member 'UWB_BtlCommandMenu_C::SsPlayer_BG' has a wrong offset!");
static_assert(offsetof(UWB_BtlCommandMenu_C, SsPlayer_Cursor) == 0x000280, "Member 'UWB_BtlCommandMenu_C::SsPlayer_Cursor' has a wrong offset!");
static_assert(offsetof(UWB_BtlCommandMenu_C, SsPlayer_Pos) == 0x000288, "Member 'UWB_BtlCommandMenu_C::SsPlayer_Pos' has a wrong offset!");
static_assert(offsetof(UWB_BtlCommandMenu_C, SsPlayer_Title) == 0x000290, "Member 'UWB_BtlCommandMenu_C::SsPlayer_Title' has a wrong offset!");
static_assert(offsetof(UWB_BtlCommandMenu_C, MenuParts) == 0x000298, "Member 'UWB_BtlCommandMenu_C::MenuParts' has a wrong offset!");
static_assert(offsetof(UWB_BtlCommandMenu_C, RippleOffset) == 0x0002A8, "Member 'UWB_BtlCommandMenu_C::RippleOffset' has a wrong offset!");
static_assert(offsetof(UWB_BtlCommandMenu_C, IsInitialized) == 0x0002B0, "Member 'UWB_BtlCommandMenu_C::IsInitialized' has a wrong offset!");
static_assert(offsetof(UWB_BtlCommandMenu_C, CursorIndex) == 0x0002B4, "Member 'UWB_BtlCommandMenu_C::CursorIndex' has a wrong offset!");
static_assert(offsetof(UWB_BtlCommandMenu_C, CursorMovable) == 0x0002B8, "Member 'UWB_BtlCommandMenu_C::CursorMovable' has a wrong offset!");
static_assert(offsetof(UWB_BtlCommandMenu_C, IsInputEnable) == 0x0002B9, "Member 'UWB_BtlCommandMenu_C::IsInputEnable' has a wrong offset!");
static_assert(offsetof(UWB_BtlCommandMenu_C, MenuPool) == 0x0002C0, "Member 'UWB_BtlCommandMenu_C::MenuPool' has a wrong offset!");
static_assert(offsetof(UWB_BtlCommandMenu_C, MenuOrigin) == 0x000310, "Member 'UWB_BtlCommandMenu_C::MenuOrigin' has a wrong offset!");
static_assert(offsetof(UWB_BtlCommandMenu_C, IsRegistered) == 0x000318, "Member 'UWB_BtlCommandMenu_C::IsRegistered' has a wrong offset!");
static_assert(offsetof(UWB_BtlCommandMenu_C, M_IsDisappeared) == 0x000319, "Member 'UWB_BtlCommandMenu_C::M_IsDisappeared' has a wrong offset!");
static_assert(offsetof(UWB_BtlCommandMenu_C, Evt_OnListHovered) == 0x000320, "Member 'UWB_BtlCommandMenu_C::Evt_OnListHovered' has a wrong offset!");
static_assert(offsetof(UWB_BtlCommandMenu_C, Evt_OnListClicked) == 0x000330, "Member 'UWB_BtlCommandMenu_C::Evt_OnListClicked' has a wrong offset!");
static_assert(offsetof(UWB_BtlCommandMenu_C, Evt_OnListUnHovered) == 0x000340, "Member 'UWB_BtlCommandMenu_C::Evt_OnListUnHovered' has a wrong offset!");

}

