#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BtlCommandMenu

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_BtlCommandMenu.WB_BtlCommandMenu_C.Evt_OnListHovered__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WB_BtlCommandMenu_C_Evt_OnListHovered__DelegateSignature final
{
public:
	int32                                         ShiftIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtlCommandMenu_C_Evt_OnListHovered__DelegateSignature) == 0x000004, "Wrong alignment on WB_BtlCommandMenu_C_Evt_OnListHovered__DelegateSignature");
static_assert(sizeof(WB_BtlCommandMenu_C_Evt_OnListHovered__DelegateSignature) == 0x000004, "Wrong size on WB_BtlCommandMenu_C_Evt_OnListHovered__DelegateSignature");
static_assert(offsetof(WB_BtlCommandMenu_C_Evt_OnListHovered__DelegateSignature, ShiftIndex) == 0x000000, "Member 'WB_BtlCommandMenu_C_Evt_OnListHovered__DelegateSignature::ShiftIndex' has a wrong offset!");

// Function WB_BtlCommandMenu.WB_BtlCommandMenu_C.Evt_OnListClicked__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WB_BtlCommandMenu_C_Evt_OnListClicked__DelegateSignature final
{
public:
	E_BTL_UI_COMMAND                              Command;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtlCommandMenu_C_Evt_OnListClicked__DelegateSignature) == 0x000001, "Wrong alignment on WB_BtlCommandMenu_C_Evt_OnListClicked__DelegateSignature");
static_assert(sizeof(WB_BtlCommandMenu_C_Evt_OnListClicked__DelegateSignature) == 0x000001, "Wrong size on WB_BtlCommandMenu_C_Evt_OnListClicked__DelegateSignature");
static_assert(offsetof(WB_BtlCommandMenu_C_Evt_OnListClicked__DelegateSignature, Command) == 0x000000, "Member 'WB_BtlCommandMenu_C_Evt_OnListClicked__DelegateSignature::Command' has a wrong offset!");

// Function WB_BtlCommandMenu.WB_BtlCommandMenu_C.ExecuteUbergraph_WB_BtlCommandMenu
// 0x0090 (0x0090 - 0x0000)
struct WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMouseWheelAxis_Axis;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Delta;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x000C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_1;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_1;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_1;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_1;       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A95[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName;           // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName;          // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A96[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Rate_1;                               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Immediately_1;                        // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A97[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Rate;                                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Immediately;                          // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu) == 0x000004, "Wrong alignment on WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu");
static_assert(sizeof(WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu) == 0x000090, "Wrong size on WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu");
static_assert(offsetof(WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu, EntryPoint) == 0x000000, "Member 'WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu, CallFunc_GetMouseWheelAxis_Axis) == 0x000004, "Member 'WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu::CallFunc_GetMouseWheelAxis_Axis' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu, K2Node_Event_Delta) == 0x000008, "Member 'WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu::K2Node_Event_Delta' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu, K2Node_Event_MyGeometry) == 0x00000C, "Member 'WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu, K2Node_Event_InDeltaTime) == 0x000044, "Member 'WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu, K2Node_ComponentBoundEvent_AnimPackName_1) == 0x000048, "Member 'WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu::K2Node_ComponentBoundEvent_AnimPackName_1' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu, K2Node_ComponentBoundEvent_AnimationName_1) == 0x000050, "Member 'WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu::K2Node_ComponentBoundEvent_AnimationName_1' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu, K2Node_ComponentBoundEvent_AnimPackIndex_1) == 0x000058, "Member 'WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu::K2Node_ComponentBoundEvent_AnimPackIndex_1' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu, K2Node_ComponentBoundEvent_AnimationIndex_1) == 0x00005C, "Member 'WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu::K2Node_ComponentBoundEvent_AnimationIndex_1' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu, K2Node_SwitchInteger_CmpSuccess) == 0x000060, "Member 'WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu, K2Node_ComponentBoundEvent_AnimPackName) == 0x000064, "Member 'WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu::K2Node_ComponentBoundEvent_AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu, K2Node_ComponentBoundEvent_AnimationName) == 0x00006C, "Member 'WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu::K2Node_ComponentBoundEvent_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu, K2Node_ComponentBoundEvent_AnimPackIndex) == 0x000074, "Member 'WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu::K2Node_ComponentBoundEvent_AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu, K2Node_ComponentBoundEvent_AnimationIndex) == 0x000078, "Member 'WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu::K2Node_ComponentBoundEvent_AnimationIndex' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu, K2Node_SwitchInteger_CmpSuccess_1) == 0x00007C, "Member 'WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu, K2Node_Event_Rate_1) == 0x000080, "Member 'WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu::K2Node_Event_Rate_1' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu, K2Node_Event_Immediately_1) == 0x000084, "Member 'WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu::K2Node_Event_Immediately_1' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu, K2Node_Event_Rate) == 0x000088, "Member 'WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu::K2Node_Event_Rate' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu, K2Node_Event_Immediately) == 0x00008C, "Member 'WB_BtlCommandMenu_C_ExecuteUbergraph_WB_BtlCommandMenu::K2Node_Event_Immediately' has a wrong offset!");

// Function WB_BtlCommandMenu.WB_BtlCommandMenu_C.Disappear
// 0x0008 (0x0008 - 0x0000)
struct WB_BtlCommandMenu_C_Disappear final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Immediately;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlCommandMenu_C_Disappear) == 0x000004, "Wrong alignment on WB_BtlCommandMenu_C_Disappear");
static_assert(sizeof(WB_BtlCommandMenu_C_Disappear) == 0x000008, "Wrong size on WB_BtlCommandMenu_C_Disappear");
static_assert(offsetof(WB_BtlCommandMenu_C_Disappear, Rate) == 0x000000, "Member 'WB_BtlCommandMenu_C_Disappear::Rate' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_Disappear, Immediately) == 0x000004, "Member 'WB_BtlCommandMenu_C_Disappear::Immediately' has a wrong offset!");

// Function WB_BtlCommandMenu.WB_BtlCommandMenu_C.Appear
// 0x0008 (0x0008 - 0x0000)
struct WB_BtlCommandMenu_C_Appear final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Immediately;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlCommandMenu_C_Appear) == 0x000004, "Wrong alignment on WB_BtlCommandMenu_C_Appear");
static_assert(sizeof(WB_BtlCommandMenu_C_Appear) == 0x000008, "Wrong size on WB_BtlCommandMenu_C_Appear");
static_assert(offsetof(WB_BtlCommandMenu_C_Appear, Rate) == 0x000000, "Member 'WB_BtlCommandMenu_C_Appear::Rate' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_Appear, Immediately) == 0x000004, "Member 'WB_BtlCommandMenu_C_Appear::Immediately' has a wrong offset!");

// Function WB_BtlCommandMenu.WB_BtlCommandMenu_C.BndEvt__SsPlayer_Title_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_BtlCommandMenu_C_BndEvt__SsPlayer_Title_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtlCommandMenu_C_BndEvt__SsPlayer_Title_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_BtlCommandMenu_C_BndEvt__SsPlayer_Title_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_BtlCommandMenu_C_BndEvt__SsPlayer_Title_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_BtlCommandMenu_C_BndEvt__SsPlayer_Title_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_BtlCommandMenu_C_BndEvt__SsPlayer_Title_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_BtlCommandMenu_C_BndEvt__SsPlayer_Title_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_BndEvt__SsPlayer_Title_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_BtlCommandMenu_C_BndEvt__SsPlayer_Title_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_BndEvt__SsPlayer_Title_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_BtlCommandMenu_C_BndEvt__SsPlayer_Title_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_BndEvt__SsPlayer_Title_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_BtlCommandMenu_C_BndEvt__SsPlayer_Title_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_BtlCommandMenu.WB_BtlCommandMenu_C.BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_BtlCommandMenu_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtlCommandMenu_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_BtlCommandMenu_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_BtlCommandMenu_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_BtlCommandMenu_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_BtlCommandMenu_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_BtlCommandMenu_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_BtlCommandMenu_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_BtlCommandMenu_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_BtlCommandMenu_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_BtlCommandMenu.WB_BtlCommandMenu_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_BtlCommandMenu_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtlCommandMenu_C_Tick) == 0x000004, "Wrong alignment on WB_BtlCommandMenu_C_Tick");
static_assert(sizeof(WB_BtlCommandMenu_C_Tick) == 0x00003C, "Wrong size on WB_BtlCommandMenu_C_Tick");
static_assert(offsetof(WB_BtlCommandMenu_C_Tick, MyGeometry) == 0x000000, "Member 'WB_BtlCommandMenu_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_BtlCommandMenu_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_BtlCommandMenu.WB_BtlCommandMenu_C.CallTick
// 0x0004 (0x0004 - 0x0000)
struct WB_BtlCommandMenu_C_CallTick final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtlCommandMenu_C_CallTick) == 0x000004, "Wrong alignment on WB_BtlCommandMenu_C_CallTick");
static_assert(sizeof(WB_BtlCommandMenu_C_CallTick) == 0x000004, "Wrong size on WB_BtlCommandMenu_C_CallTick");
static_assert(offsetof(WB_BtlCommandMenu_C_CallTick, Delta) == 0x000000, "Member 'WB_BtlCommandMenu_C_CallTick::Delta' has a wrong offset!");

// Function WB_BtlCommandMenu.WB_BtlCommandMenu_C.AddMenu
// 0x0038 (0x0038 - 0x0000)
struct WB_BtlCommandMenu_C_AddMenu final
{
public:
	E_BTL_UI_COMMAND                              Menu;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Selectable;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BTL_UI_COMMAND                              Lo_Menu;                                           // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A98[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Lo_Selected;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_Normal;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A99[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtlCommandMenuPart_C*               Lo_Part;                                           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Lo_Selectable;                                     // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A9A[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtlCommandMenuPart_C*               CallFunc_Map_Find_Value;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A9B[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtlCommandMenu_C_AddMenu) == 0x000008, "Wrong alignment on WB_BtlCommandMenu_C_AddMenu");
static_assert(sizeof(WB_BtlCommandMenu_C_AddMenu) == 0x000038, "Wrong size on WB_BtlCommandMenu_C_AddMenu");
static_assert(offsetof(WB_BtlCommandMenu_C_AddMenu, Menu) == 0x000000, "Member 'WB_BtlCommandMenu_C_AddMenu::Menu' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_AddMenu, Selectable) == 0x000001, "Member 'WB_BtlCommandMenu_C_AddMenu::Selectable' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_AddMenu, Lo_Menu) == 0x000002, "Member 'WB_BtlCommandMenu_C_AddMenu::Lo_Menu' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_AddMenu, Lo_Selected) == 0x000004, "Member 'WB_BtlCommandMenu_C_AddMenu::Lo_Selected' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_AddMenu, Lo_Normal) == 0x000008, "Member 'WB_BtlCommandMenu_C_AddMenu::Lo_Normal' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_AddMenu, Lo_Part) == 0x000010, "Member 'WB_BtlCommandMenu_C_AddMenu::Lo_Part' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_AddMenu, Lo_Selectable) == 0x000018, "Member 'WB_BtlCommandMenu_C_AddMenu::Lo_Selectable' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_AddMenu, CallFunc_Map_Find_Value) == 0x000020, "Member 'WB_BtlCommandMenu_C_AddMenu::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_AddMenu, CallFunc_Map_Find_ReturnValue) == 0x000028, "Member 'WB_BtlCommandMenu_C_AddMenu::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_AddMenu, CallFunc_Array_Add_ReturnValue) == 0x00002C, "Member 'WB_BtlCommandMenu_C_AddMenu::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_AddMenu, CallFunc_AddChildToCanvas_ReturnValue) == 0x000030, "Member 'WB_BtlCommandMenu_C_AddMenu::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");

// Function WB_BtlCommandMenu.WB_BtlCommandMenu_C.DecidePos
// 0x0030 (0x0030 - 0x0000)
struct WB_BtlCommandMenu_C_DecidePos final
{
public:
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec_1;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec_2;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayByIndex_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlCommandMenu_C_DecidePos) == 0x000008, "Wrong alignment on WB_BtlCommandMenu_C_DecidePos");
static_assert(sizeof(WB_BtlCommandMenu_C_DecidePos) == 0x000030, "Wrong size on WB_BtlCommandMenu_C_DecidePos");
static_assert(offsetof(WB_BtlCommandMenu_C_DecidePos, CallFunc_GetSSPPositionDataByPartsName_OutVec) == 0x000000, "Member 'WB_BtlCommandMenu_C_DecidePos::CallFunc_GetSSPPositionDataByPartsName_OutVec' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_DecidePos, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000008, "Member 'WB_BtlCommandMenu_C_DecidePos::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_DecidePos, CallFunc_GetSSPPositionDataByPartsName_OutVec_1) == 0x000010, "Member 'WB_BtlCommandMenu_C_DecidePos::CallFunc_GetSSPPositionDataByPartsName_OutVec_1' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_DecidePos, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000018, "Member 'WB_BtlCommandMenu_C_DecidePos::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_DecidePos, CallFunc_GetSSPPositionDataByPartsName_OutVec_2) == 0x000020, "Member 'WB_BtlCommandMenu_C_DecidePos::CallFunc_GetSSPPositionDataByPartsName_OutVec_2' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_DecidePos, CallFunc_PlayByIndex_ReturnValue) == 0x000028, "Member 'WB_BtlCommandMenu_C_DecidePos::CallFunc_PlayByIndex_ReturnValue' has a wrong offset!");

// Function WB_BtlCommandMenu.WB_BtlCommandMenu_C.PlayTitleAnim
// 0x0010 (0x0010 - 0x0000)
struct WB_BtlCommandMenu_C_PlayTitleAnim final
{
public:
	int32                                         AnimIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoop;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A9C[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayByIndex_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlCommandMenu_C_PlayTitleAnim) == 0x000004, "Wrong alignment on WB_BtlCommandMenu_C_PlayTitleAnim");
static_assert(sizeof(WB_BtlCommandMenu_C_PlayTitleAnim) == 0x000010, "Wrong size on WB_BtlCommandMenu_C_PlayTitleAnim");
static_assert(offsetof(WB_BtlCommandMenu_C_PlayTitleAnim, AnimIndex) == 0x000000, "Member 'WB_BtlCommandMenu_C_PlayTitleAnim::AnimIndex' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_PlayTitleAnim, IsLoop) == 0x000004, "Member 'WB_BtlCommandMenu_C_PlayTitleAnim::IsLoop' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_PlayTitleAnim, CallFunc_SelectInt_ReturnValue) == 0x000008, "Member 'WB_BtlCommandMenu_C_PlayTitleAnim::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_PlayTitleAnim, CallFunc_PlayByIndex_ReturnValue) == 0x00000C, "Member 'WB_BtlCommandMenu_C_PlayTitleAnim::CallFunc_PlayByIndex_ReturnValue' has a wrong offset!");

// Function WB_BtlCommandMenu.WB_BtlCommandMenu_C.PlayBG Anim
// 0x0010 (0x0010 - 0x0000)
struct WB_BtlCommandMenu_C_PlayBG_Anim final
{
public:
	int32                                         AnimIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoop;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A9D[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayByIndex_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlCommandMenu_C_PlayBG_Anim) == 0x000004, "Wrong alignment on WB_BtlCommandMenu_C_PlayBG_Anim");
static_assert(sizeof(WB_BtlCommandMenu_C_PlayBG_Anim) == 0x000010, "Wrong size on WB_BtlCommandMenu_C_PlayBG_Anim");
static_assert(offsetof(WB_BtlCommandMenu_C_PlayBG_Anim, AnimIndex) == 0x000000, "Member 'WB_BtlCommandMenu_C_PlayBG_Anim::AnimIndex' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_PlayBG_Anim, IsLoop) == 0x000004, "Member 'WB_BtlCommandMenu_C_PlayBG_Anim::IsLoop' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_PlayBG_Anim, CallFunc_SelectInt_ReturnValue) == 0x000008, "Member 'WB_BtlCommandMenu_C_PlayBG_Anim::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_PlayBG_Anim, CallFunc_PlayByIndex_ReturnValue) == 0x00000C, "Member 'WB_BtlCommandMenu_C_PlayBG_Anim::CallFunc_PlayByIndex_ReturnValue' has a wrong offset!");

// Function WB_BtlCommandMenu.WB_BtlCommandMenu_C.PlayCursorAnim
// 0x0010 (0x0010 - 0x0000)
struct WB_BtlCommandMenu_C_PlayCursorAnim final
{
public:
	int32                                         AnimIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoop;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A9E[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayByIndex_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlCommandMenu_C_PlayCursorAnim) == 0x000004, "Wrong alignment on WB_BtlCommandMenu_C_PlayCursorAnim");
static_assert(sizeof(WB_BtlCommandMenu_C_PlayCursorAnim) == 0x000010, "Wrong size on WB_BtlCommandMenu_C_PlayCursorAnim");
static_assert(offsetof(WB_BtlCommandMenu_C_PlayCursorAnim, AnimIndex) == 0x000000, "Member 'WB_BtlCommandMenu_C_PlayCursorAnim::AnimIndex' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_PlayCursorAnim, IsLoop) == 0x000004, "Member 'WB_BtlCommandMenu_C_PlayCursorAnim::IsLoop' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_PlayCursorAnim, CallFunc_SelectInt_ReturnValue) == 0x000008, "Member 'WB_BtlCommandMenu_C_PlayCursorAnim::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_PlayCursorAnim, CallFunc_PlayByIndex_ReturnValue) == 0x00000C, "Member 'WB_BtlCommandMenu_C_PlayCursorAnim::CallFunc_PlayByIndex_ReturnValue' has a wrong offset!");

// Function WB_BtlCommandMenu.WB_BtlCommandMenu_C.SlideOut
// 0x0020 (0x0020 - 0x0000)
struct WB_BtlCommandMenu_C_SlideOut final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A9F[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtlCommandMenuPart_C*               CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlCommandMenu_C_SlideOut) == 0x000008, "Wrong alignment on WB_BtlCommandMenu_C_SlideOut");
static_assert(sizeof(WB_BtlCommandMenu_C_SlideOut) == 0x000020, "Wrong size on WB_BtlCommandMenu_C_SlideOut");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideOut, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WB_BtlCommandMenu_C_SlideOut::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideOut, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WB_BtlCommandMenu_C_SlideOut::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideOut, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WB_BtlCommandMenu_C_SlideOut::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideOut, CallFunc_Array_Get_Item) == 0x000010, "Member 'WB_BtlCommandMenu_C_SlideOut::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideOut, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WB_BtlCommandMenu_C_SlideOut::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideOut, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WB_BtlCommandMenu_C_SlideOut::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideOut, CallFunc_BooleanAND_ReturnValue) == 0x00001D, "Member 'WB_BtlCommandMenu_C_SlideOut::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WB_BtlCommandMenu.WB_BtlCommandMenu_C.SlideIn
// 0x0058 (0x0058 - 0x0000)
struct WB_BtlCommandMenu_C_SlideIn final
{
public:
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AA0[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AA1[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5AA2[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtlCommandMenuPart_C*               CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_BtlCommandMenuPart_C*               CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AA3[0x2];                                     // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlCommandMenu_C_SlideIn) == 0x000008, "Wrong alignment on WB_BtlCommandMenu_C_SlideIn");
static_assert(sizeof(WB_BtlCommandMenu_C_SlideIn) == 0x000058, "Wrong size on WB_BtlCommandMenu_C_SlideIn");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideIn, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000000, "Member 'WB_BtlCommandMenu_C_SlideIn::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideIn, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000004, "Member 'WB_BtlCommandMenu_C_SlideIn::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideIn, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WB_BtlCommandMenu_C_SlideIn::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideIn, CallFunc_SelectInt_ReturnValue) == 0x00000C, "Member 'WB_BtlCommandMenu_C_SlideIn::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideIn, CallFunc_Multiply_IntInt_ReturnValue) == 0x000010, "Member 'WB_BtlCommandMenu_C_SlideIn::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideIn, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WB_BtlCommandMenu_C_SlideIn::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideIn, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WB_BtlCommandMenu_C_SlideIn::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideIn, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'WB_BtlCommandMenu_C_SlideIn::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideIn, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WB_BtlCommandMenu_C_SlideIn::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideIn, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'WB_BtlCommandMenu_C_SlideIn::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideIn, CallFunc_Array_Get_Item) == 0x000038, "Member 'WB_BtlCommandMenu_C_SlideIn::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideIn, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'WB_BtlCommandMenu_C_SlideIn::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideIn, CallFunc_BooleanAND_ReturnValue) == 0x000048, "Member 'WB_BtlCommandMenu_C_SlideIn::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideIn, CallFunc_BooleanAND_ReturnValue_1) == 0x000049, "Member 'WB_BtlCommandMenu_C_SlideIn::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideIn, CallFunc_Array_Length_ReturnValue_1) == 0x00004C, "Member 'WB_BtlCommandMenu_C_SlideIn::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_SlideIn, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WB_BtlCommandMenu_C_SlideIn::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_BtlCommandMenu.WB_BtlCommandMenu_C.CursorCtrl
// 0x0038 (0x0038 - 0x0000)
struct WB_BtlCommandMenu_C_CursorCtrl final
{
public:
	int32                                         Direction;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CursorMoved;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAllSlideInFinished_Finished;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AA4[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtlCommandMenuPart_C*               CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFinishSlideIn_isFinished;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AA5[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AA6[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlCommandMenu_C_CursorCtrl) == 0x000008, "Wrong alignment on WB_BtlCommandMenu_C_CursorCtrl");
static_assert(sizeof(WB_BtlCommandMenu_C_CursorCtrl) == 0x000038, "Wrong size on WB_BtlCommandMenu_C_CursorCtrl");
static_assert(offsetof(WB_BtlCommandMenu_C_CursorCtrl, Direction) == 0x000000, "Member 'WB_BtlCommandMenu_C_CursorCtrl::Direction' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_CursorCtrl, CursorMoved) == 0x000004, "Member 'WB_BtlCommandMenu_C_CursorCtrl::CursorMoved' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_CursorCtrl, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000005, "Member 'WB_BtlCommandMenu_C_CursorCtrl::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_CursorCtrl, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000006, "Member 'WB_BtlCommandMenu_C_CursorCtrl::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_CursorCtrl, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000007, "Member 'WB_BtlCommandMenu_C_CursorCtrl::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_CursorCtrl, CallFunc_IsAllSlideInFinished_Finished) == 0x000008, "Member 'WB_BtlCommandMenu_C_CursorCtrl::CallFunc_IsAllSlideInFinished_Finished' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_CursorCtrl, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'WB_BtlCommandMenu_C_CursorCtrl::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_CursorCtrl, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'WB_BtlCommandMenu_C_CursorCtrl::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_CursorCtrl, CallFunc_Array_Get_Item) == 0x000010, "Member 'WB_BtlCommandMenu_C_CursorCtrl::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_CursorCtrl, CallFunc_IsFinishSlideIn_isFinished) == 0x000018, "Member 'WB_BtlCommandMenu_C_CursorCtrl::CallFunc_IsFinishSlideIn_isFinished' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_CursorCtrl, CallFunc_SelectInt_ReturnValue) == 0x00001C, "Member 'WB_BtlCommandMenu_C_CursorCtrl::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_CursorCtrl, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000020, "Member 'WB_BtlCommandMenu_C_CursorCtrl::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_CursorCtrl, CallFunc_Array_LastIndex_ReturnValue) == 0x000024, "Member 'WB_BtlCommandMenu_C_CursorCtrl::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_CursorCtrl, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WB_BtlCommandMenu_C_CursorCtrl::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_CursorCtrl, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x00002C, "Member 'WB_BtlCommandMenu_C_CursorCtrl::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_CursorCtrl, CallFunc_Greater_IntInt_ReturnValue) == 0x00002D, "Member 'WB_BtlCommandMenu_C_CursorCtrl::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_CursorCtrl, CallFunc_Less_IntInt_ReturnValue) == 0x00002E, "Member 'WB_BtlCommandMenu_C_CursorCtrl::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_CursorCtrl, CallFunc_BooleanAND_ReturnValue_1) == 0x00002F, "Member 'WB_BtlCommandMenu_C_CursorCtrl::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_CursorCtrl, CallFunc_BooleanAND_ReturnValue_2) == 0x000030, "Member 'WB_BtlCommandMenu_C_CursorCtrl::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_CursorCtrl, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x000031, "Member 'WB_BtlCommandMenu_C_CursorCtrl::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_CursorCtrl, CallFunc_BooleanOR_ReturnValue) == 0x000032, "Member 'WB_BtlCommandMenu_C_CursorCtrl::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WB_BtlCommandMenu.WB_BtlCommandMenu_C.DecideCursor
// 0x0058 (0x0058 - 0x0000)
struct WB_BtlCommandMenu_C_DecideCursor final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AA7[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AA8[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtlCommandMenuPart_C*               CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AA9[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtlCommandMenu_C_DecideCursor) == 0x000008, "Wrong alignment on WB_BtlCommandMenu_C_DecideCursor");
static_assert(sizeof(WB_BtlCommandMenu_C_DecideCursor) == 0x000058, "Wrong size on WB_BtlCommandMenu_C_DecideCursor");
static_assert(offsetof(WB_BtlCommandMenu_C_DecideCursor, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WB_BtlCommandMenu_C_DecideCursor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_DecideCursor, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WB_BtlCommandMenu_C_DecideCursor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_DecideCursor, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WB_BtlCommandMenu_C_DecideCursor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_DecideCursor, CallFunc_Array_LastIndex_ReturnValue) == 0x00000C, "Member 'WB_BtlCommandMenu_C_DecideCursor::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_DecideCursor, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'WB_BtlCommandMenu_C_DecideCursor::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_DecideCursor, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'WB_BtlCommandMenu_C_DecideCursor::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_DecideCursor, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000018, "Member 'WB_BtlCommandMenu_C_DecideCursor::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_DecideCursor, CallFunc_MakeVector2D_ReturnValue) == 0x00001C, "Member 'WB_BtlCommandMenu_C_DecideCursor::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlCommandMenu_C_DecideCursor, CallFunc_Array_Get_Item) == 0x000028, "Member 'WB_BtlCommandMenu_C_DecideCursor::CallFunc_Array_Get_Item' has a wrong offset!");
