#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BtnHelp_ActionMappingIcon

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.OnClicked_KeyboardIcon__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_OnClicked_KeyboardIcon__DelegateSignature final
{
public:
	E_BTN_HELP_MAPPING_KEY_TYPE                   OnClickedHelpType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63FD[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OnClickedHelpIdx;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_OnClicked_KeyboardIcon__DelegateSignature) == 0x000004, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_OnClicked_KeyboardIcon__DelegateSignature");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_OnClicked_KeyboardIcon__DelegateSignature) == 0x000008, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_OnClicked_KeyboardIcon__DelegateSignature");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_OnClicked_KeyboardIcon__DelegateSignature, OnClickedHelpType) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_OnClicked_KeyboardIcon__DelegateSignature::OnClickedHelpType' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_OnClicked_KeyboardIcon__DelegateSignature, OnClickedHelpIdx) == 0x000004, "Member 'WB_BtnHelp_ActionMappingIcon_C_OnClicked_KeyboardIcon__DelegateSignature::OnClickedHelpIdx' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.OnReleased_KeyboardIcon__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_OnReleased_KeyboardIcon__DelegateSignature final
{
public:
	E_BTN_HELP_MAPPING_KEY_TYPE                   OnClickedHelpType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63FE[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OnClickedHelpIdx;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_OnReleased_KeyboardIcon__DelegateSignature) == 0x000004, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_OnReleased_KeyboardIcon__DelegateSignature");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_OnReleased_KeyboardIcon__DelegateSignature) == 0x000008, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_OnReleased_KeyboardIcon__DelegateSignature");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_OnReleased_KeyboardIcon__DelegateSignature, OnClickedHelpType) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_OnReleased_KeyboardIcon__DelegateSignature::OnClickedHelpType' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_OnReleased_KeyboardIcon__DelegateSignature, OnClickedHelpIdx) == 0x000004, "Member 'WB_BtnHelp_ActionMappingIcon_C_OnReleased_KeyboardIcon__DelegateSignature::OnClickedHelpIdx' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon
// 0x0060 (0x0060 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckGamePadUI_Gamepad;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63FF[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_InColor;                              // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsActive;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BTN_ICON_SIZE                               K2Node_Event_InIconSize;                           // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsGamePad;                            // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BTN_HELP_MAPPING_KEY_TYPE                   K2Node_Event_InIconMappingType;                    // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_InTranslation;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(E_BTN_HELP_MAPPING_KEY_TYPE OnClickedHelpType, int32 OnClickedHelpIdx)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UWB_MouseAndKeyboardIcon_C*             CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6400[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(E_BTN_HELP_MAPPING_KEY_TYPE OnClickedHelpType, int32 OnClickedHelpIdx)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon) == 0x000008, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon) == 0x000060, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon, EntryPoint) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon, CallFunc_CheckGamePadUI_Gamepad) == 0x000011, "Member 'WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon::CallFunc_CheckGamePadUI_Gamepad' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon, K2Node_Event_InColor) == 0x000014, "Member 'WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon::K2Node_Event_InColor' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon, K2Node_Event_IsActive) == 0x000024, "Member 'WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon::K2Node_Event_IsActive' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon, K2Node_Event_InIconSize) == 0x000025, "Member 'WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon::K2Node_Event_InIconSize' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon, K2Node_Event_IsGamePad) == 0x000026, "Member 'WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon::K2Node_Event_IsGamePad' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon, K2Node_Event_InIconMappingType) == 0x000027, "Member 'WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon::K2Node_Event_InIconMappingType' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon, K2Node_Event_InTranslation) == 0x000028, "Member 'WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon::K2Node_Event_InTranslation' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon, CallFunc_Array_Get_Item) == 0x000040, "Member 'WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon, K2Node_CreateDelegate_OutputDelegate_1) == 0x000050, "Member 'WB_BtnHelp_ActionMappingIcon_C_ExecuteUbergraph_WB_BtnHelp_ActionMappingIcon::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.SetIconTranslation
// 0x0008 (0x0008 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_SetIconTranslation final
{
public:
	struct FVector2D                              InTranslation;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_SetIconTranslation) == 0x000004, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_SetIconTranslation");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_SetIconTranslation) == 0x000008, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_SetIconTranslation");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetIconTranslation, InTranslation) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetIconTranslation::InTranslation' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.SetIconInfo
// 0x0001 (0x0001 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_SetIconInfo final
{
public:
	E_BTN_HELP_MAPPING_KEY_TYPE                   InIconMappingType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_SetIconInfo) == 0x000001, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_SetIconInfo");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_SetIconInfo) == 0x000001, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_SetIconInfo");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetIconInfo, InIconMappingType) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetIconInfo::InIconMappingType' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.SetIconDispMode
// 0x0001 (0x0001 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_SetIconDispMode final
{
public:
	bool                                          IsGamePad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_SetIconDispMode) == 0x000001, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_SetIconDispMode");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_SetIconDispMode) == 0x000001, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_SetIconDispMode");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetIconDispMode, IsGamePad) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetIconDispMode::IsGamePad' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.SetIconSize
// 0x0001 (0x0001 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_SetIconSize final
{
public:
	E_BTN_ICON_SIZE                               InIconSize;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_SetIconSize) == 0x000001, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_SetIconSize");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_SetIconSize) == 0x000001, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_SetIconSize");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetIconSize, InIconSize) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetIconSize::InIconSize' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.SetIconColor_ByActiveState
// 0x0001 (0x0001 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_SetIconColor_ByActiveState final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_SetIconColor_ByActiveState) == 0x000001, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_SetIconColor_ByActiveState");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_SetIconColor_ByActiveState) == 0x000001, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_SetIconColor_ByActiveState");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetIconColor_ByActiveState, IsActive) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetIconColor_ByActiveState::IsActive' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.SetIconColor
// 0x0010 (0x0010 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_SetIconColor final
{
public:
	struct FLinearColor                           InColor;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_SetIconColor) == 0x000004, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_SetIconColor");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_SetIconColor) == 0x000010, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_SetIconColor");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetIconColor, InColor) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetIconColor::InColor' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_PreConstruct final
{
public:
	bool                                          Param_IsDesignTime;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_PreConstruct) == 0x000001, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_PreConstruct");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_PreConstruct) == 0x000001, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_PreConstruct");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_PreConstruct, Param_IsDesignTime) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_PreConstruct::Param_IsDesignTime' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.Init
// 0x0050 (0x0050 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_Init final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(E_BTN_HELP_MAPPING_KEY_TYPE OnClickedHelpType, int32 OnClickedHelpIdx)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(E_BTN_HELP_MAPPING_KEY_TYPE OnClickedHelpType, int32 OnClickedHelpIdx)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6401[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_MouseAndKeyboardIcon_C*             CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6402[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_MouseAndKeyboardIcon_C*>     K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_Init) == 0x000008, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_Init");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_Init) == 0x000050, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_Init");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_Init, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_Init::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_Init, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WB_BtnHelp_ActionMappingIcon_C_Init::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_Init, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WB_BtnHelp_ActionMappingIcon_C_Init::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_Init, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WB_BtnHelp_ActionMappingIcon_C_Init::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_Init, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'WB_BtnHelp_ActionMappingIcon_C_Init::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_Init, CallFunc_Array_Get_Item) == 0x000030, "Member 'WB_BtnHelp_ActionMappingIcon_C_Init::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_Init, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WB_BtnHelp_ActionMappingIcon_C_Init::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_Init, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WB_BtnHelp_ActionMappingIcon_C_Init::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_Init, K2Node_MakeArray_Array) == 0x000040, "Member 'WB_BtnHelp_ActionMappingIcon_C_Init::K2Node_MakeArray_Array' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.SetSize
// 0x0020 (0x0020 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_SetSize final
{
public:
	E_BTN_ICON_SIZE                               InSIze2;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6403[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_MouseAndKeyboardIcon_C*             CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_SetSize) == 0x000008, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_SetSize");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_SetSize) == 0x000020, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_SetSize");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetSize, InSIze2) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetSize::InSIze2' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetSize, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetSize::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetSize, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetSize::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetSize, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetSize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetSize, CallFunc_Array_Get_Item) == 0x000010, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetSize::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetSize, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetSize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetSize, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetSize::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.SetTranslation
// 0x0008 (0x0008 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_SetTranslation final
{
public:
	struct FVector2D                              InTranslation;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_SetTranslation) == 0x000004, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_SetTranslation");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_SetTranslation) == 0x000008, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_SetTranslation");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetTranslation, InTranslation) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetTranslation::InTranslation' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.SetInfo
// 0x0001 (0x0001 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_SetInfo final
{
public:
	E_BTN_HELP_MAPPING_KEY_TYPE                   InHelpMappingType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_SetInfo) == 0x000001, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_SetInfo");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_SetInfo) == 0x000001, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_SetInfo");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetInfo, InHelpMappingType) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetInfo::InHelpMappingType' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.SetColor
// 0x0030 (0x0030 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_SetColor final
{
public:
	struct FLinearColor                           InColor;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6404[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_MouseAndKeyboardIcon_C*             CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_SetColor) == 0x000008, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_SetColor");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_SetColor) == 0x000030, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_SetColor");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetColor, InColor) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetColor::InColor' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetColor, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetColor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetColor, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetColor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetColor, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetColor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetColor, CallFunc_Array_Get_Item) == 0x000020, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetColor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetColor, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetColor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetColor, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetColor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.SetColor_ByActiveState
// 0x0034 (0x0034 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_SetColor_ByActiveState final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6405[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_SetColor_ByActiveState) == 0x000004, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_SetColor_ByActiveState");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_SetColor_ByActiveState) == 0x000034, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_SetColor_ByActiveState");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetColor_ByActiveState, IsActive) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetColor_ByActiveState::IsActive' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetColor_ByActiveState, Temp_bool_Variable) == 0x000001, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetColor_ByActiveState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetColor_ByActiveState, Temp_struct_Variable) == 0x000004, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetColor_ByActiveState::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetColor_ByActiveState, Temp_struct_Variable_1) == 0x000014, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetColor_ByActiveState::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetColor_ByActiveState, K2Node_Select_Default) == 0x000024, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetColor_ByActiveState::K2Node_Select_Default' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.SetDispMode
// 0x0003 (0x0003 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_SetDispMode final
{
public:
	bool                                          IsGamePad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetBtnHelpInitIconMode_ReturnValue;       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetBtnHelpIconModeTick_ReturnValue;       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_SetDispMode) == 0x000001, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_SetDispMode");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_SetDispMode) == 0x000003, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_SetDispMode");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetDispMode, IsGamePad) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetDispMode::IsGamePad' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetDispMode, CallFunc_GetBtnHelpInitIconMode_ReturnValue) == 0x000001, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetDispMode::CallFunc_GetBtnHelpInitIconMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_SetDispMode, CallFunc_GetBtnHelpIconModeTick_ReturnValue) == 0x000002, "Member 'WB_BtnHelp_ActionMappingIcon_C_SetDispMode::CallFunc_GetBtnHelpIconModeTick_ReturnValue' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.GetIconDispMode
// 0x0001 (0x0001 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_GetIconDispMode final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_GetIconDispMode) == 0x000001, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_GetIconDispMode");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_GetIconDispMode) == 0x000001, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_GetIconDispMode");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetIconDispMode, ReturnValue) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetIconDispMode::ReturnValue' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.GetKeyboardIconSsPlayerFrame
// 0x0060 (0x0060 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame final
{
public:
	TArray<int32>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	int32                                         L_LoopIdx;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6406[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 L_AnimFrame;                                       // 0x0018(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6407[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_MouseAndKeyboardIcon_C*             CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_MouseAndKeyboardIcon_C*             CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6408[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetKeyboardIconSsPlayerFrame_KeyboardText; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6409[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame) == 0x000008, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame) == 0x000060, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame, ReturnValue) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame, L_LoopIdx) == 0x000010, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame::L_LoopIdx' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame, L_AnimFrame) == 0x000018, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame::L_AnimFrame' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame, Temp_int_Array_Index_Variable) == 0x000028, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame, CallFunc_Array_Get_Item) == 0x000038, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame, CallFunc_GetVisibility_ReturnValue) == 0x000048, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame, CallFunc_GetKeyboardIconSsPlayerFrame_KeyboardText) == 0x00004C, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame::CallFunc_GetKeyboardIconSsPlayerFrame_KeyboardText' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000050, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame, CallFunc_Array_Add_ReturnValue) == 0x000054, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconSsPlayerFrame::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.GetKeyboardIconText
// 0x0088 (0x0088 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	TArray<class FString>                         L_RetText;                                         // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         L_LoopIdx;                                         // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_MouseAndKeyboardIcon_C*             CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_MouseAndKeyboardIcon_C*             CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_640A[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetKeyText_KeyboardText;                  // 0x0048(0x0018)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_640B[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText) == 0x000008, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText) == 0x000088, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText, ReturnValue) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText, L_RetText) == 0x000010, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText::L_RetText' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText, L_LoopIdx) == 0x000020, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText::L_LoopIdx' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText, Temp_int_Array_Index_Variable) == 0x000024, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText, CallFunc_Array_Get_Item) == 0x000030, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText, CallFunc_GetVisibility_ReturnValue) == 0x000040, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText, CallFunc_GetKeyText_KeyboardText) == 0x000048, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText::CallFunc_GetKeyText_KeyboardText' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000060, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText, CallFunc_Conv_TextToString_ReturnValue) == 0x000068, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText, CallFunc_Array_Add_ReturnValue) == 0x000078, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconText::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.GetKeyboardIconFont
// 0x00B0 (0x00B0 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconFont final
{
public:
	struct FSlateFontInfo                         ReturnValue;                                       // 0x0000(0x0058)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	struct FSlateFontInfo                         CallFunc_GetKeyTextFont_Font;                      // 0x0058(0x0058)(HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconFont) == 0x000008, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconFont");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconFont) == 0x0000B0, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconFont");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconFont, ReturnValue) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconFont::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconFont, CallFunc_GetKeyTextFont_Font) == 0x000058, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconFont::CallFunc_GetKeyTextFont_Font' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.GetKeyboardIconDispNum
// 0x0038 (0x0038 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_RetVal;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_640C[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_MouseAndKeyboardIcon_C*             CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_640D[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum) == 0x000008, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum) == 0x000038, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum, ReturnValue) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum, L_RetVal) == 0x000004, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum::L_RetVal' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum, Temp_int_Variable) == 0x000018, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum, CallFunc_Array_Get_Item) == 0x000020, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum, CallFunc_GetVisibility_ReturnValue) == 0x000028, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000029, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WB_BtnHelp_ActionMappingIcon_C_GetKeyboardIconDispNum::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.ReloadPadIcon
// 0x0018 (0x0018 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_ReloadPadIcon final
{
public:
	TArray<struct FKey>                           L_DispKeyList;                                     // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         L_LoopIdx;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelp_ActionMappingIcon_C_ReloadPadIcon) == 0x000008, "Wrong alignment on WB_BtnHelp_ActionMappingIcon_C_ReloadPadIcon");
static_assert(sizeof(WB_BtnHelp_ActionMappingIcon_C_ReloadPadIcon) == 0x000018, "Wrong size on WB_BtnHelp_ActionMappingIcon_C_ReloadPadIcon");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_ReloadPadIcon, L_DispKeyList) == 0x000000, "Member 'WB_BtnHelp_ActionMappingIcon_C_ReloadPadIcon::L_DispKeyList' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp_ActionMappingIcon_C_ReloadPadIcon, L_LoopIdx) == 0x000010, "Member 'WB_BtnHelp_ActionMappingIcon_C_ReloadPadIcon::L_LoopIdx' has a wrong offset!");

// Function WB_BtnHelp_ActionMappingIcon.WB_BtnHelp_ActionMappingIcon_C.ReloadKeyboardText
// 0x0060 (0x0060 - 0x0000)
struct WB_BtnHelp_ActionMappingIcon_C_ReloadKeyboardText final
{
public:
	TArray<struct FKey>                           L_DispKeyList;                                     // 0x0000(0x0010)(Edit, BlueprintVisible)
