#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BtlUtilIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Project_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_BtlUtilIcon.WB_BtlUtilIcon_C
// 0x0038 (0x0298 - 0x0260)
class UWB_BtlUtilIcon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USsPlayerWidget*                        SsPlayer_Indicator;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          M_IsDraw;                                          // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B23[0x3];                                     // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         M_Life;                                            // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         M_Time;                                            // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          M_TickEnable;                                      // 0x027C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B24[0x3];                                     // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         M_PlayRate;                                        // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTL_UTIL_ICON_TYPE                          M_IconType;                                        // 0x0284(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          M_IsAppeared;                                      // 0x0285(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B25[0x2];                                     // 0x0286(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnDisappearFinished;                               // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnDisappearFinished__DelegateSignature();
	void ExecuteUbergraph_WB_BtlUtilIcon(int32 EntryPoint);
	void CallTick(float Delta);
	void Construct();
	void Disappear(float Rate, bool Immediately);
	void Appear(float Rate, bool Immediately);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void InitDisappeared();
	void BndEvt__SsPlayer_Indicator_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void Show(E_BTL_UTIL_ICON_TYPE Type, float Life, float PlayRate);
	void IsFinished(bool* RetValue);
	void PlayIndicatorAnim(E_BTL_UTIL_ICON_TYPE IconType, int32 AnimIndex, bool IsLoop, float Rate);
	void SetIconType(E_BTL_UTIL_ICON_TYPE IconType);
	void Hide();
	void IsDisappeared(bool* Param_IsDisappeared);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_BtlUtilIcon_C">();
	}
	static class UWB_BtlUtilIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_BtlUtilIcon_C>();
	}
};
static_assert(alignof(UWB_BtlUtilIcon_C) == 0x000008, "Wrong alignment on UWB_BtlUtilIcon_C");
static_assert(sizeof(UWB_BtlUtilIcon_C) == 0x000298, "Wrong size on UWB_BtlUtilIcon_C");
static_assert(offsetof(UWB_BtlUtilIcon_C, UberGraphFrame) == 0x000260, "Member 'UWB_BtlUtilIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_BtlUtilIcon_C, SsPlayer_Indicator) == 0x000268, "Member 'UWB_BtlUtilIcon_C::SsPlayer_Indicator' has a wrong offset!");
static_assert(offsetof(UWB_BtlUtilIcon_C, M_IsDraw) == 0x000270, "Member 'UWB_BtlUtilIcon_C::M_IsDraw' has a wrong offset!");
static_assert(offsetof(UWB_BtlUtilIcon_C, M_Life) == 0x000274, "Member 'UWB_BtlUtilIcon_C::M_Life' has a wrong offset!");
static_assert(offsetof(UWB_BtlUtilIcon_C, M_Time) == 0x000278, "Member 'UWB_BtlUtilIcon_C::M_Time' has a wrong offset!");
static_assert(offsetof(UWB_BtlUtilIcon_C, M_TickEnable) == 0x00027C, "Member 'UWB_BtlUtilIcon_C::M_TickEnable' has a wrong offset!");
static_assert(offsetof(UWB_BtlUtilIcon_C, M_PlayRate) == 0x000280, "Member 'UWB_BtlUtilIcon_C::M_PlayRate' has a wrong offset!");
static_assert(offsetof(UWB_BtlUtilIcon_C, M_IconType) == 0x000284, "Member 'UWB_BtlUtilIcon_C::M_IconType' has a wrong offset!");
static_assert(offsetof(UWB_BtlUtilIcon_C, M_IsAppeared) == 0x000285, "Member 'UWB_BtlUtilIcon_C::M_IsAppeared' has a wrong offset!");
static_assert(offsetof(UWB_BtlUtilIcon_C, OnDisappearFinished) == 0x000288, "Member 'UWB_BtlUtilIcon_C::OnDisappearFinished' has a wrong offset!");

}

