#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BtnHelp2

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"


namespace SDK::Params
{

// Function WB_BtnHelp2.WB_BtnHelp2_C.ExecuteUbergraph_WB_BtnHelp2
// 0x0044 (0x0044 - 0x0000)
struct WB_BtnHelp2_C_ExecuteUbergraph_WB_BtnHelp2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63A3[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelp2_C_ExecuteUbergraph_WB_BtnHelp2) == 0x000004, "Wrong alignment on WB_BtnHelp2_C_ExecuteUbergraph_WB_BtnHelp2");
static_assert(sizeof(WB_BtnHelp2_C_ExecuteUbergraph_WB_BtnHelp2) == 0x000044, "Wrong size on WB_BtnHelp2_C_ExecuteUbergraph_WB_BtnHelp2");
static_assert(offsetof(WB_BtnHelp2_C_ExecuteUbergraph_WB_BtnHelp2, EntryPoint) == 0x000000, "Member 'WB_BtnHelp2_C_ExecuteUbergraph_WB_BtnHelp2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_ExecuteUbergraph_WB_BtnHelp2, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WB_BtnHelp2_C_ExecuteUbergraph_WB_BtnHelp2::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_ExecuteUbergraph_WB_BtnHelp2, K2Node_Event_MyGeometry) == 0x000008, "Member 'WB_BtnHelp2_C_ExecuteUbergraph_WB_BtnHelp2::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_ExecuteUbergraph_WB_BtnHelp2, K2Node_Event_InDeltaTime) == 0x000040, "Member 'WB_BtnHelp2_C_ExecuteUbergraph_WB_BtnHelp2::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function WB_BtnHelp2.WB_BtnHelp2_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_BtnHelp2_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelp2_C_Tick) == 0x000004, "Wrong alignment on WB_BtnHelp2_C_Tick");
static_assert(sizeof(WB_BtnHelp2_C_Tick) == 0x00003C, "Wrong size on WB_BtnHelp2_C_Tick");
static_assert(offsetof(WB_BtnHelp2_C_Tick, MyGeometry) == 0x000000, "Member 'WB_BtnHelp2_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_BtnHelp2_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_BtnHelp2.WB_BtnHelp2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_BtnHelp2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp2_C_PreConstruct) == 0x000001, "Wrong alignment on WB_BtnHelp2_C_PreConstruct");
static_assert(sizeof(WB_BtnHelp2_C_PreConstruct) == 0x000001, "Wrong size on WB_BtnHelp2_C_PreConstruct");
static_assert(offsetof(WB_BtnHelp2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_BtnHelp2_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_BtnHelp2.WB_BtnHelp2_C.ResetPartsParam
// 0x0020 (0x0020 - 0x0000)
struct WB_BtnHelp2_C_ResetPartsParam final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63A4[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtnHelpSlot2_C*                     CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp2_C_ResetPartsParam) == 0x000008, "Wrong alignment on WB_BtnHelp2_C_ResetPartsParam");
static_assert(sizeof(WB_BtnHelp2_C_ResetPartsParam) == 0x000020, "Wrong size on WB_BtnHelp2_C_ResetPartsParam");
static_assert(offsetof(WB_BtnHelp2_C_ResetPartsParam, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WB_BtnHelp2_C_ResetPartsParam::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_ResetPartsParam, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WB_BtnHelp2_C_ResetPartsParam::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_ResetPartsParam, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WB_BtnHelp2_C_ResetPartsParam::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_ResetPartsParam, CallFunc_Array_Get_Item) == 0x000010, "Member 'WB_BtnHelp2_C_ResetPartsParam::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_ResetPartsParam, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WB_BtnHelp2_C_ResetPartsParam::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_ResetPartsParam, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WB_BtnHelp2_C_ResetPartsParam::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_BtnHelp2.WB_BtnHelp2_C.PlayAnim_Setup
// 0x0001 (0x0001 - 0x0000)
struct WB_BtnHelp2_C_PlayAnim_Setup final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp2_C_PlayAnim_Setup) == 0x000001, "Wrong alignment on WB_BtnHelp2_C_PlayAnim_Setup");
static_assert(sizeof(WB_BtnHelp2_C_PlayAnim_Setup) == 0x000001, "Wrong size on WB_BtnHelp2_C_PlayAnim_Setup");
static_assert(offsetof(WB_BtnHelp2_C_PlayAnim_Setup, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_BtnHelp2_C_PlayAnim_Setup::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_BtnHelp2.WB_BtnHelp2_C.PlayAnim_In
// 0x0001 (0x0001 - 0x0000)
struct WB_BtnHelp2_C_PlayAnim_In final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp2_C_PlayAnim_In) == 0x000001, "Wrong alignment on WB_BtnHelp2_C_PlayAnim_In");
static_assert(sizeof(WB_BtnHelp2_C_PlayAnim_In) == 0x000001, "Wrong size on WB_BtnHelp2_C_PlayAnim_In");
static_assert(offsetof(WB_BtnHelp2_C_PlayAnim_In, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_BtnHelp2_C_PlayAnim_In::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_BtnHelp2.WB_BtnHelp2_C.PlayAnim_Out
// 0x0001 (0x0001 - 0x0000)
struct WB_BtnHelp2_C_PlayAnim_Out final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp2_C_PlayAnim_Out) == 0x000001, "Wrong alignment on WB_BtnHelp2_C_PlayAnim_Out");
static_assert(sizeof(WB_BtnHelp2_C_PlayAnim_Out) == 0x000001, "Wrong size on WB_BtnHelp2_C_PlayAnim_Out");
static_assert(offsetof(WB_BtnHelp2_C_PlayAnim_Out, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_BtnHelp2_C_PlayAnim_Out::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_BtnHelp2.WB_BtnHelp2_C.PlayAnim_Loop
// 0x0001 (0x0001 - 0x0000)
struct WB_BtnHelp2_C_PlayAnim_Loop final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp2_C_PlayAnim_Loop) == 0x000001, "Wrong alignment on WB_BtnHelp2_C_PlayAnim_Loop");
static_assert(sizeof(WB_BtnHelp2_C_PlayAnim_Loop) == 0x000001, "Wrong size on WB_BtnHelp2_C_PlayAnim_Loop");
static_assert(offsetof(WB_BtnHelp2_C_PlayAnim_Loop, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_BtnHelp2_C_PlayAnim_Loop::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_BtnHelp2.WB_BtnHelp2_C.SetHelpInfo
// 0x0048 (0x0048 - 0x0000)
struct WB_BtnHelp2_C_SetHelpInfo final
{
public:
	TArray<struct FBtnHelpInfo>                   InInfo;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector2D                              L_tmpSlotPos;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_SlotIdx;                                         // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63A5[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtnHelpSlot2_C*                     CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63A6[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtnHelpSlot2_C*                     CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp2_C_SetHelpInfo) == 0x000008, "Wrong alignment on WB_BtnHelp2_C_SetHelpInfo");
static_assert(sizeof(WB_BtnHelp2_C_SetHelpInfo) == 0x000048, "Wrong size on WB_BtnHelp2_C_SetHelpInfo");
static_assert(offsetof(WB_BtnHelp2_C_SetHelpInfo, InInfo) == 0x000000, "Member 'WB_BtnHelp2_C_SetHelpInfo::InInfo' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetHelpInfo, L_tmpSlotPos) == 0x000010, "Member 'WB_BtnHelp2_C_SetHelpInfo::L_tmpSlotPos' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetHelpInfo, L_SlotIdx) == 0x000018, "Member 'WB_BtnHelp2_C_SetHelpInfo::L_SlotIdx' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetHelpInfo, CallFunc_Array_Get_Item) == 0x000020, "Member 'WB_BtnHelp2_C_SetHelpInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetHelpInfo, Temp_int_Variable) == 0x000028, "Member 'WB_BtnHelp2_C_SetHelpInfo::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetHelpInfo, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WB_BtnHelp2_C_SetHelpInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetHelpInfo, CallFunc_Array_LastIndex_ReturnValue) == 0x000030, "Member 'WB_BtnHelp2_C_SetHelpInfo::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetHelpInfo, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000034, "Member 'WB_BtnHelp2_C_SetHelpInfo::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetHelpInfo, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'WB_BtnHelp2_C_SetHelpInfo::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetHelpInfo, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000040, "Member 'WB_BtnHelp2_C_SetHelpInfo::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function WB_BtnHelp2.WB_BtnHelp2_C.SetPosType
// 0x0001 (0x0001 - 0x0000)
struct WB_BtnHelp2_C_SetPosType final
{
public:
	E_BTN_HELP_POS_TYPE                           Param_PosType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelp2_C_SetPosType) == 0x000001, "Wrong alignment on WB_BtnHelp2_C_SetPosType");
static_assert(sizeof(WB_BtnHelp2_C_SetPosType) == 0x000001, "Wrong size on WB_BtnHelp2_C_SetPosType");
static_assert(offsetof(WB_BtnHelp2_C_SetPosType, Param_PosType) == 0x000000, "Member 'WB_BtnHelp2_C_SetPosType::Param_PosType' has a wrong offset!");

// Function WB_BtnHelp2.WB_BtnHelp2_C.SetDirectionType
// 0x001C (0x001C - 0x0000)
struct WB_BtnHelp2_C_SetDirectionType final
{
public:
	E_BTN_HELP_DIR                                Param_HelpDir;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTN_HELP_DIR                                Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63A7[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelp2_C_SetDirectionType) == 0x000004, "Wrong alignment on WB_BtnHelp2_C_SetDirectionType");
static_assert(sizeof(WB_BtnHelp2_C_SetDirectionType) == 0x00001C, "Wrong size on WB_BtnHelp2_C_SetDirectionType");
static_assert(offsetof(WB_BtnHelp2_C_SetDirectionType, Param_HelpDir) == 0x000000, "Member 'WB_BtnHelp2_C_SetDirectionType::Param_HelpDir' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetDirectionType, Temp_byte_Variable) == 0x000001, "Member 'WB_BtnHelp2_C_SetDirectionType::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetDirectionType, Temp_name_Variable) == 0x000004, "Member 'WB_BtnHelp2_C_SetDirectionType::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetDirectionType, Temp_name_Variable_1) == 0x00000C, "Member 'WB_BtnHelp2_C_SetDirectionType::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetDirectionType, K2Node_Select_Default) == 0x000014, "Member 'WB_BtnHelp2_C_SetDirectionType::K2Node_Select_Default' has a wrong offset!");

// Function WB_BtnHelp2.WB_BtnHelp2_C.SetDispMode
// 0x0020 (0x0020 - 0x0000)
struct WB_BtnHelp2_C_SetDispMode final
{
public:
	bool                                          IsGamePad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63A8[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_BtnHelpSlot2_C*                     CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp2_C_SetDispMode) == 0x000008, "Wrong alignment on WB_BtnHelp2_C_SetDispMode");
static_assert(sizeof(WB_BtnHelp2_C_SetDispMode) == 0x000020, "Wrong size on WB_BtnHelp2_C_SetDispMode");
static_assert(offsetof(WB_BtnHelp2_C_SetDispMode, IsGamePad) == 0x000000, "Member 'WB_BtnHelp2_C_SetDispMode::IsGamePad' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetDispMode, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WB_BtnHelp2_C_SetDispMode::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetDispMode, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WB_BtnHelp2_C_SetDispMode::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetDispMode, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WB_BtnHelp2_C_SetDispMode::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetDispMode, CallFunc_Array_Get_Item) == 0x000010, "Member 'WB_BtnHelp2_C_SetDispMode::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetDispMode, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WB_BtnHelp2_C_SetDispMode::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetDispMode, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WB_BtnHelp2_C_SetDispMode::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_BtnHelp2.WB_BtnHelp2_C.GetNowAssignAnim
// 0x0020 (0x0020 - 0x0000)
struct WB_BtnHelp2_C_GetNowAssignAnim final
{
public:
	class FName                                   AnimationName;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlaying;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63A9[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName;  // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName; // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp2_C_GetNowAssignAnim) == 0x000004, "Wrong alignment on WB_BtnHelp2_C_GetNowAssignAnim");
static_assert(sizeof(WB_BtnHelp2_C_GetNowAssignAnim) == 0x000020, "Wrong size on WB_BtnHelp2_C_GetNowAssignAnim");
static_assert(offsetof(WB_BtnHelp2_C_GetNowAssignAnim, AnimationName) == 0x000000, "Member 'WB_BtnHelp2_C_GetNowAssignAnim::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_GetNowAssignAnim, IsPlaying) == 0x000008, "Member 'WB_BtnHelp2_C_GetNowAssignAnim::IsPlaying' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_GetNowAssignAnim, CallFunc_GetPlayingAnimationName_OutAnimPackName) == 0x00000C, "Member 'WB_BtnHelp2_C_GetNowAssignAnim::CallFunc_GetPlayingAnimationName_OutAnimPackName' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_GetNowAssignAnim, CallFunc_GetPlayingAnimationName_OutAnimationName) == 0x000014, "Member 'WB_BtnHelp2_C_GetNowAssignAnim::CallFunc_GetPlayingAnimationName_OutAnimationName' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_GetNowAssignAnim, CallFunc_IsPlaying_ReturnValue) == 0x00001C, "Member 'WB_BtnHelp2_C_GetNowAssignAnim::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");

// Function WB_BtnHelp2.WB_BtnHelp2_C.UpdateBasePos
// 0x0098 (0x0098 - 0x0000)
struct WB_BtnHelp2_C_UpdateBasePos final
{
public:
	struct FVector2D                              L_BasePos;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63AA[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63AB[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue_1;             // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec;     // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec_1;   // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue_2;             // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_4;                        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_4;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec_2;   // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_5;                        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_5;                        // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelp2_C_UpdateBasePos) == 0x000008, "Wrong alignment on WB_BtnHelp2_C_UpdateBasePos");
static_assert(sizeof(WB_BtnHelp2_C_UpdateBasePos) == 0x000098, "Wrong size on WB_BtnHelp2_C_UpdateBasePos");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, L_BasePos) == 0x000000, "Member 'WB_BtnHelp2_C_UpdateBasePos::L_BasePos' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'WB_BtnHelp2_C_UpdateBasePos::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'WB_BtnHelp2_C_UpdateBasePos::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, K2Node_SwitchEnum_CmpSuccess_1) == 0x000018, "Member 'WB_BtnHelp2_C_UpdateBasePos::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, CallFunc_GetDesiredSize_ReturnValue) == 0x00001C, "Member 'WB_BtnHelp2_C_UpdateBasePos::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, CallFunc_GetDesiredSize_ReturnValue_1) == 0x000024, "Member 'WB_BtnHelp2_C_UpdateBasePos::CallFunc_GetDesiredSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, CallFunc_BreakVector2D_X) == 0x00002C, "Member 'WB_BtnHelp2_C_UpdateBasePos::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, CallFunc_BreakVector2D_Y) == 0x000030, "Member 'WB_BtnHelp2_C_UpdateBasePos::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, CallFunc_BreakVector2D_X_1) == 0x000034, "Member 'WB_BtnHelp2_C_UpdateBasePos::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, CallFunc_BreakVector2D_Y_1) == 0x000038, "Member 'WB_BtnHelp2_C_UpdateBasePos::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, CallFunc_GetSSPPositionDataByPartsName_OutVec) == 0x00003C, "Member 'WB_BtnHelp2_C_UpdateBasePos::CallFunc_GetSSPPositionDataByPartsName_OutVec' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, CallFunc_GetSSPPositionDataByPartsName_OutVec_1) == 0x000044, "Member 'WB_BtnHelp2_C_UpdateBasePos::CallFunc_GetSSPPositionDataByPartsName_OutVec_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, CallFunc_BreakVector2D_X_2) == 0x00004C, "Member 'WB_BtnHelp2_C_UpdateBasePos::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, CallFunc_BreakVector2D_Y_2) == 0x000050, "Member 'WB_BtnHelp2_C_UpdateBasePos::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, CallFunc_BreakVector2D_X_3) == 0x000054, "Member 'WB_BtnHelp2_C_UpdateBasePos::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, CallFunc_BreakVector2D_Y_3) == 0x000058, "Member 'WB_BtnHelp2_C_UpdateBasePos::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, CallFunc_MakeVector2D_ReturnValue) == 0x00005C, "Member 'WB_BtnHelp2_C_UpdateBasePos::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, CallFunc_MakeVector2D_ReturnValue_1) == 0x000064, "Member 'WB_BtnHelp2_C_UpdateBasePos::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, CallFunc_GetDesiredSize_ReturnValue_2) == 0x00006C, "Member 'WB_BtnHelp2_C_UpdateBasePos::CallFunc_GetDesiredSize_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, CallFunc_BreakVector2D_X_4) == 0x000074, "Member 'WB_BtnHelp2_C_UpdateBasePos::CallFunc_BreakVector2D_X_4' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, CallFunc_BreakVector2D_Y_4) == 0x000078, "Member 'WB_BtnHelp2_C_UpdateBasePos::CallFunc_BreakVector2D_Y_4' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, CallFunc_GetSSPPositionDataByPartsName_OutVec_2) == 0x00007C, "Member 'WB_BtnHelp2_C_UpdateBasePos::CallFunc_GetSSPPositionDataByPartsName_OutVec_2' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, CallFunc_BreakVector2D_X_5) == 0x000084, "Member 'WB_BtnHelp2_C_UpdateBasePos::CallFunc_BreakVector2D_X_5' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, CallFunc_BreakVector2D_Y_5) == 0x000088, "Member 'WB_BtnHelp2_C_UpdateBasePos::CallFunc_BreakVector2D_Y_5' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateBasePos, CallFunc_MakeVector2D_ReturnValue_2) == 0x00008C, "Member 'WB_BtnHelp2_C_UpdateBasePos::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");

// Function WB_BtnHelp2.WB_BtnHelp2_C.SetActiveColor
// 0x0018 (0x0018 - 0x0000)
struct WB_BtnHelp2_C_SetActiveColor final
{
public:
	int32                                         BtnHelpIdx;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActiveColor;                                     // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63AC[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtnHelpSlot2_C*                     CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp2_C_SetActiveColor) == 0x000008, "Wrong alignment on WB_BtnHelp2_C_SetActiveColor");
static_assert(sizeof(WB_BtnHelp2_C_SetActiveColor) == 0x000018, "Wrong size on WB_BtnHelp2_C_SetActiveColor");
static_assert(offsetof(WB_BtnHelp2_C_SetActiveColor, BtnHelpIdx) == 0x000000, "Member 'WB_BtnHelp2_C_SetActiveColor::BtnHelpIdx' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetActiveColor, IsActiveColor) == 0x000004, "Member 'WB_BtnHelp2_C_SetActiveColor::IsActiveColor' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetActiveColor, CallFunc_Array_Get_Item) == 0x000008, "Member 'WB_BtnHelp2_C_SetActiveColor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetActiveColor, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000010, "Member 'WB_BtnHelp2_C_SetActiveColor::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function WB_BtnHelp2.WB_BtnHelp2_C.SetHoldEffect
// 0x0018 (0x0018 - 0x0000)
struct WB_BtnHelp2_C_SetHoldEffect final
{
public:
	int32                                         BtnHelpIdx;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDrawEffect;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63AD[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtnHelpSlot2_C*                     CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp2_C_SetHoldEffect) == 0x000008, "Wrong alignment on WB_BtnHelp2_C_SetHoldEffect");
static_assert(sizeof(WB_BtnHelp2_C_SetHoldEffect) == 0x000018, "Wrong size on WB_BtnHelp2_C_SetHoldEffect");
static_assert(offsetof(WB_BtnHelp2_C_SetHoldEffect, BtnHelpIdx) == 0x000000, "Member 'WB_BtnHelp2_C_SetHoldEffect::BtnHelpIdx' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetHoldEffect, IsDrawEffect) == 0x000004, "Member 'WB_BtnHelp2_C_SetHoldEffect::IsDrawEffect' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetHoldEffect, CallFunc_Array_Get_Item) == 0x000008, "Member 'WB_BtnHelp2_C_SetHoldEffect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetHoldEffect, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000010, "Member 'WB_BtnHelp2_C_SetHoldEffect::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function WB_BtnHelp2.WB_BtnHelp2_C.SetActiveColor_All
// 0x0020 (0x0020 - 0x0000)
struct WB_BtnHelp2_C_SetActiveColor_All final
{
public:
	bool                                          IsActiveColor;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63AE[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_BtnHelpSlot2_C*                     CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63AF[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelp2_C_SetActiveColor_All) == 0x000008, "Wrong alignment on WB_BtnHelp2_C_SetActiveColor_All");
static_assert(sizeof(WB_BtnHelp2_C_SetActiveColor_All) == 0x000020, "Wrong size on WB_BtnHelp2_C_SetActiveColor_All");
static_assert(offsetof(WB_BtnHelp2_C_SetActiveColor_All, IsActiveColor) == 0x000000, "Member 'WB_BtnHelp2_C_SetActiveColor_All::IsActiveColor' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetActiveColor_All, Temp_int_Variable) == 0x000004, "Member 'WB_BtnHelp2_C_SetActiveColor_All::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetActiveColor_All, CallFunc_Array_Get_Item) == 0x000008, "Member 'WB_BtnHelp2_C_SetActiveColor_All::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetActiveColor_All, CallFunc_Array_LastIndex_ReturnValue) == 0x000010, "Member 'WB_BtnHelp2_C_SetActiveColor_All::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetActiveColor_All, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000014, "Member 'WB_BtnHelp2_C_SetActiveColor_All::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetActiveColor_All, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WB_BtnHelp2_C_SetActiveColor_All::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WB_BtnHelp2.WB_BtnHelp2_C.SetHoldEffect_All
// 0x0020 (0x0020 - 0x0000)
struct WB_BtnHelp2_C_SetHoldEffect_All final
{
public:
	bool                                          IsDrawEffect;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63B0[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_BtnHelpSlot2_C*                     CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63B1[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelp2_C_SetHoldEffect_All) == 0x000008, "Wrong alignment on WB_BtnHelp2_C_SetHoldEffect_All");
static_assert(sizeof(WB_BtnHelp2_C_SetHoldEffect_All) == 0x000020, "Wrong size on WB_BtnHelp2_C_SetHoldEffect_All");
static_assert(offsetof(WB_BtnHelp2_C_SetHoldEffect_All, IsDrawEffect) == 0x000000, "Member 'WB_BtnHelp2_C_SetHoldEffect_All::IsDrawEffect' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetHoldEffect_All, Temp_int_Variable) == 0x000004, "Member 'WB_BtnHelp2_C_SetHoldEffect_All::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetHoldEffect_All, CallFunc_Array_Get_Item) == 0x000008, "Member 'WB_BtnHelp2_C_SetHoldEffect_All::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetHoldEffect_All, CallFunc_Array_LastIndex_ReturnValue) == 0x000010, "Member 'WB_BtnHelp2_C_SetHoldEffect_All::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetHoldEffect_All, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000014, "Member 'WB_BtnHelp2_C_SetHoldEffect_All::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_SetHoldEffect_All, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WB_BtnHelp2_C_SetHoldEffect_All::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WB_BtnHelp2.WB_BtnHelp2_C.GetActiveColor
// 0x0018 (0x0018 - 0x0000)
struct WB_BtnHelp2_C_GetActiveColor final
{
public:
	int32                                         BtnHelpIdx;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63B2[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtnHelpSlot2_C*                     CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActiveColor_IsActiveColor;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp2_C_GetActiveColor) == 0x000008, "Wrong alignment on WB_BtnHelp2_C_GetActiveColor");
static_assert(sizeof(WB_BtnHelp2_C_GetActiveColor) == 0x000018, "Wrong size on WB_BtnHelp2_C_GetActiveColor");
static_assert(offsetof(WB_BtnHelp2_C_GetActiveColor, BtnHelpIdx) == 0x000000, "Member 'WB_BtnHelp2_C_GetActiveColor::BtnHelpIdx' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_GetActiveColor, IsActive) == 0x000004, "Member 'WB_BtnHelp2_C_GetActiveColor::IsActive' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_GetActiveColor, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000005, "Member 'WB_BtnHelp2_C_GetActiveColor::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_GetActiveColor, CallFunc_Array_Get_Item) == 0x000008, "Member 'WB_BtnHelp2_C_GetActiveColor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_GetActiveColor, CallFunc_GetActiveColor_IsActiveColor) == 0x000010, "Member 'WB_BtnHelp2_C_GetActiveColor::CallFunc_GetActiveColor_IsActiveColor' has a wrong offset!");

// Function WB_BtnHelp2.WB_BtnHelp2_C.UpdateHelpPos
// 0x0120 (0x0120 - 0x0000)
struct WB_BtnHelp2_C_UpdateHelpPos final
{
public:
	float                                         L_PrevSlotWidth;                                   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              L_tmpSlotPos;                                      // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_SlotIdx;                                         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_BtnHelpSlot2_C*                     CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTextEndOffset_OffsetX;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63B3[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtnHelpSlot2_C*                     CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_BtnHelpSlot2_C*                     CallFunc_Array_Get_Item_2;                         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63B4[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtnHelpSlot2_C*                     CallFunc_Array_Get_Item_3;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_BtnHelpSlot2_C*                     CallFunc_Array_Get_Item_4;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLastCharWidth_LastCharWidth;           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63B5[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtnHelpSlot2_C*                     CallFunc_Array_Get_Item_5;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTextEndOffset_OffsetX_1;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTextEndOffset_OffsetX_2;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63B6[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_BtnHelpSlot2_C*                     CallFunc_Array_Get_Item_6;                         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLastCharWidth_LastCharWidth_1;         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTextEndOffset_OffsetX_3;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_1;           // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63B7[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63B8[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Round_ReturnValue_2;                      // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_8;        // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_3;                      // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelp2_C_UpdateHelpPos) == 0x000008, "Wrong alignment on WB_BtnHelp2_C_UpdateHelpPos");
static_assert(sizeof(WB_BtnHelp2_C_UpdateHelpPos) == 0x000120, "Wrong size on WB_BtnHelp2_C_UpdateHelpPos");
static_assert(offsetof(WB_BtnHelp2_C_UpdateHelpPos, L_PrevSlotWidth) == 0x000000, "Member 'WB_BtnHelp2_C_UpdateHelpPos::L_PrevSlotWidth' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateHelpPos, L_tmpSlotPos) == 0x000004, "Member 'WB_BtnHelp2_C_UpdateHelpPos::L_tmpSlotPos' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateHelpPos, L_SlotIdx) == 0x00000C, "Member 'WB_BtnHelp2_C_UpdateHelpPos::L_SlotIdx' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateHelpPos, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WB_BtnHelp2_C_UpdateHelpPos::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateHelpPos, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'WB_BtnHelp2_C_UpdateHelpPos::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateHelpPos, CallFunc_Array_Get_Item) == 0x000018, "Member 'WB_BtnHelp2_C_UpdateHelpPos::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateHelpPos, CallFunc_GetTextEndOffset_OffsetX) == 0x000020, "Member 'WB_BtnHelp2_C_UpdateHelpPos::CallFunc_GetTextEndOffset_OffsetX' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateHelpPos, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'WB_BtnHelp2_C_UpdateHelpPos::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateHelpPos, CallFunc_Array_Get_Item_2) == 0x000030, "Member 'WB_BtnHelp2_C_UpdateHelpPos::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateHelpPos, CallFunc_IsVisible_ReturnValue) == 0x000038, "Member 'WB_BtnHelp2_C_UpdateHelpPos::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateHelpPos, CallFunc_Array_Get_Item_3) == 0x000040, "Member 'WB_BtnHelp2_C_UpdateHelpPos::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateHelpPos, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000048, "Member 'WB_BtnHelp2_C_UpdateHelpPos::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateHelpPos, CallFunc_Array_Get_Item_4) == 0x000050, "Member 'WB_BtnHelp2_C_UpdateHelpPos::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateHelpPos, CallFunc_GetLastCharWidth_LastCharWidth) == 0x000058, "Member 'WB_BtnHelp2_C_UpdateHelpPos::CallFunc_GetLastCharWidth_LastCharWidth' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateHelpPos, CallFunc_Array_Get_Item_5) == 0x000060, "Member 'WB_BtnHelp2_C_UpdateHelpPos::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateHelpPos, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000068, "Member 'WB_BtnHelp2_C_UpdateHelpPos::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelp2_C_UpdateHelpPos, CallFunc_GetTextEndOffset_OffsetX_1) == 0x00006C, "Member 'WB_BtnHelp2_C_UpdateHelpPos::CallFunc_GetTextEndOffset_OffsetX_1' has a wrong offset!");
