#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BtnIcon2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Project_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_BtnIcon2.WB_BtnIcon2_C
// 0x0028 (0x0288 - 0x0260)
class UWB_BtnIcon2_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Btn;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_BTN_HELP_MAPPING_KEY_TYPE                   BtnIconType;                                       // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTN_ICON_SIZE                               BtnIconSize2;                                      // 0x0271(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6351[0x2];                                     // 0x0272(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           BtnColor;                                          // 0x0274(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_OPTION_CONTENT_BUTTON_ICON_TYPE             Debug_PlatformType;                                // 0x0284(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_OPTION_CONTENT_BUTTON_ICON_TYPE             PlatformTextureType;                               // 0x0285(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug_IsDesignTime;                                // 0x0286(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	E_GAMEPAD_TYPE                                CurrnetGamePad;                                    // 0x0287(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_BtnIcon2(int32 EntryPoint);
	void Destruct();
	void OnChangePlatformSetting();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void SetButtonSize(E_BTN_ICON_SIZE InSIze2);
	void SetButtonIcon(E_BTN_HELP_MAPPING_KEY_TYPE InType);
	void SetButtonColor(const struct FLinearColor& InColor);
	void SetButtonColor_ByActiveState(bool IsActiveColor);
	void UpdatePlatfrormTexture();
	void Tick_UpdateIcon();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_BtnIcon2_C">();
	}
	static class UWB_BtnIcon2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_BtnIcon2_C>();
	}
};
static_assert(alignof(UWB_BtnIcon2_C) == 0x000008, "Wrong alignment on UWB_BtnIcon2_C");
static_assert(sizeof(UWB_BtnIcon2_C) == 0x000288, "Wrong size on UWB_BtnIcon2_C");
static_assert(offsetof(UWB_BtnIcon2_C, UberGraphFrame) == 0x000260, "Member 'UWB_BtnIcon2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_BtnIcon2_C, Image_Btn) == 0x000268, "Member 'UWB_BtnIcon2_C::Image_Btn' has a wrong offset!");
static_assert(offsetof(UWB_BtnIcon2_C, BtnIconType) == 0x000270, "Member 'UWB_BtnIcon2_C::BtnIconType' has a wrong offset!");
static_assert(offsetof(UWB_BtnIcon2_C, BtnIconSize2) == 0x000271, "Member 'UWB_BtnIcon2_C::BtnIconSize2' has a wrong offset!");
static_assert(offsetof(UWB_BtnIcon2_C, BtnColor) == 0x000274, "Member 'UWB_BtnIcon2_C::BtnColor' has a wrong offset!");
static_assert(offsetof(UWB_BtnIcon2_C, Debug_PlatformType) == 0x000284, "Member 'UWB_BtnIcon2_C::Debug_PlatformType' has a wrong offset!");
static_assert(offsetof(UWB_BtnIcon2_C, PlatformTextureType) == 0x000285, "Member 'UWB_BtnIcon2_C::PlatformTextureType' has a wrong offset!");
static_assert(offsetof(UWB_BtnIcon2_C, Debug_IsDesignTime) == 0x000286, "Member 'UWB_BtnIcon2_C::Debug_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UWB_BtnIcon2_C, CurrnetGamePad) == 0x000287, "Member 'UWB_BtnIcon2_C::CurrnetGamePad' has a wrong offset!");

}

