#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BtlTargetDevil_AishouNotice

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_BtlTargetDevil_AishouNotice.WB_BtlTargetDevil_AishouNotice_C
// 0x0020 (0x0280 - 0x0260)
class UWB_BtlTargetDevil_AishouNotice_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USsPlayerWidget*                        SsPlayer_Aishou;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayer_Selected;                                 // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         DefenceAishou;                                     // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsKnown;                                           // 0x027C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsShowAll;                                         // 0x027D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsAppeared;                                        // 0x027E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSelected;                                        // 0x027F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_BtlTargetDevil_AishouNotice(int32 EntryPoint);
	void BndEvt__SsPlayer_Aishou_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void InitDisappeared();
	void Appear(float Rate, bool Immediately);
	void Disappear(float Rate, bool Immediately);
	void CallTick(float Delta);
	void Construct();
	void BndEvt__SsPlayer_Selected_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void SetAishouNotice(int32 Param_DefenceAishou, bool Param_IsKnown, bool Param_IsShowAll);
	void PlayAishou(class FName PackName, int32 AnimIndex, bool IsLoop, bool IsEndOfAnim);
	void AishouAnimCtrl(bool IsAppear, bool IsRefresh, bool IsEndOfAnim);
	void PlaySelected(int32 AnimIndex, bool IsLoop, bool IsEndOfAnim);
	void SetSelect(bool Select, bool Immediately);
	void SetAllWidgetTick(bool Enable);
	void IsDisappeared(bool* Param_IsDisappeared);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_BtlTargetDevil_AishouNotice_C">();
	}
	static class UWB_BtlTargetDevil_AishouNotice_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_BtlTargetDevil_AishouNotice_C>();
	}
};
static_assert(alignof(UWB_BtlTargetDevil_AishouNotice_C) == 0x000008, "Wrong alignment on UWB_BtlTargetDevil_AishouNotice_C");
static_assert(sizeof(UWB_BtlTargetDevil_AishouNotice_C) == 0x000280, "Wrong size on UWB_BtlTargetDevil_AishouNotice_C");
static_assert(offsetof(UWB_BtlTargetDevil_AishouNotice_C, UberGraphFrame) == 0x000260, "Member 'UWB_BtlTargetDevil_AishouNotice_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_BtlTargetDevil_AishouNotice_C, SsPlayer_Aishou) == 0x000268, "Member 'UWB_BtlTargetDevil_AishouNotice_C::SsPlayer_Aishou' has a wrong offset!");
static_assert(offsetof(UWB_BtlTargetDevil_AishouNotice_C, SsPlayer_Selected) == 0x000270, "Member 'UWB_BtlTargetDevil_AishouNotice_C::SsPlayer_Selected' has a wrong offset!");
static_assert(offsetof(UWB_BtlTargetDevil_AishouNotice_C, DefenceAishou) == 0x000278, "Member 'UWB_BtlTargetDevil_AishouNotice_C::DefenceAishou' has a wrong offset!");
static_assert(offsetof(UWB_BtlTargetDevil_AishouNotice_C, IsKnown) == 0x00027C, "Member 'UWB_BtlTargetDevil_AishouNotice_C::IsKnown' has a wrong offset!");
static_assert(offsetof(UWB_BtlTargetDevil_AishouNotice_C, IsShowAll) == 0x00027D, "Member 'UWB_BtlTargetDevil_AishouNotice_C::IsShowAll' has a wrong offset!");
static_assert(offsetof(UWB_BtlTargetDevil_AishouNotice_C, IsAppeared) == 0x00027E, "Member 'UWB_BtlTargetDevil_AishouNotice_C::IsAppeared' has a wrong offset!");
static_assert(offsetof(UWB_BtlTargetDevil_AishouNotice_C, IsSelected) == 0x00027F, "Member 'UWB_BtlTargetDevil_AishouNotice_C::IsSelected' has a wrong offset!");

}

