#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BattleCharaPanel

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_BattleCharaPanel.WB_BattleCharaPanel_C.ExecuteUbergraph_WB_BattleCharaPanel
// 0x0210 (0x0210 - 0x0000)
struct WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_13;        // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_13;       // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_13;       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_13;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CC2[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_12;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_12;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_12;       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_12;      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CC3[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_11;        // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_11;       // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_11;       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_11;      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_2;                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CC4[0x1];                                     // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_10;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_10;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_10;       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_10;      // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_3;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_3;                       // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CC5[0x2];                                     // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_9;         // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_9;        // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_9;        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_9;       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_4;                    // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_4;                       // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CC6[0x2];                                     // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_8;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_8;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_8;        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_8;       // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_5;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_5;                       // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CC7[0x2];                                     // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_7;         // 0x00AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_7;        // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_7;        // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_7;       // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_6;         // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_6;        // 0x00CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_6;        // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_6;       // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_6;                    // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_7;                    // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CC8[0x2];                                     // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_5;         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_5;        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_5;        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_5;       // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_4;         // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_4;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_4;        // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_4;       // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_8;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_9;                    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_6;                       // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_7;                       // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_8;                       // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_9;                       // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CC9[0x2];                                     // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_3;         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_3;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_3;        // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_3;       // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_2;         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_2;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_2;        // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_2;       // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_10;                   // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_11;                   // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CCA[0x2];                                     // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_1;         // 0x014C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_1;        // 0x0154(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_1;        // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_1;       // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_12;                   // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_10;                      // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CCB[0x2];                                     // 0x0166(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstancePartPlayFrame_ReturnValue;     // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_11;                      // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CCC[0x3];                                     // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstancePartPlayFrame_ReturnValue_1;   // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_12;                      // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CCD[0x3];                                     // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstancePartPlayFrame_ReturnValue_2;   // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_14;        // 0x017C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_14;       // 0x0184(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_14;       // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_14;      // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_13;                   // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_13;                      // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CCE[0x2];                                     // 0x0196(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_15;        // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_15;       // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_15;       // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_15;      // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_14;                   // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_14;                      // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CCF[0x2];                                     // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName;           // 0x01B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName;          // 0x01BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex;          // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex;         // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_15;                   // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_15;                      // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CD0[0x2];                                     // 0x01CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Position;               // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x01D4(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel) == 0x000004, "Wrong alignment on WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel");
static_assert(sizeof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel) == 0x000210, "Wrong size on WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, EntryPoint) == 0x000000, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackName_13) == 0x000004, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackName_13' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationName_13) == 0x00000C, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationName_13' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_13) == 0x000014, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_13' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_13) == 0x000018, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_13' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_SwitchName_CmpSuccess) == 0x00001C, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackName_12) == 0x000020, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackName_12' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationName_12) == 0x000028, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationName_12' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_12) == 0x000030, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_12' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_12) == 0x000034, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_12' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_SwitchName_CmpSuccess_1) == 0x000038, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_SwitchName_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, CallFunc_Play_ReturnValue) == 0x000039, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackName_11) == 0x00003C, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackName_11' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationName_11) == 0x000044, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationName_11' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_11) == 0x00004C, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_11' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_11) == 0x000050, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_11' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_SwitchName_CmpSuccess_2) == 0x000054, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_SwitchName_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, CallFunc_Play_ReturnValue_1) == 0x000055, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, CallFunc_Play_ReturnValue_2) == 0x000056, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackName_10) == 0x000058, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackName_10' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationName_10) == 0x000060, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationName_10' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_10) == 0x000068, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_10' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_10) == 0x00006C, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_10' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_SwitchName_CmpSuccess_3) == 0x000070, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_SwitchName_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, CallFunc_Play_ReturnValue_3) == 0x000071, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::CallFunc_Play_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackName_9) == 0x000074, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackName_9' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationName_9) == 0x00007C, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationName_9' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_9) == 0x000084, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_9' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_9) == 0x000088, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_9' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_SwitchName_CmpSuccess_4) == 0x00008C, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_SwitchName_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, CallFunc_Play_ReturnValue_4) == 0x00008D, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::CallFunc_Play_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackName_8) == 0x000090, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackName_8' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationName_8) == 0x000098, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationName_8' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_8) == 0x0000A0, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_8' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_8) == 0x0000A4, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_8' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_SwitchName_CmpSuccess_5) == 0x0000A8, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_SwitchName_CmpSuccess_5' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, CallFunc_Play_ReturnValue_5) == 0x0000A9, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::CallFunc_Play_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackName_7) == 0x0000AC, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackName_7' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationName_7) == 0x0000B4, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationName_7' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_7) == 0x0000BC, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_7' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_7) == 0x0000C0, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_7' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackName_6) == 0x0000C4, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackName_6' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationName_6) == 0x0000CC, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationName_6' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_6) == 0x0000D4, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_6' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_6) == 0x0000D8, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_6' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_SwitchName_CmpSuccess_6) == 0x0000DC, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_SwitchName_CmpSuccess_6' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_SwitchName_CmpSuccess_7) == 0x0000DD, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_SwitchName_CmpSuccess_7' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackName_5) == 0x0000E0, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackName_5' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationName_5) == 0x0000E8, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationName_5' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_5) == 0x0000F0, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_5' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_5) == 0x0000F4, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_5' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackName_4) == 0x0000F8, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackName_4' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationName_4) == 0x000100, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationName_4' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_4) == 0x000108, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_4' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_4) == 0x00010C, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_4' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_SwitchName_CmpSuccess_8) == 0x000110, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_SwitchName_CmpSuccess_8' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_SwitchName_CmpSuccess_9) == 0x000111, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_SwitchName_CmpSuccess_9' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, CallFunc_Play_ReturnValue_6) == 0x000112, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::CallFunc_Play_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, CallFunc_Play_ReturnValue_7) == 0x000113, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::CallFunc_Play_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, CallFunc_Play_ReturnValue_8) == 0x000114, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::CallFunc_Play_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, CallFunc_Play_ReturnValue_9) == 0x000115, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::CallFunc_Play_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackName_3) == 0x000118, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackName_3' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationName_3) == 0x000120, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationName_3' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_3) == 0x000128, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_3' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_3) == 0x00012C, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_3' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackName_2) == 0x000130, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackName_2' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationName_2) == 0x000138, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationName_2' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_2) == 0x000140, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_2' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_2) == 0x000144, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_2' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_SwitchName_CmpSuccess_10) == 0x000148, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_SwitchName_CmpSuccess_10' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_SwitchName_CmpSuccess_11) == 0x000149, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_SwitchName_CmpSuccess_11' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackName_1) == 0x00014C, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackName_1' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationName_1) == 0x000154, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationName_1' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_1) == 0x00015C, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_1' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_1) == 0x000160, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_1' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_SwitchName_CmpSuccess_12) == 0x000164, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_SwitchName_CmpSuccess_12' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, CallFunc_Play_ReturnValue_10) == 0x000165, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::CallFunc_Play_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, CallFunc_GetInstancePartPlayFrame_ReturnValue) == 0x000168, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::CallFunc_GetInstancePartPlayFrame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, CallFunc_Play_ReturnValue_11) == 0x00016C, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::CallFunc_Play_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, CallFunc_GetInstancePartPlayFrame_ReturnValue_1) == 0x000170, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::CallFunc_GetInstancePartPlayFrame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, CallFunc_Play_ReturnValue_12) == 0x000174, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::CallFunc_Play_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, CallFunc_GetInstancePartPlayFrame_ReturnValue_2) == 0x000178, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::CallFunc_GetInstancePartPlayFrame_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackName_14) == 0x00017C, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackName_14' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationName_14) == 0x000184, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationName_14' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_14) == 0x00018C, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_14' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_14) == 0x000190, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_14' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_SwitchName_CmpSuccess_13) == 0x000194, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_SwitchName_CmpSuccess_13' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, CallFunc_Play_ReturnValue_13) == 0x000195, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::CallFunc_Play_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackName_15) == 0x000198, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackName_15' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationName_15) == 0x0001A0, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationName_15' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_15) == 0x0001A8, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_15' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_15) == 0x0001AC, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_15' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_SwitchName_CmpSuccess_14) == 0x0001B0, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_SwitchName_CmpSuccess_14' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, CallFunc_Play_ReturnValue_14) == 0x0001B1, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::CallFunc_Play_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackName) == 0x0001B4, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationName) == 0x0001BC, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex) == 0x0001C4, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex) == 0x0001C8, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_SwitchName_CmpSuccess_15) == 0x0001CC, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_SwitchName_CmpSuccess_15' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, CallFunc_Play_ReturnValue_15) == 0x0001CD, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::CallFunc_Play_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_ComponentBoundEvent_Position) == 0x0001D0, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_ComponentBoundEvent_Position' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_Event_MyGeometry) == 0x0001D4, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel, K2Node_Event_InDeltaTime) == 0x00020C, "Member 'WB_BattleCharaPanel_C_ExecuteUbergraph_WB_BattleCharaPanel::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function WB_BattleCharaPanel.WB_BattleCharaPanel_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_BattleCharaPanel_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BattleCharaPanel_C_Tick) == 0x000004, "Wrong alignment on WB_BattleCharaPanel_C_Tick");
static_assert(sizeof(WB_BattleCharaPanel_C_Tick) == 0x00003C, "Wrong size on WB_BattleCharaPanel_C_Tick");
static_assert(offsetof(WB_BattleCharaPanel_C_Tick, MyGeometry) == 0x000000, "Member 'WB_BattleCharaPanel_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_BattleCharaPanel_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_BattleCharaPanel.WB_BattleCharaPanel_C.BndEvt__SsPlayerScroll_K2Node_ComponentBoundEvent_15_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_BattleCharaPanel_C_BndEvt__SsPlayerScroll_K2Node_ComponentBoundEvent_15_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BattleCharaPanel_C_BndEvt__SsPlayerScroll_K2Node_ComponentBoundEvent_15_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_BattleCharaPanel_C_BndEvt__SsPlayerScroll_K2Node_ComponentBoundEvent_15_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_BattleCharaPanel_C_BndEvt__SsPlayerScroll_K2Node_ComponentBoundEvent_15_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_BattleCharaPanel_C_BndEvt__SsPlayerScroll_K2Node_ComponentBoundEvent_15_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_BattleCharaPanel_C_BndEvt__SsPlayerScroll_K2Node_ComponentBoundEvent_15_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_BattleCharaPanel_C_BndEvt__SsPlayerScroll_K2Node_ComponentBoundEvent_15_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_BndEvt__SsPlayerScroll_K2Node_ComponentBoundEvent_15_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_BattleCharaPanel_C_BndEvt__SsPlayerScroll_K2Node_ComponentBoundEvent_15_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_BndEvt__SsPlayerScroll_K2Node_ComponentBoundEvent_15_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_BattleCharaPanel_C_BndEvt__SsPlayerScroll_K2Node_ComponentBoundEvent_15_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_BndEvt__SsPlayerScroll_K2Node_ComponentBoundEvent_15_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_BattleCharaPanel_C_BndEvt__SsPlayerScroll_K2Node_ComponentBoundEvent_15_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_BattleCharaPanel.WB_BattleCharaPanel_C.BndEvt__SsPlayerEnemyCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_BattleCharaPanel_C_BndEvt__SsPlayerEnemyCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BattleCharaPanel_C_BndEvt__SsPlayerEnemyCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_BattleCharaPanel_C_BndEvt__SsPlayerEnemyCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_BattleCharaPanel_C_BndEvt__SsPlayerEnemyCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_BattleCharaPanel_C_BndEvt__SsPlayerEnemyCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_BattleCharaPanel_C_BndEvt__SsPlayerEnemyCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_BattleCharaPanel_C_BndEvt__SsPlayerEnemyCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_BndEvt__SsPlayerEnemyCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_BattleCharaPanel_C_BndEvt__SsPlayerEnemyCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_BndEvt__SsPlayerEnemyCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_BattleCharaPanel_C_BndEvt__SsPlayerEnemyCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_BndEvt__SsPlayerEnemyCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_BattleCharaPanel_C_BndEvt__SsPlayerEnemyCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_BattleCharaPanel.WB_BattleCharaPanel_C.BndEvt__SsPlayerStockCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_BattleCharaPanel_C_BndEvt__SsPlayerStockCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BattleCharaPanel_C_BndEvt__SsPlayerStockCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_BattleCharaPanel_C_BndEvt__SsPlayerStockCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_BattleCharaPanel_C_BndEvt__SsPlayerStockCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_BattleCharaPanel_C_BndEvt__SsPlayerStockCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_BattleCharaPanel_C_BndEvt__SsPlayerStockCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_BattleCharaPanel_C_BndEvt__SsPlayerStockCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_BndEvt__SsPlayerStockCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_BattleCharaPanel_C_BndEvt__SsPlayerStockCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_BndEvt__SsPlayerStockCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_BattleCharaPanel_C_BndEvt__SsPlayerStockCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_BattleCharaPanel_C_BndEvt__SsPlayerStockCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_BattleCharaPanel_C_BndEvt__SsPlayerStockCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_BattleCharaPanel.WB_BattleCharaPanel_C.BndEvt__SsPlayerMainCursor_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
