#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BtnHelpSlot2

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WB_BtnHelpSlot2.WB_BtnHelpSlot2_C.ExecuteUbergraph_WB_BtnHelpSlot2
// 0x00C4 (0x00C4 - 0x0000)
struct WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(E_BTN_HELP_MAPPING_KEY_TYPE OnClickedHelpType, int32 OnClickedHelpIdx)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(E_BTN_HELP_MAPPING_KEY_TYPE OnClickedHelpType, int32 OnClickedHelpIdx)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(E_BTN_HELP_MAPPING_KEY_TYPE OnClickedHelpType, int32 OnClickedHelpIdx)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0034(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_Pos;                    // 0x0070(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_UV;                     // 0x0078(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_StartPos;               // 0x0080(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_StartUV;                // 0x0088(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_CurrentPos;             // 0x0090(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_CurrentUV;              // 0x0098(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTN_HELP_MAPPING_KEY_TYPE                   CallFunc_GetClickedKeyboardIconInfo_HelpMappingType; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_641D[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetClickedKeyboardIconInfo_DiscIconLastIdx; // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTN_HELP_MAPPING_KEY_TYPE                   CallFunc_GetClickedKeyboardIconInfo_HelpMappingType_1; // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_641E[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetClickedKeyboardIconInfo_DiscIconLastIdx_1; // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_641F[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(E_BTN_HELP_MAPPING_KEY_TYPE OnClickedHelpType, int32 OnClickedHelpIdx)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B4(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2) == 0x000004, "Wrong alignment on WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2");
static_assert(sizeof(WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2) == 0x0000C4, "Wrong size on WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2");
static_assert(offsetof(WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2, EntryPoint) == 0x000000, "Member 'WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2, K2Node_Event_MyGeometry) == 0x000034, "Member 'WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2, K2Node_Event_InDeltaTime) == 0x00006C, "Member 'WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2, K2Node_ComponentBoundEvent_Pos) == 0x000070, "Member 'WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2::K2Node_ComponentBoundEvent_Pos' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2, K2Node_ComponentBoundEvent_UV) == 0x000078, "Member 'WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2::K2Node_ComponentBoundEvent_UV' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2, K2Node_ComponentBoundEvent_StartPos) == 0x000080, "Member 'WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2::K2Node_ComponentBoundEvent_StartPos' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2, K2Node_ComponentBoundEvent_StartUV) == 0x000088, "Member 'WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2::K2Node_ComponentBoundEvent_StartUV' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2, K2Node_ComponentBoundEvent_CurrentPos) == 0x000090, "Member 'WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2::K2Node_ComponentBoundEvent_CurrentPos' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2, K2Node_ComponentBoundEvent_CurrentUV) == 0x000098, "Member 'WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2::K2Node_ComponentBoundEvent_CurrentUV' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2, CallFunc_GetClickedKeyboardIconInfo_HelpMappingType) == 0x0000A0, "Member 'WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2::CallFunc_GetClickedKeyboardIconInfo_HelpMappingType' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2, CallFunc_GetClickedKeyboardIconInfo_DiscIconLastIdx) == 0x0000A4, "Member 'WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2::CallFunc_GetClickedKeyboardIconInfo_DiscIconLastIdx' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2, CallFunc_GetClickedKeyboardIconInfo_HelpMappingType_1) == 0x0000A8, "Member 'WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2::CallFunc_GetClickedKeyboardIconInfo_HelpMappingType_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2, CallFunc_GetClickedKeyboardIconInfo_DiscIconLastIdx_1) == 0x0000AC, "Member 'WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2::CallFunc_GetClickedKeyboardIconInfo_DiscIconLastIdx_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2, K2Node_Event_IsDesignTime) == 0x0000B0, "Member 'WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000B4, "Member 'WB_BtnHelpSlot2_C_ExecuteUbergraph_WB_BtnHelpSlot2::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function WB_BtnHelpSlot2.WB_BtnHelpSlot2_C.BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_1_ButtonDragDrppEventS5__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WB_BtnHelpSlot2_C_BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_1_ButtonDragDrppEventS5__DelegateSignature final
{
public:
	struct FVector2D                              StartPos;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              StartUV;                                           // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CurrentPos;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CurrentUV;                                         // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelpSlot2_C_BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_1_ButtonDragDrppEventS5__DelegateSignature) == 0x000004, "Wrong alignment on WB_BtnHelpSlot2_C_BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_1_ButtonDragDrppEventS5__DelegateSignature");
static_assert(sizeof(WB_BtnHelpSlot2_C_BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_1_ButtonDragDrppEventS5__DelegateSignature) == 0x000020, "Wrong size on WB_BtnHelpSlot2_C_BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_1_ButtonDragDrppEventS5__DelegateSignature");
static_assert(offsetof(WB_BtnHelpSlot2_C_BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_1_ButtonDragDrppEventS5__DelegateSignature, StartPos) == 0x000000, "Member 'WB_BtnHelpSlot2_C_BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_1_ButtonDragDrppEventS5__DelegateSignature::StartPos' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_1_ButtonDragDrppEventS5__DelegateSignature, StartUV) == 0x000008, "Member 'WB_BtnHelpSlot2_C_BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_1_ButtonDragDrppEventS5__DelegateSignature::StartUV' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_1_ButtonDragDrppEventS5__DelegateSignature, CurrentPos) == 0x000010, "Member 'WB_BtnHelpSlot2_C_BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_1_ButtonDragDrppEventS5__DelegateSignature::CurrentPos' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_1_ButtonDragDrppEventS5__DelegateSignature, CurrentUV) == 0x000018, "Member 'WB_BtnHelpSlot2_C_BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_1_ButtonDragDrppEventS5__DelegateSignature::CurrentUV' has a wrong offset!");

// Function WB_BtnHelpSlot2.WB_BtnHelpSlot2_C.BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_BtnHelpSlot2_C_BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              UV;                                                // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelpSlot2_C_BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature) == 0x000004, "Wrong alignment on WB_BtnHelpSlot2_C_BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature");
static_assert(sizeof(WB_BtnHelpSlot2_C_BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature) == 0x000010, "Wrong size on WB_BtnHelpSlot2_C_BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature");
static_assert(offsetof(WB_BtnHelpSlot2_C_BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature, Pos) == 0x000000, "Member 'WB_BtnHelpSlot2_C_BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature::Pos' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature, UV) == 0x000008, "Member 'WB_BtnHelpSlot2_C_BndEvt__WB_BtnHelpSlot2_ButtonS5_261_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature::UV' has a wrong offset!");

// Function WB_BtnHelpSlot2.WB_BtnHelpSlot2_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_BtnHelpSlot2_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelpSlot2_C_Tick) == 0x000004, "Wrong alignment on WB_BtnHelpSlot2_C_Tick");
static_assert(sizeof(WB_BtnHelpSlot2_C_Tick) == 0x00003C, "Wrong size on WB_BtnHelpSlot2_C_Tick");
static_assert(offsetof(WB_BtnHelpSlot2_C_Tick, MyGeometry) == 0x000000, "Member 'WB_BtnHelpSlot2_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_BtnHelpSlot2_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_BtnHelpSlot2.WB_BtnHelpSlot2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_BtnHelpSlot2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelpSlot2_C_PreConstruct) == 0x000001, "Wrong alignment on WB_BtnHelpSlot2_C_PreConstruct");
static_assert(sizeof(WB_BtnHelpSlot2_C_PreConstruct) == 0x000001, "Wrong size on WB_BtnHelpSlot2_C_PreConstruct");
static_assert(offsetof(WB_BtnHelpSlot2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_BtnHelpSlot2_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_BtnHelpSlot2.WB_BtnHelpSlot2_C.ResetParam
// 0x0028 (0x0028 - 0x0000)
struct WB_BtnHelpSlot2_C_ResetParam final
{
public:
	bool                                          CallFunc_CheckGamePadUI_Gamepad;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6420[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtnHelpInfo                           K2Node_MakeStruct_BtnHelpInfo;                     // 0x0008(0x0020)()
};
static_assert(alignof(WB_BtnHelpSlot2_C_ResetParam) == 0x000008, "Wrong alignment on WB_BtnHelpSlot2_C_ResetParam");
static_assert(sizeof(WB_BtnHelpSlot2_C_ResetParam) == 0x000028, "Wrong size on WB_BtnHelpSlot2_C_ResetParam");
static_assert(offsetof(WB_BtnHelpSlot2_C_ResetParam, CallFunc_CheckGamePadUI_Gamepad) == 0x000000, "Member 'WB_BtnHelpSlot2_C_ResetParam::CallFunc_CheckGamePadUI_Gamepad' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_ResetParam, K2Node_MakeStruct_BtnHelpInfo) == 0x000008, "Member 'WB_BtnHelpSlot2_C_ResetParam::K2Node_MakeStruct_BtnHelpInfo' has a wrong offset!");

// Function WB_BtnHelpSlot2.WB_BtnHelpSlot2_C.SetHelpInfo2
// 0x0058 (0x0058 - 0x0000)
struct WB_BtnHelpSlot2_C_SetHelpInfo2 final
{
public:
	struct FBtnHelpInfo                           InInfo2;                                           // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Right_ReturnValue;                        // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
};
static_assert(alignof(WB_BtnHelpSlot2_C_SetHelpInfo2) == 0x000008, "Wrong alignment on WB_BtnHelpSlot2_C_SetHelpInfo2");
static_assert(sizeof(WB_BtnHelpSlot2_C_SetHelpInfo2) == 0x000058, "Wrong size on WB_BtnHelpSlot2_C_SetHelpInfo2");
static_assert(offsetof(WB_BtnHelpSlot2_C_SetHelpInfo2, InInfo2) == 0x000000, "Member 'WB_BtnHelpSlot2_C_SetHelpInfo2::InInfo2' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_SetHelpInfo2, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'WB_BtnHelpSlot2_C_SetHelpInfo2::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_SetHelpInfo2, CallFunc_Right_ReturnValue) == 0x000030, "Member 'WB_BtnHelpSlot2_C_SetHelpInfo2::CallFunc_Right_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_SetHelpInfo2, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'WB_BtnHelpSlot2_C_SetHelpInfo2::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WB_BtnHelpSlot2.WB_BtnHelpSlot2_C.SetActiveColor
// 0x0060 (0x0060 - 0x0000)
struct WB_BtnHelpSlot2_C_SetActiveColor final
{
public:
	bool                                          Param_IsActiveColor;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6421[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6422[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0028)()
};
static_assert(alignof(WB_BtnHelpSlot2_C_SetActiveColor) == 0x000008, "Wrong alignment on WB_BtnHelpSlot2_C_SetActiveColor");
static_assert(sizeof(WB_BtnHelpSlot2_C_SetActiveColor) == 0x000060, "Wrong size on WB_BtnHelpSlot2_C_SetActiveColor");
static_assert(offsetof(WB_BtnHelpSlot2_C_SetActiveColor, Param_IsActiveColor) == 0x000000, "Member 'WB_BtnHelpSlot2_C_SetActiveColor::Param_IsActiveColor' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_SetActiveColor, Temp_bool_Variable) == 0x000001, "Member 'WB_BtnHelpSlot2_C_SetActiveColor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_SetActiveColor, Temp_struct_Variable) == 0x000004, "Member 'WB_BtnHelpSlot2_C_SetActiveColor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_SetActiveColor, Temp_struct_Variable_1) == 0x000014, "Member 'WB_BtnHelpSlot2_C_SetActiveColor::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_SetActiveColor, K2Node_Select_Default) == 0x000024, "Member 'WB_BtnHelpSlot2_C_SetActiveColor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_SetActiveColor, K2Node_MakeStruct_SlateColor) == 0x000038, "Member 'WB_BtnHelpSlot2_C_SetActiveColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WB_BtnHelpSlot2.WB_BtnHelpSlot2_C.SetHoldEffect
// 0x000C (0x000C - 0x0000)
struct WB_BtnHelpSlot2_C_SetHoldEffect final
{
public:
	bool                                          Param_IsDrawEffect;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6423[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelpSlot2_C_SetHoldEffect) == 0x000004, "Wrong alignment on WB_BtnHelpSlot2_C_SetHoldEffect");
static_assert(sizeof(WB_BtnHelpSlot2_C_SetHoldEffect) == 0x00000C, "Wrong size on WB_BtnHelpSlot2_C_SetHoldEffect");
static_assert(offsetof(WB_BtnHelpSlot2_C_SetHoldEffect, Param_IsDrawEffect) == 0x000000, "Member 'WB_BtnHelpSlot2_C_SetHoldEffect::Param_IsDrawEffect' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_SetHoldEffect, CallFunc_Play_ReturnValue) == 0x000001, "Member 'WB_BtnHelpSlot2_C_SetHoldEffect::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_SetHoldEffect, CallFunc_GetRenderOpacity_ReturnValue) == 0x000004, "Member 'WB_BtnHelpSlot2_C_SetHoldEffect::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_SetHoldEffect, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'WB_BtnHelpSlot2_C_SetHoldEffect::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function WB_BtnHelpSlot2.WB_BtnHelpSlot2_C.SetCollapsedHoldEffect
// 0x0005 (0x0005 - 0x0000)
struct WB_BtnHelpSlot2_C_SetCollapsedHoldEffect final
{
public:
	bool                                          IsCollapsed;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelpSlot2_C_SetCollapsedHoldEffect) == 0x000001, "Wrong alignment on WB_BtnHelpSlot2_C_SetCollapsedHoldEffect");
static_assert(sizeof(WB_BtnHelpSlot2_C_SetCollapsedHoldEffect) == 0x000005, "Wrong size on WB_BtnHelpSlot2_C_SetCollapsedHoldEffect");
static_assert(offsetof(WB_BtnHelpSlot2_C_SetCollapsedHoldEffect, IsCollapsed) == 0x000000, "Member 'WB_BtnHelpSlot2_C_SetCollapsedHoldEffect::IsCollapsed' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_SetCollapsedHoldEffect, Temp_byte_Variable) == 0x000001, "Member 'WB_BtnHelpSlot2_C_SetCollapsedHoldEffect::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_SetCollapsedHoldEffect, Temp_byte_Variable_1) == 0x000002, "Member 'WB_BtnHelpSlot2_C_SetCollapsedHoldEffect::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_SetCollapsedHoldEffect, Temp_bool_Variable) == 0x000003, "Member 'WB_BtnHelpSlot2_C_SetCollapsedHoldEffect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_SetCollapsedHoldEffect, K2Node_Select_Default) == 0x000004, "Member 'WB_BtnHelpSlot2_C_SetCollapsedHoldEffect::K2Node_Select_Default' has a wrong offset!");

// Function WB_BtnHelpSlot2.WB_BtnHelpSlot2_C.GetActiveColor
// 0x0001 (0x0001 - 0x0000)
struct WB_BtnHelpSlot2_C_GetActiveColor final
{
public:
	bool                                          Param_IsActiveColor;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelpSlot2_C_GetActiveColor) == 0x000001, "Wrong alignment on WB_BtnHelpSlot2_C_GetActiveColor");
static_assert(sizeof(WB_BtnHelpSlot2_C_GetActiveColor) == 0x000001, "Wrong size on WB_BtnHelpSlot2_C_GetActiveColor");
static_assert(offsetof(WB_BtnHelpSlot2_C_GetActiveColor, Param_IsActiveColor) == 0x000000, "Member 'WB_BtnHelpSlot2_C_GetActiveColor::Param_IsActiveColor' has a wrong offset!");

// Function WB_BtnHelpSlot2.WB_BtnHelpSlot2_C.GetTextEndOffset
// 0x0020 (0x0020 - 0x0000)
struct WB_BtnHelpSlot2_C_GetTextEndOffset final
{
public:
	float                                         OffsetX;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNowTextWidth_Width;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelpSlot2_C_GetTextEndOffset) == 0x000004, "Wrong alignment on WB_BtnHelpSlot2_C_GetTextEndOffset");
static_assert(sizeof(WB_BtnHelpSlot2_C_GetTextEndOffset) == 0x000020, "Wrong size on WB_BtnHelpSlot2_C_GetTextEndOffset");
static_assert(offsetof(WB_BtnHelpSlot2_C_GetTextEndOffset, OffsetX) == 0x000000, "Member 'WB_BtnHelpSlot2_C_GetTextEndOffset::OffsetX' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_GetTextEndOffset, CallFunc_GetNowTextWidth_Width) == 0x000004, "Member 'WB_BtnHelpSlot2_C_GetTextEndOffset::CallFunc_GetNowTextWidth_Width' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_GetTextEndOffset, CallFunc_GetDesiredSize_ReturnValue) == 0x000008, "Member 'WB_BtnHelpSlot2_C_GetTextEndOffset::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_GetTextEndOffset, CallFunc_BreakVector2D_X) == 0x000010, "Member 'WB_BtnHelpSlot2_C_GetTextEndOffset::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_GetTextEndOffset, CallFunc_BreakVector2D_Y) == 0x000014, "Member 'WB_BtnHelpSlot2_C_GetTextEndOffset::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_GetTextEndOffset, CallFunc_Add_FloatFloat_ReturnValue) == 0x000018, "Member 'WB_BtnHelpSlot2_C_GetTextEndOffset::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_GetTextEndOffset, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'WB_BtnHelpSlot2_C_GetTextEndOffset::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function WB_BtnHelpSlot2.WB_BtnHelpSlot2_C.GetNowTextWidth
// 0x0020 (0x0020 - 0x0000)
struct WB_BtnHelpSlot2_C_GetNowTextWidth final
{
public:
	float                                         Width;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelpSlot2_C_GetNowTextWidth) == 0x000004, "Wrong alignment on WB_BtnHelpSlot2_C_GetNowTextWidth");
static_assert(sizeof(WB_BtnHelpSlot2_C_GetNowTextWidth) == 0x000020, "Wrong size on WB_BtnHelpSlot2_C_GetNowTextWidth");
static_assert(offsetof(WB_BtnHelpSlot2_C_GetNowTextWidth, Width) == 0x000000, "Member 'WB_BtnHelpSlot2_C_GetNowTextWidth::Width' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_GetNowTextWidth, CallFunc_GetDesiredSize_ReturnValue) == 0x000004, "Member 'WB_BtnHelpSlot2_C_GetNowTextWidth::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_GetNowTextWidth, CallFunc_BreakVector2D_X) == 0x00000C, "Member 'WB_BtnHelpSlot2_C_GetNowTextWidth::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_GetNowTextWidth, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'WB_BtnHelpSlot2_C_GetNowTextWidth::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_GetNowTextWidth, CallFunc_BreakVector2D_X_1) == 0x000014, "Member 'WB_BtnHelpSlot2_C_GetNowTextWidth::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_GetNowTextWidth, CallFunc_BreakVector2D_Y_1) == 0x000018, "Member 'WB_BtnHelpSlot2_C_GetNowTextWidth::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_GetNowTextWidth, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'WB_BtnHelpSlot2_C_GetNowTextWidth::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function WB_BtnHelpSlot2.WB_BtnHelpSlot2_C.GetLastCharWidth
// 0x0020 (0x0020 - 0x0000)
struct WB_BtnHelpSlot2_C_GetLastCharWidth final
{
public:
	float                                         LastCharWidth;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelpSlot2_C_GetLastCharWidth) == 0x000004, "Wrong alignment on WB_BtnHelpSlot2_C_GetLastCharWidth");
static_assert(sizeof(WB_BtnHelpSlot2_C_GetLastCharWidth) == 0x000020, "Wrong size on WB_BtnHelpSlot2_C_GetLastCharWidth");
static_assert(offsetof(WB_BtnHelpSlot2_C_GetLastCharWidth, LastCharWidth) == 0x000000, "Member 'WB_BtnHelpSlot2_C_GetLastCharWidth::LastCharWidth' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_GetLastCharWidth, CallFunc_GetDesiredSize_ReturnValue) == 0x000004, "Member 'WB_BtnHelpSlot2_C_GetLastCharWidth::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_GetLastCharWidth, CallFunc_BreakVector2D_X) == 0x00000C, "Member 'WB_BtnHelpSlot2_C_GetLastCharWidth::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_GetLastCharWidth, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'WB_BtnHelpSlot2_C_GetLastCharWidth::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_GetLastCharWidth, CallFunc_BreakVector2D_X_1) == 0x000014, "Member 'WB_BtnHelpSlot2_C_GetLastCharWidth::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_GetLastCharWidth, CallFunc_BreakVector2D_Y_1) == 0x000018, "Member 'WB_BtnHelpSlot2_C_GetLastCharWidth::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_GetLastCharWidth, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'WB_BtnHelpSlot2_C_GetLastCharWidth::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function WB_BtnHelpSlot2.WB_BtnHelpSlot2_C.SetDispMode
// 0x0001 (0x0001 - 0x0000)
struct WB_BtnHelpSlot2_C_SetDispMode final
{
public:
	bool                                          IsGamePad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtnHelpSlot2_C_SetDispMode) == 0x000001, "Wrong alignment on WB_BtnHelpSlot2_C_SetDispMode");
static_assert(sizeof(WB_BtnHelpSlot2_C_SetDispMode) == 0x000001, "Wrong size on WB_BtnHelpSlot2_C_SetDispMode");
static_assert(offsetof(WB_BtnHelpSlot2_C_SetDispMode, IsGamePad) == 0x000000, "Member 'WB_BtnHelpSlot2_C_SetDispMode::IsGamePad' has a wrong offset!");

// Function WB_BtnHelpSlot2.WB_BtnHelpSlot2_C.UpdatePartsLayout
// 0x0130 (0x0130 - 0x0000)
struct WB_BtnHelpSlot2_C_UpdatePartsLayout final
{
public:
	struct FVector2D                              L_HoldEffectSize;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_PartsOffset;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              L_MainCanvasSize;                                  // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6424[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6425[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_4;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_4;                        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue_1;             // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_5;                        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_5;                        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_6;                        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_6;                        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue_2;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_7;                        // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_7;                        // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6426[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_4;           // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_8;                        // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_8;                        // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_8;        // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTextEndOffset_OffsetX;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_4;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_5;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_5;           // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtnHelpSlot2_C_UpdatePartsLayout) == 0x000008, "Wrong alignment on WB_BtnHelpSlot2_C_UpdatePartsLayout");
static_assert(sizeof(WB_BtnHelpSlot2_C_UpdatePartsLayout) == 0x000130, "Wrong size on WB_BtnHelpSlot2_C_UpdatePartsLayout");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, L_HoldEffectSize) == 0x000000, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::L_HoldEffectSize' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, L_PartsOffset) == 0x000008, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::L_PartsOffset' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, L_MainCanvasSize) == 0x00000C, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::L_MainCanvasSize' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_BreakVector2D_X) == 0x000014, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_BreakVector2D_Y) == 0x000018, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_BreakVector2D_X_1) == 0x00001C, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_BreakVector2D_Y_1) == 0x000020, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000028, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000030, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_MakeVector2D_ReturnValue) == 0x000038, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000040, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_GetDesiredSize_ReturnValue) == 0x000044, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_BreakVector2D_X_2) == 0x00004C, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_BreakVector2D_Y_2) == 0x000050, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_BreakVector2D_X_3) == 0x000054, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_BreakVector2D_Y_3) == 0x000058, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000060, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000068, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_Add_FloatFloat_ReturnValue) == 0x00006C, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000070, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_MakeVector2D_ReturnValue_1) == 0x000078, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_BreakVector2D_X_4) == 0x000080, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_BreakVector2D_X_4' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_BreakVector2D_Y_4) == 0x000084, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_BreakVector2D_Y_4' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000088, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_GetDesiredSize_ReturnValue_1) == 0x00008C, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_GetDesiredSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_Abs_ReturnValue) == 0x000094, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_BreakVector2D_X_5) == 0x000098, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_BreakVector2D_X_5' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_BreakVector2D_Y_5) == 0x00009C, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_BreakVector2D_Y_5' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x0000A0, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_BreakVector2D_X_6) == 0x0000A8, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_BreakVector2D_X_6' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_BreakVector2D_Y_6) == 0x0000AC, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_BreakVector2D_Y_6' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x0000B0, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x0000B4, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0000B8, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x0000BC, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_GetDesiredSize_ReturnValue_2) == 0x0000C0, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_GetDesiredSize_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_MakeVector2D_ReturnValue_2) == 0x0000C8, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_BreakVector2D_X_7) == 0x0000D0, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_BreakVector2D_X_7' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_BreakVector2D_Y_7) == 0x0000D4, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_BreakVector2D_Y_7' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x0000D8, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_Round_ReturnValue) == 0x0000DC, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000E0, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_SlotAsCanvasSlot_ReturnValue_4) == 0x0000E8, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_SlotAsCanvasSlot_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_MakeVector2D_ReturnValue_3) == 0x0000F0, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_BreakVector2D_X_8) == 0x0000F8, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_BreakVector2D_X_8' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_BreakVector2D_Y_8) == 0x0000FC, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_BreakVector2D_Y_8' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_Multiply_FloatFloat_ReturnValue_7) == 0x000100, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_Multiply_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000104, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_Multiply_FloatFloat_ReturnValue_8) == 0x000108, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_Multiply_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_Round_ReturnValue_1) == 0x00010C, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000110, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_BtnHelpSlot2_C_UpdatePartsLayout, CallFunc_GetTextEndOffset_OffsetX) == 0x000114, "Member 'WB_BtnHelpSlot2_C_UpdatePartsLayout::CallFunc_GetTextEndOffset_OffsetX' has a wrong offset!");
