#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BtlTargetDevil_HitCombo

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WB_BtlTargetDevil_HitCombo.WB_BtlTargetDevil_HitCombo_C.GetDigit_2
// 0x0220 (0x0220 - 0x0000)
struct WB_BtlTargetDevil_HitCombo_C_GetDigit_2 final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0088)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            Lo_Tint;                                           // 0x0088(0x0028)(Edit, BlueprintVisible)
	int32                                         Lo_Num;                                            // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45DC[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00B8(0x0028)()
	class UObject*                                CallFunc_GetImage_retImage;                        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45DD[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00F0(0x0088)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45DE[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetImage_retImage_1;                      // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_SplitDigit_ReturnValue;                   // 0x0188(0x0010)(ReferenceParm)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0198(0x0088)()
};
static_assert(alignof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2) == 0x000008, "Wrong alignment on WB_BtlTargetDevil_HitCombo_C_GetDigit_2");
static_assert(sizeof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2) == 0x000220, "Wrong size on WB_BtlTargetDevil_HitCombo_C_GetDigit_2");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2, ReturnValue) == 0x000000, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_2::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2, Lo_Tint) == 0x000088, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_2::Lo_Tint' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2, Lo_Num) == 0x0000B0, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_2::Lo_Num' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2, K2Node_MakeStruct_SlateColor) == 0x0000B8, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_2::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2, CallFunc_GetImage_retImage) == 0x0000E0, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_2::CallFunc_GetImage_retImage' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2, CallFunc_Greater_IntInt_ReturnValue) == 0x0000E8, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_2::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2, K2Node_MakeStruct_SlateBrush) == 0x0000F0, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_2::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2, CallFunc_BooleanAND_ReturnValue) == 0x000178, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_2::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2, CallFunc_GetImage_retImage_1) == 0x000180, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_2::CallFunc_GetImage_retImage_1' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2, CallFunc_SplitDigit_ReturnValue) == 0x000188, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_2::CallFunc_SplitDigit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2, K2Node_MakeStruct_SlateBrush_1) == 0x000198, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_2::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");

// Function WB_BtlTargetDevil_HitCombo.WB_BtlTargetDevil_HitCombo_C.GetImage
// 0x0018 (0x0018 - 0x0000)
struct WB_BtlTargetDevil_HitCombo_C_GetImage final
{
public:
	int32                                         Number;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45DF[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetImage;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlTargetDevil_HitCombo_C_GetImage) == 0x000008, "Wrong alignment on WB_BtlTargetDevil_HitCombo_C_GetImage");
static_assert(sizeof(WB_BtlTargetDevil_HitCombo_C_GetImage) == 0x000018, "Wrong size on WB_BtlTargetDevil_HitCombo_C_GetImage");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetImage, Number) == 0x000000, "Member 'WB_BtlTargetDevil_HitCombo_C_GetImage::Number' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetImage, RetImage) == 0x000008, "Member 'WB_BtlTargetDevil_HitCombo_C_GetImage::RetImage' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetImage, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'WB_BtlTargetDevil_HitCombo_C_GetImage::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_BtlTargetDevil_HitCombo.WB_BtlTargetDevil_HitCombo_C.GetDigit_1
// 0x0218 (0x0218 - 0x0000)
struct WB_BtlTargetDevil_HitCombo_C_GetDigit_1 final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0088)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            Lo_Tint;                                           // 0x0088(0x0028)(Edit, BlueprintVisible)
	int32                                         Lo_Num;                                            // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45E0[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00B8(0x0028)()
	class UObject*                                CallFunc_GetImage_retImage;                        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00E8(0x0088)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45E1[0x6];                                     // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_SplitDigit_ReturnValue;                   // 0x0178(0x0010)(ReferenceParm)
	class UObject*                                CallFunc_GetImage_retImage_1;                      // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0190(0x0088)()
};
static_assert(alignof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1) == 0x000008, "Wrong alignment on WB_BtlTargetDevil_HitCombo_C_GetDigit_1");
static_assert(sizeof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1) == 0x000218, "Wrong size on WB_BtlTargetDevil_HitCombo_C_GetDigit_1");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1, ReturnValue) == 0x000000, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_1::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1, Lo_Tint) == 0x000088, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_1::Lo_Tint' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1, Lo_Num) == 0x0000B0, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_1::Lo_Num' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1, K2Node_MakeStruct_SlateColor) == 0x0000B8, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_1::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1, CallFunc_GetImage_retImage) == 0x0000E0, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_1::CallFunc_GetImage_retImage' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1, K2Node_MakeStruct_SlateBrush) == 0x0000E8, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_1::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1, CallFunc_Greater_IntInt_ReturnValue) == 0x000170, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_1::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1, CallFunc_BooleanAND_ReturnValue) == 0x000171, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_1::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1, CallFunc_SplitDigit_ReturnValue) == 0x000178, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_1::CallFunc_SplitDigit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1, CallFunc_GetImage_retImage_1) == 0x000188, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_1::CallFunc_GetImage_retImage_1' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1, K2Node_MakeStruct_SlateBrush_1) == 0x000190, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_1::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");

// Function WB_BtlTargetDevil_HitCombo.WB_BtlTargetDevil_HitCombo_C.GetDigit_2S
// 0x0218 (0x0218 - 0x0000)
struct WB_BtlTargetDevil_HitCombo_C_GetDigit_2S final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0088)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            Lo_Tint;                                           // 0x0088(0x0028)(Edit, BlueprintVisible)
	int32                                         Lo_Num;                                            // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45E2[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00B8(0x0028)()
	TArray<int32>                                 CallFunc_SplitDigit_ReturnValue;                   // 0x00E0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45E3[0x6];                                     // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetImage_retImage;                        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0100(0x0088)()
	class UObject*                                CallFunc_GetImage_retImage_1;                      // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0190(0x0088)()
};
static_assert(alignof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2S) == 0x000008, "Wrong alignment on WB_BtlTargetDevil_HitCombo_C_GetDigit_2S");
static_assert(sizeof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2S) == 0x000218, "Wrong size on WB_BtlTargetDevil_HitCombo_C_GetDigit_2S");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2S, ReturnValue) == 0x000000, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_2S::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2S, Lo_Tint) == 0x000088, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_2S::Lo_Tint' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2S, Lo_Num) == 0x0000B0, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_2S::Lo_Num' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2S, K2Node_MakeStruct_SlateColor) == 0x0000B8, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_2S::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2S, CallFunc_SplitDigit_ReturnValue) == 0x0000E0, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_2S::CallFunc_SplitDigit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2S, CallFunc_Greater_IntInt_ReturnValue) == 0x0000F0, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_2S::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2S, CallFunc_BooleanAND_ReturnValue) == 0x0000F1, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_2S::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2S, CallFunc_GetImage_retImage) == 0x0000F8, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_2S::CallFunc_GetImage_retImage' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2S, K2Node_MakeStruct_SlateBrush) == 0x000100, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_2S::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2S, CallFunc_GetImage_retImage_1) == 0x000188, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_2S::CallFunc_GetImage_retImage_1' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_2S, K2Node_MakeStruct_SlateBrush_1) == 0x000190, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_2S::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");

// Function WB_BtlTargetDevil_HitCombo.WB_BtlTargetDevil_HitCombo_C.GetDigit_1S
// 0x0218 (0x0218 - 0x0000)
struct WB_BtlTargetDevil_HitCombo_C_GetDigit_1S final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0088)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            Lo_Tint;                                           // 0x0088(0x0028)(Edit, BlueprintVisible)
	int32                                         Lo_Num;                                            // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45E4[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00B8(0x0028)()
	TArray<int32>                                 CallFunc_SplitDigit_ReturnValue;                   // 0x00E0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45E5[0x6];                                     // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetImage_retImage;                        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0100(0x0088)()
	class UObject*                                CallFunc_GetImage_retImage_1;                      // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0190(0x0088)()
};
static_assert(alignof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1S) == 0x000008, "Wrong alignment on WB_BtlTargetDevil_HitCombo_C_GetDigit_1S");
static_assert(sizeof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1S) == 0x000218, "Wrong size on WB_BtlTargetDevil_HitCombo_C_GetDigit_1S");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1S, ReturnValue) == 0x000000, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_1S::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1S, Lo_Tint) == 0x000088, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_1S::Lo_Tint' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1S, Lo_Num) == 0x0000B0, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_1S::Lo_Num' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1S, K2Node_MakeStruct_SlateColor) == 0x0000B8, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_1S::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1S, CallFunc_SplitDigit_ReturnValue) == 0x0000E0, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_1S::CallFunc_SplitDigit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1S, CallFunc_Greater_IntInt_ReturnValue) == 0x0000F0, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_1S::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1S, CallFunc_BooleanAND_ReturnValue) == 0x0000F1, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_1S::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1S, CallFunc_GetImage_retImage) == 0x0000F8, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_1S::CallFunc_GetImage_retImage' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1S, K2Node_MakeStruct_SlateBrush) == 0x000100, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_1S::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1S, CallFunc_GetImage_retImage_1) == 0x000188, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_1S::CallFunc_GetImage_retImage_1' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetDigit_1S, K2Node_MakeStruct_SlateBrush_1) == 0x000190, "Member 'WB_BtlTargetDevil_HitCombo_C_GetDigit_1S::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");

// Function WB_BtlTargetDevil_HitCombo.WB_BtlTargetDevil_HitCombo_C.GetVisibilityS
// 0x0003 (0x0003 - 0x0000)
struct WB_BtlTargetDevil_HitCombo_C_GetVisibilityS final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlTargetDevil_HitCombo_C_GetVisibilityS) == 0x000001, "Wrong alignment on WB_BtlTargetDevil_HitCombo_C_GetVisibilityS");
static_assert(sizeof(WB_BtlTargetDevil_HitCombo_C_GetVisibilityS) == 0x000003, "Wrong size on WB_BtlTargetDevil_HitCombo_C_GetVisibilityS");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetVisibilityS, ReturnValue) == 0x000000, "Member 'WB_BtlTargetDevil_HitCombo_C_GetVisibilityS::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetVisibilityS, CallFunc_Greater_IntInt_ReturnValue) == 0x000001, "Member 'WB_BtlTargetDevil_HitCombo_C_GetVisibilityS::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetVisibilityS, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'WB_BtlTargetDevil_HitCombo_C_GetVisibilityS::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WB_BtlTargetDevil_HitCombo.WB_BtlTargetDevil_HitCombo_C.GetVisibilityL
// 0x0003 (0x0003 - 0x0000)
struct WB_BtlTargetDevil_HitCombo_C_GetVisibilityL final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlTargetDevil_HitCombo_C_GetVisibilityL) == 0x000001, "Wrong alignment on WB_BtlTargetDevil_HitCombo_C_GetVisibilityL");
static_assert(sizeof(WB_BtlTargetDevil_HitCombo_C_GetVisibilityL) == 0x000003, "Wrong size on WB_BtlTargetDevil_HitCombo_C_GetVisibilityL");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetVisibilityL, ReturnValue) == 0x000000, "Member 'WB_BtlTargetDevil_HitCombo_C_GetVisibilityL::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetVisibilityL, CallFunc_Greater_IntInt_ReturnValue) == 0x000001, "Member 'WB_BtlTargetDevil_HitCombo_C_GetVisibilityL::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_GetVisibilityL, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'WB_BtlTargetDevil_HitCombo_C_GetVisibilityL::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WB_BtlTargetDevil_HitCombo.WB_BtlTargetDevil_HitCombo_C.ShowSmall
// 0x0118 (0x0118 - 0x0000)
struct WB_BtlTargetDevil_HitCombo_C_ShowSmall final
{
public:
	struct FSlateBrush                            CallFunc_GetDigit_2S_ReturnValue;                  // 0x0000(0x0088)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45E6[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetDigit_1S_ReturnValue;                  // 0x0090(0x0088)()
};
static_assert(alignof(WB_BtlTargetDevil_HitCombo_C_ShowSmall) == 0x000008, "Wrong alignment on WB_BtlTargetDevil_HitCombo_C_ShowSmall");
static_assert(sizeof(WB_BtlTargetDevil_HitCombo_C_ShowSmall) == 0x000118, "Wrong size on WB_BtlTargetDevil_HitCombo_C_ShowSmall");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_ShowSmall, CallFunc_GetDigit_2S_ReturnValue) == 0x000000, "Member 'WB_BtlTargetDevil_HitCombo_C_ShowSmall::CallFunc_GetDigit_2S_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_ShowSmall, CallFunc_Greater_IntInt_ReturnValue) == 0x000088, "Member 'WB_BtlTargetDevil_HitCombo_C_ShowSmall::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_ShowSmall, CallFunc_GetDigit_1S_ReturnValue) == 0x000090, "Member 'WB_BtlTargetDevil_HitCombo_C_ShowSmall::CallFunc_GetDigit_1S_ReturnValue' has a wrong offset!");

// Function WB_BtlTargetDevil_HitCombo.WB_BtlTargetDevil_HitCombo_C.SetNowCombo
// 0x0004 (0x0004 - 0x0000)
struct WB_BtlTargetDevil_HitCombo_C_SetNowCombo final
{
public:
	int32                                         Combo;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtlTargetDevil_HitCombo_C_SetNowCombo) == 0x000004, "Wrong alignment on WB_BtlTargetDevil_HitCombo_C_SetNowCombo");
static_assert(sizeof(WB_BtlTargetDevil_HitCombo_C_SetNowCombo) == 0x000004, "Wrong size on WB_BtlTargetDevil_HitCombo_C_SetNowCombo");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_SetNowCombo, Combo) == 0x000000, "Member 'WB_BtlTargetDevil_HitCombo_C_SetNowCombo::Combo' has a wrong offset!");

// Function WB_BtlTargetDevil_HitCombo.WB_BtlTargetDevil_HitCombo_C.AddNowCombo
// 0x0008 (0x0008 - 0x0000)
struct WB_BtlTargetDevil_HitCombo_C_AddNowCombo final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtlTargetDevil_HitCombo_C_AddNowCombo) == 0x000004, "Wrong alignment on WB_BtlTargetDevil_HitCombo_C_AddNowCombo");
static_assert(sizeof(WB_BtlTargetDevil_HitCombo_C_AddNowCombo) == 0x000008, "Wrong size on WB_BtlTargetDevil_HitCombo_C_AddNowCombo");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_AddNowCombo, Temp_int_Variable) == 0x000000, "Member 'WB_BtlTargetDevil_HitCombo_C_AddNowCombo::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_AddNowCombo, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WB_BtlTargetDevil_HitCombo_C_AddNowCombo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WB_BtlTargetDevil_HitCombo.WB_BtlTargetDevil_HitCombo_C.SetNextPlusCombo
// 0x0004 (0x0004 - 0x0000)
struct WB_BtlTargetDevil_HitCombo_C_SetNextPlusCombo final
{
public:
	int32                                         NextPlusCombo;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtlTargetDevil_HitCombo_C_SetNextPlusCombo) == 0x000004, "Wrong alignment on WB_BtlTargetDevil_HitCombo_C_SetNextPlusCombo");
static_assert(sizeof(WB_BtlTargetDevil_HitCombo_C_SetNextPlusCombo) == 0x000004, "Wrong size on WB_BtlTargetDevil_HitCombo_C_SetNextPlusCombo");
static_assert(offsetof(WB_BtlTargetDevil_HitCombo_C_SetNextPlusCombo, NextPlusCombo) == 0x000000, "Member 'WB_BtlTargetDevil_HitCombo_C_SetNextPlusCombo::NextPlusCombo' has a wrong offset!");

}

