#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BtlInfoMess

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Project_structs.hpp"


namespace SDK::Params
{

// Function WB_BtlInfoMess.WB_BtlInfoMess_C.ShowBySkill
// 0x00A0 (0x00A0 - 0x0000)
struct WB_BtlInfoMess_C_ShowBySkill final
{
public:
	int32                                         SkillId;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D73[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SrcActorName;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DstActorName;                                      // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsMaster;                                          // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D74[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OverwriteSkillMesID;                               // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Lo_ProgramVal;                                     // 0x0030(0x0010)(Edit, BlueprintVisible)
	struct FSkillInfoMess                         Lo_SkillInfoMess;                                  // 0x0040(0x001C)(Edit, BlueprintVisible, NoDestructor)
	int32                                         Lo_StringIndex;                                    // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_MessageID;                                      // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D75[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    Lo_MessageAsset;                                   // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D76[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkillInfoMess                         CallFunc_GetSkillInfoMessData_ReturnValue;         // 0x0074(0x001C)(ConstParm, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue_1;           // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlInfoMess_C_ShowBySkill) == 0x000008, "Wrong alignment on WB_BtlInfoMess_C_ShowBySkill");
static_assert(sizeof(WB_BtlInfoMess_C_ShowBySkill) == 0x0000A0, "Wrong size on WB_BtlInfoMess_C_ShowBySkill");
static_assert(offsetof(WB_BtlInfoMess_C_ShowBySkill, SkillId) == 0x000000, "Member 'WB_BtlInfoMess_C_ShowBySkill::SkillId' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowBySkill, SrcActorName) == 0x000008, "Member 'WB_BtlInfoMess_C_ShowBySkill::SrcActorName' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowBySkill, DstActorName) == 0x000018, "Member 'WB_BtlInfoMess_C_ShowBySkill::DstActorName' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowBySkill, IsMaster) == 0x000028, "Member 'WB_BtlInfoMess_C_ShowBySkill::IsMaster' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowBySkill, OverwriteSkillMesID) == 0x00002C, "Member 'WB_BtlInfoMess_C_ShowBySkill::OverwriteSkillMesID' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowBySkill, Lo_ProgramVal) == 0x000030, "Member 'WB_BtlInfoMess_C_ShowBySkill::Lo_ProgramVal' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowBySkill, Lo_SkillInfoMess) == 0x000040, "Member 'WB_BtlInfoMess_C_ShowBySkill::Lo_SkillInfoMess' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowBySkill, Lo_StringIndex) == 0x00005C, "Member 'WB_BtlInfoMess_C_ShowBySkill::Lo_StringIndex' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowBySkill, Lo_MessageID) == 0x000060, "Member 'WB_BtlInfoMess_C_ShowBySkill::Lo_MessageID' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowBySkill, Lo_MessageAsset) == 0x000068, "Member 'WB_BtlInfoMess_C_ShowBySkill::Lo_MessageAsset' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowBySkill, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000070, "Member 'WB_BtlInfoMess_C_ShowBySkill::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowBySkill, CallFunc_GetSkillInfoMessData_ReturnValue) == 0x000074, "Member 'WB_BtlInfoMess_C_ShowBySkill::CallFunc_GetSkillInfoMessData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowBySkill, CallFunc_Array_Add_ReturnValue) == 0x000090, "Member 'WB_BtlInfoMess_C_ShowBySkill::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowBySkill, CallFunc_Array_Add_ReturnValue_1) == 0x000094, "Member 'WB_BtlInfoMess_C_ShowBySkill::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowBySkill, CallFunc_Greater_ByteByte_ReturnValue) == 0x000098, "Member 'WB_BtlInfoMess_C_ShowBySkill::CallFunc_Greater_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowBySkill, CallFunc_Greater_ByteByte_ReturnValue_1) == 0x000099, "Member 'WB_BtlInfoMess_C_ShowBySkill::CallFunc_Greater_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowBySkill, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x00009A, "Member 'WB_BtlInfoMess_C_ShowBySkill::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function WB_BtlInfoMess.WB_BtlInfoMess_C.Hide
// 0x0030 (0x0030 - 0x0000)
struct WB_BtlInfoMess_C_Hide final
{
public:
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D77[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_InfoWindowCtrl_C> CallFunc_BPI_GetInfoWindowCtrl_OutActor;           // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlInfoMess_C_Hide) == 0x000008, "Wrong alignment on WB_BtlInfoMess_C_Hide");
static_assert(sizeof(WB_BtlInfoMess_C_Hide) == 0x000030, "Wrong size on WB_BtlInfoMess_C_Hide");
static_assert(offsetof(WB_BtlInfoMess_C_Hide, CallFunc_Get_ReturnValue) == 0x000000, "Member 'WB_BtlInfoMess_C_Hide::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_Hide, K2Node_DynamicCast_AsBPI_UIManager) == 0x000008, "Member 'WB_BtlInfoMess_C_Hide::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_Hide, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WB_BtlInfoMess_C_Hide::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_Hide, CallFunc_BPI_GetInfoWindowCtrl_OutActor) == 0x000020, "Member 'WB_BtlInfoMess_C_Hide::CallFunc_BPI_GetInfoWindowCtrl_OutActor' has a wrong offset!");

// Function WB_BtlInfoMess.WB_BtlInfoMess_C.EndSeq
// 0x0030 (0x0030 - 0x0000)
struct WB_BtlInfoMess_C_EndSeq final
{
public:
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D78[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_InfoWindowCtrl_C> CallFunc_BPI_GetInfoWindowCtrl_OutActor;           // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlInfoMess_C_EndSeq) == 0x000008, "Wrong alignment on WB_BtlInfoMess_C_EndSeq");
static_assert(sizeof(WB_BtlInfoMess_C_EndSeq) == 0x000030, "Wrong size on WB_BtlInfoMess_C_EndSeq");
static_assert(offsetof(WB_BtlInfoMess_C_EndSeq, CallFunc_Get_ReturnValue) == 0x000000, "Member 'WB_BtlInfoMess_C_EndSeq::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_EndSeq, K2Node_DynamicCast_AsBPI_UIManager) == 0x000008, "Member 'WB_BtlInfoMess_C_EndSeq::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_EndSeq, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WB_BtlInfoMess_C_EndSeq::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_EndSeq, CallFunc_BPI_GetInfoWindowCtrl_OutActor) == 0x000020, "Member 'WB_BtlInfoMess_C_EndSeq::CallFunc_BPI_GetInfoWindowCtrl_OutActor' has a wrong offset!");

// Function WB_BtlInfoMess.WB_BtlInfoMess_C.IsAnimationExcuting
// 0x0004 (0x0004 - 0x0000)
struct WB_BtlInfoMess_C_IsAnimationExcuting final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlInfoMess_C_IsAnimationExcuting) == 0x000001, "Wrong alignment on WB_BtlInfoMess_C_IsAnimationExcuting");
static_assert(sizeof(WB_BtlInfoMess_C_IsAnimationExcuting) == 0x000004, "Wrong size on WB_BtlInfoMess_C_IsAnimationExcuting");
static_assert(offsetof(WB_BtlInfoMess_C_IsAnimationExcuting, NewParam) == 0x000000, "Member 'WB_BtlInfoMess_C_IsAnimationExcuting::NewParam' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_IsAnimationExcuting, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000001, "Member 'WB_BtlInfoMess_C_IsAnimationExcuting::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_IsAnimationExcuting, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000002, "Member 'WB_BtlInfoMess_C_IsAnimationExcuting::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_IsAnimationExcuting, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'WB_BtlInfoMess_C_IsAnimationExcuting::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WB_BtlInfoMess.WB_BtlInfoMess_C.isDispOn
// 0x0040 (0x0040 - 0x0000)
struct WB_BtlInfoMess_C_IsDispOn final
{
public:
	bool                                          RetValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D79[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D7A[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_InfoWindowCtrl_C> CallFunc_BPI_GetInfoWindowCtrl_OutActor;           // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IIsFinishedInfoWindowOpen_OutFinished;    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlInfoMess_C_IsDispOn) == 0x000008, "Wrong alignment on WB_BtlInfoMess_C_IsDispOn");
static_assert(sizeof(WB_BtlInfoMess_C_IsDispOn) == 0x000040, "Wrong size on WB_BtlInfoMess_C_IsDispOn");
static_assert(offsetof(WB_BtlInfoMess_C_IsDispOn, RetValue) == 0x000000, "Member 'WB_BtlInfoMess_C_IsDispOn::RetValue' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_IsDispOn, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WB_BtlInfoMess_C_IsDispOn::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_IsDispOn, K2Node_DynamicCast_AsBPI_UIManager) == 0x000010, "Member 'WB_BtlInfoMess_C_IsDispOn::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_IsDispOn, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WB_BtlInfoMess_C_IsDispOn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_IsDispOn, CallFunc_BPI_GetInfoWindowCtrl_OutActor) == 0x000028, "Member 'WB_BtlInfoMess_C_IsDispOn::CallFunc_BPI_GetInfoWindowCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_IsDispOn, CallFunc_IIsFinishedInfoWindowOpen_OutFinished) == 0x000038, "Member 'WB_BtlInfoMess_C_IsDispOn::CallFunc_IIsFinishedInfoWindowOpen_OutFinished' has a wrong offset!");

// Function WB_BtlInfoMess.WB_BtlInfoMess_C.ShowExtActMess
// 0x0020 (0x0020 - 0x0000)
struct WB_BtlInfoMess_C_ShowExtActMess final
{
public:
	E_BTL_EXTRA_ACTION                            MessageIndex;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D7B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ProgramStr;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtlInfoMess_C_ShowExtActMess) == 0x000008, "Wrong alignment on WB_BtlInfoMess_C_ShowExtActMess");
static_assert(sizeof(WB_BtlInfoMess_C_ShowExtActMess) == 0x000020, "Wrong size on WB_BtlInfoMess_C_ShowExtActMess");
static_assert(offsetof(WB_BtlInfoMess_C_ShowExtActMess, MessageIndex) == 0x000000, "Member 'WB_BtlInfoMess_C_ShowExtActMess::MessageIndex' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowExtActMess, ProgramStr) == 0x000008, "Member 'WB_BtlInfoMess_C_ShowExtActMess::ProgramStr' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowExtActMess, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000018, "Member 'WB_BtlInfoMess_C_ShowExtActMess::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function WB_BtlInfoMess.WB_BtlInfoMess_C.Setup
// 0x0030 (0x0030 - 0x0000)
struct WB_BtlInfoMess_C_Setup final
{
public:
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D7C[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_InfoWindowCtrl_C> CallFunc_BPI_GetInfoWindowCtrl_OutActor;           // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlInfoMess_C_Setup) == 0x000008, "Wrong alignment on WB_BtlInfoMess_C_Setup");
static_assert(sizeof(WB_BtlInfoMess_C_Setup) == 0x000030, "Wrong size on WB_BtlInfoMess_C_Setup");
static_assert(offsetof(WB_BtlInfoMess_C_Setup, CallFunc_Get_ReturnValue) == 0x000000, "Member 'WB_BtlInfoMess_C_Setup::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_Setup, K2Node_DynamicCast_AsBPI_UIManager) == 0x000008, "Member 'WB_BtlInfoMess_C_Setup::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_Setup, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WB_BtlInfoMess_C_Setup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_Setup, CallFunc_BPI_GetInfoWindowCtrl_OutActor) == 0x000020, "Member 'WB_BtlInfoMess_C_Setup::CallFunc_BPI_GetInfoWindowCtrl_OutActor' has a wrong offset!");

// Function WB_BtlInfoMess.WB_BtlInfoMess_C.ShowByCommonMess
// 0x0004 (0x0004 - 0x0000)
struct WB_BtlInfoMess_C_ShowByCommonMess final
{
public:
	int32                                         MessageID;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtlInfoMess_C_ShowByCommonMess) == 0x000004, "Wrong alignment on WB_BtlInfoMess_C_ShowByCommonMess");
static_assert(sizeof(WB_BtlInfoMess_C_ShowByCommonMess) == 0x000004, "Wrong size on WB_BtlInfoMess_C_ShowByCommonMess");
static_assert(offsetof(WB_BtlInfoMess_C_ShowByCommonMess, MessageID) == 0x000000, "Member 'WB_BtlInfoMess_C_ShowByCommonMess::MessageID' has a wrong offset!");

// Function WB_BtlInfoMess.WB_BtlInfoMess_C.ReserveCommonInfoTagParam
// 0x0018 (0x0018 - 0x0000)
struct WB_BtlInfoMess_C_ReserveCommonInfoTagParam final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_BtlInfoMess_C_ReserveCommonInfoTagParam) == 0x000008, "Wrong alignment on WB_BtlInfoMess_C_ReserveCommonInfoTagParam");
static_assert(sizeof(WB_BtlInfoMess_C_ReserveCommonInfoTagParam) == 0x000018, "Wrong size on WB_BtlInfoMess_C_ReserveCommonInfoTagParam");
static_assert(offsetof(WB_BtlInfoMess_C_ReserveCommonInfoTagParam, String) == 0x000000, "Member 'WB_BtlInfoMess_C_ReserveCommonInfoTagParam::String' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ReserveCommonInfoTagParam, CallFunc_Array_Add_ReturnValue) == 0x000010, "Member 'WB_BtlInfoMess_C_ReserveCommonInfoTagParam::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WB_BtlInfoMess.WB_BtlInfoMess_C.SetWidgetVisibility
// 0x0038 (0x0038 - 0x0000)
struct WB_BtlInfoMess_C_SetWidgetVisibility final
{
public:
	bool                                          Param_IsVisible;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D7D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D7E[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_InfoWindowCtrl_C> CallFunc_BPI_GetInfoWindowCtrl_OutActor;           // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlInfoMess_C_SetWidgetVisibility) == 0x000008, "Wrong alignment on WB_BtlInfoMess_C_SetWidgetVisibility");
static_assert(sizeof(WB_BtlInfoMess_C_SetWidgetVisibility) == 0x000038, "Wrong size on WB_BtlInfoMess_C_SetWidgetVisibility");
static_assert(offsetof(WB_BtlInfoMess_C_SetWidgetVisibility, Param_IsVisible) == 0x000000, "Member 'WB_BtlInfoMess_C_SetWidgetVisibility::Param_IsVisible' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_SetWidgetVisibility, Temp_bool_Variable) == 0x000001, "Member 'WB_BtlInfoMess_C_SetWidgetVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_SetWidgetVisibility, Temp_byte_Variable) == 0x000002, "Member 'WB_BtlInfoMess_C_SetWidgetVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_SetWidgetVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'WB_BtlInfoMess_C_SetWidgetVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_SetWidgetVisibility, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WB_BtlInfoMess_C_SetWidgetVisibility::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_SetWidgetVisibility, K2Node_DynamicCast_AsBPI_UIManager) == 0x000010, "Member 'WB_BtlInfoMess_C_SetWidgetVisibility::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_SetWidgetVisibility, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WB_BtlInfoMess_C_SetWidgetVisibility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_SetWidgetVisibility, K2Node_Select_Default) == 0x000021, "Member 'WB_BtlInfoMess_C_SetWidgetVisibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_SetWidgetVisibility, CallFunc_BPI_GetInfoWindowCtrl_OutActor) == 0x000028, "Member 'WB_BtlInfoMess_C_SetWidgetVisibility::CallFunc_BPI_GetInfoWindowCtrl_OutActor' has a wrong offset!");

// Function WB_BtlInfoMess.WB_BtlInfoMess_C.ShowByCommonMessLabel
// 0x000C (0x000C - 0x0000)
struct WB_BtlInfoMess_C_ShowByCommonMessLabel final
{
public:
	class FName                                   MessageIDLabel;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SelectSkillScriptMessage;                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlInfoMess_C_ShowByCommonMessLabel) == 0x000004, "Wrong alignment on WB_BtlInfoMess_C_ShowByCommonMessLabel");
static_assert(sizeof(WB_BtlInfoMess_C_ShowByCommonMessLabel) == 0x00000C, "Wrong size on WB_BtlInfoMess_C_ShowByCommonMessLabel");
static_assert(offsetof(WB_BtlInfoMess_C_ShowByCommonMessLabel, MessageIDLabel) == 0x000000, "Member 'WB_BtlInfoMess_C_ShowByCommonMessLabel::MessageIDLabel' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowByCommonMessLabel, SelectSkillScriptMessage) == 0x000008, "Member 'WB_BtlInfoMess_C_ShowByCommonMessLabel::SelectSkillScriptMessage' has a wrong offset!");

// Function WB_BtlInfoMess.WB_BtlInfoMess_C.ShowInfoWindow
// 0x0078 (0x0078 - 0x0000)
struct WB_BtlInfoMess_C_ShowInfoWindow final
{
public:
	class UScriptMessageAsset*                    InScriptMessage;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMessageId;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D7F[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         InProgramValue;                                    // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D80[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D81[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D82[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_InfoWindowCtrl_C> CallFunc_BPI_GetInfoWindowCtrl_OutActor;           // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlInfoMess_C_ShowInfoWindow) == 0x000008, "Wrong alignment on WB_BtlInfoMess_C_ShowInfoWindow");
static_assert(sizeof(WB_BtlInfoMess_C_ShowInfoWindow) == 0x000078, "Wrong size on WB_BtlInfoMess_C_ShowInfoWindow");
static_assert(offsetof(WB_BtlInfoMess_C_ShowInfoWindow, InScriptMessage) == 0x000000, "Member 'WB_BtlInfoMess_C_ShowInfoWindow::InScriptMessage' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowInfoWindow, InMessageId) == 0x000008, "Member 'WB_BtlInfoMess_C_ShowInfoWindow::InMessageId' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowInfoWindow, InProgramValue) == 0x000010, "Member 'WB_BtlInfoMess_C_ShowInfoWindow::InProgramValue' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowInfoWindow, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WB_BtlInfoMess_C_ShowInfoWindow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowInfoWindow, Temp_int_Array_Index_Variable) == 0x000024, "Member 'WB_BtlInfoMess_C_ShowInfoWindow::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowInfoWindow, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'WB_BtlInfoMess_C_ShowInfoWindow::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowInfoWindow, CallFunc_Array_Get_Item) == 0x000030, "Member 'WB_BtlInfoMess_C_ShowInfoWindow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowInfoWindow, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WB_BtlInfoMess_C_ShowInfoWindow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowInfoWindow, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'WB_BtlInfoMess_C_ShowInfoWindow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowInfoWindow, CallFunc_Get_ReturnValue) == 0x000048, "Member 'WB_BtlInfoMess_C_ShowInfoWindow::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowInfoWindow, K2Node_DynamicCast_AsBPI_UIManager) == 0x000050, "Member 'WB_BtlInfoMess_C_ShowInfoWindow::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowInfoWindow, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WB_BtlInfoMess_C_ShowInfoWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowInfoWindow, CallFunc_BPI_GetInfoWindowCtrl_OutActor) == 0x000068, "Member 'WB_BtlInfoMess_C_ShowInfoWindow::CallFunc_BPI_GetInfoWindowCtrl_OutActor' has a wrong offset!");

// Function WB_BtlInfoMess.WB_BtlInfoMess_C.ShowInfoWindowByLabel
// 0x0078 (0x0078 - 0x0000)
struct WB_BtlInfoMess_C_ShowInfoWindowByLabel final
{
public:
	class UScriptMessageAsset*                    InScriptMessage;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InMessageIDLabel;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         InProgramValue;                                    // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D83[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D84[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D85[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_InfoWindowCtrl_C> CallFunc_BPI_GetInfoWindowCtrl_OutActor;           // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_BtlInfoMess_C_ShowInfoWindowByLabel) == 0x000008, "Wrong alignment on WB_BtlInfoMess_C_ShowInfoWindowByLabel");
static_assert(sizeof(WB_BtlInfoMess_C_ShowInfoWindowByLabel) == 0x000078, "Wrong size on WB_BtlInfoMess_C_ShowInfoWindowByLabel");
static_assert(offsetof(WB_BtlInfoMess_C_ShowInfoWindowByLabel, InScriptMessage) == 0x000000, "Member 'WB_BtlInfoMess_C_ShowInfoWindowByLabel::InScriptMessage' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowInfoWindowByLabel, InMessageIDLabel) == 0x000008, "Member 'WB_BtlInfoMess_C_ShowInfoWindowByLabel::InMessageIDLabel' has a wrong offset!");
static_assert(offsetof(WB_BtlInfoMess_C_ShowInfoWindowByLabel, InProgramValue) == 0x000010, "Member 'WB_BtlInfoMess_C_ShowInfoWindowByLabel::InProgramValue' has a wrong offset!");
