#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CommonHelpWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Project_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_CommonHelpWindow.WB_CommonHelpWindow_C
// 0x0030 (0x0290 - 0x0260)
class UWB_CommonHelpWindow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMessageRichTextWidget*                 MessageRichTextHelp;                               // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerHelp;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerTextAnimation;                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsTextChange;                                      // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsWindowOpen;                                      // 0x0281(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsWindowClose;                                     // 0x0282(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsGamePad;                                         // 0x0283(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         TextMargin;                                        // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IconMargin;                                        // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GAMEPAD_TYPE                                CurrnetGamePad;                                    // 0x028C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_CommonHelpWindow(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__SsPlayerHelp_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void BndEvt__SsPlayerWidget_550_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void WindowOpen();
	void ExecutionWindowClose();
	void ExecutionWindowOpen();
	void TextChangeAnimetion(bool InChangeAnimation);
	void WindowClose();
	void IsFinishedOpenWindow(bool* OutFinished);
	void IsFinishedCloseWindow(bool* OutFinished);
	void SetExecutionRichText();
	void SetHelpRichTextByLabel(class UScriptMessageAsset* InScriptMessageAsset, class FName InLabel, bool InExecutionText, bool InBuildText);
	void SetHelpRichTextByIndex(class UScriptMessageAsset* InScriptMessageAsset, int32 InIndex, bool InExecutionText, bool InBuildText);
	void SetBuildRichText();
	void ClearRichText();
	void SetHelpWindowProgramValue(int32 InIndex, const class FString& InString);
	void SetHelpWindowSkillId(int32 InSkillId);
	void SetHelpWindowItemId(int32 InItemId);
	void ClearHelpRichText();
	void SetHelpWindowValueParam(int32 InIndex, int32 InParam);
	void UpdateMappingIcon();
	void UpdateLocalizationSetting();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_CommonHelpWindow_C">();
	}
	static class UWB_CommonHelpWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_CommonHelpWindow_C>();
	}
};
static_assert(alignof(UWB_CommonHelpWindow_C) == 0x000008, "Wrong alignment on UWB_CommonHelpWindow_C");
static_assert(sizeof(UWB_CommonHelpWindow_C) == 0x000290, "Wrong size on UWB_CommonHelpWindow_C");
static_assert(offsetof(UWB_CommonHelpWindow_C, UberGraphFrame) == 0x000260, "Member 'UWB_CommonHelpWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_CommonHelpWindow_C, MessageRichTextHelp) == 0x000268, "Member 'UWB_CommonHelpWindow_C::MessageRichTextHelp' has a wrong offset!");
static_assert(offsetof(UWB_CommonHelpWindow_C, SsPlayerHelp) == 0x000270, "Member 'UWB_CommonHelpWindow_C::SsPlayerHelp' has a wrong offset!");
static_assert(offsetof(UWB_CommonHelpWindow_C, SsPlayerTextAnimation) == 0x000278, "Member 'UWB_CommonHelpWindow_C::SsPlayerTextAnimation' has a wrong offset!");
static_assert(offsetof(UWB_CommonHelpWindow_C, IsTextChange) == 0x000280, "Member 'UWB_CommonHelpWindow_C::IsTextChange' has a wrong offset!");
static_assert(offsetof(UWB_CommonHelpWindow_C, IsWindowOpen) == 0x000281, "Member 'UWB_CommonHelpWindow_C::IsWindowOpen' has a wrong offset!");
static_assert(offsetof(UWB_CommonHelpWindow_C, IsWindowClose) == 0x000282, "Member 'UWB_CommonHelpWindow_C::IsWindowClose' has a wrong offset!");
static_assert(offsetof(UWB_CommonHelpWindow_C, IsGamePad) == 0x000283, "Member 'UWB_CommonHelpWindow_C::IsGamePad' has a wrong offset!");
static_assert(offsetof(UWB_CommonHelpWindow_C, TextMargin) == 0x000284, "Member 'UWB_CommonHelpWindow_C::TextMargin' has a wrong offset!");
static_assert(offsetof(UWB_CommonHelpWindow_C, IconMargin) == 0x000288, "Member 'UWB_CommonHelpWindow_C::IconMargin' has a wrong offset!");
static_assert(offsetof(UWB_CommonHelpWindow_C, CurrnetGamePad) == 0x00028C, "Member 'UWB_CommonHelpWindow_C::CurrnetGamePad' has a wrong offset!");

}

