#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CampItemMouseMask

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_CampItemMouseMask.WB_CampItemMouseMask_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_CampItemMouseMask_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemMouseMask_C_PreConstruct) == 0x000001, "Wrong alignment on WB_CampItemMouseMask_C_PreConstruct");
static_assert(sizeof(WB_CampItemMouseMask_C_PreConstruct) == 0x000001, "Wrong size on WB_CampItemMouseMask_C_PreConstruct");
static_assert(offsetof(WB_CampItemMouseMask_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_CampItemMouseMask_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_CampItemMouseMask.WB_CampItemMouseMask_C.ExecuteUbergraph_WB_CampItemMouseMask
// 0x0008 (0x0008 - 0x0000)
struct WB_CampItemMouseMask_C_ExecuteUbergraph_WB_CampItemMouseMask final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemMouseMask_C_ExecuteUbergraph_WB_CampItemMouseMask) == 0x000004, "Wrong alignment on WB_CampItemMouseMask_C_ExecuteUbergraph_WB_CampItemMouseMask");
static_assert(sizeof(WB_CampItemMouseMask_C_ExecuteUbergraph_WB_CampItemMouseMask) == 0x000008, "Wrong size on WB_CampItemMouseMask_C_ExecuteUbergraph_WB_CampItemMouseMask");
static_assert(offsetof(WB_CampItemMouseMask_C_ExecuteUbergraph_WB_CampItemMouseMask, EntryPoint) == 0x000000, "Member 'WB_CampItemMouseMask_C_ExecuteUbergraph_WB_CampItemMouseMask::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_CampItemMouseMask_C_ExecuteUbergraph_WB_CampItemMouseMask, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WB_CampItemMouseMask_C_ExecuteUbergraph_WB_CampItemMouseMask::K2Node_Event_IsDesignTime' has a wrong offset!");

}

