#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CampNumSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_CampNumSelector.WB_CampNumSelector_C
// 0x0050 (0x02B0 - 0x0260)
class UWB_CampNumSelector_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButtonS5*                              ButtonS5_Down;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButtonS5*                              ButtonS5_Up;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Num00;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Num10;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Num11;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayer_Base;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Number;                                            // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A14[0x4];                                     // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             MouseEvent_OnClickedArrow;                         // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void GetNumber(int32* Param_Number);
	void OnFinishedBaseAnim(class FName InAnimPackName, class FName InAnimationName);
	void PlayAnim_Down();
	void PlayAnim_Up();
	void Play_Anim_Main(class FName InState);
	void SetNumber(int32 InNum);
	void SetNumImgParam(class UImage*& InImg, int32 InNum);
	void BndEvt__SsPlayerWidget_Buy_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__WB_ShopItemNumSelector_ButtonS5_Up_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature(const struct FVector2D& Pos, const struct FVector2D& UV);
	void BndEvt__WB_ShopItemNumSelector_ButtonS5_Down_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature(const struct FVector2D& Pos, const struct FVector2D& UV);
	void ExecuteUbergraph_WB_CampNumSelector(int32 EntryPoint);
	void MouseEvent_OnClickedArrow__DelegateSignature(bool IsClicked_UP);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_CampNumSelector_C">();
	}
	static class UWB_CampNumSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_CampNumSelector_C>();
	}
};
static_assert(alignof(UWB_CampNumSelector_C) == 0x000008, "Wrong alignment on UWB_CampNumSelector_C");
static_assert(sizeof(UWB_CampNumSelector_C) == 0x0002B0, "Wrong size on UWB_CampNumSelector_C");
static_assert(offsetof(UWB_CampNumSelector_C, UberGraphFrame) == 0x000260, "Member 'UWB_CampNumSelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_CampNumSelector_C, ButtonS5_Down) == 0x000268, "Member 'UWB_CampNumSelector_C::ButtonS5_Down' has a wrong offset!");
static_assert(offsetof(UWB_CampNumSelector_C, ButtonS5_Up) == 0x000270, "Member 'UWB_CampNumSelector_C::ButtonS5_Up' has a wrong offset!");
static_assert(offsetof(UWB_CampNumSelector_C, Img_Num00) == 0x000278, "Member 'UWB_CampNumSelector_C::Img_Num00' has a wrong offset!");
static_assert(offsetof(UWB_CampNumSelector_C, Img_Num10) == 0x000280, "Member 'UWB_CampNumSelector_C::Img_Num10' has a wrong offset!");
static_assert(offsetof(UWB_CampNumSelector_C, Img_Num11) == 0x000288, "Member 'UWB_CampNumSelector_C::Img_Num11' has a wrong offset!");
static_assert(offsetof(UWB_CampNumSelector_C, SsPlayer_Base) == 0x000290, "Member 'UWB_CampNumSelector_C::SsPlayer_Base' has a wrong offset!");
static_assert(offsetof(UWB_CampNumSelector_C, Number) == 0x000298, "Member 'UWB_CampNumSelector_C::Number' has a wrong offset!");
static_assert(offsetof(UWB_CampNumSelector_C, MouseEvent_OnClickedArrow) == 0x0002A0, "Member 'UWB_CampNumSelector_C::MouseEvent_OnClickedArrow' has a wrong offset!");

}

