#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CampHelpWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_CampHelpWindow.WB_CampHelpWindow_C
// 0x00C0 (0x0320 - 0x0260)
class UWB_CampHelpWindow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanelHelpList;                               // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanelHelpListRect;                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMessageSimpleTextWidget*               MessageSimpleTextNoData;                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerHelpTitle;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerNoData;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerPosition;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerScroll;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerTopMenu;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerWidgetIcon;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CampHelpList_C*                     WB_CampHelpList_10;                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CampHelpList_C*                     WB_CampHelpList_00;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CampHelpList_C*                     WB_CampHelpList_01;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CampHelpList_C*                     WB_CampHelpList_02;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CampHelpList_C*                     WB_CampHelpList_03;                                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CampHelpList_C*                     WB_CampHelpList_04;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CampHelpList_C*                     WB_CampHelpList_05;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CampHelpList_C*                     WB_CampHelpList_06;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CampHelpList_C*                     WB_CampHelpList_07;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CampHelpList_C*                     WB_CampHelpList_08;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CampHelpList_C*                     WB_CampHelpList_09;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ScrollBar_C*                        WB_ScrollBar;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              Cursortopposition;                                 // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsExistScrollBar;                                  // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsListAnimation;                                   // 0x0319(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsItScrollBar;                                     // 0x031A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62DD[0x1];                                     // 0x031B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Scrollbarvalue;                                    // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetScrollNumber(int32 InMaxNumber, int32 InDispNumber);
	void GetNewIconFrame(float* OutFrame);
	void IsHelpListRectArea(bool* OutParam);
	void IsItAvobeScrollBar(bool* OutParam);
	void GetScrollBarValue(float* OutValue);
	void DisableListMouseFocus();
	void EnableListMouseFocus();
	void GetMouseHovered(int32* OutIndex);
	void GetMouseOnClicked(int32* OutIndex);
	void ResetMouseFlag();
	void TopMenuPanelOff();
	void TopMenuPanelOn();
	void IsHelpListAnimationEnd(bool* OutFinished);
	void SetScrollRate(float InRate);
	void SetPanelHelpNameColor(int32 InIndex, int32 InUseHelpNo);
	void HelpTitleOff();
	void HelpTitleOn();
	void PanelHelpOff(int32 InIndex);
	void PanelHelpOn(int32 InIndex);
	void SetPanelHelp(int32 InIndex, int32 InCategoryId, int32 InHelpId, int32 InUseHelpNo, bool InDispOnFlag);
	void SetPanelHelpName(int32 InIndex, int32 InCategoryId, int32 InHelpId);
	void GetCategoryPosition(struct FVector2D* OutVec);
	void HelpScrollBarOut();
	void HelpScrollBarIn();
	void GetCampHelpList(int32 InIndex, class UWB_CampHelpList_C** OutCampHelpList);
	void NoDataOff();
	void NoDataOn();
	void SetInitPosition();
	void CampHelpListOff();
	void CampHelpListOn();
	void BndEvt__WB_CampHelpWindow_WB_ScrollBar_K2Node_ComponentBoundEvent_4_OnScrolledByMouse__DelegateSignature(float Position);
	void BndEvt__WB_CampHelpWindow_SsPlayerHelpTitle_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void BndEvt__WB_CampHelpWindow_SsPlayerNoData_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void BndEvt__WB_CampHelpWindow_SsPlayerScroll_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void BndEvt__WB_CampHelpWindow_SsPlayerTopMenu_K2Node_ComponentBoundEvent_3_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void Construct();
	void ExecuteUbergraph_WB_CampHelpWindow(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_CampHelpWindow_C">();
	}
	static class UWB_CampHelpWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_CampHelpWindow_C>();
	}
};
static_assert(alignof(UWB_CampHelpWindow_C) == 0x000008, "Wrong alignment on UWB_CampHelpWindow_C");
static_assert(sizeof(UWB_CampHelpWindow_C) == 0x000320, "Wrong size on UWB_CampHelpWindow_C");
static_assert(offsetof(UWB_CampHelpWindow_C, UberGraphFrame) == 0x000260, "Member 'UWB_CampHelpWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, CanvasPanelHelpList) == 0x000268, "Member 'UWB_CampHelpWindow_C::CanvasPanelHelpList' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, CanvasPanelHelpListRect) == 0x000270, "Member 'UWB_CampHelpWindow_C::CanvasPanelHelpListRect' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, MessageSimpleTextNoData) == 0x000278, "Member 'UWB_CampHelpWindow_C::MessageSimpleTextNoData' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, SsPlayerHelpTitle) == 0x000280, "Member 'UWB_CampHelpWindow_C::SsPlayerHelpTitle' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, SsPlayerNoData) == 0x000288, "Member 'UWB_CampHelpWindow_C::SsPlayerNoData' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, SsPlayerPosition) == 0x000290, "Member 'UWB_CampHelpWindow_C::SsPlayerPosition' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, SsPlayerScroll) == 0x000298, "Member 'UWB_CampHelpWindow_C::SsPlayerScroll' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, SsPlayerTopMenu) == 0x0002A0, "Member 'UWB_CampHelpWindow_C::SsPlayerTopMenu' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, SsPlayerWidgetIcon) == 0x0002A8, "Member 'UWB_CampHelpWindow_C::SsPlayerWidgetIcon' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, WB_CampHelpList_10) == 0x0002B0, "Member 'UWB_CampHelpWindow_C::WB_CampHelpList_10' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, WB_CampHelpList_00) == 0x0002B8, "Member 'UWB_CampHelpWindow_C::WB_CampHelpList_00' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, WB_CampHelpList_01) == 0x0002C0, "Member 'UWB_CampHelpWindow_C::WB_CampHelpList_01' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, WB_CampHelpList_02) == 0x0002C8, "Member 'UWB_CampHelpWindow_C::WB_CampHelpList_02' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, WB_CampHelpList_03) == 0x0002D0, "Member 'UWB_CampHelpWindow_C::WB_CampHelpList_03' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, WB_CampHelpList_04) == 0x0002D8, "Member 'UWB_CampHelpWindow_C::WB_CampHelpList_04' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, WB_CampHelpList_05) == 0x0002E0, "Member 'UWB_CampHelpWindow_C::WB_CampHelpList_05' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, WB_CampHelpList_06) == 0x0002E8, "Member 'UWB_CampHelpWindow_C::WB_CampHelpList_06' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, WB_CampHelpList_07) == 0x0002F0, "Member 'UWB_CampHelpWindow_C::WB_CampHelpList_07' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, WB_CampHelpList_08) == 0x0002F8, "Member 'UWB_CampHelpWindow_C::WB_CampHelpList_08' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, WB_CampHelpList_09) == 0x000300, "Member 'UWB_CampHelpWindow_C::WB_CampHelpList_09' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, WB_ScrollBar) == 0x000308, "Member 'UWB_CampHelpWindow_C::WB_ScrollBar' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, Cursortopposition) == 0x000310, "Member 'UWB_CampHelpWindow_C::Cursortopposition' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, IsExistScrollBar) == 0x000318, "Member 'UWB_CampHelpWindow_C::IsExistScrollBar' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, IsListAnimation) == 0x000319, "Member 'UWB_CampHelpWindow_C::IsListAnimation' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, IsItScrollBar) == 0x00031A, "Member 'UWB_CampHelpWindow_C::IsItScrollBar' has a wrong offset!");
static_assert(offsetof(UWB_CampHelpWindow_C, Scrollbarvalue) == 0x00031C, "Member 'UWB_CampHelpWindow_C::Scrollbarvalue' has a wrong offset!");

}

