#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CampCharaPanel

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.ExecuteUbergraph_WB_CampCharaPanel
// 0x00C8 (0x00C8 - 0x0000)
struct WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Position;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_6;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_6;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_6;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_6;       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89FD[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_5;         // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_5;        // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_5;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_5;       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89FE[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_4;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_4;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_4;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_4;       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_3;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_3;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_3;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_3;       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_2;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_3;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_3;                       // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_2;         // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_2;        // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_2;        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_2;       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_4;                    // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_4;                       // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89FF[0x2];                                     // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_1;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_1;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_1;        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_1;       // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_5;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_5;                       // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A00[0x2];                                     // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName;           // 0x00AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName;          // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex;          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex;         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_6;                    // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_6;                       // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel) == 0x000004, "Wrong alignment on WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel");
static_assert(sizeof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel) == 0x0000C8, "Wrong size on WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, EntryPoint) == 0x000000, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_Position) == 0x000004, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_Position' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimPackName_6) == 0x000008, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimPackName_6' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimationName_6) == 0x000010, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimationName_6' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_6) == 0x000018, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_6' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_6) == 0x00001C, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_6' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_SwitchName_CmpSuccess) == 0x000020, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, CallFunc_Play_ReturnValue) == 0x000021, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimPackName_5) == 0x000024, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimPackName_5' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimationName_5) == 0x00002C, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimationName_5' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_5) == 0x000034, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_5' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_5) == 0x000038, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_5' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_SwitchName_CmpSuccess_1) == 0x00003C, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_SwitchName_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, CallFunc_Play_ReturnValue_1) == 0x00003D, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimPackName_4) == 0x000040, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimPackName_4' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimationName_4) == 0x000048, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimationName_4' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_4) == 0x000050, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_4' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_4) == 0x000054, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_4' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimPackName_3) == 0x000058, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimPackName_3' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimationName_3) == 0x000060, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimationName_3' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_3) == 0x000068, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_3' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_3) == 0x00006C, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_3' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_SwitchName_CmpSuccess_2) == 0x000070, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_SwitchName_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_SwitchName_CmpSuccess_3) == 0x000071, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_SwitchName_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, CallFunc_Play_ReturnValue_2) == 0x000072, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, CallFunc_Play_ReturnValue_3) == 0x000073, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::CallFunc_Play_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimPackName_2) == 0x000074, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimPackName_2' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimationName_2) == 0x00007C, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimationName_2' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_2) == 0x000084, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_2' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_2) == 0x000088, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_2' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_SwitchName_CmpSuccess_4) == 0x00008C, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_SwitchName_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, CallFunc_Play_ReturnValue_4) == 0x00008D, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::CallFunc_Play_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimPackName_1) == 0x000090, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimPackName_1' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimationName_1) == 0x000098, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimationName_1' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_1) == 0x0000A0, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_1' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_1) == 0x0000A4, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_1' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_SwitchName_CmpSuccess_5) == 0x0000A8, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_SwitchName_CmpSuccess_5' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, CallFunc_Play_ReturnValue_5) == 0x0000A9, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::CallFunc_Play_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimPackName) == 0x0000AC, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimationName) == 0x0000B4, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex) == 0x0000BC, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_ComponentBoundEvent_AnimationIndex) == 0x0000C0, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_ComponentBoundEvent_AnimationIndex' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, K2Node_SwitchName_CmpSuccess_6) == 0x0000C4, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::K2Node_SwitchName_CmpSuccess_6' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel, CallFunc_Play_ReturnValue_6) == 0x0000C5, "Member 'WB_CampCharaPanel_C_ExecuteUbergraph_WB_CampCharaPanel::CallFunc_Play_ReturnValue_6' has a wrong offset!");

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.OnClickedMouseEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WB_CampCharaPanel_C_OnClickedMouseEvent__DelegateSignature final
{
public:
	bool                                          InClickedUp;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampCharaPanel_C_OnClickedMouseEvent__DelegateSignature) == 0x000001, "Wrong alignment on WB_CampCharaPanel_C_OnClickedMouseEvent__DelegateSignature");
static_assert(sizeof(WB_CampCharaPanel_C_OnClickedMouseEvent__DelegateSignature) == 0x000001, "Wrong size on WB_CampCharaPanel_C_OnClickedMouseEvent__DelegateSignature");
static_assert(offsetof(WB_CampCharaPanel_C_OnClickedMouseEvent__DelegateSignature, InClickedUp) == 0x000000, "Member 'WB_CampCharaPanel_C_OnClickedMouseEvent__DelegateSignature::InClickedUp' has a wrong offset!");

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.On Clicked Item Num Selector
// 0x0001 (0x0001 - 0x0000)
struct WB_CampCharaPanel_C_On_Clicked_Item_Num_Selector final
{
public:
	bool                                          IsClicked_UP;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampCharaPanel_C_On_Clicked_Item_Num_Selector) == 0x000001, "Wrong alignment on WB_CampCharaPanel_C_On_Clicked_Item_Num_Selector");
static_assert(sizeof(WB_CampCharaPanel_C_On_Clicked_Item_Num_Selector) == 0x000001, "Wrong size on WB_CampCharaPanel_C_On_Clicked_Item_Num_Selector");
static_assert(offsetof(WB_CampCharaPanel_C_On_Clicked_Item_Num_Selector, IsClicked_UP) == 0x000000, "Member 'WB_CampCharaPanel_C_On_Clicked_Item_Num_Selector::IsClicked_UP' has a wrong offset!");

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.BindItemNumSelectorEvent
// 0x0010 (0x0010 - 0x0000)
struct WB_CampCharaPanel_C_BindItemNumSelectorEvent final
{
public:
	TDelegate<void(bool IsClicked_UP)>            K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WB_CampCharaPanel_C_BindItemNumSelectorEvent) == 0x000004, "Wrong alignment on WB_CampCharaPanel_C_BindItemNumSelectorEvent");
static_assert(sizeof(WB_CampCharaPanel_C_BindItemNumSelectorEvent) == 0x000010, "Wrong size on WB_CampCharaPanel_C_BindItemNumSelectorEvent");
static_assert(offsetof(WB_CampCharaPanel_C_BindItemNumSelectorEvent, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WB_CampCharaPanel_C_BindItemNumSelectorEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.SetWBItemNumSelectorPosition
// 0x0010 (0x0010 - 0x0000)
struct WB_CampCharaPanel_C_SetWBItemNumSelectorPosition final
{
public:
	struct FVector2D                              InPosition;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampCharaPanel_C_SetWBItemNumSelectorPosition) == 0x000008, "Wrong alignment on WB_CampCharaPanel_C_SetWBItemNumSelectorPosition");
static_assert(sizeof(WB_CampCharaPanel_C_SetWBItemNumSelectorPosition) == 0x000010, "Wrong size on WB_CampCharaPanel_C_SetWBItemNumSelectorPosition");
static_assert(offsetof(WB_CampCharaPanel_C_SetWBItemNumSelectorPosition, InPosition) == 0x000000, "Member 'WB_CampCharaPanel_C_SetWBItemNumSelectorPosition::InPosition' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_SetWBItemNumSelectorPosition, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000008, "Member 'WB_CampCharaPanel_C_SetWBItemNumSelectorPosition::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.SetItemNumSelector
// 0x0004 (0x0004 - 0x0000)
struct WB_CampCharaPanel_C_SetItemNumSelector final
{
public:
	int32                                         InNumber;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampCharaPanel_C_SetItemNumSelector) == 0x000004, "Wrong alignment on WB_CampCharaPanel_C_SetItemNumSelector");
static_assert(sizeof(WB_CampCharaPanel_C_SetItemNumSelector) == 0x000004, "Wrong size on WB_CampCharaPanel_C_SetItemNumSelector");
static_assert(offsetof(WB_CampCharaPanel_C_SetItemNumSelector, InNumber) == 0x000000, "Member 'WB_CampCharaPanel_C_SetItemNumSelector::InNumber' has a wrong offset!");

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.SetScrollNumber
// 0x0008 (0x0008 - 0x0000)
struct WB_CampCharaPanel_C_SetScrollNumber final
{
public:
	int32                                         InMaxNumber;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InDispNumber;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampCharaPanel_C_SetScrollNumber) == 0x000004, "Wrong alignment on WB_CampCharaPanel_C_SetScrollNumber");
static_assert(sizeof(WB_CampCharaPanel_C_SetScrollNumber) == 0x000008, "Wrong size on WB_CampCharaPanel_C_SetScrollNumber");
static_assert(offsetof(WB_CampCharaPanel_C_SetScrollNumber, InMaxNumber) == 0x000000, "Member 'WB_CampCharaPanel_C_SetScrollNumber::InMaxNumber' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_SetScrollNumber, InDispNumber) == 0x000004, "Member 'WB_CampCharaPanel_C_SetScrollNumber::InDispNumber' has a wrong offset!");

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.IsPartyStockArea
// 0x0002 (0x0002 - 0x0000)
struct WB_CampCharaPanel_C_IsPartyStockArea final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMouseOvered_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampCharaPanel_C_IsPartyStockArea) == 0x000001, "Wrong alignment on WB_CampCharaPanel_C_IsPartyStockArea");
static_assert(sizeof(WB_CampCharaPanel_C_IsPartyStockArea) == 0x000002, "Wrong size on WB_CampCharaPanel_C_IsPartyStockArea");
static_assert(offsetof(WB_CampCharaPanel_C_IsPartyStockArea, OutParam) == 0x000000, "Member 'WB_CampCharaPanel_C_IsPartyStockArea::OutParam' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_IsPartyStockArea, CallFunc_GetMouseOvered_ReturnValue) == 0x000001, "Member 'WB_CampCharaPanel_C_IsPartyStockArea::CallFunc_GetMouseOvered_ReturnValue' has a wrong offset!");

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.GetScrollBarValue
// 0x0008 (0x0008 - 0x0000)
struct WB_CampCharaPanel_C_GetScrollBarValue final
{
public:
	float                                         OutValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RetValue;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampCharaPanel_C_GetScrollBarValue) == 0x000004, "Wrong alignment on WB_CampCharaPanel_C_GetScrollBarValue");
static_assert(sizeof(WB_CampCharaPanel_C_GetScrollBarValue) == 0x000008, "Wrong size on WB_CampCharaPanel_C_GetScrollBarValue");
static_assert(offsetof(WB_CampCharaPanel_C_GetScrollBarValue, OutValue) == 0x000000, "Member 'WB_CampCharaPanel_C_GetScrollBarValue::OutValue' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_GetScrollBarValue, RetValue) == 0x000004, "Member 'WB_CampCharaPanel_C_GetScrollBarValue::RetValue' has a wrong offset!");

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.SetWBCharaPriority
// 0x0018 (0x0018 - 0x0000)
struct WB_CampCharaPanel_C_SetWBCharaPriority final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InPrio;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CharaPanel_C*                       CallFunc_GetWBCharaPanel_OutWidget;                // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampCharaPanel_C_SetWBCharaPriority) == 0x000008, "Wrong alignment on WB_CampCharaPanel_C_SetWBCharaPriority");
static_assert(sizeof(WB_CampCharaPanel_C_SetWBCharaPriority) == 0x000018, "Wrong size on WB_CampCharaPanel_C_SetWBCharaPriority");
static_assert(offsetof(WB_CampCharaPanel_C_SetWBCharaPriority, InIndex) == 0x000000, "Member 'WB_CampCharaPanel_C_SetWBCharaPriority::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_SetWBCharaPriority, InPrio) == 0x000004, "Member 'WB_CampCharaPanel_C_SetWBCharaPriority::InPrio' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_SetWBCharaPriority, CallFunc_GetWBCharaPanel_OutWidget) == 0x000008, "Member 'WB_CampCharaPanel_C_SetWBCharaPriority::CallFunc_GetWBCharaPanel_OutWidget' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_SetWBCharaPriority, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'WB_CampCharaPanel_C_SetWBCharaPriority::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.UtsusemiNoDataOff
// 0x0014 (0x0014 - 0x0000)
struct WB_CampCharaPanel_C_UtsusemiNoDataOff final
{
public:
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampCharaPanel_C_UtsusemiNoDataOff) == 0x000004, "Wrong alignment on WB_CampCharaPanel_C_UtsusemiNoDataOff");
static_assert(sizeof(WB_CampCharaPanel_C_UtsusemiNoDataOff) == 0x000014, "Wrong size on WB_CampCharaPanel_C_UtsusemiNoDataOff");
static_assert(offsetof(WB_CampCharaPanel_C_UtsusemiNoDataOff, CallFunc_GetPlayingAnimationName_OutAnimPackName) == 0x000000, "Member 'WB_CampCharaPanel_C_UtsusemiNoDataOff::CallFunc_GetPlayingAnimationName_OutAnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_UtsusemiNoDataOff, CallFunc_GetPlayingAnimationName_OutAnimationName) == 0x000008, "Member 'WB_CampCharaPanel_C_UtsusemiNoDataOff::CallFunc_GetPlayingAnimationName_OutAnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_UtsusemiNoDataOff, CallFunc_Play_ReturnValue) == 0x000010, "Member 'WB_CampCharaPanel_C_UtsusemiNoDataOff::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.UtsusemiNoDataOn
// 0x0028 (0x0028 - 0x0000)
struct WB_CampCharaPanel_C_UtsusemiNoDataOn final
{
public:
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetScriptMessageByLabel_self_CastInput;   // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampCharaPanel_C_UtsusemiNoDataOn) == 0x000008, "Wrong alignment on WB_CampCharaPanel_C_UtsusemiNoDataOn");
static_assert(sizeof(WB_CampCharaPanel_C_UtsusemiNoDataOn) == 0x000028, "Wrong size on WB_CampCharaPanel_C_UtsusemiNoDataOn");
static_assert(offsetof(WB_CampCharaPanel_C_UtsusemiNoDataOn, CallFunc_SetScriptMessageByLabel_self_CastInput) == 0x000000, "Member 'WB_CampCharaPanel_C_UtsusemiNoDataOn::CallFunc_SetScriptMessageByLabel_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_UtsusemiNoDataOn, CallFunc_GetPlayingAnimationName_OutAnimPackName) == 0x000010, "Member 'WB_CampCharaPanel_C_UtsusemiNoDataOn::CallFunc_GetPlayingAnimationName_OutAnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_UtsusemiNoDataOn, CallFunc_GetPlayingAnimationName_OutAnimationName) == 0x000018, "Member 'WB_CampCharaPanel_C_UtsusemiNoDataOn::CallFunc_GetPlayingAnimationName_OutAnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_UtsusemiNoDataOn, CallFunc_Play_ReturnValue) == 0x000020, "Member 'WB_CampCharaPanel_C_UtsusemiNoDataOn::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.SetPanelScrollRate
// 0x0004 (0x0004 - 0x0000)
struct WB_CampCharaPanel_C_SetPanelScrollRate final
{
public:
	float                                         InRate;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampCharaPanel_C_SetPanelScrollRate) == 0x000004, "Wrong alignment on WB_CampCharaPanel_C_SetPanelScrollRate");
static_assert(sizeof(WB_CampCharaPanel_C_SetPanelScrollRate) == 0x000004, "Wrong size on WB_CampCharaPanel_C_SetPanelScrollRate");
static_assert(offsetof(WB_CampCharaPanel_C_SetPanelScrollRate, InRate) == 0x000000, "Member 'WB_CampCharaPanel_C_SetPanelScrollRate::InRate' has a wrong offset!");

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.PanelScrollBarOn
// 0x0001 (0x0001 - 0x0000)
struct WB_CampCharaPanel_C_PanelScrollBarOn final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampCharaPanel_C_PanelScrollBarOn) == 0x000001, "Wrong alignment on WB_CampCharaPanel_C_PanelScrollBarOn");
static_assert(sizeof(WB_CampCharaPanel_C_PanelScrollBarOn) == 0x000001, "Wrong size on WB_CampCharaPanel_C_PanelScrollBarOn");
static_assert(offsetof(WB_CampCharaPanel_C_PanelScrollBarOn, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampCharaPanel_C_PanelScrollBarOn::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.PanelScrollBarOut
// 0x0001 (0x0001 - 0x0000)
struct WB_CampCharaPanel_C_PanelScrollBarOut final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampCharaPanel_C_PanelScrollBarOut) == 0x000001, "Wrong alignment on WB_CampCharaPanel_C_PanelScrollBarOut");
static_assert(sizeof(WB_CampCharaPanel_C_PanelScrollBarOut) == 0x000001, "Wrong size on WB_CampCharaPanel_C_PanelScrollBarOut");
static_assert(offsetof(WB_CampCharaPanel_C_PanelScrollBarOut, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampCharaPanel_C_PanelScrollBarOut::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.PanelScrollBarIn
// 0x0001 (0x0001 - 0x0000)
struct WB_CampCharaPanel_C_PanelScrollBarIn final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampCharaPanel_C_PanelScrollBarIn) == 0x000001, "Wrong alignment on WB_CampCharaPanel_C_PanelScrollBarIn");
static_assert(sizeof(WB_CampCharaPanel_C_PanelScrollBarIn) == 0x000001, "Wrong size on WB_CampCharaPanel_C_PanelScrollBarIn");
static_assert(offsetof(WB_CampCharaPanel_C_PanelScrollBarIn, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampCharaPanel_C_PanelScrollBarIn::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.SetNumberFontColor
// 0x0008 (0x0008 - 0x0000)
struct WB_CampCharaPanel_C_SetNumberFontColor final
{
public:
	int32                                         InColorType;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampCharaPanel_C_SetNumberFontColor) == 0x000004, "Wrong alignment on WB_CampCharaPanel_C_SetNumberFontColor");
static_assert(sizeof(WB_CampCharaPanel_C_SetNumberFontColor) == 0x000008, "Wrong size on WB_CampCharaPanel_C_SetNumberFontColor");
static_assert(offsetof(WB_CampCharaPanel_C_SetNumberFontColor, InColorType) == 0x000000, "Member 'WB_CampCharaPanel_C_SetNumberFontColor::InColorType' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_SetNumberFontColor, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_CampCharaPanel_C_SetNumberFontColor::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.AnalyzeNoDataOff
// 0x0014 (0x0014 - 0x0000)
struct WB_CampCharaPanel_C_AnalyzeNoDataOff final
{
public:
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampCharaPanel_C_AnalyzeNoDataOff) == 0x000004, "Wrong alignment on WB_CampCharaPanel_C_AnalyzeNoDataOff");
static_assert(sizeof(WB_CampCharaPanel_C_AnalyzeNoDataOff) == 0x000014, "Wrong size on WB_CampCharaPanel_C_AnalyzeNoDataOff");
static_assert(offsetof(WB_CampCharaPanel_C_AnalyzeNoDataOff, CallFunc_GetPlayingAnimationName_OutAnimPackName) == 0x000000, "Member 'WB_CampCharaPanel_C_AnalyzeNoDataOff::CallFunc_GetPlayingAnimationName_OutAnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_AnalyzeNoDataOff, CallFunc_GetPlayingAnimationName_OutAnimationName) == 0x000008, "Member 'WB_CampCharaPanel_C_AnalyzeNoDataOff::CallFunc_GetPlayingAnimationName_OutAnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_AnalyzeNoDataOff, CallFunc_Play_ReturnValue) == 0x000010, "Member 'WB_CampCharaPanel_C_AnalyzeNoDataOff::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.AnalyzeNoDataOn
// 0x0028 (0x0028 - 0x0000)
struct WB_CampCharaPanel_C_AnalyzeNoDataOn final
{
public:
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetScriptMessageByLabel_self_CastInput;   // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampCharaPanel_C_AnalyzeNoDataOn) == 0x000008, "Wrong alignment on WB_CampCharaPanel_C_AnalyzeNoDataOn");
static_assert(sizeof(WB_CampCharaPanel_C_AnalyzeNoDataOn) == 0x000028, "Wrong size on WB_CampCharaPanel_C_AnalyzeNoDataOn");
static_assert(offsetof(WB_CampCharaPanel_C_AnalyzeNoDataOn, CallFunc_SetScriptMessageByLabel_self_CastInput) == 0x000000, "Member 'WB_CampCharaPanel_C_AnalyzeNoDataOn::CallFunc_SetScriptMessageByLabel_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_AnalyzeNoDataOn, CallFunc_GetPlayingAnimationName_OutAnimPackName) == 0x000010, "Member 'WB_CampCharaPanel_C_AnalyzeNoDataOn::CallFunc_GetPlayingAnimationName_OutAnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_AnalyzeNoDataOn, CallFunc_GetPlayingAnimationName_OutAnimationName) == 0x000018, "Member 'WB_CampCharaPanel_C_AnalyzeNoDataOn::CallFunc_GetPlayingAnimationName_OutAnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_AnalyzeNoDataOn, CallFunc_Play_ReturnValue) == 0x000020, "Member 'WB_CampCharaPanel_C_AnalyzeNoDataOn::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.GetCategoryPosition
// 0x0010 (0x0010 - 0x0000)
struct WB_CampCharaPanel_C_GetCategoryPosition final
{
public:
	struct FVector2D                              OutVector2D;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampCharaPanel_C_GetCategoryPosition) == 0x000004, "Wrong alignment on WB_CampCharaPanel_C_GetCategoryPosition");
static_assert(sizeof(WB_CampCharaPanel_C_GetCategoryPosition) == 0x000010, "Wrong size on WB_CampCharaPanel_C_GetCategoryPosition");
static_assert(offsetof(WB_CampCharaPanel_C_GetCategoryPosition, OutVector2D) == 0x000000, "Member 'WB_CampCharaPanel_C_GetCategoryPosition::OutVector2D' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_GetCategoryPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec) == 0x000008, "Member 'WB_CampCharaPanel_C_GetCategoryPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec' has a wrong offset!");

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.SetStockNumber
// 0x000C (0x000C - 0x0000)
struct WB_CampCharaPanel_C_SetStockNumber final
{
public:
	int32                                         InNumber;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMax;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampCharaPanel_C_SetStockNumber) == 0x000004, "Wrong alignment on WB_CampCharaPanel_C_SetStockNumber");
static_assert(sizeof(WB_CampCharaPanel_C_SetStockNumber) == 0x00000C, "Wrong size on WB_CampCharaPanel_C_SetStockNumber");
static_assert(offsetof(WB_CampCharaPanel_C_SetStockNumber, InNumber) == 0x000000, "Member 'WB_CampCharaPanel_C_SetStockNumber::InNumber' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_SetStockNumber, InMax) == 0x000004, "Member 'WB_CampCharaPanel_C_SetStockNumber::InMax' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_SetStockNumber, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'WB_CampCharaPanel_C_SetStockNumber::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.MemberMenuOut
// 0x0094 (0x0094 - 0x0000)
struct WB_CampCharaPanel_C_MemberMenuOut final
{
public:
	int32                                         InMenuType;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A01[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A02[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName_1; // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName_1; // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A03[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName_2; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName_2; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A04[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName_3; // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName_3; // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_3;                       // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A05[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName_4; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName_4; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_4;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A06[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName_5; // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName_5; // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_5;                       // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A07[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName_6; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName_6; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_6;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampCharaPanel_C_MemberMenuOut) == 0x000004, "Wrong alignment on WB_CampCharaPanel_C_MemberMenuOut");
static_assert(sizeof(WB_CampCharaPanel_C_MemberMenuOut) == 0x000094, "Wrong size on WB_CampCharaPanel_C_MemberMenuOut");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, InMenuType) == 0x000000, "Member 'WB_CampCharaPanel_C_MemberMenuOut::InMenuType' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_CampCharaPanel_C_MemberMenuOut::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, CallFunc_GetPlayingAnimationName_OutAnimPackName) == 0x000008, "Member 'WB_CampCharaPanel_C_MemberMenuOut::CallFunc_GetPlayingAnimationName_OutAnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, CallFunc_GetPlayingAnimationName_OutAnimationName) == 0x000010, "Member 'WB_CampCharaPanel_C_MemberMenuOut::CallFunc_GetPlayingAnimationName_OutAnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, CallFunc_Play_ReturnValue) == 0x000018, "Member 'WB_CampCharaPanel_C_MemberMenuOut::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, CallFunc_GetPlayingAnimationName_OutAnimPackName_1) == 0x00001C, "Member 'WB_CampCharaPanel_C_MemberMenuOut::CallFunc_GetPlayingAnimationName_OutAnimPackName_1' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, CallFunc_GetPlayingAnimationName_OutAnimationName_1) == 0x000024, "Member 'WB_CampCharaPanel_C_MemberMenuOut::CallFunc_GetPlayingAnimationName_OutAnimationName_1' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, CallFunc_Play_ReturnValue_1) == 0x00002C, "Member 'WB_CampCharaPanel_C_MemberMenuOut::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, CallFunc_GetPlayingAnimationName_OutAnimPackName_2) == 0x000030, "Member 'WB_CampCharaPanel_C_MemberMenuOut::CallFunc_GetPlayingAnimationName_OutAnimPackName_2' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, CallFunc_GetPlayingAnimationName_OutAnimationName_2) == 0x000038, "Member 'WB_CampCharaPanel_C_MemberMenuOut::CallFunc_GetPlayingAnimationName_OutAnimationName_2' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, CallFunc_Play_ReturnValue_2) == 0x000040, "Member 'WB_CampCharaPanel_C_MemberMenuOut::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, CallFunc_GetPlayingAnimationName_OutAnimPackName_3) == 0x000044, "Member 'WB_CampCharaPanel_C_MemberMenuOut::CallFunc_GetPlayingAnimationName_OutAnimPackName_3' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, CallFunc_GetPlayingAnimationName_OutAnimationName_3) == 0x00004C, "Member 'WB_CampCharaPanel_C_MemberMenuOut::CallFunc_GetPlayingAnimationName_OutAnimationName_3' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, CallFunc_Play_ReturnValue_3) == 0x000054, "Member 'WB_CampCharaPanel_C_MemberMenuOut::CallFunc_Play_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, CallFunc_GetPlayingAnimationName_OutAnimPackName_4) == 0x000058, "Member 'WB_CampCharaPanel_C_MemberMenuOut::CallFunc_GetPlayingAnimationName_OutAnimPackName_4' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, CallFunc_GetPlayingAnimationName_OutAnimationName_4) == 0x000060, "Member 'WB_CampCharaPanel_C_MemberMenuOut::CallFunc_GetPlayingAnimationName_OutAnimationName_4' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, CallFunc_Play_ReturnValue_4) == 0x000068, "Member 'WB_CampCharaPanel_C_MemberMenuOut::CallFunc_Play_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, CallFunc_GetPlayingAnimationName_OutAnimPackName_5) == 0x00006C, "Member 'WB_CampCharaPanel_C_MemberMenuOut::CallFunc_GetPlayingAnimationName_OutAnimPackName_5' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, CallFunc_GetPlayingAnimationName_OutAnimationName_5) == 0x000074, "Member 'WB_CampCharaPanel_C_MemberMenuOut::CallFunc_GetPlayingAnimationName_OutAnimationName_5' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, CallFunc_Play_ReturnValue_5) == 0x00007C, "Member 'WB_CampCharaPanel_C_MemberMenuOut::CallFunc_Play_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, CallFunc_GetPlayingAnimationName_OutAnimPackName_6) == 0x000080, "Member 'WB_CampCharaPanel_C_MemberMenuOut::CallFunc_GetPlayingAnimationName_OutAnimPackName_6' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, CallFunc_GetPlayingAnimationName_OutAnimationName_6) == 0x000088, "Member 'WB_CampCharaPanel_C_MemberMenuOut::CallFunc_GetPlayingAnimationName_OutAnimationName_6' has a wrong offset!");
static_assert(offsetof(WB_CampCharaPanel_C_MemberMenuOut, CallFunc_Play_ReturnValue_6) == 0x000090, "Member 'WB_CampCharaPanel_C_MemberMenuOut::CallFunc_Play_ReturnValue_6' has a wrong offset!");

// Function WB_CampCharaPanel.WB_CampCharaPanel_C.MemberMenuIn
// 0x00B8 (0x00B8 - 0x0000)
struct WB_CampCharaPanel_C_MemberMenuIn final
{
public:
	int32                                         InMenuType;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A08[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A09[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName_1; // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName_1; // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A0A[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName_2; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName_2; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A0B[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName_3; // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName_3; // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_3;                       // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_4;                       // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
