#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CharaPanel

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_CharaPanel.WB_CharaPanel_C.ExecuteUbergraph_WB_CharaPanel
// 0x0080 (0x0080 - 0x0000)
struct WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_3;         // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_3;        // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_3;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_3;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_2;         // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_2;        // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_2;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_2;       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52B6[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_1;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_1;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_1;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_1;       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52B7[0x1];                                     // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName;           // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName;          // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex;          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex;         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_3;                       // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_2;                    // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_3;                    // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              K2Node_ComponentBoundEvent_Pos;                    // 0x0070(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_UV;                     // 0x0078(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel) == 0x000004, "Wrong alignment on WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel");
static_assert(sizeof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel) == 0x000080, "Wrong size on WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, EntryPoint) == 0x000000, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, K2Node_ComponentBoundEvent_AnimPackName_3) == 0x000004, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::K2Node_ComponentBoundEvent_AnimPackName_3' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, K2Node_ComponentBoundEvent_AnimationName_3) == 0x00000C, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::K2Node_ComponentBoundEvent_AnimationName_3' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_3) == 0x000014, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_3' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_3) == 0x000018, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_3' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, K2Node_ComponentBoundEvent_AnimPackName_2) == 0x00001C, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::K2Node_ComponentBoundEvent_AnimPackName_2' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, K2Node_ComponentBoundEvent_AnimationName_2) == 0x000024, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::K2Node_ComponentBoundEvent_AnimationName_2' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_2) == 0x00002C, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_2' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_2) == 0x000030, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_2' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, K2Node_SwitchName_CmpSuccess) == 0x000034, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, K2Node_ComponentBoundEvent_AnimPackName_1) == 0x000038, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::K2Node_ComponentBoundEvent_AnimPackName_1' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, K2Node_ComponentBoundEvent_AnimationName_1) == 0x000040, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::K2Node_ComponentBoundEvent_AnimationName_1' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex_1) == 0x000048, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex_1' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, K2Node_ComponentBoundEvent_AnimationIndex_1) == 0x00004C, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::K2Node_ComponentBoundEvent_AnimationIndex_1' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, CallFunc_Play_ReturnValue) == 0x000050, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, CallFunc_Play_ReturnValue_1) == 0x000051, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, CallFunc_Play_ReturnValue_2) == 0x000052, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, K2Node_ComponentBoundEvent_AnimPackName) == 0x000054, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::K2Node_ComponentBoundEvent_AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, K2Node_ComponentBoundEvent_AnimationName) == 0x00005C, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::K2Node_ComponentBoundEvent_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, K2Node_ComponentBoundEvent_AnimPackIndex) == 0x000064, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::K2Node_ComponentBoundEvent_AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, K2Node_ComponentBoundEvent_AnimationIndex) == 0x000068, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::K2Node_ComponentBoundEvent_AnimationIndex' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, K2Node_SwitchName_CmpSuccess_1) == 0x00006C, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::K2Node_SwitchName_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, CallFunc_Play_ReturnValue_3) == 0x00006D, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::CallFunc_Play_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, K2Node_SwitchName_CmpSuccess_2) == 0x00006E, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::K2Node_SwitchName_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, K2Node_SwitchName_CmpSuccess_3) == 0x00006F, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::K2Node_SwitchName_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, K2Node_ComponentBoundEvent_Pos) == 0x000070, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::K2Node_ComponentBoundEvent_Pos' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel, K2Node_ComponentBoundEvent_UV) == 0x000078, "Member 'WB_CharaPanel_C_ExecuteUbergraph_WB_CharaPanel::K2Node_ComponentBoundEvent_UV' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.BndEvt__WB_CharaPanel_ButtonS5Mouse_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_CharaPanel_C_BndEvt__WB_CharaPanel_ButtonS5Mouse_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              UV;                                                // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaPanel_C_BndEvt__WB_CharaPanel_ButtonS5Mouse_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature) == 0x000004, "Wrong alignment on WB_CharaPanel_C_BndEvt__WB_CharaPanel_ButtonS5Mouse_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature");
static_assert(sizeof(WB_CharaPanel_C_BndEvt__WB_CharaPanel_ButtonS5Mouse_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature) == 0x000010, "Wrong size on WB_CharaPanel_C_BndEvt__WB_CharaPanel_ButtonS5Mouse_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature");
static_assert(offsetof(WB_CharaPanel_C_BndEvt__WB_CharaPanel_ButtonS5Mouse_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature, Pos) == 0x000000, "Member 'WB_CharaPanel_C_BndEvt__WB_CharaPanel_ButtonS5Mouse_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature::Pos' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_BndEvt__WB_CharaPanel_ButtonS5Mouse_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature, UV) == 0x000008, "Member 'WB_CharaPanel_C_BndEvt__WB_CharaPanel_ButtonS5Mouse_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature::UV' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.BndEvt__SsPlayerLevelUp_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_CharaPanel_C_BndEvt__SsPlayerLevelUp_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaPanel_C_BndEvt__SsPlayerLevelUp_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_CharaPanel_C_BndEvt__SsPlayerLevelUp_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_CharaPanel_C_BndEvt__SsPlayerLevelUp_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_CharaPanel_C_BndEvt__SsPlayerLevelUp_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_CharaPanel_C_BndEvt__SsPlayerLevelUp_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_CharaPanel_C_BndEvt__SsPlayerLevelUp_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_BndEvt__SsPlayerLevelUp_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_CharaPanel_C_BndEvt__SsPlayerLevelUp_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_BndEvt__SsPlayerLevelUp_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_CharaPanel_C_BndEvt__SsPlayerLevelUp_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_BndEvt__SsPlayerLevelUp_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_CharaPanel_C_BndEvt__SsPlayerLevelUp_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.BndEvt__SsPlayerRecovery_K2Node_ComponentBoundEvent_6_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_CharaPanel_C_BndEvt__SsPlayerRecovery_K2Node_ComponentBoundEvent_6_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaPanel_C_BndEvt__SsPlayerRecovery_K2Node_ComponentBoundEvent_6_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_CharaPanel_C_BndEvt__SsPlayerRecovery_K2Node_ComponentBoundEvent_6_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_CharaPanel_C_BndEvt__SsPlayerRecovery_K2Node_ComponentBoundEvent_6_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_CharaPanel_C_BndEvt__SsPlayerRecovery_K2Node_ComponentBoundEvent_6_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_CharaPanel_C_BndEvt__SsPlayerRecovery_K2Node_ComponentBoundEvent_6_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_CharaPanel_C_BndEvt__SsPlayerRecovery_K2Node_ComponentBoundEvent_6_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_BndEvt__SsPlayerRecovery_K2Node_ComponentBoundEvent_6_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_CharaPanel_C_BndEvt__SsPlayerRecovery_K2Node_ComponentBoundEvent_6_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_BndEvt__SsPlayerRecovery_K2Node_ComponentBoundEvent_6_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_CharaPanel_C_BndEvt__SsPlayerRecovery_K2Node_ComponentBoundEvent_6_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_BndEvt__SsPlayerRecovery_K2Node_ComponentBoundEvent_6_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_CharaPanel_C_BndEvt__SsPlayerRecovery_K2Node_ComponentBoundEvent_6_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.BndEvt__SsPlayerDamage_K2Node_ComponentBoundEvent_5_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_CharaPanel_C_BndEvt__SsPlayerDamage_K2Node_ComponentBoundEvent_5_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaPanel_C_BndEvt__SsPlayerDamage_K2Node_ComponentBoundEvent_5_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_CharaPanel_C_BndEvt__SsPlayerDamage_K2Node_ComponentBoundEvent_5_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_CharaPanel_C_BndEvt__SsPlayerDamage_K2Node_ComponentBoundEvent_5_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_CharaPanel_C_BndEvt__SsPlayerDamage_K2Node_ComponentBoundEvent_5_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_CharaPanel_C_BndEvt__SsPlayerDamage_K2Node_ComponentBoundEvent_5_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_CharaPanel_C_BndEvt__SsPlayerDamage_K2Node_ComponentBoundEvent_5_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_BndEvt__SsPlayerDamage_K2Node_ComponentBoundEvent_5_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_CharaPanel_C_BndEvt__SsPlayerDamage_K2Node_ComponentBoundEvent_5_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_BndEvt__SsPlayerDamage_K2Node_ComponentBoundEvent_5_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_CharaPanel_C_BndEvt__SsPlayerDamage_K2Node_ComponentBoundEvent_5_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_BndEvt__SsPlayerDamage_K2Node_ComponentBoundEvent_5_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_CharaPanel_C_BndEvt__SsPlayerDamage_K2Node_ComponentBoundEvent_5_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_CharaPanel_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaPanel_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_CharaPanel_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_CharaPanel_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_CharaPanel_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_CharaPanel_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_CharaPanel_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_CharaPanel_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_CharaPanel_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_CharaPanel_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.CharaPanelOn
// 0x0020 (0x0020 - 0x0000)
struct WB_CharaPanel_C_CharaPanelOn final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_3;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_4;                       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52B8[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_5;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CharaPanel_C_CharaPanelOn) == 0x000008, "Wrong alignment on WB_CharaPanel_C_CharaPanelOn");
static_assert(sizeof(WB_CharaPanel_C_CharaPanelOn) == 0x000020, "Wrong size on WB_CharaPanel_C_CharaPanelOn");
static_assert(offsetof(WB_CharaPanel_C_CharaPanelOn, InType) == 0x000000, "Member 'WB_CharaPanel_C_CharaPanelOn::InType' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_CharaPanelOn, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_CharaPanel_C_CharaPanelOn::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_CharaPanelOn, CallFunc_Play_ReturnValue) == 0x000005, "Member 'WB_CharaPanel_C_CharaPanelOn::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_CharaPanelOn, CallFunc_Play_ReturnValue_1) == 0x000006, "Member 'WB_CharaPanel_C_CharaPanelOn::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_CharaPanelOn, CallFunc_Play_ReturnValue_2) == 0x000007, "Member 'WB_CharaPanel_C_CharaPanelOn::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_CharaPanelOn, CallFunc_Play_ReturnValue_3) == 0x000008, "Member 'WB_CharaPanel_C_CharaPanelOn::CallFunc_Play_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_CharaPanelOn, CallFunc_Play_ReturnValue_4) == 0x000009, "Member 'WB_CharaPanel_C_CharaPanelOn::CallFunc_Play_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_CharaPanelOn, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'WB_CharaPanel_C_CharaPanelOn::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_CharaPanelOn, CallFunc_Play_ReturnValue_5) == 0x000018, "Member 'WB_CharaPanel_C_CharaPanelOn::CallFunc_Play_ReturnValue_5' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.BadstatusIconOn
// 0x0008 (0x0008 - 0x0000)
struct WB_CharaPanel_C_BadstatusIconOn final
{
public:
	int32                                         InPos;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BAD_STATUS                                  InBadStatus;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaPanel_C_BadstatusIconOn) == 0x000004, "Wrong alignment on WB_CharaPanel_C_BadstatusIconOn");
static_assert(sizeof(WB_CharaPanel_C_BadstatusIconOn) == 0x000008, "Wrong size on WB_CharaPanel_C_BadstatusIconOn");
static_assert(offsetof(WB_CharaPanel_C_BadstatusIconOn, InPos) == 0x000000, "Member 'WB_CharaPanel_C_BadstatusIconOn::InPos' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_BadstatusIconOn, InBadStatus) == 0x000004, "Member 'WB_CharaPanel_C_BadstatusIconOn::InBadStatus' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.BadstatusIconOff
// 0x0004 (0x0004 - 0x0000)
struct WB_CharaPanel_C_BadstatusIconOff final
{
public:
	int32                                         InPos;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaPanel_C_BadstatusIconOff) == 0x000004, "Wrong alignment on WB_CharaPanel_C_BadstatusIconOff");
static_assert(sizeof(WB_CharaPanel_C_BadstatusIconOff) == 0x000004, "Wrong size on WB_CharaPanel_C_BadstatusIconOff");
static_assert(offsetof(WB_CharaPanel_C_BadstatusIconOff, InPos) == 0x000000, "Member 'WB_CharaPanel_C_BadstatusIconOff::InPos' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.SupportIconOn
// 0x0008 (0x0008 - 0x0000)
struct WB_CharaPanel_C_SupportIconOn final
{
public:
	int32                                         InPos;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InParam;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaPanel_C_SupportIconOn) == 0x000004, "Wrong alignment on WB_CharaPanel_C_SupportIconOn");
static_assert(sizeof(WB_CharaPanel_C_SupportIconOn) == 0x000008, "Wrong size on WB_CharaPanel_C_SupportIconOn");
static_assert(offsetof(WB_CharaPanel_C_SupportIconOn, InPos) == 0x000000, "Member 'WB_CharaPanel_C_SupportIconOn::InPos' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SupportIconOn, InParam) == 0x000004, "Member 'WB_CharaPanel_C_SupportIconOn::InParam' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.SupportIconOff
// 0x0004 (0x0004 - 0x0000)
struct WB_CharaPanel_C_SupportIconOff final
{
public:
	int32                                         InPos;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaPanel_C_SupportIconOff) == 0x000004, "Wrong alignment on WB_CharaPanel_C_SupportIconOff");
static_assert(sizeof(WB_CharaPanel_C_SupportIconOff) == 0x000004, "Wrong size on WB_CharaPanel_C_SupportIconOff");
static_assert(offsetof(WB_CharaPanel_C_SupportIconOff, InPos) == 0x000000, "Member 'WB_CharaPanel_C_SupportIconOff::InPos' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.SetHPParamDec
// 0x0038 (0x0038 - 0x0000)
struct WB_CharaPanel_C_SetHPParamDec final
{
public:
	float                                         InRatio;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InCalcRatio;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InHp;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InHPMax;                                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Scalecalc;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ScaleParam;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52B9[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CharaPanel_C_SetHPParamDec) == 0x000004, "Wrong alignment on WB_CharaPanel_C_SetHPParamDec");
static_assert(sizeof(WB_CharaPanel_C_SetHPParamDec) == 0x000038, "Wrong size on WB_CharaPanel_C_SetHPParamDec");
static_assert(offsetof(WB_CharaPanel_C_SetHPParamDec, InRatio) == 0x000000, "Member 'WB_CharaPanel_C_SetHPParamDec::InRatio' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetHPParamDec, InCalcRatio) == 0x000004, "Member 'WB_CharaPanel_C_SetHPParamDec::InCalcRatio' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetHPParamDec, InHp) == 0x000008, "Member 'WB_CharaPanel_C_SetHPParamDec::InHp' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetHPParamDec, InHPMax) == 0x00000C, "Member 'WB_CharaPanel_C_SetHPParamDec::InHPMax' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetHPParamDec, Scalecalc) == 0x000010, "Member 'WB_CharaPanel_C_SetHPParamDec::Scalecalc' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetHPParamDec, ScaleParam) == 0x000018, "Member 'WB_CharaPanel_C_SetHPParamDec::ScaleParam' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetHPParamDec, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000020, "Member 'WB_CharaPanel_C_SetHPParamDec::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetHPParamDec, CallFunc_MakeVector2D_ReturnValue) == 0x000024, "Member 'WB_CharaPanel_C_SetHPParamDec::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetHPParamDec, CallFunc_MakeVector2D_ReturnValue_1) == 0x00002C, "Member 'WB_CharaPanel_C_SetHPParamDec::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetHPParamDec, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000034, "Member 'WB_CharaPanel_C_SetHPParamDec::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetHPParamDec, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000035, "Member 'WB_CharaPanel_C_SetHPParamDec::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetHPParamDec, CallFunc_LessEqual_FloatFloat_ReturnValue_2) == 0x000036, "Member 'WB_CharaPanel_C_SetHPParamDec::CallFunc_LessEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetHPParamDec, CallFunc_Greater_IntInt_ReturnValue) == 0x000037, "Member 'WB_CharaPanel_C_SetHPParamDec::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.SetPosition
// 0x0010 (0x0010 - 0x0000)
struct WB_CharaPanel_C_SetPosition final
{
public:
	struct FVector2D                              InPos;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaPanel_C_SetPosition) == 0x000008, "Wrong alignment on WB_CharaPanel_C_SetPosition");
static_assert(sizeof(WB_CharaPanel_C_SetPosition) == 0x000010, "Wrong size on WB_CharaPanel_C_SetPosition");
static_assert(offsetof(WB_CharaPanel_C_SetPosition, InPos) == 0x000000, "Member 'WB_CharaPanel_C_SetPosition::InPos' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetPosition, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000008, "Member 'WB_CharaPanel_C_SetPosition::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.SetCharaNameText
// 0x0018 (0x0018 - 0x0000)
struct WB_CharaPanel_C_SetCharaNameText final
{
public:
	class FText                                   InName;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WB_CharaPanel_C_SetCharaNameText) == 0x000008, "Wrong alignment on WB_CharaPanel_C_SetCharaNameText");
static_assert(sizeof(WB_CharaPanel_C_SetCharaNameText) == 0x000018, "Wrong size on WB_CharaPanel_C_SetCharaNameText");
static_assert(offsetof(WB_CharaPanel_C_SetCharaNameText, InName) == 0x000000, "Member 'WB_CharaPanel_C_SetCharaNameText::InName' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.SetRaceNameText
// 0x0018 (0x0018 - 0x0000)
struct WB_CharaPanel_C_SetRaceNameText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WB_CharaPanel_C_SetRaceNameText) == 0x000008, "Wrong alignment on WB_CharaPanel_C_SetRaceNameText");
static_assert(sizeof(WB_CharaPanel_C_SetRaceNameText) == 0x000018, "Wrong size on WB_CharaPanel_C_SetRaceNameText");
static_assert(offsetof(WB_CharaPanel_C_SetRaceNameText, InText) == 0x000000, "Member 'WB_CharaPanel_C_SetRaceNameText::InText' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.SetMPParamDec
// 0x0038 (0x0038 - 0x0000)
struct WB_CharaPanel_C_SetMPParamDec final
{
public:
	float                                         InRatio;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InCalcRatio;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMp;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMPMax;                                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Scalecalc;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ScaleParam;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52BA[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52BB[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaPanel_C_SetMPParamDec) == 0x000004, "Wrong alignment on WB_CharaPanel_C_SetMPParamDec");
static_assert(sizeof(WB_CharaPanel_C_SetMPParamDec) == 0x000038, "Wrong size on WB_CharaPanel_C_SetMPParamDec");
static_assert(offsetof(WB_CharaPanel_C_SetMPParamDec, InRatio) == 0x000000, "Member 'WB_CharaPanel_C_SetMPParamDec::InRatio' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetMPParamDec, InCalcRatio) == 0x000004, "Member 'WB_CharaPanel_C_SetMPParamDec::InCalcRatio' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetMPParamDec, InMp) == 0x000008, "Member 'WB_CharaPanel_C_SetMPParamDec::InMp' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetMPParamDec, InMPMax) == 0x00000C, "Member 'WB_CharaPanel_C_SetMPParamDec::InMPMax' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetMPParamDec, Scalecalc) == 0x000010, "Member 'WB_CharaPanel_C_SetMPParamDec::Scalecalc' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetMPParamDec, ScaleParam) == 0x000018, "Member 'WB_CharaPanel_C_SetMPParamDec::ScaleParam' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetMPParamDec, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000020, "Member 'WB_CharaPanel_C_SetMPParamDec::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetMPParamDec, CallFunc_MakeVector2D_ReturnValue) == 0x000024, "Member 'WB_CharaPanel_C_SetMPParamDec::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetMPParamDec, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00002C, "Member 'WB_CharaPanel_C_SetMPParamDec::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetMPParamDec, CallFunc_MakeVector2D_ReturnValue_1) == 0x000030, "Member 'WB_CharaPanel_C_SetMPParamDec::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.SetCharaTexture
// 0x0028 (0x0028 - 0x0000)
struct WB_CharaPanel_C_SetCharaTexture final
{
public:
	int32                                         InCharaId;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52BC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               InTextureRef;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Devilname;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaPanel_C_SetCharaTexture) == 0x000008, "Wrong alignment on WB_CharaPanel_C_SetCharaTexture");
static_assert(sizeof(WB_CharaPanel_C_SetCharaTexture) == 0x000028, "Wrong size on WB_CharaPanel_C_SetCharaTexture");
static_assert(offsetof(WB_CharaPanel_C_SetCharaTexture, InCharaId) == 0x000000, "Member 'WB_CharaPanel_C_SetCharaTexture::InCharaId' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetCharaTexture, InTextureRef) == 0x000008, "Member 'WB_CharaPanel_C_SetCharaTexture::InTextureRef' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetCharaTexture, Devilname) == 0x000010, "Member 'WB_CharaPanel_C_SetCharaTexture::Devilname' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetCharaTexture, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'WB_CharaPanel_C_SetCharaTexture::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.SetLevel
// 0x0004 (0x0004 - 0x0000)
struct WB_CharaPanel_C_SetLevel final
{
public:
	int32                                         InLevel;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaPanel_C_SetLevel) == 0x000004, "Wrong alignment on WB_CharaPanel_C_SetLevel");
static_assert(sizeof(WB_CharaPanel_C_SetLevel) == 0x000004, "Wrong size on WB_CharaPanel_C_SetLevel");
static_assert(offsetof(WB_CharaPanel_C_SetLevel, InLevel) == 0x000000, "Member 'WB_CharaPanel_C_SetLevel::InLevel' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.SetLevelFontColor
// 0x0004 (0x0004 - 0x0000)
struct WB_CharaPanel_C_SetLevelFontColor final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaPanel_C_SetLevelFontColor) == 0x000004, "Wrong alignment on WB_CharaPanel_C_SetLevelFontColor");
static_assert(sizeof(WB_CharaPanel_C_SetLevelFontColor) == 0x000004, "Wrong size on WB_CharaPanel_C_SetLevelFontColor");
static_assert(offsetof(WB_CharaPanel_C_SetLevelFontColor, InType) == 0x000000, "Member 'WB_CharaPanel_C_SetLevelFontColor::InType' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.SetHPFontColor
// 0x0004 (0x0004 - 0x0000)
struct WB_CharaPanel_C_SetHPFontColor final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaPanel_C_SetHPFontColor) == 0x000004, "Wrong alignment on WB_CharaPanel_C_SetHPFontColor");
static_assert(sizeof(WB_CharaPanel_C_SetHPFontColor) == 0x000004, "Wrong size on WB_CharaPanel_C_SetHPFontColor");
static_assert(offsetof(WB_CharaPanel_C_SetHPFontColor, InType) == 0x000000, "Member 'WB_CharaPanel_C_SetHPFontColor::InType' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.SetMPFontColor
// 0x0004 (0x0004 - 0x0000)
struct WB_CharaPanel_C_SetMPFontColor final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaPanel_C_SetMPFontColor) == 0x000004, "Wrong alignment on WB_CharaPanel_C_SetMPFontColor");
static_assert(sizeof(WB_CharaPanel_C_SetMPFontColor) == 0x000004, "Wrong size on WB_CharaPanel_C_SetMPFontColor");
static_assert(offsetof(WB_CharaPanel_C_SetMPFontColor, InType) == 0x000000, "Member 'WB_CharaPanel_C_SetMPFontColor::InType' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.ActorPanelOn
// 0x0001 (0x0001 - 0x0000)
struct WB_CharaPanel_C_ActorPanelOn final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CharaPanel_C_ActorPanelOn) == 0x000001, "Wrong alignment on WB_CharaPanel_C_ActorPanelOn");
static_assert(sizeof(WB_CharaPanel_C_ActorPanelOn) == 0x000001, "Wrong size on WB_CharaPanel_C_ActorPanelOn");
static_assert(offsetof(WB_CharaPanel_C_ActorPanelOn, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CharaPanel_C_ActorPanelOn::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.SetMPParamAdd
// 0x0030 (0x0030 - 0x0000)
struct WB_CharaPanel_C_SetMPParamAdd final
{
public:
	float                                         InRatio;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InCalcRatio;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMp;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMPMax;                                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Scalecalc;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ScaleParam;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaPanel_C_SetMPParamAdd) == 0x000004, "Wrong alignment on WB_CharaPanel_C_SetMPParamAdd");
static_assert(sizeof(WB_CharaPanel_C_SetMPParamAdd) == 0x000030, "Wrong size on WB_CharaPanel_C_SetMPParamAdd");
static_assert(offsetof(WB_CharaPanel_C_SetMPParamAdd, InRatio) == 0x000000, "Member 'WB_CharaPanel_C_SetMPParamAdd::InRatio' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetMPParamAdd, InCalcRatio) == 0x000004, "Member 'WB_CharaPanel_C_SetMPParamAdd::InCalcRatio' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetMPParamAdd, InMp) == 0x000008, "Member 'WB_CharaPanel_C_SetMPParamAdd::InMp' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetMPParamAdd, InMPMax) == 0x00000C, "Member 'WB_CharaPanel_C_SetMPParamAdd::InMPMax' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetMPParamAdd, Scalecalc) == 0x000010, "Member 'WB_CharaPanel_C_SetMPParamAdd::Scalecalc' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetMPParamAdd, ScaleParam) == 0x000018, "Member 'WB_CharaPanel_C_SetMPParamAdd::ScaleParam' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetMPParamAdd, CallFunc_MakeVector2D_ReturnValue) == 0x000020, "Member 'WB_CharaPanel_C_SetMPParamAdd::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetMPParamAdd, CallFunc_MakeVector2D_ReturnValue_1) == 0x000028, "Member 'WB_CharaPanel_C_SetMPParamAdd::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.SetReserveMPParamAdd
// 0x0030 (0x0030 - 0x0000)
struct WB_CharaPanel_C_SetReserveMPParamAdd final
{
public:
	float                                         InBeforeRatio;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InAfterRatio;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Afterscale;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              beforescale;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcAddRatio_OutBefore;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcAddRatio_OutAfter;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaPanel_C_SetReserveMPParamAdd) == 0x000004, "Wrong alignment on WB_CharaPanel_C_SetReserveMPParamAdd");
static_assert(sizeof(WB_CharaPanel_C_SetReserveMPParamAdd) == 0x000030, "Wrong size on WB_CharaPanel_C_SetReserveMPParamAdd");
static_assert(offsetof(WB_CharaPanel_C_SetReserveMPParamAdd, InBeforeRatio) == 0x000000, "Member 'WB_CharaPanel_C_SetReserveMPParamAdd::InBeforeRatio' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetReserveMPParamAdd, InAfterRatio) == 0x000004, "Member 'WB_CharaPanel_C_SetReserveMPParamAdd::InAfterRatio' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetReserveMPParamAdd, Afterscale) == 0x000008, "Member 'WB_CharaPanel_C_SetReserveMPParamAdd::Afterscale' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetReserveMPParamAdd, beforescale) == 0x000010, "Member 'WB_CharaPanel_C_SetReserveMPParamAdd::beforescale' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetReserveMPParamAdd, CallFunc_CalcAddRatio_OutBefore) == 0x000018, "Member 'WB_CharaPanel_C_SetReserveMPParamAdd::CallFunc_CalcAddRatio_OutBefore' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetReserveMPParamAdd, CallFunc_CalcAddRatio_OutAfter) == 0x00001C, "Member 'WB_CharaPanel_C_SetReserveMPParamAdd::CallFunc_CalcAddRatio_OutAfter' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetReserveMPParamAdd, CallFunc_MakeVector2D_ReturnValue) == 0x000020, "Member 'WB_CharaPanel_C_SetReserveMPParamAdd::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaPanel_C_SetReserveMPParamAdd, CallFunc_MakeVector2D_ReturnValue_1) == 0x000028, "Member 'WB_CharaPanel_C_SetReserveMPParamAdd::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");

// Function WB_CharaPanel.WB_CharaPanel_C.SelectPanelOn
// 0x0001 (0x0001 - 0x0000)
struct WB_CharaPanel_C_SelectPanelOn final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CharaPanel_C_SelectPanelOn) == 0x000001, "Wrong alignment on WB_CharaPanel_C_SelectPanelOn");
