#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CategoryWindowIcon

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_CategoryWindowIcon.WB_CategoryWindowIcon_C.MouseEvent_OnClickedIcon__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WB_CategoryWindowIcon_C_MouseEvent_OnClickedIcon__DelegateSignature final
{
public:
	int32                                         Param_CategoryIdx;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CategoryWindowIcon_C_MouseEvent_OnClickedIcon__DelegateSignature) == 0x000004, "Wrong alignment on WB_CategoryWindowIcon_C_MouseEvent_OnClickedIcon__DelegateSignature");
static_assert(sizeof(WB_CategoryWindowIcon_C_MouseEvent_OnClickedIcon__DelegateSignature) == 0x000004, "Wrong size on WB_CategoryWindowIcon_C_MouseEvent_OnClickedIcon__DelegateSignature");
static_assert(offsetof(WB_CategoryWindowIcon_C_MouseEvent_OnClickedIcon__DelegateSignature, Param_CategoryIdx) == 0x000000, "Member 'WB_CategoryWindowIcon_C_MouseEvent_OnClickedIcon__DelegateSignature::Param_CategoryIdx' has a wrong offset!");

// Function WB_CategoryWindowIcon.WB_CategoryWindowIcon_C.ExecuteUbergraph_WB_CategoryWindowIcon
// 0x0018 (0x0018 - 0x0000)
struct WB_CategoryWindowIcon_C_ExecuteUbergraph_WB_CategoryWindowIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_ComponentBoundEvent_Pos;                    // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_UV;                     // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CategoryWindowIcon_C_ExecuteUbergraph_WB_CategoryWindowIcon) == 0x000004, "Wrong alignment on WB_CategoryWindowIcon_C_ExecuteUbergraph_WB_CategoryWindowIcon");
static_assert(sizeof(WB_CategoryWindowIcon_C_ExecuteUbergraph_WB_CategoryWindowIcon) == 0x000018, "Wrong size on WB_CategoryWindowIcon_C_ExecuteUbergraph_WB_CategoryWindowIcon");
static_assert(offsetof(WB_CategoryWindowIcon_C_ExecuteUbergraph_WB_CategoryWindowIcon, EntryPoint) == 0x000000, "Member 'WB_CategoryWindowIcon_C_ExecuteUbergraph_WB_CategoryWindowIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_CategoryWindowIcon_C_ExecuteUbergraph_WB_CategoryWindowIcon, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WB_CategoryWindowIcon_C_ExecuteUbergraph_WB_CategoryWindowIcon::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_CategoryWindowIcon_C_ExecuteUbergraph_WB_CategoryWindowIcon, K2Node_ComponentBoundEvent_Pos) == 0x000008, "Member 'WB_CategoryWindowIcon_C_ExecuteUbergraph_WB_CategoryWindowIcon::K2Node_ComponentBoundEvent_Pos' has a wrong offset!");
static_assert(offsetof(WB_CategoryWindowIcon_C_ExecuteUbergraph_WB_CategoryWindowIcon, K2Node_ComponentBoundEvent_UV) == 0x000010, "Member 'WB_CategoryWindowIcon_C_ExecuteUbergraph_WB_CategoryWindowIcon::K2Node_ComponentBoundEvent_UV' has a wrong offset!");

// Function WB_CategoryWindowIcon.WB_CategoryWindowIcon_C.BndEvt__WB_CategoryWindowIcon_Button_S5_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_CategoryWindowIcon_C_BndEvt__WB_CategoryWindowIcon_Button_S5_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              UV;                                                // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CategoryWindowIcon_C_BndEvt__WB_CategoryWindowIcon_Button_S5_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature) == 0x000004, "Wrong alignment on WB_CategoryWindowIcon_C_BndEvt__WB_CategoryWindowIcon_Button_S5_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature");
static_assert(sizeof(WB_CategoryWindowIcon_C_BndEvt__WB_CategoryWindowIcon_Button_S5_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature) == 0x000010, "Wrong size on WB_CategoryWindowIcon_C_BndEvt__WB_CategoryWindowIcon_Button_S5_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature");
static_assert(offsetof(WB_CategoryWindowIcon_C_BndEvt__WB_CategoryWindowIcon_Button_S5_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature, Pos) == 0x000000, "Member 'WB_CategoryWindowIcon_C_BndEvt__WB_CategoryWindowIcon_Button_S5_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature::Pos' has a wrong offset!");
static_assert(offsetof(WB_CategoryWindowIcon_C_BndEvt__WB_CategoryWindowIcon_Button_S5_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature, UV) == 0x000008, "Member 'WB_CategoryWindowIcon_C_BndEvt__WB_CategoryWindowIcon_Button_S5_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature::UV' has a wrong offset!");

// Function WB_CategoryWindowIcon.WB_CategoryWindowIcon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_CategoryWindowIcon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CategoryWindowIcon_C_PreConstruct) == 0x000001, "Wrong alignment on WB_CategoryWindowIcon_C_PreConstruct");
static_assert(sizeof(WB_CategoryWindowIcon_C_PreConstruct) == 0x000001, "Wrong size on WB_CategoryWindowIcon_C_PreConstruct");
static_assert(offsetof(WB_CategoryWindowIcon_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_CategoryWindowIcon_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_CategoryWindowIcon.WB_CategoryWindowIcon_C.SetCategoryIconAnim
// 0x0088 (0x0088 - 0x0000)
struct WB_CategoryWindowIcon_C_SetCategoryIconAnim final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelectAnim;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _arrayIdx;                                         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           _iconName_select;                                  // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           _iconName;                                         // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x0060(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CategoryWindowIcon_C_SetCategoryIconAnim) == 0x000008, "Wrong alignment on WB_CategoryWindowIcon_C_SetCategoryIconAnim");
static_assert(sizeof(WB_CategoryWindowIcon_C_SetCategoryIconAnim) == 0x000088, "Wrong size on WB_CategoryWindowIcon_C_SetCategoryIconAnim");
static_assert(offsetof(WB_CategoryWindowIcon_C_SetCategoryIconAnim, AnimPackName) == 0x000000, "Member 'WB_CategoryWindowIcon_C_SetCategoryIconAnim::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CategoryWindowIcon_C_SetCategoryIconAnim, IsSelectAnim) == 0x000008, "Member 'WB_CategoryWindowIcon_C_SetCategoryIconAnim::IsSelectAnim' has a wrong offset!");
static_assert(offsetof(WB_CategoryWindowIcon_C_SetCategoryIconAnim, _arrayIdx) == 0x00000C, "Member 'WB_CategoryWindowIcon_C_SetCategoryIconAnim::_arrayIdx' has a wrong offset!");
static_assert(offsetof(WB_CategoryWindowIcon_C_SetCategoryIconAnim, _iconName_select) == 0x000010, "Member 'WB_CategoryWindowIcon_C_SetCategoryIconAnim::_iconName_select' has a wrong offset!");
static_assert(offsetof(WB_CategoryWindowIcon_C_SetCategoryIconAnim, _iconName) == 0x000020, "Member 'WB_CategoryWindowIcon_C_SetCategoryIconAnim::_iconName' has a wrong offset!");
static_assert(offsetof(WB_CategoryWindowIcon_C_SetCategoryIconAnim, K2Node_MakeArray_Array) == 0x000030, "Member 'WB_CategoryWindowIcon_C_SetCategoryIconAnim::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_CategoryWindowIcon_C_SetCategoryIconAnim, CallFunc_Conv_NameToString_ReturnValue) == 0x000040, "Member 'WB_CategoryWindowIcon_C_SetCategoryIconAnim::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CategoryWindowIcon_C_SetCategoryIconAnim, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'WB_CategoryWindowIcon_C_SetCategoryIconAnim::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CategoryWindowIcon_C_SetCategoryIconAnim, K2Node_MakeArray_Array_1) == 0x000060, "Member 'WB_CategoryWindowIcon_C_SetCategoryIconAnim::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WB_CategoryWindowIcon_C_SetCategoryIconAnim, CallFunc_Conv_StringToName_ReturnValue) == 0x000070, "Member 'WB_CategoryWindowIcon_C_SetCategoryIconAnim::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CategoryWindowIcon_C_SetCategoryIconAnim, Temp_bool_Variable) == 0x000078, "Member 'WB_CategoryWindowIcon_C_SetCategoryIconAnim::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_CategoryWindowIcon_C_SetCategoryIconAnim, K2Node_Select_Default) == 0x00007C, "Member 'WB_CategoryWindowIcon_C_SetCategoryIconAnim::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_CategoryWindowIcon_C_SetCategoryIconAnim, CallFunc_Play_ReturnValue) == 0x000084, "Member 'WB_CategoryWindowIcon_C_SetCategoryIconAnim::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CategoryWindowIcon.WB_CategoryWindowIcon_C.SetNewIconVisibility
// 0x0005 (0x0005 - 0x0000)
struct WB_CategoryWindowIcon_C_SetNewIconVisibility final
{
public:
	bool                                          Param_IsVisible;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CategoryWindowIcon_C_SetNewIconVisibility) == 0x000001, "Wrong alignment on WB_CategoryWindowIcon_C_SetNewIconVisibility");
static_assert(sizeof(WB_CategoryWindowIcon_C_SetNewIconVisibility) == 0x000005, "Wrong size on WB_CategoryWindowIcon_C_SetNewIconVisibility");
static_assert(offsetof(WB_CategoryWindowIcon_C_SetNewIconVisibility, Param_IsVisible) == 0x000000, "Member 'WB_CategoryWindowIcon_C_SetNewIconVisibility::Param_IsVisible' has a wrong offset!");
static_assert(offsetof(WB_CategoryWindowIcon_C_SetNewIconVisibility, Temp_bool_Variable) == 0x000001, "Member 'WB_CategoryWindowIcon_C_SetNewIconVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_CategoryWindowIcon_C_SetNewIconVisibility, Temp_byte_Variable) == 0x000002, "Member 'WB_CategoryWindowIcon_C_SetNewIconVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_CategoryWindowIcon_C_SetNewIconVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'WB_CategoryWindowIcon_C_SetNewIconVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_CategoryWindowIcon_C_SetNewIconVisibility, K2Node_Select_Default) == 0x000004, "Member 'WB_CategoryWindowIcon_C_SetNewIconVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WB_CategoryWindowIcon.WB_CategoryWindowIcon_C.AlignNewIconAnim
// 0x0004 (0x0004 - 0x0000)
struct WB_CategoryWindowIcon_C_AlignNewIconAnim final
{
public:
	float                                         Frame;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CategoryWindowIcon_C_AlignNewIconAnim) == 0x000004, "Wrong alignment on WB_CategoryWindowIcon_C_AlignNewIconAnim");
static_assert(sizeof(WB_CategoryWindowIcon_C_AlignNewIconAnim) == 0x000004, "Wrong size on WB_CategoryWindowIcon_C_AlignNewIconAnim");
static_assert(offsetof(WB_CategoryWindowIcon_C_AlignNewIconAnim, Frame) == 0x000000, "Member 'WB_CategoryWindowIcon_C_AlignNewIconAnim::Frame' has a wrong offset!");

// Function WB_CategoryWindowIcon.WB_CategoryWindowIcon_C.GetNewIconAnimFrame
// 0x000C (0x000C - 0x0000)
struct WB_CategoryWindowIcon_C_GetNewIconAnimFrame final
{
public:
	float                                         Frame;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayFrame_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CategoryWindowIcon_C_GetNewIconAnimFrame) == 0x000004, "Wrong alignment on WB_CategoryWindowIcon_C_GetNewIconAnimFrame");
static_assert(sizeof(WB_CategoryWindowIcon_C_GetNewIconAnimFrame) == 0x00000C, "Wrong size on WB_CategoryWindowIcon_C_GetNewIconAnimFrame");
static_assert(offsetof(WB_CategoryWindowIcon_C_GetNewIconAnimFrame, Frame) == 0x000000, "Member 'WB_CategoryWindowIcon_C_GetNewIconAnimFrame::Frame' has a wrong offset!");
static_assert(offsetof(WB_CategoryWindowIcon_C_GetNewIconAnimFrame, CallFunc_GetPlayFrame_ReturnValue) == 0x000004, "Member 'WB_CategoryWindowIcon_C_GetNewIconAnimFrame::CallFunc_GetPlayFrame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CategoryWindowIcon_C_GetNewIconAnimFrame, CallFunc_IsVisible_ReturnValue) == 0x000008, "Member 'WB_CategoryWindowIcon_C_GetNewIconAnimFrame::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

}

