#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CampItemList

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_CampItemList.WB_CampItemList_C.IsItHovered
// 0x0001 (0x0001 - 0x0000)
struct WB_CampItemList_C_IsItHovered final
{
public:
	bool                                          OutHovered;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemList_C_IsItHovered) == 0x000001, "Wrong alignment on WB_CampItemList_C_IsItHovered");
static_assert(sizeof(WB_CampItemList_C_IsItHovered) == 0x000001, "Wrong size on WB_CampItemList_C_IsItHovered");
static_assert(offsetof(WB_CampItemList_C_IsItHovered, OutHovered) == 0x000000, "Member 'WB_CampItemList_C_IsItHovered::OutHovered' has a wrong offset!");

// Function WB_CampItemList.WB_CampItemList_C.IsItClicked
// 0x0001 (0x0001 - 0x0000)
struct WB_CampItemList_C_IsItClicked final
{
public:
	bool                                          OutClicked;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemList_C_IsItClicked) == 0x000001, "Wrong alignment on WB_CampItemList_C_IsItClicked");
static_assert(sizeof(WB_CampItemList_C_IsItClicked) == 0x000001, "Wrong size on WB_CampItemList_C_IsItClicked");
static_assert(offsetof(WB_CampItemList_C_IsItClicked, OutClicked) == 0x000000, "Member 'WB_CampItemList_C_IsItClicked::OutClicked' has a wrong offset!");

// Function WB_CampItemList.WB_CampItemList_C.SetItemSelectCursorAnimation
// 0x0001 (0x0001 - 0x0000)
struct WB_CampItemList_C_SetItemSelectCursorAnimation final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemList_C_SetItemSelectCursorAnimation) == 0x000001, "Wrong alignment on WB_CampItemList_C_SetItemSelectCursorAnimation");
static_assert(sizeof(WB_CampItemList_C_SetItemSelectCursorAnimation) == 0x000001, "Wrong size on WB_CampItemList_C_SetItemSelectCursorAnimation");
static_assert(offsetof(WB_CampItemList_C_SetItemSelectCursorAnimation, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampItemList_C_SetItemSelectCursorAnimation::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampItemList.WB_CampItemList_C.IsAnimationEnd
// 0x0003 (0x0003 - 0x0000)
struct WB_CampItemList_C_IsAnimationEnd final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemList_C_IsAnimationEnd) == 0x000001, "Wrong alignment on WB_CampItemList_C_IsAnimationEnd");
static_assert(sizeof(WB_CampItemList_C_IsAnimationEnd) == 0x000003, "Wrong size on WB_CampItemList_C_IsAnimationEnd");
static_assert(offsetof(WB_CampItemList_C_IsAnimationEnd, OutParam) == 0x000000, "Member 'WB_CampItemList_C_IsAnimationEnd::OutParam' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_IsAnimationEnd, CallFunc_IsVisible_ReturnValue) == 0x000001, "Member 'WB_CampItemList_C_IsAnimationEnd::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_IsAnimationEnd, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WB_CampItemList_C_IsAnimationEnd::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WB_CampItemList.WB_CampItemList_C.SetItemCursorAnimationUseAnimeType
// 0x0004 (0x0004 - 0x0000)
struct WB_CampItemList_C_SetItemCursorAnimationUseAnimeType final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemList_C_SetItemCursorAnimationUseAnimeType) == 0x000004, "Wrong alignment on WB_CampItemList_C_SetItemCursorAnimationUseAnimeType");
static_assert(sizeof(WB_CampItemList_C_SetItemCursorAnimationUseAnimeType) == 0x000004, "Wrong size on WB_CampItemList_C_SetItemCursorAnimationUseAnimeType");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimationUseAnimeType, InType) == 0x000000, "Member 'WB_CampItemList_C_SetItemCursorAnimationUseAnimeType::InType' has a wrong offset!");

// Function WB_CampItemList.WB_CampItemList_C.GetUseItem
// 0x0004 (0x0004 - 0x0000)
struct WB_CampItemList_C_GetUseItem final
{
public:
	int32                                         OutUseItem;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemList_C_GetUseItem) == 0x000004, "Wrong alignment on WB_CampItemList_C_GetUseItem");
static_assert(sizeof(WB_CampItemList_C_GetUseItem) == 0x000004, "Wrong size on WB_CampItemList_C_GetUseItem");
static_assert(offsetof(WB_CampItemList_C_GetUseItem, OutUseItem) == 0x000000, "Member 'WB_CampItemList_C_GetUseItem::OutUseItem' has a wrong offset!");

// Function WB_CampItemList.WB_CampItemList_C.DarkMaskOff
// 0x0001 (0x0001 - 0x0000)
struct WB_CampItemList_C_DarkMaskOff final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemList_C_DarkMaskOff) == 0x000001, "Wrong alignment on WB_CampItemList_C_DarkMaskOff");
static_assert(sizeof(WB_CampItemList_C_DarkMaskOff) == 0x000001, "Wrong size on WB_CampItemList_C_DarkMaskOff");
static_assert(offsetof(WB_CampItemList_C_DarkMaskOff, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampItemList_C_DarkMaskOff::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampItemList.WB_CampItemList_C.DarkMaskOn
// 0x0001 (0x0001 - 0x0000)
struct WB_CampItemList_C_DarkMaskOn final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemList_C_DarkMaskOn) == 0x000001, "Wrong alignment on WB_CampItemList_C_DarkMaskOn");
static_assert(sizeof(WB_CampItemList_C_DarkMaskOn) == 0x000001, "Wrong size on WB_CampItemList_C_DarkMaskOn");
static_assert(offsetof(WB_CampItemList_C_DarkMaskOn, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampItemList_C_DarkMaskOn::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampItemList.WB_CampItemList_C.SetItemNameFontColor
// 0x0088 (0x0088 - 0x0000)
struct WB_CampItemList_C_SetItemNameFontColor final
{
public:
	int32                                         InUseItem;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A8C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A8D[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0038(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0060(0x0028)()
};
static_assert(alignof(WB_CampItemList_C_SetItemNameFontColor) == 0x000008, "Wrong alignment on WB_CampItemList_C_SetItemNameFontColor");
static_assert(sizeof(WB_CampItemList_C_SetItemNameFontColor) == 0x000088, "Wrong size on WB_CampItemList_C_SetItemNameFontColor");
static_assert(offsetof(WB_CampItemList_C_SetItemNameFontColor, InUseItem) == 0x000000, "Member 'WB_CampItemList_C_SetItemNameFontColor::InUseItem' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemNameFontColor, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'WB_CampItemList_C_SetItemNameFontColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemNameFontColor, K2Node_SwitchInteger_CmpSuccess) == 0x000030, "Member 'WB_CampItemList_C_SetItemNameFontColor::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemNameFontColor, K2Node_MakeStruct_SlateColor_1) == 0x000038, "Member 'WB_CampItemList_C_SetItemNameFontColor::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemNameFontColor, K2Node_MakeStruct_SlateColor_2) == 0x000060, "Member 'WB_CampItemList_C_SetItemNameFontColor::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");

// Function WB_CampItemList.WB_CampItemList_C.SetNumberColor
// 0x0008 (0x0008 - 0x0000)
struct WB_CampItemList_C_SetNumberColor final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemList_C_SetNumberColor) == 0x000004, "Wrong alignment on WB_CampItemList_C_SetNumberColor");
static_assert(sizeof(WB_CampItemList_C_SetNumberColor) == 0x000008, "Wrong size on WB_CampItemList_C_SetNumberColor");
static_assert(offsetof(WB_CampItemList_C_SetNumberColor, InType) == 0x000000, "Member 'WB_CampItemList_C_SetNumberColor::InType' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetNumberColor, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_CampItemList_C_SetNumberColor::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_CampItemList.WB_CampItemList_C.SetItemPanel
// 0x0018 (0x0018 - 0x0000)
struct WB_CampItemList_C_SetItemPanel final
{
public:
	int32                                         InItemId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InNumerator;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InDenominator;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InUseItem;                                         // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InDispOnFlag;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A8E[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemIconIdByItemId_ReturnValue;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemList_C_SetItemPanel) == 0x000004, "Wrong alignment on WB_CampItemList_C_SetItemPanel");
static_assert(sizeof(WB_CampItemList_C_SetItemPanel) == 0x000018, "Wrong size on WB_CampItemList_C_SetItemPanel");
static_assert(offsetof(WB_CampItemList_C_SetItemPanel, InItemId) == 0x000000, "Member 'WB_CampItemList_C_SetItemPanel::InItemId' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemPanel, InNumerator) == 0x000004, "Member 'WB_CampItemList_C_SetItemPanel::InNumerator' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemPanel, InDenominator) == 0x000008, "Member 'WB_CampItemList_C_SetItemPanel::InDenominator' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemPanel, InUseItem) == 0x00000C, "Member 'WB_CampItemList_C_SetItemPanel::InUseItem' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemPanel, InDispOnFlag) == 0x000010, "Member 'WB_CampItemList_C_SetItemPanel::InDispOnFlag' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemPanel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000011, "Member 'WB_CampItemList_C_SetItemPanel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemPanel, CallFunc_GetItemIconIdByItemId_ReturnValue) == 0x000014, "Member 'WB_CampItemList_C_SetItemPanel::CallFunc_GetItemIconIdByItemId_ReturnValue' has a wrong offset!");

// Function WB_CampItemList.WB_CampItemList_C.SetItemCursorAnimation
// 0x00B0 (0x00B0 - 0x0000)
struct WB_CampItemList_C_SetItemCursorAnimation final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InAnimeType;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InCursorOn;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InCursorLoop;                                      // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A8F[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           AnimationNameArrayOut;                             // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           AnimationNameArrayIn;                              // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           AnimetionNameArrayLoop;                            // 0x0030(0x0010)(Edit, BlueprintVisible)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_3;                       // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A90[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName;  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName_1; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName_1; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x0078(0x0010)(ReferenceParm)
	TArray<class FName>                           K2Node_MakeArray_Array_2;                          // 0x0088(0x0010)(ReferenceParm)
	bool                                          CallFunc_Play_ReturnValue_4;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_5;                       // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A91[0x2];                                     // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName_2; // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName_2; // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_6;                       // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemList_C_SetItemCursorAnimation) == 0x000008, "Wrong alignment on WB_CampItemList_C_SetItemCursorAnimation");
static_assert(sizeof(WB_CampItemList_C_SetItemCursorAnimation) == 0x0000B0, "Wrong size on WB_CampItemList_C_SetItemCursorAnimation");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, InType) == 0x000000, "Member 'WB_CampItemList_C_SetItemCursorAnimation::InType' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, InAnimeType) == 0x000004, "Member 'WB_CampItemList_C_SetItemCursorAnimation::InAnimeType' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, InCursorOn) == 0x000008, "Member 'WB_CampItemList_C_SetItemCursorAnimation::InCursorOn' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, InCursorLoop) == 0x000009, "Member 'WB_CampItemList_C_SetItemCursorAnimation::InCursorLoop' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, AnimationNameArrayOut) == 0x000010, "Member 'WB_CampItemList_C_SetItemCursorAnimation::AnimationNameArrayOut' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, AnimationNameArrayIn) == 0x000020, "Member 'WB_CampItemList_C_SetItemCursorAnimation::AnimationNameArrayIn' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, AnimetionNameArrayLoop) == 0x000030, "Member 'WB_CampItemList_C_SetItemCursorAnimation::AnimetionNameArrayLoop' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, K2Node_SwitchInteger_CmpSuccess) == 0x000040, "Member 'WB_CampItemList_C_SetItemCursorAnimation::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, CallFunc_Play_ReturnValue) == 0x000041, "Member 'WB_CampItemList_C_SetItemCursorAnimation::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, CallFunc_Play_ReturnValue_1) == 0x000042, "Member 'WB_CampItemList_C_SetItemCursorAnimation::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, CallFunc_Play_ReturnValue_2) == 0x000043, "Member 'WB_CampItemList_C_SetItemCursorAnimation::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, CallFunc_Play_ReturnValue_3) == 0x000044, "Member 'WB_CampItemList_C_SetItemCursorAnimation::CallFunc_Play_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, CallFunc_GetPlayingAnimationName_OutAnimPackName) == 0x000048, "Member 'WB_CampItemList_C_SetItemCursorAnimation::CallFunc_GetPlayingAnimationName_OutAnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, CallFunc_GetPlayingAnimationName_OutAnimationName) == 0x000050, "Member 'WB_CampItemList_C_SetItemCursorAnimation::CallFunc_GetPlayingAnimationName_OutAnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, CallFunc_GetPlayingAnimationName_OutAnimPackName_1) == 0x000058, "Member 'WB_CampItemList_C_SetItemCursorAnimation::CallFunc_GetPlayingAnimationName_OutAnimPackName_1' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, CallFunc_GetPlayingAnimationName_OutAnimationName_1) == 0x000060, "Member 'WB_CampItemList_C_SetItemCursorAnimation::CallFunc_GetPlayingAnimationName_OutAnimationName_1' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, K2Node_MakeArray_Array) == 0x000068, "Member 'WB_CampItemList_C_SetItemCursorAnimation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, K2Node_MakeArray_Array_1) == 0x000078, "Member 'WB_CampItemList_C_SetItemCursorAnimation::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, K2Node_MakeArray_Array_2) == 0x000088, "Member 'WB_CampItemList_C_SetItemCursorAnimation::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, CallFunc_Play_ReturnValue_4) == 0x000098, "Member 'WB_CampItemList_C_SetItemCursorAnimation::CallFunc_Play_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, CallFunc_Play_ReturnValue_5) == 0x000099, "Member 'WB_CampItemList_C_SetItemCursorAnimation::CallFunc_Play_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, CallFunc_GetPlayingAnimationName_OutAnimPackName_2) == 0x00009C, "Member 'WB_CampItemList_C_SetItemCursorAnimation::CallFunc_GetPlayingAnimationName_OutAnimPackName_2' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, CallFunc_GetPlayingAnimationName_OutAnimationName_2) == 0x0000A4, "Member 'WB_CampItemList_C_SetItemCursorAnimation::CallFunc_GetPlayingAnimationName_OutAnimationName_2' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemCursorAnimation, CallFunc_Play_ReturnValue_6) == 0x0000AC, "Member 'WB_CampItemList_C_SetItemCursorAnimation::CallFunc_Play_ReturnValue_6' has a wrong offset!");

// Function WB_CampItemList.WB_CampItemList_C.SetItemDenomibator
// 0x0004 (0x0004 - 0x0000)
struct WB_CampItemList_C_SetItemDenomibator final
{
public:
	int32                                         InDenominator;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemList_C_SetItemDenomibator) == 0x000004, "Wrong alignment on WB_CampItemList_C_SetItemDenomibator");
static_assert(sizeof(WB_CampItemList_C_SetItemDenomibator) == 0x000004, "Wrong size on WB_CampItemList_C_SetItemDenomibator");
static_assert(offsetof(WB_CampItemList_C_SetItemDenomibator, InDenominator) == 0x000000, "Member 'WB_CampItemList_C_SetItemDenomibator::InDenominator' has a wrong offset!");

// Function WB_CampItemList.WB_CampItemList_C.SetItemNumerator
// 0x0004 (0x0004 - 0x0000)
struct WB_CampItemList_C_SetItemNumerator final
{
public:
	int32                                         InNumber;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemList_C_SetItemNumerator) == 0x000004, "Wrong alignment on WB_CampItemList_C_SetItemNumerator");
static_assert(sizeof(WB_CampItemList_C_SetItemNumerator) == 0x000004, "Wrong size on WB_CampItemList_C_SetItemNumerator");
static_assert(offsetof(WB_CampItemList_C_SetItemNumerator, InNumber) == 0x000000, "Member 'WB_CampItemList_C_SetItemNumerator::InNumber' has a wrong offset!");

// Function WB_CampItemList.WB_CampItemList_C.SetItemName
// 0x0038 (0x0038 - 0x0000)
struct WB_CampItemList_C_SetItemName final
{
public:
	int32                                         InItemId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A92[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetScriptMessageByLabel_self_CastInput;   // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetValueParam_self_CastInput;             // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IMessageTagInterface>  CallFunc_BuildText_self_CastInput;                 // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemList_C_SetItemName) == 0x000008, "Wrong alignment on WB_CampItemList_C_SetItemName");
static_assert(sizeof(WB_CampItemList_C_SetItemName) == 0x000038, "Wrong size on WB_CampItemList_C_SetItemName");
static_assert(offsetof(WB_CampItemList_C_SetItemName, InItemId) == 0x000000, "Member 'WB_CampItemList_C_SetItemName::InItemId' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemName, CallFunc_SetScriptMessageByLabel_self_CastInput) == 0x000008, "Member 'WB_CampItemList_C_SetItemName::CallFunc_SetScriptMessageByLabel_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemName, CallFunc_SetValueParam_self_CastInput) == 0x000018, "Member 'WB_CampItemList_C_SetItemName::CallFunc_SetValueParam_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_SetItemName, CallFunc_BuildText_self_CastInput) == 0x000028, "Member 'WB_CampItemList_C_SetItemName::CallFunc_BuildText_self_CastInput' has a wrong offset!");

// Function WB_CampItemList.WB_CampItemList_C.BndEvt__WB_CampItemList_ButtonS5Mouse_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_CampItemList_C_BndEvt__WB_CampItemList_ButtonS5Mouse_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              UV;                                                // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemList_C_BndEvt__WB_CampItemList_ButtonS5Mouse_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature) == 0x000004, "Wrong alignment on WB_CampItemList_C_BndEvt__WB_CampItemList_ButtonS5Mouse_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature");
static_assert(sizeof(WB_CampItemList_C_BndEvt__WB_CampItemList_ButtonS5Mouse_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature) == 0x000010, "Wrong size on WB_CampItemList_C_BndEvt__WB_CampItemList_ButtonS5Mouse_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature");
static_assert(offsetof(WB_CampItemList_C_BndEvt__WB_CampItemList_ButtonS5Mouse_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature, Pos) == 0x000000, "Member 'WB_CampItemList_C_BndEvt__WB_CampItemList_ButtonS5Mouse_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature::Pos' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_BndEvt__WB_CampItemList_ButtonS5Mouse_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature, UV) == 0x000008, "Member 'WB_CampItemList_C_BndEvt__WB_CampItemList_ButtonS5Mouse_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature::UV' has a wrong offset!");

// Function WB_CampItemList.WB_CampItemList_C.BndEvt__SsPlayerItemList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_CampItemList_C_BndEvt__SsPlayerItemList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemList_C_BndEvt__SsPlayerItemList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_CampItemList_C_BndEvt__SsPlayerItemList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_CampItemList_C_BndEvt__SsPlayerItemList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_CampItemList_C_BndEvt__SsPlayerItemList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_CampItemList_C_BndEvt__SsPlayerItemList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_CampItemList_C_BndEvt__SsPlayerItemList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_BndEvt__SsPlayerItemList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_CampItemList_C_BndEvt__SsPlayerItemList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_BndEvt__SsPlayerItemList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_CampItemList_C_BndEvt__SsPlayerItemList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_BndEvt__SsPlayerItemList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_CampItemList_C_BndEvt__SsPlayerItemList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_CampItemList.WB_CampItemList_C.BndEvt__SsPlayerDark_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_CampItemList_C_BndEvt__SsPlayerDark_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemList_C_BndEvt__SsPlayerDark_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_CampItemList_C_BndEvt__SsPlayerDark_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_CampItemList_C_BndEvt__SsPlayerDark_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_CampItemList_C_BndEvt__SsPlayerDark_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_CampItemList_C_BndEvt__SsPlayerDark_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_CampItemList_C_BndEvt__SsPlayerDark_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_BndEvt__SsPlayerDark_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_CampItemList_C_BndEvt__SsPlayerDark_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_BndEvt__SsPlayerDark_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_CampItemList_C_BndEvt__SsPlayerDark_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_BndEvt__SsPlayerDark_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_CampItemList_C_BndEvt__SsPlayerDark_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_CampItemList.WB_CampItemList_C.BndEvt__SsPlayerCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_CampItemList_C_BndEvt__SsPlayerCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemList_C_BndEvt__SsPlayerCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_CampItemList_C_BndEvt__SsPlayerCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_CampItemList_C_BndEvt__SsPlayerCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_CampItemList_C_BndEvt__SsPlayerCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_CampItemList_C_BndEvt__SsPlayerCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_CampItemList_C_BndEvt__SsPlayerCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_BndEvt__SsPlayerCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_CampItemList_C_BndEvt__SsPlayerCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_BndEvt__SsPlayerCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_CampItemList_C_BndEvt__SsPlayerCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_BndEvt__SsPlayerCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_CampItemList_C_BndEvt__SsPlayerCursor_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_CampItemList.WB_CampItemList_C.ExecuteUbergraph_WB_CampItemList
// 0x0068 (0x0068 - 0x0000)
struct WB_CampItemList_C_ExecuteUbergraph_WB_CampItemList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_Pos;                    // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_UV;                     // 0x000C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_2;         // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_2;        // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_2;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_2;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_1;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_1;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_1;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_1;       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_3;                       // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A93[0x2];                                     // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName;           // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName;          // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex;          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_2;                    // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_4;                       // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemList_C_ExecuteUbergraph_WB_CampItemList) == 0x000004, "Wrong alignment on WB_CampItemList_C_ExecuteUbergraph_WB_CampItemList");
static_assert(sizeof(WB_CampItemList_C_ExecuteUbergraph_WB_CampItemList) == 0x000068, "Wrong size on WB_CampItemList_C_ExecuteUbergraph_WB_CampItemList");
static_assert(offsetof(WB_CampItemList_C_ExecuteUbergraph_WB_CampItemList, EntryPoint) == 0x000000, "Member 'WB_CampItemList_C_ExecuteUbergraph_WB_CampItemList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_CampItemList_C_ExecuteUbergraph_WB_CampItemList, K2Node_ComponentBoundEvent_Pos) == 0x000004, "Member 'WB_CampItemList_C_ExecuteUbergraph_WB_CampItemList::K2Node_ComponentBoundEvent_Pos' has a wrong offset!");
