#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CampHelpList

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_CampHelpList.WB_CampHelpList_C.SynchronizedNewIcon
// 0x0004 (0x0004 - 0x0000)
struct WB_CampHelpList_C_SynchronizedNewIcon final
{
public:
	float                                         InFrame;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampHelpList_C_SynchronizedNewIcon) == 0x000004, "Wrong alignment on WB_CampHelpList_C_SynchronizedNewIcon");
static_assert(sizeof(WB_CampHelpList_C_SynchronizedNewIcon) == 0x000004, "Wrong size on WB_CampHelpList_C_SynchronizedNewIcon");
static_assert(offsetof(WB_CampHelpList_C_SynchronizedNewIcon, InFrame) == 0x000000, "Member 'WB_CampHelpList_C_SynchronizedNewIcon::InFrame' has a wrong offset!");

// Function WB_CampHelpList.WB_CampHelpList_C.NewIconOn
// 0x0001 (0x0001 - 0x0000)
struct WB_CampHelpList_C_NewIconOn final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpList_C_NewIconOn) == 0x000001, "Wrong alignment on WB_CampHelpList_C_NewIconOn");
static_assert(sizeof(WB_CampHelpList_C_NewIconOn) == 0x000001, "Wrong size on WB_CampHelpList_C_NewIconOn");
static_assert(offsetof(WB_CampHelpList_C_NewIconOn, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampHelpList_C_NewIconOn::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampHelpList.WB_CampHelpList_C.IsItHovered
// 0x0001 (0x0001 - 0x0000)
struct WB_CampHelpList_C_IsItHovered final
{
public:
	bool                                          OutHovered;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpList_C_IsItHovered) == 0x000001, "Wrong alignment on WB_CampHelpList_C_IsItHovered");
static_assert(sizeof(WB_CampHelpList_C_IsItHovered) == 0x000001, "Wrong size on WB_CampHelpList_C_IsItHovered");
static_assert(offsetof(WB_CampHelpList_C_IsItHovered, OutHovered) == 0x000000, "Member 'WB_CampHelpList_C_IsItHovered::OutHovered' has a wrong offset!");

// Function WB_CampHelpList.WB_CampHelpList_C.IsItClicked
// 0x0001 (0x0001 - 0x0000)
struct WB_CampHelpList_C_IsItClicked final
{
public:
	bool                                          OutClicked;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpList_C_IsItClicked) == 0x000001, "Wrong alignment on WB_CampHelpList_C_IsItClicked");
static_assert(sizeof(WB_CampHelpList_C_IsItClicked) == 0x000001, "Wrong size on WB_CampHelpList_C_IsItClicked");
static_assert(offsetof(WB_CampHelpList_C_IsItClicked, OutClicked) == 0x000000, "Member 'WB_CampHelpList_C_IsItClicked::OutClicked' has a wrong offset!");

// Function WB_CampHelpList.WB_CampHelpList_C.SetHelpPanel
// 0x0010 (0x0010 - 0x0000)
struct WB_CampHelpList_C_SetHelpPanel final
{
public:
	int32                                         InCategoryId;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InHelpId;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InUseHelpNo;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InDispOnFlag;                                      // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpList_C_SetHelpPanel) == 0x000004, "Wrong alignment on WB_CampHelpList_C_SetHelpPanel");
static_assert(sizeof(WB_CampHelpList_C_SetHelpPanel) == 0x000010, "Wrong size on WB_CampHelpList_C_SetHelpPanel");
static_assert(offsetof(WB_CampHelpList_C_SetHelpPanel, InCategoryId) == 0x000000, "Member 'WB_CampHelpList_C_SetHelpPanel::InCategoryId' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpPanel, InHelpId) == 0x000004, "Member 'WB_CampHelpList_C_SetHelpPanel::InHelpId' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpPanel, InUseHelpNo) == 0x000008, "Member 'WB_CampHelpList_C_SetHelpPanel::InUseHelpNo' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpPanel, InDispOnFlag) == 0x00000C, "Member 'WB_CampHelpList_C_SetHelpPanel::InDispOnFlag' has a wrong offset!");

// Function WB_CampHelpList.WB_CampHelpList_C.SetHelpName
// 0x0030 (0x0030 - 0x0000)
struct WB_CampHelpList_C_SetHelpName final
{
public:
	int32                                         InCategoryId;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InHelpTextId;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CD3[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMessageTagInterface>  CallFunc_BuildText_self_CastInput;                 // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetScriptMessageByID_self_CastInput;      // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpList_C_SetHelpName) == 0x000008, "Wrong alignment on WB_CampHelpList_C_SetHelpName");
static_assert(sizeof(WB_CampHelpList_C_SetHelpName) == 0x000030, "Wrong size on WB_CampHelpList_C_SetHelpName");
static_assert(offsetof(WB_CampHelpList_C_SetHelpName, InCategoryId) == 0x000000, "Member 'WB_CampHelpList_C_SetHelpName::InCategoryId' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpName, InHelpTextId) == 0x000004, "Member 'WB_CampHelpList_C_SetHelpName::InHelpTextId' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpName, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'WB_CampHelpList_C_SetHelpName::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpName, CallFunc_BuildText_self_CastInput) == 0x000010, "Member 'WB_CampHelpList_C_SetHelpName::CallFunc_BuildText_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpName, CallFunc_SetScriptMessageByID_self_CastInput) == 0x000020, "Member 'WB_CampHelpList_C_SetHelpName::CallFunc_SetScriptMessageByID_self_CastInput' has a wrong offset!");

// Function WB_CampHelpList.WB_CampHelpList_C.SetHelpNameFontColor
// 0x0080 (0x0080 - 0x0000)
struct WB_CampHelpList_C_SetHelpNameFontColor final
{
public:
	int32                                         InUseHelp;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CD4[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0058(0x0028)()
};
static_assert(alignof(WB_CampHelpList_C_SetHelpNameFontColor) == 0x000008, "Wrong alignment on WB_CampHelpList_C_SetHelpNameFontColor");
static_assert(sizeof(WB_CampHelpList_C_SetHelpNameFontColor) == 0x000080, "Wrong size on WB_CampHelpList_C_SetHelpNameFontColor");
static_assert(offsetof(WB_CampHelpList_C_SetHelpNameFontColor, InUseHelp) == 0x000000, "Member 'WB_CampHelpList_C_SetHelpNameFontColor::InUseHelp' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpNameFontColor, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_CampHelpList_C_SetHelpNameFontColor::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpNameFontColor, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'WB_CampHelpList_C_SetHelpNameFontColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpNameFontColor, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'WB_CampHelpList_C_SetHelpNameFontColor::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpNameFontColor, K2Node_MakeStruct_SlateColor_2) == 0x000058, "Member 'WB_CampHelpList_C_SetHelpNameFontColor::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");

// Function WB_CampHelpList.WB_CampHelpList_C.SetIcon
// 0x0018 (0x0018 - 0x0000)
struct WB_CampHelpList_C_SetIcon final
{
public:
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampHelpList_C_SetIcon) == 0x000008, "Wrong alignment on WB_CampHelpList_C_SetIcon");
static_assert(sizeof(WB_CampHelpList_C_SetIcon) == 0x000018, "Wrong size on WB_CampHelpList_C_SetIcon");
static_assert(offsetof(WB_CampHelpList_C_SetIcon, K2Node_MakeStruct_LinearColor) == 0x000000, "Member 'WB_CampHelpList_C_SetIcon::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WB_CampHelpList_C_SetIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WB_CampHelpList.WB_CampHelpList_C.SetHelpSelectCursorAnimation
// 0x0001 (0x0001 - 0x0000)
struct WB_CampHelpList_C_SetHelpSelectCursorAnimation final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpList_C_SetHelpSelectCursorAnimation) == 0x000001, "Wrong alignment on WB_CampHelpList_C_SetHelpSelectCursorAnimation");
static_assert(sizeof(WB_CampHelpList_C_SetHelpSelectCursorAnimation) == 0x000001, "Wrong size on WB_CampHelpList_C_SetHelpSelectCursorAnimation");
static_assert(offsetof(WB_CampHelpList_C_SetHelpSelectCursorAnimation, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampHelpList_C_SetHelpSelectCursorAnimation::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampHelpList.WB_CampHelpList_C.SetHelpCursorAnimationUseAnimeType
// 0x0004 (0x0004 - 0x0000)
struct WB_CampHelpList_C_SetHelpCursorAnimationUseAnimeType final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampHelpList_C_SetHelpCursorAnimationUseAnimeType) == 0x000004, "Wrong alignment on WB_CampHelpList_C_SetHelpCursorAnimationUseAnimeType");
static_assert(sizeof(WB_CampHelpList_C_SetHelpCursorAnimationUseAnimeType) == 0x000004, "Wrong size on WB_CampHelpList_C_SetHelpCursorAnimationUseAnimeType");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimationUseAnimeType, InType) == 0x000000, "Member 'WB_CampHelpList_C_SetHelpCursorAnimationUseAnimeType::InType' has a wrong offset!");

// Function WB_CampHelpList.WB_CampHelpList_C.SetHelpCursorAnimation
// 0x00B0 (0x00B0 - 0x0000)
struct WB_CampHelpList_C_SetHelpCursorAnimation final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InAnimeType;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InCursorOn;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InCursorLoop;                                      // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InNewIcon;                                         // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CD5[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           AnimationNameArrayOut;                             // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           AnimationNameArrayIn;                              // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           AnimationNameArrayLoop;                            // 0x0030(0x0010)(Edit, BlueprintVisible)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CD6[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName;  // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName; // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CD7[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName_1; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName_1; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_3;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_4;                       // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_5;                       // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CD8[0x1];                                     // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName_2; // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName_2; // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_6;                       // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CD9[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x0090(0x0010)(ReferenceParm)
	TArray<class FName>                           K2Node_MakeArray_Array_2;                          // 0x00A0(0x0010)(ReferenceParm)
};
static_assert(alignof(WB_CampHelpList_C_SetHelpCursorAnimation) == 0x000008, "Wrong alignment on WB_CampHelpList_C_SetHelpCursorAnimation");
static_assert(sizeof(WB_CampHelpList_C_SetHelpCursorAnimation) == 0x0000B0, "Wrong size on WB_CampHelpList_C_SetHelpCursorAnimation");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, InType) == 0x000000, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::InType' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, InAnimeType) == 0x000004, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::InAnimeType' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, InCursorOn) == 0x000008, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::InCursorOn' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, InCursorLoop) == 0x000009, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::InCursorLoop' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, InNewIcon) == 0x00000A, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::InNewIcon' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, AnimationNameArrayOut) == 0x000010, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::AnimationNameArrayOut' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, AnimationNameArrayIn) == 0x000020, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::AnimationNameArrayIn' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, AnimationNameArrayLoop) == 0x000030, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::AnimationNameArrayLoop' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, K2Node_SwitchInteger_CmpSuccess) == 0x000040, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, CallFunc_Play_ReturnValue) == 0x000041, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, CallFunc_GetPlayingAnimationName_OutAnimPackName) == 0x000044, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::CallFunc_GetPlayingAnimationName_OutAnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, CallFunc_GetPlayingAnimationName_OutAnimationName) == 0x00004C, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::CallFunc_GetPlayingAnimationName_OutAnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, CallFunc_Play_ReturnValue_1) == 0x000054, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, CallFunc_Play_ReturnValue_2) == 0x000055, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, CallFunc_GetPlayingAnimationName_OutAnimPackName_1) == 0x000058, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::CallFunc_GetPlayingAnimationName_OutAnimPackName_1' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, CallFunc_GetPlayingAnimationName_OutAnimationName_1) == 0x000060, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::CallFunc_GetPlayingAnimationName_OutAnimationName_1' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, CallFunc_Play_ReturnValue_3) == 0x000068, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::CallFunc_Play_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, CallFunc_Play_ReturnValue_4) == 0x000069, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::CallFunc_Play_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, CallFunc_Play_ReturnValue_5) == 0x00006A, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::CallFunc_Play_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, CallFunc_GetPlayingAnimationName_OutAnimPackName_2) == 0x00006C, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::CallFunc_GetPlayingAnimationName_OutAnimPackName_2' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, CallFunc_GetPlayingAnimationName_OutAnimationName_2) == 0x000074, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::CallFunc_GetPlayingAnimationName_OutAnimationName_2' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, CallFunc_Play_ReturnValue_6) == 0x00007C, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::CallFunc_Play_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, K2Node_MakeArray_Array) == 0x000080, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, K2Node_MakeArray_Array_1) == 0x000090, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_SetHelpCursorAnimation, K2Node_MakeArray_Array_2) == 0x0000A0, "Member 'WB_CampHelpList_C_SetHelpCursorAnimation::K2Node_MakeArray_Array_2' has a wrong offset!");

// Function WB_CampHelpList.WB_CampHelpList_C.IsAnimationEnd
// 0x0003 (0x0003 - 0x0000)
struct WB_CampHelpList_C_IsAnimationEnd final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpList_C_IsAnimationEnd) == 0x000001, "Wrong alignment on WB_CampHelpList_C_IsAnimationEnd");
static_assert(sizeof(WB_CampHelpList_C_IsAnimationEnd) == 0x000003, "Wrong size on WB_CampHelpList_C_IsAnimationEnd");
static_assert(offsetof(WB_CampHelpList_C_IsAnimationEnd, OutParam) == 0x000000, "Member 'WB_CampHelpList_C_IsAnimationEnd::OutParam' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_IsAnimationEnd, CallFunc_IsVisible_ReturnValue) == 0x000001, "Member 'WB_CampHelpList_C_IsAnimationEnd::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_IsAnimationEnd, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WB_CampHelpList_C_IsAnimationEnd::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WB_CampHelpList.WB_CampHelpList_C.BndEvt__WB_CampHelpList_ButtonS5Mouse_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_CampHelpList_C_BndEvt__WB_CampHelpList_ButtonS5Mouse_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              UV;                                                // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampHelpList_C_BndEvt__WB_CampHelpList_ButtonS5Mouse_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature) == 0x000004, "Wrong alignment on WB_CampHelpList_C_BndEvt__WB_CampHelpList_ButtonS5Mouse_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature");
static_assert(sizeof(WB_CampHelpList_C_BndEvt__WB_CampHelpList_ButtonS5Mouse_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature) == 0x000010, "Wrong size on WB_CampHelpList_C_BndEvt__WB_CampHelpList_ButtonS5Mouse_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature");
static_assert(offsetof(WB_CampHelpList_C_BndEvt__WB_CampHelpList_ButtonS5Mouse_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature, Pos) == 0x000000, "Member 'WB_CampHelpList_C_BndEvt__WB_CampHelpList_ButtonS5Mouse_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature::Pos' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_BndEvt__WB_CampHelpList_ButtonS5Mouse_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature, UV) == 0x000008, "Member 'WB_CampHelpList_C_BndEvt__WB_CampHelpList_ButtonS5Mouse_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature::UV' has a wrong offset!");

// Function WB_CampHelpList.WB_CampHelpList_C.BndEvt__WB_CampHelpList_SsPlayerHelpList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerHelpList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerHelpList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerHelpList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerHelpList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerHelpList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerHelpList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerHelpList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerHelpList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerHelpList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerHelpList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerHelpList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerHelpList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerHelpList_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_CampHelpList.WB_CampHelpList_C.BndEvt__WB_CampHelpList_SsPlayerCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_CampHelpList_C_BndEvt__WB_CampHelpList_SsPlayerCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_CampHelpList.WB_CampHelpList_C.ExecuteUbergraph_WB_CampHelpList
// 0x004C (0x004C - 0x0000)
struct WB_CampHelpList_C_ExecuteUbergraph_WB_CampHelpList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_Pos;                    // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_UV;                     // 0x000C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_1;         // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_1;        // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_1;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_1;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CDA[0x1];                                     // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpList_C_ExecuteUbergraph_WB_CampHelpList) == 0x000004, "Wrong alignment on WB_CampHelpList_C_ExecuteUbergraph_WB_CampHelpList");
static_assert(sizeof(WB_CampHelpList_C_ExecuteUbergraph_WB_CampHelpList) == 0x00004C, "Wrong size on WB_CampHelpList_C_ExecuteUbergraph_WB_CampHelpList");
static_assert(offsetof(WB_CampHelpList_C_ExecuteUbergraph_WB_CampHelpList, EntryPoint) == 0x000000, "Member 'WB_CampHelpList_C_ExecuteUbergraph_WB_CampHelpList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_CampHelpList_C_ExecuteUbergraph_WB_CampHelpList, K2Node_ComponentBoundEvent_Pos) == 0x000004, "Member 'WB_CampHelpList_C_ExecuteUbergraph_WB_CampHelpList::K2Node_ComponentBoundEvent_Pos' has a wrong offset!");
