#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CampTopWindow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_CampTopWindow.WB_CampTopWindow_C.TopMenuPanelOff
// 0x0014 (0x0014 - 0x0000)
struct WB_CampTopWindow_C_TopMenuPanelOff final
{
public:
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampTopWindow_C_TopMenuPanelOff) == 0x000004, "Wrong alignment on WB_CampTopWindow_C_TopMenuPanelOff");
static_assert(sizeof(WB_CampTopWindow_C_TopMenuPanelOff) == 0x000014, "Wrong size on WB_CampTopWindow_C_TopMenuPanelOff");
static_assert(offsetof(WB_CampTopWindow_C_TopMenuPanelOff, CallFunc_GetPlayingAnimationName_OutAnimPackName) == 0x000000, "Member 'WB_CampTopWindow_C_TopMenuPanelOff::CallFunc_GetPlayingAnimationName_OutAnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_TopMenuPanelOff, CallFunc_GetPlayingAnimationName_OutAnimationName) == 0x000008, "Member 'WB_CampTopWindow_C_TopMenuPanelOff::CallFunc_GetPlayingAnimationName_OutAnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_TopMenuPanelOff, CallFunc_Play_ReturnValue) == 0x000010, "Member 'WB_CampTopWindow_C_TopMenuPanelOff::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampTopWindow.WB_CampTopWindow_C.TopMenuNewIconOff
// 0x0008 (0x0008 - 0x0000)
struct WB_CampTopWindow_C_TopMenuNewIconOff final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampTopWindow_C_TopMenuNewIconOff) == 0x000004, "Wrong alignment on WB_CampTopWindow_C_TopMenuNewIconOff");
static_assert(sizeof(WB_CampTopWindow_C_TopMenuNewIconOff) == 0x000008, "Wrong size on WB_CampTopWindow_C_TopMenuNewIconOff");
static_assert(offsetof(WB_CampTopWindow_C_TopMenuNewIconOff, InIndex) == 0x000000, "Member 'WB_CampTopWindow_C_TopMenuNewIconOff::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_TopMenuNewIconOff, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_CampTopWindow_C_TopMenuNewIconOff::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_CampTopWindow.WB_CampTopWindow_C.TopMenuNewIconOn
// 0x0010 (0x0010 - 0x0000)
struct WB_CampTopWindow_C_TopMenuNewIconOn final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InRate;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_3;                       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_4;                       // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_5;                       // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampTopWindow_C_TopMenuNewIconOn) == 0x000004, "Wrong alignment on WB_CampTopWindow_C_TopMenuNewIconOn");
static_assert(sizeof(WB_CampTopWindow_C_TopMenuNewIconOn) == 0x000010, "Wrong size on WB_CampTopWindow_C_TopMenuNewIconOn");
static_assert(offsetof(WB_CampTopWindow_C_TopMenuNewIconOn, InIndex) == 0x000000, "Member 'WB_CampTopWindow_C_TopMenuNewIconOn::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_TopMenuNewIconOn, InRate) == 0x000004, "Member 'WB_CampTopWindow_C_TopMenuNewIconOn::InRate' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_TopMenuNewIconOn, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'WB_CampTopWindow_C_TopMenuNewIconOn::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_TopMenuNewIconOn, CallFunc_Play_ReturnValue) == 0x000009, "Member 'WB_CampTopWindow_C_TopMenuNewIconOn::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_TopMenuNewIconOn, CallFunc_Play_ReturnValue_1) == 0x00000A, "Member 'WB_CampTopWindow_C_TopMenuNewIconOn::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_TopMenuNewIconOn, CallFunc_Play_ReturnValue_2) == 0x00000B, "Member 'WB_CampTopWindow_C_TopMenuNewIconOn::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_TopMenuNewIconOn, CallFunc_Play_ReturnValue_3) == 0x00000C, "Member 'WB_CampTopWindow_C_TopMenuNewIconOn::CallFunc_Play_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_TopMenuNewIconOn, CallFunc_Play_ReturnValue_4) == 0x00000D, "Member 'WB_CampTopWindow_C_TopMenuNewIconOn::CallFunc_Play_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_TopMenuNewIconOn, CallFunc_Play_ReturnValue_5) == 0x00000E, "Member 'WB_CampTopWindow_C_TopMenuNewIconOn::CallFunc_Play_ReturnValue_5' has a wrong offset!");

// Function WB_CampTopWindow.WB_CampTopWindow_C.ChangeSubMenuColor
// 0x0030 (0x0030 - 0x0000)
struct WB_CampTopWindow_C_ChangeSubMenuColor final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InColorType;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USsPlayerWidget*                        CallFunc_GetSystemMenuListSSPlayer_OutWidget;      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BC4[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BC5[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampTopWindow_C_ChangeSubMenuColor) == 0x000008, "Wrong alignment on WB_CampTopWindow_C_ChangeSubMenuColor");
static_assert(sizeof(WB_CampTopWindow_C_ChangeSubMenuColor) == 0x000030, "Wrong size on WB_CampTopWindow_C_ChangeSubMenuColor");
static_assert(offsetof(WB_CampTopWindow_C_ChangeSubMenuColor, InIndex) == 0x000000, "Member 'WB_CampTopWindow_C_ChangeSubMenuColor::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_ChangeSubMenuColor, InColorType) == 0x000004, "Member 'WB_CampTopWindow_C_ChangeSubMenuColor::InColorType' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_ChangeSubMenuColor, CallFunc_GetSystemMenuListSSPlayer_OutWidget) == 0x000008, "Member 'WB_CampTopWindow_C_ChangeSubMenuColor::CallFunc_GetSystemMenuListSSPlayer_OutWidget' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_ChangeSubMenuColor, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WB_CampTopWindow_C_ChangeSubMenuColor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_ChangeSubMenuColor, CallFunc_Array_Get_Item) == 0x000018, "Member 'WB_CampTopWindow_C_ChangeSubMenuColor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_ChangeSubMenuColor, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WB_CampTopWindow_C_ChangeSubMenuColor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_ChangeSubMenuColor, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WB_CampTopWindow_C_ChangeSubMenuColor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_ChangeSubMenuColor, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WB_CampTopWindow_C_ChangeSubMenuColor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_ChangeSubMenuColor, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WB_CampTopWindow_C_ChangeSubMenuColor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampTopWindow.WB_CampTopWindow_C.ChangeTopMenuColor
// 0x0030 (0x0030 - 0x0000)
struct WB_CampTopWindow_C_ChangeTopMenuColor final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InColorType;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USsPlayerWidget*                        CallFunc_GetTopMenuListSSPlayer_OutSSPlayer;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BC6[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BC7[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampTopWindow_C_ChangeTopMenuColor) == 0x000008, "Wrong alignment on WB_CampTopWindow_C_ChangeTopMenuColor");
static_assert(sizeof(WB_CampTopWindow_C_ChangeTopMenuColor) == 0x000030, "Wrong size on WB_CampTopWindow_C_ChangeTopMenuColor");
static_assert(offsetof(WB_CampTopWindow_C_ChangeTopMenuColor, InIndex) == 0x000000, "Member 'WB_CampTopWindow_C_ChangeTopMenuColor::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_ChangeTopMenuColor, InColorType) == 0x000004, "Member 'WB_CampTopWindow_C_ChangeTopMenuColor::InColorType' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_ChangeTopMenuColor, CallFunc_GetTopMenuListSSPlayer_OutSSPlayer) == 0x000008, "Member 'WB_CampTopWindow_C_ChangeTopMenuColor::CallFunc_GetTopMenuListSSPlayer_OutSSPlayer' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_ChangeTopMenuColor, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WB_CampTopWindow_C_ChangeTopMenuColor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_ChangeTopMenuColor, CallFunc_Array_Get_Item) == 0x000018, "Member 'WB_CampTopWindow_C_ChangeTopMenuColor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_ChangeTopMenuColor, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WB_CampTopWindow_C_ChangeTopMenuColor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_ChangeTopMenuColor, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WB_CampTopWindow_C_ChangeTopMenuColor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_ChangeTopMenuColor, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WB_CampTopWindow_C_ChangeTopMenuColor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_ChangeTopMenuColor, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WB_CampTopWindow_C_ChangeTopMenuColor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampTopWindow.WB_CampTopWindow_C.SetSubMenuCursorPlayAnimation
// 0x0014 (0x0014 - 0x0000)
struct WB_CampTopWindow_C_SetSubMenuCursorPlayAnimation final
{
public:
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampTopWindow_C_SetSubMenuCursorPlayAnimation) == 0x000004, "Wrong alignment on WB_CampTopWindow_C_SetSubMenuCursorPlayAnimation");
static_assert(sizeof(WB_CampTopWindow_C_SetSubMenuCursorPlayAnimation) == 0x000014, "Wrong size on WB_CampTopWindow_C_SetSubMenuCursorPlayAnimation");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuCursorPlayAnimation, CallFunc_GetPlayingAnimationName_OutAnimPackName) == 0x000000, "Member 'WB_CampTopWindow_C_SetSubMenuCursorPlayAnimation::CallFunc_GetPlayingAnimationName_OutAnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuCursorPlayAnimation, CallFunc_GetPlayingAnimationName_OutAnimationName) == 0x000008, "Member 'WB_CampTopWindow_C_SetSubMenuCursorPlayAnimation::CallFunc_GetPlayingAnimationName_OutAnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuCursorPlayAnimation, CallFunc_Play_ReturnValue) == 0x000010, "Member 'WB_CampTopWindow_C_SetSubMenuCursorPlayAnimation::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampTopWindow.WB_CampTopWindow_C.SetTopMenuCursorPlayAnimation
// 0x0014 (0x0014 - 0x0000)
struct WB_CampTopWindow_C_SetTopMenuCursorPlayAnimation final
{
public:
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampTopWindow_C_SetTopMenuCursorPlayAnimation) == 0x000004, "Wrong alignment on WB_CampTopWindow_C_SetTopMenuCursorPlayAnimation");
static_assert(sizeof(WB_CampTopWindow_C_SetTopMenuCursorPlayAnimation) == 0x000014, "Wrong size on WB_CampTopWindow_C_SetTopMenuCursorPlayAnimation");
static_assert(offsetof(WB_CampTopWindow_C_SetTopMenuCursorPlayAnimation, CallFunc_GetPlayingAnimationName_OutAnimPackName) == 0x000000, "Member 'WB_CampTopWindow_C_SetTopMenuCursorPlayAnimation::CallFunc_GetPlayingAnimationName_OutAnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetTopMenuCursorPlayAnimation, CallFunc_GetPlayingAnimationName_OutAnimationName) == 0x000008, "Member 'WB_CampTopWindow_C_SetTopMenuCursorPlayAnimation::CallFunc_GetPlayingAnimationName_OutAnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetTopMenuCursorPlayAnimation, CallFunc_Play_ReturnValue) == 0x000010, "Member 'WB_CampTopWindow_C_SetTopMenuCursorPlayAnimation::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampTopWindow.WB_CampTopWindow_C.Set Sub Menu Play Animation
// 0x0030 (0x0030 - 0x0000)
struct WB_CampTopWindow_C_Set_Sub_Menu_Play_Animation final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BC8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UButtonS5*                              CallFunc_Get_System_Menu_List_Button_Mouse_OutButton; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USsPlayerWidget*                        CallFunc_GetSystemMenuListSSPlayer_OutWidget;      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampTopWindow_C_Set_Sub_Menu_Play_Animation) == 0x000008, "Wrong alignment on WB_CampTopWindow_C_Set_Sub_Menu_Play_Animation");
static_assert(sizeof(WB_CampTopWindow_C_Set_Sub_Menu_Play_Animation) == 0x000030, "Wrong size on WB_CampTopWindow_C_Set_Sub_Menu_Play_Animation");
static_assert(offsetof(WB_CampTopWindow_C_Set_Sub_Menu_Play_Animation, InIndex) == 0x000000, "Member 'WB_CampTopWindow_C_Set_Sub_Menu_Play_Animation::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_Set_Sub_Menu_Play_Animation, CallFunc_Get_System_Menu_List_Button_Mouse_OutButton) == 0x000008, "Member 'WB_CampTopWindow_C_Set_Sub_Menu_Play_Animation::CallFunc_Get_System_Menu_List_Button_Mouse_OutButton' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_Set_Sub_Menu_Play_Animation, CallFunc_GetSystemMenuListSSPlayer_OutWidget) == 0x000010, "Member 'WB_CampTopWindow_C_Set_Sub_Menu_Play_Animation::CallFunc_GetSystemMenuListSSPlayer_OutWidget' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_Set_Sub_Menu_Play_Animation, CallFunc_GetPlayingAnimationName_OutAnimPackName) == 0x000018, "Member 'WB_CampTopWindow_C_Set_Sub_Menu_Play_Animation::CallFunc_GetPlayingAnimationName_OutAnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_Set_Sub_Menu_Play_Animation, CallFunc_GetPlayingAnimationName_OutAnimationName) == 0x000020, "Member 'WB_CampTopWindow_C_Set_Sub_Menu_Play_Animation::CallFunc_GetPlayingAnimationName_OutAnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_Set_Sub_Menu_Play_Animation, CallFunc_Play_ReturnValue) == 0x000028, "Member 'WB_CampTopWindow_C_Set_Sub_Menu_Play_Animation::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampTopWindow.WB_CampTopWindow_C.SetTopMenuPlayAnimation
// 0x0030 (0x0030 - 0x0000)
struct WB_CampTopWindow_C_SetTopMenuPlayAnimation final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InType;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BC9[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USsPlayerWidget*                        CallFunc_GetTopMenuListSSPlayer_OutSSPlayer;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UButtonS5*                              CallFunc_GetTopMenuListButtonMouse_OutButtonMouse; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BCA[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UButtonS5*                              CallFunc_GetTopMenuQuestionButtonMouse_OutParam;   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampTopWindow_C_SetTopMenuPlayAnimation) == 0x000008, "Wrong alignment on WB_CampTopWindow_C_SetTopMenuPlayAnimation");
static_assert(sizeof(WB_CampTopWindow_C_SetTopMenuPlayAnimation) == 0x000030, "Wrong size on WB_CampTopWindow_C_SetTopMenuPlayAnimation");
static_assert(offsetof(WB_CampTopWindow_C_SetTopMenuPlayAnimation, InIndex) == 0x000000, "Member 'WB_CampTopWindow_C_SetTopMenuPlayAnimation::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetTopMenuPlayAnimation, InType) == 0x000004, "Member 'WB_CampTopWindow_C_SetTopMenuPlayAnimation::InType' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetTopMenuPlayAnimation, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'WB_CampTopWindow_C_SetTopMenuPlayAnimation::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetTopMenuPlayAnimation, CallFunc_GetTopMenuListSSPlayer_OutSSPlayer) == 0x000010, "Member 'WB_CampTopWindow_C_SetTopMenuPlayAnimation::CallFunc_GetTopMenuListSSPlayer_OutSSPlayer' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetTopMenuPlayAnimation, CallFunc_GetTopMenuListButtonMouse_OutButtonMouse) == 0x000018, "Member 'WB_CampTopWindow_C_SetTopMenuPlayAnimation::CallFunc_GetTopMenuListButtonMouse_OutButtonMouse' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetTopMenuPlayAnimation, CallFunc_Play_ReturnValue) == 0x000020, "Member 'WB_CampTopWindow_C_SetTopMenuPlayAnimation::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetTopMenuPlayAnimation, CallFunc_Play_ReturnValue_1) == 0x000021, "Member 'WB_CampTopWindow_C_SetTopMenuPlayAnimation::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetTopMenuPlayAnimation, CallFunc_GetTopMenuQuestionButtonMouse_OutParam) == 0x000028, "Member 'WB_CampTopWindow_C_SetTopMenuPlayAnimation::CallFunc_GetTopMenuQuestionButtonMouse_OutParam' has a wrong offset!");

// Function WB_CampTopWindow.WB_CampTopWindow_C.SetSubMenuCursorOffset
// 0x0014 (0x0014 - 0x0000)
struct WB_CampTopWindow_C_SetSubMenuCursorOffset final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampTopWindow_C_SetSubMenuCursorOffset) == 0x000004, "Wrong alignment on WB_CampTopWindow_C_SetSubMenuCursorOffset");
static_assert(sizeof(WB_CampTopWindow_C_SetSubMenuCursorOffset) == 0x000014, "Wrong size on WB_CampTopWindow_C_SetSubMenuCursorOffset");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuCursorOffset, InIndex) == 0x000000, "Member 'WB_CampTopWindow_C_SetSubMenuCursorOffset::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuCursorOffset, CallFunc_Multiply_IntInt_ReturnValue) == 0x000004, "Member 'WB_CampTopWindow_C_SetSubMenuCursorOffset::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuCursorOffset, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'WB_CampTopWindow_C_SetSubMenuCursorOffset::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuCursorOffset, CallFunc_MakeVector2D_ReturnValue) == 0x00000C, "Member 'WB_CampTopWindow_C_SetSubMenuCursorOffset::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WB_CampTopWindow.WB_CampTopWindow_C.SetSubMenuPosition
// 0x00A0 (0x00A0 - 0x0000)
struct WB_CampTopWindow_C_SetSubMenuPosition final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Positionbuf;                                       // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_2;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_3;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_4;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_4;           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_5;           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec_1;   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampTopWindow_C_SetSubMenuPosition) == 0x000008, "Wrong alignment on WB_CampTopWindow_C_SetSubMenuPosition");
static_assert(sizeof(WB_CampTopWindow_C_SetSubMenuPosition) == 0x0000A0, "Wrong size on WB_CampTopWindow_C_SetSubMenuPosition");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, InIndex) == 0x000000, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, Positionbuf) == 0x000004, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::Positionbuf' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, CallFunc_Multiply_IntInt_ReturnValue) == 0x000010, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000014, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, CallFunc_MakeVector2D_ReturnValue) == 0x000018, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000020, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, CallFunc_Add_Vector2DVector2D_ReturnValue_1) == 0x000028, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::CallFunc_Add_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000030, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000038, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, CallFunc_BreakVector2D_X) == 0x000040, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, CallFunc_BreakVector2D_Y) == 0x000044, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, CallFunc_BreakVector2D_X_1) == 0x000048, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, CallFunc_BreakVector2D_Y_1) == 0x00004C, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec) == 0x000050, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, CallFunc_MakeVector2D_ReturnValue_1) == 0x000058, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000060, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, CallFunc_Add_Vector2DVector2D_ReturnValue_2) == 0x000068, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::CallFunc_Add_Vector2DVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, CallFunc_Add_Vector2DVector2D_ReturnValue_3) == 0x000070, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::CallFunc_Add_Vector2DVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x000078, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, CallFunc_Add_Vector2DVector2D_ReturnValue_4) == 0x000080, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::CallFunc_Add_Vector2DVector2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, CallFunc_SlotAsCanvasSlot_ReturnValue_4) == 0x000088, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::CallFunc_SlotAsCanvasSlot_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, CallFunc_SlotAsCanvasSlot_ReturnValue_5) == 0x000090, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::CallFunc_SlotAsCanvasSlot_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetSubMenuPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec_1) == 0x000098, "Member 'WB_CampTopWindow_C_SetSubMenuPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec_1' has a wrong offset!");

// Function WB_CampTopWindow.WB_CampTopWindow_C.SubMenuListOut
// 0x0050 (0x0050 - 0x0000)
struct WB_CampTopWindow_C_SubMenuListOut final
{
public:
	int32                                         StartFrame;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstancePartPlayFrame_ReturnValue;     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BCB[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UButtonS5*                              CallFunc_Get_System_Menu_List_Button_Mouse_OutButton; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USsPlayerWidget*                        CallFunc_GetSystemMenuListSSPlayer_OutWidget;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName_1; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName_1; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampTopWindow_C_SubMenuListOut) == 0x000008, "Wrong alignment on WB_CampTopWindow_C_SubMenuListOut");
static_assert(sizeof(WB_CampTopWindow_C_SubMenuListOut) == 0x000050, "Wrong size on WB_CampTopWindow_C_SubMenuListOut");
static_assert(offsetof(WB_CampTopWindow_C_SubMenuListOut, StartFrame) == 0x000000, "Member 'WB_CampTopWindow_C_SubMenuListOut::StartFrame' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SubMenuListOut, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WB_CampTopWindow_C_SubMenuListOut::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SubMenuListOut, CallFunc_GetPlayingAnimationName_OutAnimPackName) == 0x000008, "Member 'WB_CampTopWindow_C_SubMenuListOut::CallFunc_GetPlayingAnimationName_OutAnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SubMenuListOut, CallFunc_GetPlayingAnimationName_OutAnimationName) == 0x000010, "Member 'WB_CampTopWindow_C_SubMenuListOut::CallFunc_GetPlayingAnimationName_OutAnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SubMenuListOut, CallFunc_GetInstancePartPlayFrame_ReturnValue) == 0x000018, "Member 'WB_CampTopWindow_C_SubMenuListOut::CallFunc_GetInstancePartPlayFrame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SubMenuListOut, CallFunc_Play_ReturnValue) == 0x00001C, "Member 'WB_CampTopWindow_C_SubMenuListOut::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SubMenuListOut, Temp_int_Variable) == 0x000020, "Member 'WB_CampTopWindow_C_SubMenuListOut::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SubMenuListOut, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'WB_CampTopWindow_C_SubMenuListOut::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SubMenuListOut, CallFunc_Get_System_Menu_List_Button_Mouse_OutButton) == 0x000028, "Member 'WB_CampTopWindow_C_SubMenuListOut::CallFunc_Get_System_Menu_List_Button_Mouse_OutButton' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SubMenuListOut, CallFunc_GetSystemMenuListSSPlayer_OutWidget) == 0x000030, "Member 'WB_CampTopWindow_C_SubMenuListOut::CallFunc_GetSystemMenuListSSPlayer_OutWidget' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SubMenuListOut, CallFunc_GetPlayingAnimationName_OutAnimPackName_1) == 0x000038, "Member 'WB_CampTopWindow_C_SubMenuListOut::CallFunc_GetPlayingAnimationName_OutAnimPackName_1' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SubMenuListOut, CallFunc_GetPlayingAnimationName_OutAnimationName_1) == 0x000040, "Member 'WB_CampTopWindow_C_SubMenuListOut::CallFunc_GetPlayingAnimationName_OutAnimationName_1' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SubMenuListOut, CallFunc_Play_ReturnValue_1) == 0x000048, "Member 'WB_CampTopWindow_C_SubMenuListOut::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SubMenuListOut, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000049, "Member 'WB_CampTopWindow_C_SubMenuListOut::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampTopWindow.WB_CampTopWindow_C.GetSystemMenuListSSPlayer
// 0x0020 (0x0020 - 0x0000)
struct WB_CampTopWindow_C_GetSystemMenuListSSPlayer final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BCC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USsPlayerWidget*                        OutWidget;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USsPlayerWidget*                        Ssplayerwidet;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampTopWindow_C_GetSystemMenuListSSPlayer) == 0x000008, "Wrong alignment on WB_CampTopWindow_C_GetSystemMenuListSSPlayer");
static_assert(sizeof(WB_CampTopWindow_C_GetSystemMenuListSSPlayer) == 0x000020, "Wrong size on WB_CampTopWindow_C_GetSystemMenuListSSPlayer");
static_assert(offsetof(WB_CampTopWindow_C_GetSystemMenuListSSPlayer, InIndex) == 0x000000, "Member 'WB_CampTopWindow_C_GetSystemMenuListSSPlayer::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_GetSystemMenuListSSPlayer, OutWidget) == 0x000008, "Member 'WB_CampTopWindow_C_GetSystemMenuListSSPlayer::OutWidget' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_GetSystemMenuListSSPlayer, Ssplayerwidet) == 0x000010, "Member 'WB_CampTopWindow_C_GetSystemMenuListSSPlayer::Ssplayerwidet' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_GetSystemMenuListSSPlayer, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'WB_CampTopWindow_C_GetSystemMenuListSSPlayer::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_CampTopWindow.WB_CampTopWindow_C.TopMenuCursorSelectedOff
// 0x0001 (0x0001 - 0x0000)
struct WB_CampTopWindow_C_TopMenuCursorSelectedOff final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampTopWindow_C_TopMenuCursorSelectedOff) == 0x000001, "Wrong alignment on WB_CampTopWindow_C_TopMenuCursorSelectedOff");
static_assert(sizeof(WB_CampTopWindow_C_TopMenuCursorSelectedOff) == 0x000001, "Wrong size on WB_CampTopWindow_C_TopMenuCursorSelectedOff");
static_assert(offsetof(WB_CampTopWindow_C_TopMenuCursorSelectedOff, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampTopWindow_C_TopMenuCursorSelectedOff::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampTopWindow.WB_CampTopWindow_C.TopMenuCursorSelectedOn
// 0x0001 (0x0001 - 0x0000)
struct WB_CampTopWindow_C_TopMenuCursorSelectedOn final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampTopWindow_C_TopMenuCursorSelectedOn) == 0x000001, "Wrong alignment on WB_CampTopWindow_C_TopMenuCursorSelectedOn");
static_assert(sizeof(WB_CampTopWindow_C_TopMenuCursorSelectedOn) == 0x000001, "Wrong size on WB_CampTopWindow_C_TopMenuCursorSelectedOn");
static_assert(offsetof(WB_CampTopWindow_C_TopMenuCursorSelectedOn, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampTopWindow_C_TopMenuCursorSelectedOn::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampTopWindow.WB_CampTopWindow_C.GetCharaPanelPosition
// 0x0040 (0x0040 - 0x0000)
struct WB_CampTopWindow_C_GetCharaPanelPosition final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              OutVector2D;                                       // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Vec2d;                                             // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BCD[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec_1;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec_2;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec_3;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec_4;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampTopWindow_C_GetCharaPanelPosition) == 0x000004, "Wrong alignment on WB_CampTopWindow_C_GetCharaPanelPosition");
static_assert(sizeof(WB_CampTopWindow_C_GetCharaPanelPosition) == 0x000040, "Wrong size on WB_CampTopWindow_C_GetCharaPanelPosition");
static_assert(offsetof(WB_CampTopWindow_C_GetCharaPanelPosition, InType) == 0x000000, "Member 'WB_CampTopWindow_C_GetCharaPanelPosition::InType' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_GetCharaPanelPosition, OutVector2D) == 0x000004, "Member 'WB_CampTopWindow_C_GetCharaPanelPosition::OutVector2D' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_GetCharaPanelPosition, Vec2d) == 0x00000C, "Member 'WB_CampTopWindow_C_GetCharaPanelPosition::Vec2d' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_GetCharaPanelPosition, K2Node_SwitchInteger_CmpSuccess) == 0x000014, "Member 'WB_CampTopWindow_C_GetCharaPanelPosition::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_GetCharaPanelPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec) == 0x000018, "Member 'WB_CampTopWindow_C_GetCharaPanelPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_GetCharaPanelPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec_1) == 0x000020, "Member 'WB_CampTopWindow_C_GetCharaPanelPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec_1' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_GetCharaPanelPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec_2) == 0x000028, "Member 'WB_CampTopWindow_C_GetCharaPanelPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec_2' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_GetCharaPanelPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec_3) == 0x000030, "Member 'WB_CampTopWindow_C_GetCharaPanelPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec_3' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_GetCharaPanelPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec_4) == 0x000038, "Member 'WB_CampTopWindow_C_GetCharaPanelPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec_4' has a wrong offset!");

// Function WB_CampTopWindow.WB_CampTopWindow_C.SetTopMenuPosition
// 0x00B8 (0x00B8 - 0x0000)
struct WB_CampTopWindow_C_SetTopMenuPosition final
{
public:
	struct FVector2D                              Positionbuf;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_2;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_3;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_4;           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_4;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_5;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_5;           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_6;           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_7;           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec_1;   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec_2;   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_8;           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec_3;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_9;           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampTopWindow_C_SetTopMenuPosition) == 0x000008, "Wrong alignment on WB_CampTopWindow_C_SetTopMenuPosition");
static_assert(sizeof(WB_CampTopWindow_C_SetTopMenuPosition) == 0x0000B8, "Wrong size on WB_CampTopWindow_C_SetTopMenuPosition");
static_assert(offsetof(WB_CampTopWindow_C_SetTopMenuPosition, Positionbuf) == 0x000000, "Member 'WB_CampTopWindow_C_SetTopMenuPosition::Positionbuf' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetTopMenuPosition, CallFunc_BreakVector2D_X) == 0x000008, "Member 'WB_CampTopWindow_C_SetTopMenuPosition::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetTopMenuPosition, CallFunc_BreakVector2D_Y) == 0x00000C, "Member 'WB_CampTopWindow_C_SetTopMenuPosition::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetTopMenuPosition, CallFunc_MakeVector2D_ReturnValue) == 0x000010, "Member 'WB_CampTopWindow_C_SetTopMenuPosition::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetTopMenuPosition, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000018, "Member 'WB_CampTopWindow_C_SetTopMenuPosition::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetTopMenuPosition, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000020, "Member 'WB_CampTopWindow_C_SetTopMenuPosition::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetTopMenuPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec) == 0x000028, "Member 'WB_CampTopWindow_C_SetTopMenuPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec' has a wrong offset!");
static_assert(offsetof(WB_CampTopWindow_C_SetTopMenuPosition, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000030, "Member 'WB_CampTopWindow_C_SetTopMenuPosition::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
