#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CampItemWindow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_CampItemWindow.WB_CampItemWindow_C.SetScrollNumber
// 0x0008 (0x0008 - 0x0000)
struct WB_CampItemWindow_C_SetScrollNumber final
{
public:
	int32                                         InMaxNumber;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InDispNumber;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemWindow_C_SetScrollNumber) == 0x000004, "Wrong alignment on WB_CampItemWindow_C_SetScrollNumber");
static_assert(sizeof(WB_CampItemWindow_C_SetScrollNumber) == 0x000008, "Wrong size on WB_CampItemWindow_C_SetScrollNumber");
static_assert(offsetof(WB_CampItemWindow_C_SetScrollNumber, InMaxNumber) == 0x000000, "Member 'WB_CampItemWindow_C_SetScrollNumber::InMaxNumber' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetScrollNumber, InDispNumber) == 0x000004, "Member 'WB_CampItemWindow_C_SetScrollNumber::InDispNumber' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.IsItemListArea
// 0x0002 (0x0002 - 0x0000)
struct WB_CampItemWindow_C_IsItemListArea final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMouseOvered_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemWindow_C_IsItemListArea) == 0x000001, "Wrong alignment on WB_CampItemWindow_C_IsItemListArea");
static_assert(sizeof(WB_CampItemWindow_C_IsItemListArea) == 0x000002, "Wrong size on WB_CampItemWindow_C_IsItemListArea");
static_assert(offsetof(WB_CampItemWindow_C_IsItemListArea, OutParam) == 0x000000, "Member 'WB_CampItemWindow_C_IsItemListArea::OutParam' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_IsItemListArea, CallFunc_GetMouseOvered_ReturnValue) == 0x000001, "Member 'WB_CampItemWindow_C_IsItemListArea::CallFunc_GetMouseOvered_ReturnValue' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.GetScrollBarValue
// 0x0008 (0x0008 - 0x0000)
struct WB_CampItemWindow_C_GetScrollBarValue final
{
public:
	float                                         OutValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RetValue;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemWindow_C_GetScrollBarValue) == 0x000004, "Wrong alignment on WB_CampItemWindow_C_GetScrollBarValue");
static_assert(sizeof(WB_CampItemWindow_C_GetScrollBarValue) == 0x000008, "Wrong size on WB_CampItemWindow_C_GetScrollBarValue");
static_assert(offsetof(WB_CampItemWindow_C_GetScrollBarValue, OutValue) == 0x000000, "Member 'WB_CampItemWindow_C_GetScrollBarValue::OutValue' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_GetScrollBarValue, RetValue) == 0x000004, "Member 'WB_CampItemWindow_C_GetScrollBarValue::RetValue' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.DisableListMouseFocus
// 0x0018 (0x0018 - 0x0000)
struct WB_CampItemWindow_C_DisableListMouseFocus final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CampItemList_C*                     CallFunc_GetCampItemList_OutCampItemList;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemWindow_C_DisableListMouseFocus) == 0x000008, "Wrong alignment on WB_CampItemWindow_C_DisableListMouseFocus");
static_assert(sizeof(WB_CampItemWindow_C_DisableListMouseFocus) == 0x000018, "Wrong size on WB_CampItemWindow_C_DisableListMouseFocus");
static_assert(offsetof(WB_CampItemWindow_C_DisableListMouseFocus, Temp_int_Variable) == 0x000000, "Member 'WB_CampItemWindow_C_DisableListMouseFocus::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_DisableListMouseFocus, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WB_CampItemWindow_C_DisableListMouseFocus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_DisableListMouseFocus, CallFunc_GetCampItemList_OutCampItemList) == 0x000008, "Member 'WB_CampItemWindow_C_DisableListMouseFocus::CallFunc_GetCampItemList_OutCampItemList' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_DisableListMouseFocus, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'WB_CampItemWindow_C_DisableListMouseFocus::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.EnableListMouseFocus
// 0x0018 (0x0018 - 0x0000)
struct WB_CampItemWindow_C_EnableListMouseFocus final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CampItemList_C*                     CallFunc_GetCampItemList_OutCampItemList;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemWindow_C_EnableListMouseFocus) == 0x000008, "Wrong alignment on WB_CampItemWindow_C_EnableListMouseFocus");
static_assert(sizeof(WB_CampItemWindow_C_EnableListMouseFocus) == 0x000018, "Wrong size on WB_CampItemWindow_C_EnableListMouseFocus");
static_assert(offsetof(WB_CampItemWindow_C_EnableListMouseFocus, Temp_int_Variable) == 0x000000, "Member 'WB_CampItemWindow_C_EnableListMouseFocus::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_EnableListMouseFocus, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WB_CampItemWindow_C_EnableListMouseFocus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_EnableListMouseFocus, CallFunc_GetCampItemList_OutCampItemList) == 0x000008, "Member 'WB_CampItemWindow_C_EnableListMouseFocus::CallFunc_GetCampItemList_OutCampItemList' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_EnableListMouseFocus, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'WB_CampItemWindow_C_EnableListMouseFocus::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.GetMouseOnHovered
// 0x0020 (0x0020 - 0x0000)
struct WB_CampItemWindow_C_GetMouseOnHovered final
{
public:
	int32                                         OutIndex;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Retindex;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B1C[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampItemList_C*                     CallFunc_GetCampItemList_OutCampItemList;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItHovered_OutHovered;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B1D[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemWindow_C_GetMouseOnHovered) == 0x000008, "Wrong alignment on WB_CampItemWindow_C_GetMouseOnHovered");
static_assert(sizeof(WB_CampItemWindow_C_GetMouseOnHovered) == 0x000020, "Wrong size on WB_CampItemWindow_C_GetMouseOnHovered");
static_assert(offsetof(WB_CampItemWindow_C_GetMouseOnHovered, OutIndex) == 0x000000, "Member 'WB_CampItemWindow_C_GetMouseOnHovered::OutIndex' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_GetMouseOnHovered, Retindex) == 0x000004, "Member 'WB_CampItemWindow_C_GetMouseOnHovered::Retindex' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_GetMouseOnHovered, Temp_int_Variable) == 0x000008, "Member 'WB_CampItemWindow_C_GetMouseOnHovered::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_GetMouseOnHovered, CallFunc_GetCampItemList_OutCampItemList) == 0x000010, "Member 'WB_CampItemWindow_C_GetMouseOnHovered::CallFunc_GetCampItemList_OutCampItemList' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_GetMouseOnHovered, CallFunc_IsItHovered_OutHovered) == 0x000018, "Member 'WB_CampItemWindow_C_GetMouseOnHovered::CallFunc_IsItHovered_OutHovered' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_GetMouseOnHovered, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000019, "Member 'WB_CampItemWindow_C_GetMouseOnHovered::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_GetMouseOnHovered, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WB_CampItemWindow_C_GetMouseOnHovered::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.GetMouseOnClicked
// 0x0020 (0x0020 - 0x0000)
struct WB_CampItemWindow_C_GetMouseOnClicked final
{
public:
	int32                                         OutIndex;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Retindex;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B1E[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampItemList_C*                     CallFunc_GetCampItemList_OutCampItemList;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItClicked_OutClicked;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B1F[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemWindow_C_GetMouseOnClicked) == 0x000008, "Wrong alignment on WB_CampItemWindow_C_GetMouseOnClicked");
static_assert(sizeof(WB_CampItemWindow_C_GetMouseOnClicked) == 0x000020, "Wrong size on WB_CampItemWindow_C_GetMouseOnClicked");
static_assert(offsetof(WB_CampItemWindow_C_GetMouseOnClicked, OutIndex) == 0x000000, "Member 'WB_CampItemWindow_C_GetMouseOnClicked::OutIndex' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_GetMouseOnClicked, Retindex) == 0x000004, "Member 'WB_CampItemWindow_C_GetMouseOnClicked::Retindex' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_GetMouseOnClicked, Temp_int_Variable) == 0x000008, "Member 'WB_CampItemWindow_C_GetMouseOnClicked::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_GetMouseOnClicked, CallFunc_GetCampItemList_OutCampItemList) == 0x000010, "Member 'WB_CampItemWindow_C_GetMouseOnClicked::CallFunc_GetCampItemList_OutCampItemList' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_GetMouseOnClicked, CallFunc_IsItClicked_OutClicked) == 0x000018, "Member 'WB_CampItemWindow_C_GetMouseOnClicked::CallFunc_IsItClicked_OutClicked' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_GetMouseOnClicked, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000019, "Member 'WB_CampItemWindow_C_GetMouseOnClicked::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_GetMouseOnClicked, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WB_CampItemWindow_C_GetMouseOnClicked::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.ResetMouseFlag
// 0x0018 (0x0018 - 0x0000)
struct WB_CampItemWindow_C_ResetMouseFlag final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CampItemList_C*                     CallFunc_GetCampItemList_OutCampItemList;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemWindow_C_ResetMouseFlag) == 0x000008, "Wrong alignment on WB_CampItemWindow_C_ResetMouseFlag");
static_assert(sizeof(WB_CampItemWindow_C_ResetMouseFlag) == 0x000018, "Wrong size on WB_CampItemWindow_C_ResetMouseFlag");
static_assert(offsetof(WB_CampItemWindow_C_ResetMouseFlag, Temp_int_Variable) == 0x000000, "Member 'WB_CampItemWindow_C_ResetMouseFlag::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_ResetMouseFlag, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WB_CampItemWindow_C_ResetMouseFlag::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_ResetMouseFlag, CallFunc_GetCampItemList_OutCampItemList) == 0x000008, "Member 'WB_CampItemWindow_C_ResetMouseFlag::CallFunc_GetCampItemList_OutCampItemList' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_ResetMouseFlag, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'WB_CampItemWindow_C_ResetMouseFlag::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.IsItemListAnimationEnd
// 0x0020 (0x0020 - 0x0000)
struct WB_CampItemWindow_C_IsItemListAnimationEnd final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Endanimationflag;                                  // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B20[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B21[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampItemList_C*                     CallFunc_GetCampItemList_OutCampItemList;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationEnd_OutParam;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemWindow_C_IsItemListAnimationEnd) == 0x000008, "Wrong alignment on WB_CampItemWindow_C_IsItemListAnimationEnd");
static_assert(sizeof(WB_CampItemWindow_C_IsItemListAnimationEnd) == 0x000020, "Wrong size on WB_CampItemWindow_C_IsItemListAnimationEnd");
static_assert(offsetof(WB_CampItemWindow_C_IsItemListAnimationEnd, OutParam) == 0x000000, "Member 'WB_CampItemWindow_C_IsItemListAnimationEnd::OutParam' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_IsItemListAnimationEnd, Endanimationflag) == 0x000001, "Member 'WB_CampItemWindow_C_IsItemListAnimationEnd::Endanimationflag' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_IsItemListAnimationEnd, Temp_int_Variable) == 0x000004, "Member 'WB_CampItemWindow_C_IsItemListAnimationEnd::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_IsItemListAnimationEnd, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WB_CampItemWindow_C_IsItemListAnimationEnd::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_IsItemListAnimationEnd, CallFunc_GetCampItemList_OutCampItemList) == 0x000010, "Member 'WB_CampItemWindow_C_IsItemListAnimationEnd::CallFunc_GetCampItemList_OutCampItemList' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_IsItemListAnimationEnd, CallFunc_IsAnimationEnd_OutParam) == 0x000018, "Member 'WB_CampItemWindow_C_IsItemListAnimationEnd::CallFunc_IsAnimationEnd_OutParam' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_IsItemListAnimationEnd, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000019, "Member 'WB_CampItemWindow_C_IsItemListAnimationEnd::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.SetScrollRate
// 0x0004 (0x0004 - 0x0000)
struct WB_CampItemWindow_C_SetScrollRate final
{
public:
	float                                         InRate;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemWindow_C_SetScrollRate) == 0x000004, "Wrong alignment on WB_CampItemWindow_C_SetScrollRate");
static_assert(sizeof(WB_CampItemWindow_C_SetScrollRate) == 0x000004, "Wrong size on WB_CampItemWindow_C_SetScrollRate");
static_assert(offsetof(WB_CampItemWindow_C_SetScrollRate, InRate) == 0x000000, "Member 'WB_CampItemWindow_C_SetScrollRate::InRate' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.ItemScrollBarOut
// 0x0001 (0x0001 - 0x0000)
struct WB_CampItemWindow_C_ItemScrollBarOut final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemWindow_C_ItemScrollBarOut) == 0x000001, "Wrong alignment on WB_CampItemWindow_C_ItemScrollBarOut");
static_assert(sizeof(WB_CampItemWindow_C_ItemScrollBarOut) == 0x000001, "Wrong size on WB_CampItemWindow_C_ItemScrollBarOut");
static_assert(offsetof(WB_CampItemWindow_C_ItemScrollBarOut, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampItemWindow_C_ItemScrollBarOut::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.ItemScrollBarIn
// 0x0001 (0x0001 - 0x0000)
struct WB_CampItemWindow_C_ItemScrollBarIn final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemWindow_C_ItemScrollBarIn) == 0x000001, "Wrong alignment on WB_CampItemWindow_C_ItemScrollBarIn");
static_assert(sizeof(WB_CampItemWindow_C_ItemScrollBarIn) == 0x000001, "Wrong size on WB_CampItemWindow_C_ItemScrollBarIn");
static_assert(offsetof(WB_CampItemWindow_C_ItemScrollBarIn, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampItemWindow_C_ItemScrollBarIn::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.IsFinishedItemListAnimation
// 0x0002 (0x0002 - 0x0000)
struct WB_CampItemWindow_C_IsFinishedItemListAnimation final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemWindow_C_IsFinishedItemListAnimation) == 0x000001, "Wrong alignment on WB_CampItemWindow_C_IsFinishedItemListAnimation");
static_assert(sizeof(WB_CampItemWindow_C_IsFinishedItemListAnimation) == 0x000002, "Wrong size on WB_CampItemWindow_C_IsFinishedItemListAnimation");
static_assert(offsetof(WB_CampItemWindow_C_IsFinishedItemListAnimation, OutFinished) == 0x000000, "Member 'WB_CampItemWindow_C_IsFinishedItemListAnimation::OutFinished' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_IsFinishedItemListAnimation, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'WB_CampItemWindow_C_IsFinishedItemListAnimation::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.CampItemDarkMaskOff
// 0x0010 (0x0010 - 0x0000)
struct WB_CampItemWindow_C_CampItemDarkMaskOff final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B22[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampItemList_C*                     CallFunc_GetCampItemList_OutCampItemList;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemWindow_C_CampItemDarkMaskOff) == 0x000008, "Wrong alignment on WB_CampItemWindow_C_CampItemDarkMaskOff");
static_assert(sizeof(WB_CampItemWindow_C_CampItemDarkMaskOff) == 0x000010, "Wrong size on WB_CampItemWindow_C_CampItemDarkMaskOff");
static_assert(offsetof(WB_CampItemWindow_C_CampItemDarkMaskOff, InIndex) == 0x000000, "Member 'WB_CampItemWindow_C_CampItemDarkMaskOff::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_CampItemDarkMaskOff, CallFunc_GetCampItemList_OutCampItemList) == 0x000008, "Member 'WB_CampItemWindow_C_CampItemDarkMaskOff::CallFunc_GetCampItemList_OutCampItemList' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.CampItemDarkMaskOn
// 0x0010 (0x0010 - 0x0000)
struct WB_CampItemWindow_C_CampItemDarkMaskOn final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B23[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampItemList_C*                     CallFunc_GetCampItemList_OutCampItemList;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemWindow_C_CampItemDarkMaskOn) == 0x000008, "Wrong alignment on WB_CampItemWindow_C_CampItemDarkMaskOn");
static_assert(sizeof(WB_CampItemWindow_C_CampItemDarkMaskOn) == 0x000010, "Wrong size on WB_CampItemWindow_C_CampItemDarkMaskOn");
static_assert(offsetof(WB_CampItemWindow_C_CampItemDarkMaskOn, InIndex) == 0x000000, "Member 'WB_CampItemWindow_C_CampItemDarkMaskOn::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_CampItemDarkMaskOn, CallFunc_GetCampItemList_OutCampItemList) == 0x000008, "Member 'WB_CampItemWindow_C_CampItemDarkMaskOn::CallFunc_GetCampItemList_OutCampItemList' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.SetPanelItemNameColor
// 0x0010 (0x0010 - 0x0000)
struct WB_CampItemWindow_C_SetPanelItemNameColor final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InUseItem;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CampItemList_C*                     CallFunc_GetCampItemList_OutCampItemList;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemWindow_C_SetPanelItemNameColor) == 0x000008, "Wrong alignment on WB_CampItemWindow_C_SetPanelItemNameColor");
static_assert(sizeof(WB_CampItemWindow_C_SetPanelItemNameColor) == 0x000010, "Wrong size on WB_CampItemWindow_C_SetPanelItemNameColor");
static_assert(offsetof(WB_CampItemWindow_C_SetPanelItemNameColor, InIndex) == 0x000000, "Member 'WB_CampItemWindow_C_SetPanelItemNameColor::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetPanelItemNameColor, InUseItem) == 0x000004, "Member 'WB_CampItemWindow_C_SetPanelItemNameColor::InUseItem' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetPanelItemNameColor, CallFunc_GetCampItemList_OutCampItemList) == 0x000008, "Member 'WB_CampItemWindow_C_SetPanelItemNameColor::CallFunc_GetCampItemList_OutCampItemList' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.ItemTitleOff
// 0x0001 (0x0001 - 0x0000)
struct WB_CampItemWindow_C_ItemTitleOff final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemWindow_C_ItemTitleOff) == 0x000001, "Wrong alignment on WB_CampItemWindow_C_ItemTitleOff");
static_assert(sizeof(WB_CampItemWindow_C_ItemTitleOff) == 0x000001, "Wrong size on WB_CampItemWindow_C_ItemTitleOff");
static_assert(offsetof(WB_CampItemWindow_C_ItemTitleOff, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampItemWindow_C_ItemTitleOff::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.ItemTitleOn
// 0x0001 (0x0001 - 0x0000)
struct WB_CampItemWindow_C_ItemTitleOn final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemWindow_C_ItemTitleOn) == 0x000001, "Wrong alignment on WB_CampItemWindow_C_ItemTitleOn");
static_assert(sizeof(WB_CampItemWindow_C_ItemTitleOn) == 0x000001, "Wrong size on WB_CampItemWindow_C_ItemTitleOn");
static_assert(offsetof(WB_CampItemWindow_C_ItemTitleOn, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampItemWindow_C_ItemTitleOn::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.SetInitPosition
// 0x0078 (0x0078 - 0x0000)
struct WB_CampItemWindow_C_SetInitPosition final
{
public:
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec_1;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec_2;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CampItemList_C*                     CallFunc_GetCampItemList_OutCampItemList;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B24[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec_3;   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_4;           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemWindow_C_SetInitPosition) == 0x000008, "Wrong alignment on WB_CampItemWindow_C_SetInitPosition");
static_assert(sizeof(WB_CampItemWindow_C_SetInitPosition) == 0x000078, "Wrong size on WB_CampItemWindow_C_SetInitPosition");
static_assert(offsetof(WB_CampItemWindow_C_SetInitPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec) == 0x000000, "Member 'WB_CampItemWindow_C_SetInitPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetInitPosition, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000008, "Member 'WB_CampItemWindow_C_SetInitPosition::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetInitPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec_1) == 0x000010, "Member 'WB_CampItemWindow_C_SetInitPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec_1' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetInitPosition, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000018, "Member 'WB_CampItemWindow_C_SetInitPosition::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetInitPosition, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000020, "Member 'WB_CampItemWindow_C_SetInitPosition::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetInitPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec_2) == 0x000028, "Member 'WB_CampItemWindow_C_SetInitPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec_2' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetInitPosition, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000030, "Member 'WB_CampItemWindow_C_SetInitPosition::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetInitPosition, Temp_int_Variable) == 0x000038, "Member 'WB_CampItemWindow_C_SetInitPosition::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetInitPosition, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00003C, "Member 'WB_CampItemWindow_C_SetInitPosition::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetInitPosition, CallFunc_GetCampItemList_OutCampItemList) == 0x000040, "Member 'WB_CampItemWindow_C_SetInitPosition::CallFunc_GetCampItemList_OutCampItemList' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetInitPosition, CallFunc_MakeVector2D_ReturnValue) == 0x000048, "Member 'WB_CampItemWindow_C_SetInitPosition::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetInitPosition, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x000050, "Member 'WB_CampItemWindow_C_SetInitPosition::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetInitPosition, CallFunc_Add_Vector2DVector2D_ReturnValue_1) == 0x000058, "Member 'WB_CampItemWindow_C_SetInitPosition::CallFunc_Add_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetInitPosition, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000060, "Member 'WB_CampItemWindow_C_SetInitPosition::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetInitPosition, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'WB_CampItemWindow_C_SetInitPosition::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetInitPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec_3) == 0x000068, "Member 'WB_CampItemWindow_C_SetInitPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec_3' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetInitPosition, CallFunc_SlotAsCanvasSlot_ReturnValue_4) == 0x000070, "Member 'WB_CampItemWindow_C_SetInitPosition::CallFunc_SlotAsCanvasSlot_ReturnValue_4' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.GetCategoryPosition
// 0x0010 (0x0010 - 0x0000)
struct WB_CampItemWindow_C_GetCategoryPosition final
{
public:
	struct FVector2D                              OutVector2D;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemWindow_C_GetCategoryPosition) == 0x000004, "Wrong alignment on WB_CampItemWindow_C_GetCategoryPosition");
static_assert(sizeof(WB_CampItemWindow_C_GetCategoryPosition) == 0x000010, "Wrong size on WB_CampItemWindow_C_GetCategoryPosition");
static_assert(offsetof(WB_CampItemWindow_C_GetCategoryPosition, OutVector2D) == 0x000000, "Member 'WB_CampItemWindow_C_GetCategoryPosition::OutVector2D' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_GetCategoryPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec) == 0x000008, "Member 'WB_CampItemWindow_C_GetCategoryPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.SetCampItemListCursorPosition
// 0x0028 (0x0028 - 0x0000)
struct WB_CampItemWindow_C_SetCampItemListCursorPosition final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemWindow_C_SetCampItemListCursorPosition) == 0x000008, "Wrong alignment on WB_CampItemWindow_C_SetCampItemListCursorPosition");
static_assert(sizeof(WB_CampItemWindow_C_SetCampItemListCursorPosition) == 0x000028, "Wrong size on WB_CampItemWindow_C_SetCampItemListCursorPosition");
static_assert(offsetof(WB_CampItemWindow_C_SetCampItemListCursorPosition, InIndex) == 0x000000, "Member 'WB_CampItemWindow_C_SetCampItemListCursorPosition::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetCampItemListCursorPosition, CallFunc_Multiply_IntInt_ReturnValue) == 0x000004, "Member 'WB_CampItemWindow_C_SetCampItemListCursorPosition::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetCampItemListCursorPosition, CallFunc_BreakVector2D_X) == 0x000008, "Member 'WB_CampItemWindow_C_SetCampItemListCursorPosition::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetCampItemListCursorPosition, CallFunc_BreakVector2D_Y) == 0x00000C, "Member 'WB_CampItemWindow_C_SetCampItemListCursorPosition::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetCampItemListCursorPosition, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000010, "Member 'WB_CampItemWindow_C_SetCampItemListCursorPosition::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetCampItemListCursorPosition, CallFunc_Add_FloatFloat_ReturnValue) == 0x000014, "Member 'WB_CampItemWindow_C_SetCampItemListCursorPosition::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetCampItemListCursorPosition, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000018, "Member 'WB_CampItemWindow_C_SetCampItemListCursorPosition::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetCampItemListCursorPosition, CallFunc_MakeVector2D_ReturnValue) == 0x000020, "Member 'WB_CampItemWindow_C_SetCampItemListCursorPosition::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.SetCampItemListCursorAnimation
// 0x0004 (0x0004 - 0x0000)
struct WB_CampItemWindow_C_SetCampItemListCursorAnimation final
{
public:
	int32                                         InAnimeType;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemWindow_C_SetCampItemListCursorAnimation) == 0x000004, "Wrong alignment on WB_CampItemWindow_C_SetCampItemListCursorAnimation");
static_assert(sizeof(WB_CampItemWindow_C_SetCampItemListCursorAnimation) == 0x000004, "Wrong size on WB_CampItemWindow_C_SetCampItemListCursorAnimation");
static_assert(offsetof(WB_CampItemWindow_C_SetCampItemListCursorAnimation, InAnimeType) == 0x000000, "Member 'WB_CampItemWindow_C_SetCampItemListCursorAnimation::InAnimeType' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.PanelItemNoDataOff
// 0x0014 (0x0014 - 0x0000)
struct WB_CampItemWindow_C_PanelItemNoDataOff final
{
public:
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemWindow_C_PanelItemNoDataOff) == 0x000004, "Wrong alignment on WB_CampItemWindow_C_PanelItemNoDataOff");
static_assert(sizeof(WB_CampItemWindow_C_PanelItemNoDataOff) == 0x000014, "Wrong size on WB_CampItemWindow_C_PanelItemNoDataOff");
static_assert(offsetof(WB_CampItemWindow_C_PanelItemNoDataOff, CallFunc_GetPlayingAnimationName_OutAnimPackName) == 0x000000, "Member 'WB_CampItemWindow_C_PanelItemNoDataOff::CallFunc_GetPlayingAnimationName_OutAnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_PanelItemNoDataOff, CallFunc_GetPlayingAnimationName_OutAnimationName) == 0x000008, "Member 'WB_CampItemWindow_C_PanelItemNoDataOff::CallFunc_GetPlayingAnimationName_OutAnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_PanelItemNoDataOff, CallFunc_Play_ReturnValue) == 0x000010, "Member 'WB_CampItemWindow_C_PanelItemNoDataOff::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.PanelItemNoDataOn
// 0x0028 (0x0028 - 0x0000)
struct WB_CampItemWindow_C_PanelItemNoDataOn final
{
public:
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetScriptMessageByLabel_self_CastInput;   // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampItemWindow_C_PanelItemNoDataOn) == 0x000008, "Wrong alignment on WB_CampItemWindow_C_PanelItemNoDataOn");
static_assert(sizeof(WB_CampItemWindow_C_PanelItemNoDataOn) == 0x000028, "Wrong size on WB_CampItemWindow_C_PanelItemNoDataOn");
static_assert(offsetof(WB_CampItemWindow_C_PanelItemNoDataOn, CallFunc_SetScriptMessageByLabel_self_CastInput) == 0x000000, "Member 'WB_CampItemWindow_C_PanelItemNoDataOn::CallFunc_SetScriptMessageByLabel_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_PanelItemNoDataOn, CallFunc_GetPlayingAnimationName_OutAnimPackName) == 0x000010, "Member 'WB_CampItemWindow_C_PanelItemNoDataOn::CallFunc_GetPlayingAnimationName_OutAnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_PanelItemNoDataOn, CallFunc_GetPlayingAnimationName_OutAnimationName) == 0x000018, "Member 'WB_CampItemWindow_C_PanelItemNoDataOn::CallFunc_GetPlayingAnimationName_OutAnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_PanelItemNoDataOn, CallFunc_Play_ReturnValue) == 0x000020, "Member 'WB_CampItemWindow_C_PanelItemNoDataOn::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.PanelItemOff
// 0x0010 (0x0010 - 0x0000)
struct WB_CampItemWindow_C_PanelItemOff final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B25[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampItemList_C*                     CallFunc_GetCampItemList_OutCampItemList;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemWindow_C_PanelItemOff) == 0x000008, "Wrong alignment on WB_CampItemWindow_C_PanelItemOff");
static_assert(sizeof(WB_CampItemWindow_C_PanelItemOff) == 0x000010, "Wrong size on WB_CampItemWindow_C_PanelItemOff");
static_assert(offsetof(WB_CampItemWindow_C_PanelItemOff, InIndex) == 0x000000, "Member 'WB_CampItemWindow_C_PanelItemOff::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_PanelItemOff, CallFunc_GetCampItemList_OutCampItemList) == 0x000008, "Member 'WB_CampItemWindow_C_PanelItemOff::CallFunc_GetCampItemList_OutCampItemList' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.PanelItemOn
// 0x0010 (0x0010 - 0x0000)
struct WB_CampItemWindow_C_PanelItemOn final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B26[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampItemList_C*                     CallFunc_GetCampItemList_OutCampItemList;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemWindow_C_PanelItemOn) == 0x000008, "Wrong alignment on WB_CampItemWindow_C_PanelItemOn");
static_assert(sizeof(WB_CampItemWindow_C_PanelItemOn) == 0x000010, "Wrong size on WB_CampItemWindow_C_PanelItemOn");
static_assert(offsetof(WB_CampItemWindow_C_PanelItemOn, InIndex) == 0x000000, "Member 'WB_CampItemWindow_C_PanelItemOn::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_PanelItemOn, CallFunc_GetCampItemList_OutCampItemList) == 0x000008, "Member 'WB_CampItemWindow_C_PanelItemOn::CallFunc_GetCampItemList_OutCampItemList' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.SetPanelItem
// 0x0020 (0x0020 - 0x0000)
struct WB_CampItemWindow_C_SetPanelItem final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InItemId;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InNamerator;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InDenominator;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InUseItem;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InDispOnFlag;                                      // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B27[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampItemList_C*                     CallFunc_GetCampItemList_OutCampItemList;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemWindow_C_SetPanelItem) == 0x000008, "Wrong alignment on WB_CampItemWindow_C_SetPanelItem");
static_assert(sizeof(WB_CampItemWindow_C_SetPanelItem) == 0x000020, "Wrong size on WB_CampItemWindow_C_SetPanelItem");
static_assert(offsetof(WB_CampItemWindow_C_SetPanelItem, InIndex) == 0x000000, "Member 'WB_CampItemWindow_C_SetPanelItem::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetPanelItem, InItemId) == 0x000004, "Member 'WB_CampItemWindow_C_SetPanelItem::InItemId' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetPanelItem, InNamerator) == 0x000008, "Member 'WB_CampItemWindow_C_SetPanelItem::InNamerator' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetPanelItem, InDenominator) == 0x00000C, "Member 'WB_CampItemWindow_C_SetPanelItem::InDenominator' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetPanelItem, InUseItem) == 0x000010, "Member 'WB_CampItemWindow_C_SetPanelItem::InUseItem' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetPanelItem, InDispOnFlag) == 0x000014, "Member 'WB_CampItemWindow_C_SetPanelItem::InDispOnFlag' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetPanelItem, CallFunc_GetCampItemList_OutCampItemList) == 0x000018, "Member 'WB_CampItemWindow_C_SetPanelItem::CallFunc_GetCampItemList_OutCampItemList' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.SetPanelItemCursorAnimation
// 0x0018 (0x0018 - 0x0000)
struct WB_CampItemWindow_C_SetPanelItemCursorAnimation final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InType;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InAnimeType;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B28[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampItemList_C*                     CallFunc_GetCampItemList_OutCampItemList;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemWindow_C_SetPanelItemCursorAnimation) == 0x000008, "Wrong alignment on WB_CampItemWindow_C_SetPanelItemCursorAnimation");
static_assert(sizeof(WB_CampItemWindow_C_SetPanelItemCursorAnimation) == 0x000018, "Wrong size on WB_CampItemWindow_C_SetPanelItemCursorAnimation");
static_assert(offsetof(WB_CampItemWindow_C_SetPanelItemCursorAnimation, InIndex) == 0x000000, "Member 'WB_CampItemWindow_C_SetPanelItemCursorAnimation::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetPanelItemCursorAnimation, InType) == 0x000004, "Member 'WB_CampItemWindow_C_SetPanelItemCursorAnimation::InType' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetPanelItemCursorAnimation, InAnimeType) == 0x000008, "Member 'WB_CampItemWindow_C_SetPanelItemCursorAnimation::InAnimeType' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetPanelItemCursorAnimation, CallFunc_GetCampItemList_OutCampItemList) == 0x000010, "Member 'WB_CampItemWindow_C_SetPanelItemCursorAnimation::CallFunc_GetCampItemList_OutCampItemList' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.SetPanelItemDenominator
// 0x0010 (0x0010 - 0x0000)
struct WB_CampItemWindow_C_SetPanelItemDenominator final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InDenominator;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CampItemList_C*                     CallFunc_GetCampItemList_OutCampItemList;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemWindow_C_SetPanelItemDenominator) == 0x000008, "Wrong alignment on WB_CampItemWindow_C_SetPanelItemDenominator");
static_assert(sizeof(WB_CampItemWindow_C_SetPanelItemDenominator) == 0x000010, "Wrong size on WB_CampItemWindow_C_SetPanelItemDenominator");
static_assert(offsetof(WB_CampItemWindow_C_SetPanelItemDenominator, InIndex) == 0x000000, "Member 'WB_CampItemWindow_C_SetPanelItemDenominator::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetPanelItemDenominator, InDenominator) == 0x000004, "Member 'WB_CampItemWindow_C_SetPanelItemDenominator::InDenominator' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetPanelItemDenominator, CallFunc_GetCampItemList_OutCampItemList) == 0x000008, "Member 'WB_CampItemWindow_C_SetPanelItemDenominator::CallFunc_GetCampItemList_OutCampItemList' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.SetPanelItemNumerator
// 0x0010 (0x0010 - 0x0000)
struct WB_CampItemWindow_C_SetPanelItemNumerator final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InNumerator;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CampItemList_C*                     CallFunc_GetCampItemList_OutCampItemList;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampItemWindow_C_SetPanelItemNumerator) == 0x000008, "Wrong alignment on WB_CampItemWindow_C_SetPanelItemNumerator");
static_assert(sizeof(WB_CampItemWindow_C_SetPanelItemNumerator) == 0x000010, "Wrong size on WB_CampItemWindow_C_SetPanelItemNumerator");
static_assert(offsetof(WB_CampItemWindow_C_SetPanelItemNumerator, InIndex) == 0x000000, "Member 'WB_CampItemWindow_C_SetPanelItemNumerator::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetPanelItemNumerator, InNumerator) == 0x000004, "Member 'WB_CampItemWindow_C_SetPanelItemNumerator::InNumerator' has a wrong offset!");
static_assert(offsetof(WB_CampItemWindow_C_SetPanelItemNumerator, CallFunc_GetCampItemList_OutCampItemList) == 0x000008, "Member 'WB_CampItemWindow_C_SetPanelItemNumerator::CallFunc_GetCampItemList_OutCampItemList' has a wrong offset!");

// Function WB_CampItemWindow.WB_CampItemWindow_C.GetCampItemList
// 0x0020 (0x0020 - 0x0000)
struct WB_CampItemWindow_C_GetCampItemList final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B29[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampItemList_C*                     OutCampItemList;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CampItemList_C*                     RetCampItemList;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
