#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CommonWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_CommonWindow.WB_CommonWindow_C
// 0x0040 (0x02A0 - 0x0260)
class UWB_CommonWindow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanelIcon;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanelTop;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMessageSimpleTextWidget*               MessageSimpleTextActionWindow;                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerActionWindow;                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BtnHelp_ActionMappingIcon_C*        WB_BtnHelp_ActionMappingIcon;                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              Posdata;                                           // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Transdata;                                         // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_CommonWindow(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void BndEvt__SsPlayerSearch_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void ActionWindowOut();
	void ActionWindowIn();
	void SetActionWindowTextByLabel(class UScriptMessageAsset* InScriptMessageAsset, class FName InLabel);
	void ActionWindowOn();
	void ActionWindowOff();
	void SetActionWindowTextByIndex(class UScriptMessageAsset* InScriptMessageAsset, int32 InIndex);
	void SetIcon(int32 InIndex, E_BTN_HELP_MAPPING_KEY_TYPE InActionMap);
	void SetIconColor(int32 InColorType);
	void IsActionWindowActive(bool* OutParam);
	void SetIconDispMode(bool InMode);
	void CalcTranslation(struct FVector2D* OutVec);
	void CalcIconPosition(struct FVector2D* OutVec);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_CommonWindow_C">();
	}
	static class UWB_CommonWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_CommonWindow_C>();
	}
};
static_assert(alignof(UWB_CommonWindow_C) == 0x000008, "Wrong alignment on UWB_CommonWindow_C");
static_assert(sizeof(UWB_CommonWindow_C) == 0x0002A0, "Wrong size on UWB_CommonWindow_C");
static_assert(offsetof(UWB_CommonWindow_C, UberGraphFrame) == 0x000260, "Member 'UWB_CommonWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_CommonWindow_C, CanvasPanelIcon) == 0x000268, "Member 'UWB_CommonWindow_C::CanvasPanelIcon' has a wrong offset!");
static_assert(offsetof(UWB_CommonWindow_C, CanvasPanelTop) == 0x000270, "Member 'UWB_CommonWindow_C::CanvasPanelTop' has a wrong offset!");
static_assert(offsetof(UWB_CommonWindow_C, MessageSimpleTextActionWindow) == 0x000278, "Member 'UWB_CommonWindow_C::MessageSimpleTextActionWindow' has a wrong offset!");
static_assert(offsetof(UWB_CommonWindow_C, SsPlayerActionWindow) == 0x000280, "Member 'UWB_CommonWindow_C::SsPlayerActionWindow' has a wrong offset!");
static_assert(offsetof(UWB_CommonWindow_C, WB_BtnHelp_ActionMappingIcon) == 0x000288, "Member 'UWB_CommonWindow_C::WB_BtnHelp_ActionMappingIcon' has a wrong offset!");
static_assert(offsetof(UWB_CommonWindow_C, Posdata) == 0x000290, "Member 'UWB_CommonWindow_C::Posdata' has a wrong offset!");
static_assert(offsetof(UWB_CommonWindow_C, Transdata) == 0x000298, "Member 'UWB_CommonWindow_C::Transdata' has a wrong offset!");

}

