#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CampSkillWindow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.SetScrollNumber
// 0x0008 (0x0008 - 0x0000)
struct WB_CampSkillWindow_C_SetScrollNumber final
{
public:
	int32                                         InMaxNumber;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InDispNumber;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampSkillWindow_C_SetScrollNumber) == 0x000004, "Wrong alignment on WB_CampSkillWindow_C_SetScrollNumber");
static_assert(sizeof(WB_CampSkillWindow_C_SetScrollNumber) == 0x000008, "Wrong size on WB_CampSkillWindow_C_SetScrollNumber");
static_assert(offsetof(WB_CampSkillWindow_C_SetScrollNumber, InMaxNumber) == 0x000000, "Member 'WB_CampSkillWindow_C_SetScrollNumber::InMaxNumber' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetScrollNumber, InDispNumber) == 0x000004, "Member 'WB_CampSkillWindow_C_SetScrollNumber::InDispNumber' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.SetPanelUnique
// 0x0028 (0x0028 - 0x0000)
struct WB_CampSkillWindow_C_SetPanelUnique final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InSkillId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InFaceIconId;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InCost;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InUseSkill;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InTekiseiParam;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InUseType;                                         // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InDispOn;                                          // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9322[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampSkillList_C*                    CallFunc_GetCampSkillList_OutList;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampSkillWindow_C_SetPanelUnique) == 0x000008, "Wrong alignment on WB_CampSkillWindow_C_SetPanelUnique");
static_assert(sizeof(WB_CampSkillWindow_C_SetPanelUnique) == 0x000028, "Wrong size on WB_CampSkillWindow_C_SetPanelUnique");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelUnique, InIndex) == 0x000000, "Member 'WB_CampSkillWindow_C_SetPanelUnique::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelUnique, InSkillId) == 0x000004, "Member 'WB_CampSkillWindow_C_SetPanelUnique::InSkillId' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelUnique, InFaceIconId) == 0x000008, "Member 'WB_CampSkillWindow_C_SetPanelUnique::InFaceIconId' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelUnique, InCost) == 0x00000C, "Member 'WB_CampSkillWindow_C_SetPanelUnique::InCost' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelUnique, InUseSkill) == 0x000010, "Member 'WB_CampSkillWindow_C_SetPanelUnique::InUseSkill' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelUnique, InTekiseiParam) == 0x000014, "Member 'WB_CampSkillWindow_C_SetPanelUnique::InTekiseiParam' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelUnique, InUseType) == 0x000018, "Member 'WB_CampSkillWindow_C_SetPanelUnique::InUseType' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelUnique, InDispOn) == 0x00001C, "Member 'WB_CampSkillWindow_C_SetPanelUnique::InDispOn' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelUnique, CallFunc_GetCampSkillList_OutList) == 0x000020, "Member 'WB_CampSkillWindow_C_SetPanelUnique::CallFunc_GetCampSkillList_OutList' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.IsSkillListRectArea
// 0x0002 (0x0002 - 0x0000)
struct WB_CampSkillWindow_C_IsSkillListRectArea final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMouseOvered_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampSkillWindow_C_IsSkillListRectArea) == 0x000001, "Wrong alignment on WB_CampSkillWindow_C_IsSkillListRectArea");
static_assert(sizeof(WB_CampSkillWindow_C_IsSkillListRectArea) == 0x000002, "Wrong size on WB_CampSkillWindow_C_IsSkillListRectArea");
static_assert(offsetof(WB_CampSkillWindow_C_IsSkillListRectArea, OutParam) == 0x000000, "Member 'WB_CampSkillWindow_C_IsSkillListRectArea::OutParam' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_IsSkillListRectArea, CallFunc_GetMouseOvered_ReturnValue) == 0x000001, "Member 'WB_CampSkillWindow_C_IsSkillListRectArea::CallFunc_GetMouseOvered_ReturnValue' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.IsItAvobeScrollBar
// 0x0001 (0x0001 - 0x0000)
struct WB_CampSkillWindow_C_IsItAvobeScrollBar final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampSkillWindow_C_IsItAvobeScrollBar) == 0x000001, "Wrong alignment on WB_CampSkillWindow_C_IsItAvobeScrollBar");
static_assert(sizeof(WB_CampSkillWindow_C_IsItAvobeScrollBar) == 0x000001, "Wrong size on WB_CampSkillWindow_C_IsItAvobeScrollBar");
static_assert(offsetof(WB_CampSkillWindow_C_IsItAvobeScrollBar, OutParam) == 0x000000, "Member 'WB_CampSkillWindow_C_IsItAvobeScrollBar::OutParam' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.GetScrollBarValue
// 0x0008 (0x0008 - 0x0000)
struct WB_CampSkillWindow_C_GetScrollBarValue final
{
public:
	float                                         OutValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RetValue;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampSkillWindow_C_GetScrollBarValue) == 0x000004, "Wrong alignment on WB_CampSkillWindow_C_GetScrollBarValue");
static_assert(sizeof(WB_CampSkillWindow_C_GetScrollBarValue) == 0x000008, "Wrong size on WB_CampSkillWindow_C_GetScrollBarValue");
static_assert(offsetof(WB_CampSkillWindow_C_GetScrollBarValue, OutValue) == 0x000000, "Member 'WB_CampSkillWindow_C_GetScrollBarValue::OutValue' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_GetScrollBarValue, RetValue) == 0x000004, "Member 'WB_CampSkillWindow_C_GetScrollBarValue::RetValue' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.DisableListMouseFocus
// 0x0018 (0x0018 - 0x0000)
struct WB_CampSkillWindow_C_DisableListMouseFocus final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CampSkillList_C*                    CallFunc_GetCampSkillList_OutList;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampSkillWindow_C_DisableListMouseFocus) == 0x000008, "Wrong alignment on WB_CampSkillWindow_C_DisableListMouseFocus");
static_assert(sizeof(WB_CampSkillWindow_C_DisableListMouseFocus) == 0x000018, "Wrong size on WB_CampSkillWindow_C_DisableListMouseFocus");
static_assert(offsetof(WB_CampSkillWindow_C_DisableListMouseFocus, Temp_int_Variable) == 0x000000, "Member 'WB_CampSkillWindow_C_DisableListMouseFocus::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_DisableListMouseFocus, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WB_CampSkillWindow_C_DisableListMouseFocus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_DisableListMouseFocus, CallFunc_GetCampSkillList_OutList) == 0x000008, "Member 'WB_CampSkillWindow_C_DisableListMouseFocus::CallFunc_GetCampSkillList_OutList' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_DisableListMouseFocus, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'WB_CampSkillWindow_C_DisableListMouseFocus::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.EnableListMouseFocus
// 0x0018 (0x0018 - 0x0000)
struct WB_CampSkillWindow_C_EnableListMouseFocus final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CampSkillList_C*                    CallFunc_GetCampSkillList_OutList;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampSkillWindow_C_EnableListMouseFocus) == 0x000008, "Wrong alignment on WB_CampSkillWindow_C_EnableListMouseFocus");
static_assert(sizeof(WB_CampSkillWindow_C_EnableListMouseFocus) == 0x000018, "Wrong size on WB_CampSkillWindow_C_EnableListMouseFocus");
static_assert(offsetof(WB_CampSkillWindow_C_EnableListMouseFocus, Temp_int_Variable) == 0x000000, "Member 'WB_CampSkillWindow_C_EnableListMouseFocus::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_EnableListMouseFocus, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WB_CampSkillWindow_C_EnableListMouseFocus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_EnableListMouseFocus, CallFunc_GetCampSkillList_OutList) == 0x000008, "Member 'WB_CampSkillWindow_C_EnableListMouseFocus::CallFunc_GetCampSkillList_OutList' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_EnableListMouseFocus, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'WB_CampSkillWindow_C_EnableListMouseFocus::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.GetMouseHovered
// 0x0020 (0x0020 - 0x0000)
struct WB_CampSkillWindow_C_GetMouseHovered final
{
public:
	int32                                         OutIndex;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Retindex;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CampSkillList_C*                    CallFunc_GetCampSkillList_OutList;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItHovered_RetHovered;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampSkillWindow_C_GetMouseHovered) == 0x000008, "Wrong alignment on WB_CampSkillWindow_C_GetMouseHovered");
static_assert(sizeof(WB_CampSkillWindow_C_GetMouseHovered) == 0x000020, "Wrong size on WB_CampSkillWindow_C_GetMouseHovered");
static_assert(offsetof(WB_CampSkillWindow_C_GetMouseHovered, OutIndex) == 0x000000, "Member 'WB_CampSkillWindow_C_GetMouseHovered::OutIndex' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_GetMouseHovered, Retindex) == 0x000004, "Member 'WB_CampSkillWindow_C_GetMouseHovered::Retindex' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_GetMouseHovered, Temp_int_Variable) == 0x000008, "Member 'WB_CampSkillWindow_C_GetMouseHovered::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_GetMouseHovered, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WB_CampSkillWindow_C_GetMouseHovered::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_GetMouseHovered, CallFunc_GetCampSkillList_OutList) == 0x000010, "Member 'WB_CampSkillWindow_C_GetMouseHovered::CallFunc_GetCampSkillList_OutList' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_GetMouseHovered, CallFunc_IsItHovered_RetHovered) == 0x000018, "Member 'WB_CampSkillWindow_C_GetMouseHovered::CallFunc_IsItHovered_RetHovered' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_GetMouseHovered, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000019, "Member 'WB_CampSkillWindow_C_GetMouseHovered::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.GetMouseOnClicked
// 0x0020 (0x0020 - 0x0000)
struct WB_CampSkillWindow_C_GetMouseOnClicked final
{
public:
	int32                                         OutIndex;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Retindex;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CampSkillList_C*                    CallFunc_GetCampSkillList_OutList;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItClicked_OutClicked;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampSkillWindow_C_GetMouseOnClicked) == 0x000008, "Wrong alignment on WB_CampSkillWindow_C_GetMouseOnClicked");
static_assert(sizeof(WB_CampSkillWindow_C_GetMouseOnClicked) == 0x000020, "Wrong size on WB_CampSkillWindow_C_GetMouseOnClicked");
static_assert(offsetof(WB_CampSkillWindow_C_GetMouseOnClicked, OutIndex) == 0x000000, "Member 'WB_CampSkillWindow_C_GetMouseOnClicked::OutIndex' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_GetMouseOnClicked, Retindex) == 0x000004, "Member 'WB_CampSkillWindow_C_GetMouseOnClicked::Retindex' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_GetMouseOnClicked, Temp_int_Variable) == 0x000008, "Member 'WB_CampSkillWindow_C_GetMouseOnClicked::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_GetMouseOnClicked, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WB_CampSkillWindow_C_GetMouseOnClicked::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_GetMouseOnClicked, CallFunc_GetCampSkillList_OutList) == 0x000010, "Member 'WB_CampSkillWindow_C_GetMouseOnClicked::CallFunc_GetCampSkillList_OutList' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_GetMouseOnClicked, CallFunc_IsItClicked_OutClicked) == 0x000018, "Member 'WB_CampSkillWindow_C_GetMouseOnClicked::CallFunc_IsItClicked_OutClicked' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_GetMouseOnClicked, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000019, "Member 'WB_CampSkillWindow_C_GetMouseOnClicked::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.ResetMouseFlag
// 0x0018 (0x0018 - 0x0000)
struct WB_CampSkillWindow_C_ResetMouseFlag final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CampSkillList_C*                    CallFunc_GetCampSkillList_OutList;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampSkillWindow_C_ResetMouseFlag) == 0x000008, "Wrong alignment on WB_CampSkillWindow_C_ResetMouseFlag");
static_assert(sizeof(WB_CampSkillWindow_C_ResetMouseFlag) == 0x000018, "Wrong size on WB_CampSkillWindow_C_ResetMouseFlag");
static_assert(offsetof(WB_CampSkillWindow_C_ResetMouseFlag, Temp_int_Variable) == 0x000000, "Member 'WB_CampSkillWindow_C_ResetMouseFlag::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_ResetMouseFlag, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WB_CampSkillWindow_C_ResetMouseFlag::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_ResetMouseFlag, CallFunc_GetCampSkillList_OutList) == 0x000008, "Member 'WB_CampSkillWindow_C_ResetMouseFlag::CallFunc_GetCampSkillList_OutList' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_ResetMouseFlag, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'WB_CampSkillWindow_C_ResetMouseFlag::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.SetUseSkillType
// 0x0008 (0x0008 - 0x0000)
struct WB_CampSkillWindow_C_SetUseSkillType final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InUseType;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampSkillWindow_C_SetUseSkillType) == 0x000004, "Wrong alignment on WB_CampSkillWindow_C_SetUseSkillType");
static_assert(sizeof(WB_CampSkillWindow_C_SetUseSkillType) == 0x000008, "Wrong size on WB_CampSkillWindow_C_SetUseSkillType");
static_assert(offsetof(WB_CampSkillWindow_C_SetUseSkillType, InIndex) == 0x000000, "Member 'WB_CampSkillWindow_C_SetUseSkillType::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetUseSkillType, InUseType) == 0x000004, "Member 'WB_CampSkillWindow_C_SetUseSkillType::InUseType' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.CalcSkillListAnimation_UseSkill
// 0x0003 (0x0003 - 0x0000)
struct WB_CampSkillWindow_C_CalcSkillListAnimation_UseSkill final
{
public:
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampSkillWindow_C_CalcSkillListAnimation_UseSkill) == 0x000001, "Wrong alignment on WB_CampSkillWindow_C_CalcSkillListAnimation_UseSkill");
static_assert(sizeof(WB_CampSkillWindow_C_CalcSkillListAnimation_UseSkill) == 0x000003, "Wrong size on WB_CampSkillWindow_C_CalcSkillListAnimation_UseSkill");
static_assert(offsetof(WB_CampSkillWindow_C_CalcSkillListAnimation_UseSkill, K2Node_SwitchInteger_CmpSuccess) == 0x000000, "Member 'WB_CampSkillWindow_C_CalcSkillListAnimation_UseSkill::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_CalcSkillListAnimation_UseSkill, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000001, "Member 'WB_CampSkillWindow_C_CalcSkillListAnimation_UseSkill::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_CalcSkillListAnimation_UseSkill, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000002, "Member 'WB_CampSkillWindow_C_CalcSkillListAnimation_UseSkill::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.StopListAnimation
// 0x0001 (0x0001 - 0x0000)
struct WB_CampSkillWindow_C_StopListAnimation final
{
public:
	bool                                          CallFunc_StopUseSkillListAnimation_ReturnValue;    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampSkillWindow_C_StopListAnimation) == 0x000001, "Wrong alignment on WB_CampSkillWindow_C_StopListAnimation");
static_assert(sizeof(WB_CampSkillWindow_C_StopListAnimation) == 0x000001, "Wrong size on WB_CampSkillWindow_C_StopListAnimation");
static_assert(offsetof(WB_CampSkillWindow_C_StopListAnimation, CallFunc_StopUseSkillListAnimation_ReturnValue) == 0x000000, "Member 'WB_CampSkillWindow_C_StopListAnimation::CallFunc_StopUseSkillListAnimation_ReturnValue' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.SetInitializeListAnimation
// 0x0018 (0x0018 - 0x0000)
struct WB_CampSkillWindow_C_SetInitializeListAnimation final
{
public:
	int32                                         InStepCount;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InType;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InAmimeType;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InCursorOn;                                        // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9323[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampSkillList_C*                    CallFunc_GetCampSkillList_OutList;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampSkillWindow_C_SetInitializeListAnimation) == 0x000008, "Wrong alignment on WB_CampSkillWindow_C_SetInitializeListAnimation");
static_assert(sizeof(WB_CampSkillWindow_C_SetInitializeListAnimation) == 0x000018, "Wrong size on WB_CampSkillWindow_C_SetInitializeListAnimation");
static_assert(offsetof(WB_CampSkillWindow_C_SetInitializeListAnimation, InStepCount) == 0x000000, "Member 'WB_CampSkillWindow_C_SetInitializeListAnimation::InStepCount' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetInitializeListAnimation, InType) == 0x000004, "Member 'WB_CampSkillWindow_C_SetInitializeListAnimation::InType' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetInitializeListAnimation, InAmimeType) == 0x000008, "Member 'WB_CampSkillWindow_C_SetInitializeListAnimation::InAmimeType' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetInitializeListAnimation, InCursorOn) == 0x00000C, "Member 'WB_CampSkillWindow_C_SetInitializeListAnimation::InCursorOn' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetInitializeListAnimation, CallFunc_GetCampSkillList_OutList) == 0x000010, "Member 'WB_CampSkillWindow_C_SetInitializeListAnimation::CallFunc_GetCampSkillList_OutList' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.CalcSkillListAnimation
// 0x0010 (0x0010 - 0x0000)
struct WB_CampSkillWindow_C_CalcSkillListAnimation final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StopUseSkillListAnimation_ReturnValue;    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9324[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CalcUseSkillListAnimation_ReturnValue;    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampSkillWindow_C_CalcSkillListAnimation) == 0x000004, "Wrong alignment on WB_CampSkillWindow_C_CalcSkillListAnimation");
static_assert(sizeof(WB_CampSkillWindow_C_CalcSkillListAnimation) == 0x000010, "Wrong size on WB_CampSkillWindow_C_CalcSkillListAnimation");
static_assert(offsetof(WB_CampSkillWindow_C_CalcSkillListAnimation, InDeltaTime) == 0x000000, "Member 'WB_CampSkillWindow_C_CalcSkillListAnimation::InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_CalcSkillListAnimation, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_CampSkillWindow_C_CalcSkillListAnimation::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_CalcSkillListAnimation, CallFunc_StopUseSkillListAnimation_ReturnValue) == 0x000005, "Member 'WB_CampSkillWindow_C_CalcSkillListAnimation::CallFunc_StopUseSkillListAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_CalcSkillListAnimation, CallFunc_CalcUseSkillListAnimation_ReturnValue) == 0x000008, "Member 'WB_CampSkillWindow_C_CalcSkillListAnimation::CallFunc_CalcUseSkillListAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_CalcSkillListAnimation, K2Node_SwitchInteger_CmpSuccess_1) == 0x00000C, "Member 'WB_CampSkillWindow_C_CalcSkillListAnimation::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.Start Use Skill List Animation
// 0x000C (0x000C - 0x0000)
struct WB_CampSkillWindow_C_Start_Use_Skill_List_Animation final
{
public:
	bool                                          InListAnimationFlag;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InDarkMaskOn;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9325[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InDisplayMax;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartUseSkillListAnimation_ReturnValue;   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampSkillWindow_C_Start_Use_Skill_List_Animation) == 0x000004, "Wrong alignment on WB_CampSkillWindow_C_Start_Use_Skill_List_Animation");
static_assert(sizeof(WB_CampSkillWindow_C_Start_Use_Skill_List_Animation) == 0x00000C, "Wrong size on WB_CampSkillWindow_C_Start_Use_Skill_List_Animation");
static_assert(offsetof(WB_CampSkillWindow_C_Start_Use_Skill_List_Animation, InListAnimationFlag) == 0x000000, "Member 'WB_CampSkillWindow_C_Start_Use_Skill_List_Animation::InListAnimationFlag' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_Start_Use_Skill_List_Animation, InDarkMaskOn) == 0x000001, "Member 'WB_CampSkillWindow_C_Start_Use_Skill_List_Animation::InDarkMaskOn' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_Start_Use_Skill_List_Animation, InDisplayMax) == 0x000004, "Member 'WB_CampSkillWindow_C_Start_Use_Skill_List_Animation::InDisplayMax' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_Start_Use_Skill_List_Animation, CallFunc_StartUseSkillListAnimation_ReturnValue) == 0x000008, "Member 'WB_CampSkillWindow_C_Start_Use_Skill_List_Animation::CallFunc_StartUseSkillListAnimation_ReturnValue' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.SetPanelBlank
// 0x0020 (0x0020 - 0x0000)
struct WB_CampSkillWindow_C_SetPanelBlank final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InBlankType;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InFaceIconId;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InUseSkill;                                        // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InDispOn;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InDispOnFaceIcon;                                  // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InDispOnMagatsuhi;                                 // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9326[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampSkillList_C*                    CallFunc_GetCampSkillList_OutList;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampSkillWindow_C_SetPanelBlank) == 0x000008, "Wrong alignment on WB_CampSkillWindow_C_SetPanelBlank");
static_assert(sizeof(WB_CampSkillWindow_C_SetPanelBlank) == 0x000020, "Wrong size on WB_CampSkillWindow_C_SetPanelBlank");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelBlank, InIndex) == 0x000000, "Member 'WB_CampSkillWindow_C_SetPanelBlank::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelBlank, InBlankType) == 0x000004, "Member 'WB_CampSkillWindow_C_SetPanelBlank::InBlankType' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelBlank, InFaceIconId) == 0x000008, "Member 'WB_CampSkillWindow_C_SetPanelBlank::InFaceIconId' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelBlank, InUseSkill) == 0x00000C, "Member 'WB_CampSkillWindow_C_SetPanelBlank::InUseSkill' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelBlank, InDispOn) == 0x000010, "Member 'WB_CampSkillWindow_C_SetPanelBlank::InDispOn' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelBlank, InDispOnFaceIcon) == 0x000011, "Member 'WB_CampSkillWindow_C_SetPanelBlank::InDispOnFaceIcon' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelBlank, InDispOnMagatsuhi) == 0x000012, "Member 'WB_CampSkillWindow_C_SetPanelBlank::InDispOnMagatsuhi' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelBlank, CallFunc_GetCampSkillList_OutList) == 0x000018, "Member 'WB_CampSkillWindow_C_SetPanelBlank::CallFunc_GetCampSkillList_OutList' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.IsMagatsuhiGaugeAnimationEnd
// 0x0002 (0x0002 - 0x0000)
struct WB_CampSkillWindow_C_IsMagatsuhiGaugeAnimationEnd final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampSkillWindow_C_IsMagatsuhiGaugeAnimationEnd) == 0x000001, "Wrong alignment on WB_CampSkillWindow_C_IsMagatsuhiGaugeAnimationEnd");
static_assert(sizeof(WB_CampSkillWindow_C_IsMagatsuhiGaugeAnimationEnd) == 0x000002, "Wrong size on WB_CampSkillWindow_C_IsMagatsuhiGaugeAnimationEnd");
static_assert(offsetof(WB_CampSkillWindow_C_IsMagatsuhiGaugeAnimationEnd, OutFinished) == 0x000000, "Member 'WB_CampSkillWindow_C_IsMagatsuhiGaugeAnimationEnd::OutFinished' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_IsMagatsuhiGaugeAnimationEnd, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'WB_CampSkillWindow_C_IsMagatsuhiGaugeAnimationEnd::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.SetPanelMagatsuhi
// 0x0028 (0x0028 - 0x0000)
struct WB_CampSkillWindow_C_SetPanelMagatsuhi final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InSkillId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InFaceIconId;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InCost;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InUseSkill;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InTekiseiParam;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InUseType;                                         // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InDispOn;                                          // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9327[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampSkillList_C*                    CallFunc_GetCampSkillList_OutList;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampSkillWindow_C_SetPanelMagatsuhi) == 0x000008, "Wrong alignment on WB_CampSkillWindow_C_SetPanelMagatsuhi");
static_assert(sizeof(WB_CampSkillWindow_C_SetPanelMagatsuhi) == 0x000028, "Wrong size on WB_CampSkillWindow_C_SetPanelMagatsuhi");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelMagatsuhi, InIndex) == 0x000000, "Member 'WB_CampSkillWindow_C_SetPanelMagatsuhi::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelMagatsuhi, InSkillId) == 0x000004, "Member 'WB_CampSkillWindow_C_SetPanelMagatsuhi::InSkillId' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelMagatsuhi, InFaceIconId) == 0x000008, "Member 'WB_CampSkillWindow_C_SetPanelMagatsuhi::InFaceIconId' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelMagatsuhi, InCost) == 0x00000C, "Member 'WB_CampSkillWindow_C_SetPanelMagatsuhi::InCost' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelMagatsuhi, InUseSkill) == 0x000010, "Member 'WB_CampSkillWindow_C_SetPanelMagatsuhi::InUseSkill' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelMagatsuhi, InTekiseiParam) == 0x000014, "Member 'WB_CampSkillWindow_C_SetPanelMagatsuhi::InTekiseiParam' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelMagatsuhi, InUseType) == 0x000018, "Member 'WB_CampSkillWindow_C_SetPanelMagatsuhi::InUseType' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelMagatsuhi, InDispOn) == 0x00001C, "Member 'WB_CampSkillWindow_C_SetPanelMagatsuhi::InDispOn' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelMagatsuhi, CallFunc_GetCampSkillList_OutList) == 0x000020, "Member 'WB_CampSkillWindow_C_SetPanelMagatsuhi::CallFunc_GetCampSkillList_OutList' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.IsSkillListAnimationEnd
// 0x0018 (0x0018 - 0x0000)
struct WB_CampSkillWindow_C_IsSkillListAnimationEnd final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9328[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CampSkillList_C*                    CallFunc_GetCampSkillList_OutList;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationEnd_OutParam;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9329[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampSkillWindow_C_IsSkillListAnimationEnd) == 0x000008, "Wrong alignment on WB_CampSkillWindow_C_IsSkillListAnimationEnd");
static_assert(sizeof(WB_CampSkillWindow_C_IsSkillListAnimationEnd) == 0x000018, "Wrong size on WB_CampSkillWindow_C_IsSkillListAnimationEnd");
static_assert(offsetof(WB_CampSkillWindow_C_IsSkillListAnimationEnd, OutFinished) == 0x000000, "Member 'WB_CampSkillWindow_C_IsSkillListAnimationEnd::OutFinished' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_IsSkillListAnimationEnd, Temp_int_Variable) == 0x000004, "Member 'WB_CampSkillWindow_C_IsSkillListAnimationEnd::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_IsSkillListAnimationEnd, CallFunc_GetCampSkillList_OutList) == 0x000008, "Member 'WB_CampSkillWindow_C_IsSkillListAnimationEnd::CallFunc_GetCampSkillList_OutList' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_IsSkillListAnimationEnd, CallFunc_IsAnimationEnd_OutParam) == 0x000010, "Member 'WB_CampSkillWindow_C_IsSkillListAnimationEnd::CallFunc_IsAnimationEnd_OutParam' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_IsSkillListAnimationEnd, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000011, "Member 'WB_CampSkillWindow_C_IsSkillListAnimationEnd::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_IsSkillListAnimationEnd, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WB_CampSkillWindow_C_IsSkillListAnimationEnd::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.SetFaceIconColor
// 0x0010 (0x0010 - 0x0000)
struct WB_CampSkillWindow_C_SetFaceIconColor final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InType;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CampSkillList_C*                    CallFunc_GetCampSkillList_OutList;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampSkillWindow_C_SetFaceIconColor) == 0x000008, "Wrong alignment on WB_CampSkillWindow_C_SetFaceIconColor");
static_assert(sizeof(WB_CampSkillWindow_C_SetFaceIconColor) == 0x000010, "Wrong size on WB_CampSkillWindow_C_SetFaceIconColor");
static_assert(offsetof(WB_CampSkillWindow_C_SetFaceIconColor, InIndex) == 0x000000, "Member 'WB_CampSkillWindow_C_SetFaceIconColor::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetFaceIconColor, InType) == 0x000004, "Member 'WB_CampSkillWindow_C_SetFaceIconColor::InType' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetFaceIconColor, CallFunc_GetCampSkillList_OutList) == 0x000008, "Member 'WB_CampSkillWindow_C_SetFaceIconColor::CallFunc_GetCampSkillList_OutList' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.SetSkillScrollRate
// 0x0004 (0x0004 - 0x0000)
struct WB_CampSkillWindow_C_SetSkillScrollRate final
{
public:
	float                                         InRate;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampSkillWindow_C_SetSkillScrollRate) == 0x000004, "Wrong alignment on WB_CampSkillWindow_C_SetSkillScrollRate");
static_assert(sizeof(WB_CampSkillWindow_C_SetSkillScrollRate) == 0x000004, "Wrong size on WB_CampSkillWindow_C_SetSkillScrollRate");
static_assert(offsetof(WB_CampSkillWindow_C_SetSkillScrollRate, InRate) == 0x000000, "Member 'WB_CampSkillWindow_C_SetSkillScrollRate::InRate' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.SkillScrollBarOut
// 0x0001 (0x0001 - 0x0000)
struct WB_CampSkillWindow_C_SkillScrollBarOut final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampSkillWindow_C_SkillScrollBarOut) == 0x000001, "Wrong alignment on WB_CampSkillWindow_C_SkillScrollBarOut");
static_assert(sizeof(WB_CampSkillWindow_C_SkillScrollBarOut) == 0x000001, "Wrong size on WB_CampSkillWindow_C_SkillScrollBarOut");
static_assert(offsetof(WB_CampSkillWindow_C_SkillScrollBarOut, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampSkillWindow_C_SkillScrollBarOut::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.SkillScrollBarIn
// 0x0001 (0x0001 - 0x0000)
struct WB_CampSkillWindow_C_SkillScrollBarIn final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampSkillWindow_C_SkillScrollBarIn) == 0x000001, "Wrong alignment on WB_CampSkillWindow_C_SkillScrollBarIn");
static_assert(sizeof(WB_CampSkillWindow_C_SkillScrollBarIn) == 0x000001, "Wrong size on WB_CampSkillWindow_C_SkillScrollBarIn");
static_assert(offsetof(WB_CampSkillWindow_C_SkillScrollBarIn, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampSkillWindow_C_SkillScrollBarIn::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.CampSkillDarkMaskOff
// 0x0010 (0x0010 - 0x0000)
struct WB_CampSkillWindow_C_CampSkillDarkMaskOff final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_932A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampSkillList_C*                    CallFunc_GetCampSkillList_OutList;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampSkillWindow_C_CampSkillDarkMaskOff) == 0x000008, "Wrong alignment on WB_CampSkillWindow_C_CampSkillDarkMaskOff");
static_assert(sizeof(WB_CampSkillWindow_C_CampSkillDarkMaskOff) == 0x000010, "Wrong size on WB_CampSkillWindow_C_CampSkillDarkMaskOff");
static_assert(offsetof(WB_CampSkillWindow_C_CampSkillDarkMaskOff, InIndex) == 0x000000, "Member 'WB_CampSkillWindow_C_CampSkillDarkMaskOff::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_CampSkillDarkMaskOff, CallFunc_GetCampSkillList_OutList) == 0x000008, "Member 'WB_CampSkillWindow_C_CampSkillDarkMaskOff::CallFunc_GetCampSkillList_OutList' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.CampSkillDarkMaskOn
// 0x0010 (0x0010 - 0x0000)
struct WB_CampSkillWindow_C_CampSkillDarkMaskOn final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_932B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampSkillList_C*                    CallFunc_GetCampSkillList_OutList;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampSkillWindow_C_CampSkillDarkMaskOn) == 0x000008, "Wrong alignment on WB_CampSkillWindow_C_CampSkillDarkMaskOn");
static_assert(sizeof(WB_CampSkillWindow_C_CampSkillDarkMaskOn) == 0x000010, "Wrong size on WB_CampSkillWindow_C_CampSkillDarkMaskOn");
static_assert(offsetof(WB_CampSkillWindow_C_CampSkillDarkMaskOn, InIndex) == 0x000000, "Member 'WB_CampSkillWindow_C_CampSkillDarkMaskOn::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_CampSkillDarkMaskOn, CallFunc_GetCampSkillList_OutList) == 0x000008, "Member 'WB_CampSkillWindow_C_CampSkillDarkMaskOn::CallFunc_GetCampSkillList_OutList' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.SetPanelSkillNameColor
// 0x0010 (0x0010 - 0x0000)
struct WB_CampSkillWindow_C_SetPanelSkillNameColor final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InUseSkill;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CampSkillList_C*                    CallFunc_GetCampSkillList_OutList;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampSkillWindow_C_SetPanelSkillNameColor) == 0x000008, "Wrong alignment on WB_CampSkillWindow_C_SetPanelSkillNameColor");
static_assert(sizeof(WB_CampSkillWindow_C_SetPanelSkillNameColor) == 0x000010, "Wrong size on WB_CampSkillWindow_C_SetPanelSkillNameColor");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelSkillNameColor, InIndex) == 0x000000, "Member 'WB_CampSkillWindow_C_SetPanelSkillNameColor::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelSkillNameColor, InUseSkill) == 0x000004, "Member 'WB_CampSkillWindow_C_SetPanelSkillNameColor::InUseSkill' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetPanelSkillNameColor, CallFunc_GetCampSkillList_OutList) == 0x000008, "Member 'WB_CampSkillWindow_C_SetPanelSkillNameColor::CallFunc_GetCampSkillList_OutList' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.SkillTitleOff
// 0x0002 (0x0002 - 0x0000)
struct WB_CampSkillWindow_C_SkillTitleOff final
{
public:
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampSkillWindow_C_SkillTitleOff) == 0x000001, "Wrong alignment on WB_CampSkillWindow_C_SkillTitleOff");
static_assert(sizeof(WB_CampSkillWindow_C_SkillTitleOff) == 0x000002, "Wrong size on WB_CampSkillWindow_C_SkillTitleOff");
static_assert(offsetof(WB_CampSkillWindow_C_SkillTitleOff, CallFunc_IsInViewport_ReturnValue) == 0x000000, "Member 'WB_CampSkillWindow_C_SkillTitleOff::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SkillTitleOff, CallFunc_Play_ReturnValue) == 0x000001, "Member 'WB_CampSkillWindow_C_SkillTitleOff::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.SkillTitleOn
// 0x0001 (0x0001 - 0x0000)
struct WB_CampSkillWindow_C_SkillTitleOn final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampSkillWindow_C_SkillTitleOn) == 0x000001, "Wrong alignment on WB_CampSkillWindow_C_SkillTitleOn");
static_assert(sizeof(WB_CampSkillWindow_C_SkillTitleOn) == 0x000001, "Wrong size on WB_CampSkillWindow_C_SkillTitleOn");
static_assert(offsetof(WB_CampSkillWindow_C_SkillTitleOn, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampSkillWindow_C_SkillTitleOn::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampSkillWindow.WB_CampSkillWindow_C.SetInitPosition
// 0x0068 (0x0068 - 0x0000)
struct WB_CampSkillWindow_C_SetInitPosition final
{
public:
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec_1;   // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_932C[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampSkillList_C*                    CallFunc_GetCampSkillList_OutList;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_932D[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec_2;   // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampSkillWindow_C_SetInitPosition) == 0x000008, "Wrong alignment on WB_CampSkillWindow_C_SetInitPosition");
static_assert(sizeof(WB_CampSkillWindow_C_SetInitPosition) == 0x000068, "Wrong size on WB_CampSkillWindow_C_SetInitPosition");
static_assert(offsetof(WB_CampSkillWindow_C_SetInitPosition, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000000, "Member 'WB_CampSkillWindow_C_SetInitPosition::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetInitPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec) == 0x000008, "Member 'WB_CampSkillWindow_C_SetInitPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetInitPosition, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000010, "Member 'WB_CampSkillWindow_C_SetInitPosition::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetInitPosition, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000018, "Member 'WB_CampSkillWindow_C_SetInitPosition::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_CampSkillWindow_C_SetInitPosition, Temp_int_Variable) == 0x000020, "Member 'WB_CampSkillWindow_C_SetInitPosition::Temp_int_Variable' has a wrong offset!");
