#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CampCharaPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_CampCharaPanel.WB_CampCharaPanel_C
// 0x0140 (0x03A0 - 0x0260)
class UWB_CampCharaPanel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_AnalyzeNoData;                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_DevilStock;                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Party;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanelCharaPanelArea;                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MainCanvas;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMessageSimpleTextWidget*               MessageSimpleTextAnalyzeNoData;                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerDevilStock;                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerMainMember;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerMainPartition;                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerPosition;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerScroll;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerStockMember;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerStockPartition;                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerWidget_AnalyzeNoData;                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CampNumSelector_C*                  WB_CampNumSelector;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CharaPanel_C*                       WB_CharaPanel_10;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CharaPanel_C*                       WB_CharaPanel_11;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CharaPanel_C*                       WB_CharaPanel_12;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CharaPanel_C*                       WB_CharaPanel_13;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CharaPanel_C*                       WB_CharaPanel_14;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CharaPanel_C*                       WB_CharaPanel_15;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CharaPanel_C*                       WB_CharaPanel_00;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CharaPanel_C*                       WB_CharaPanel_01;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CharaPanel_C*                       WB_CharaPanel_02;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CharaPanel_C*                       WB_CharaPanel_03;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CharaPanel_C*                       WB_CharaPanel_04;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CharaPanel_C*                       WB_CharaPanel_05;                                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CharaPanel_C*                       WB_CharaPanel_06;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CharaPanel_C*                       WB_CharaPanel_07;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CharaPanel_C*                       WB_CharaPanel_08;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CharaPanel_C*                       WB_CharaPanel_09;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_NNumberIcon01_C*                    WB_NNumberIcon01Denominator;                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_NNumberIcon01_C*                    WB_NNumberIcon01Numerator;                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_NSlashIcon01_C*                     WB_NSlashIcon01;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ScrollBar_C*                        WB_ScrollBar;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Stocknumber;                                       // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stockmax;                                          // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsExistScrollBar;                                  // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsItScrollBar;                                     // 0x0389(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89FC[0x2];                                     // 0x038A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Scrollbarvalue;                                    // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClickedMouseEvent;                               // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WB_CampCharaPanel(int32 EntryPoint);
	void OnClickedMouseEvent__DelegateSignature(bool InClickedUp);
	void On_Clicked_Item_Num_Selector(bool IsClicked_UP);
	void UnbindItemNumSelectorEvent();
	void BindItemNumSelectorEvent();
	void SetWBItemNumSelectorPosition(const struct FVector2D& InPosition);
	void ItemNumSelectorOut();
	void SetItemNumSelectorAnimeDown();
	void SetItemNumSelectorAnimeUp();
	void ItemNumSelectorIn();
	void SetItemNumSelector(int32 InNumber);
	void SetScrollNumber(int32 InMaxNumber, int32 InDispNumber);
	void ResetScrollBarFlag();
	void IsPartyStockArea(bool* OutParam);
	void GetScrollBarValue(float* OutValue);
	void SetWBCharaPriority(int32 InIndex, int32 InPrio);
	void UtsusemiNoDataOff();
	void UtsusemiNoDataOn();
	void SetPanelScrollRate(float InRate);
	void PanelScrollBarOn();
	void PanelScrollBarOut();
	void PanelScrollBarIn();
	void SetNumberFontColor(int32 InColorType);
	void AnalyzeNoDataOff();
	void AnalyzeNoDataOn();
	void GetCategoryPosition(struct FVector2D* OutVector2D);
	void UpdateStockNumber();
	void SetStockNumber(int32 InNumber, int32 InMax);
	void MemberMenuOut(int32 InMenuType);
	void MemberMenuIn(int32 InMenuType);
	void SetMenuPosition(int32 InMenuType);
	void GetWBCharaPosition(int32 InIndex, struct FVector2D* OutVector2D);
	void SetWBCharaPosition(int32 InIndex, const struct FVector2D& InPosition);
	void CharaPanelOff();
	void CharaPanelOn();
	void GetWBCharaPanel(int32 InIndex, class UWB_CharaPanel_C** OutWidget);
	void BndEvt__WB_CampCharaPanel_WB_ScrollBar_K2Node_ComponentBoundEvent_0_OnScrolledByMouse__DelegateSignature(float Position);
	void BndEvt__SsPlayerPartition_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void BndEvt__SsPlayerStockPartition_K2Node_ComponentBoundEvent_5_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void BndEvt__SsPlayerMainMember_K2Node_ComponentBoundEvent_6_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void BndEvt__SsPlayerStockMember_K2Node_ComponentBoundEvent_7_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void BndEvt__SsPlayerDevilStock_K2Node_ComponentBoundEvent_8_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void BndEvt__SsPlayerWidget_AnalyzeNoData_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void BndEvt__SsPlayerScroll_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_CampCharaPanel_C">();
	}
	static class UWB_CampCharaPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_CampCharaPanel_C>();
	}
};
static_assert(alignof(UWB_CampCharaPanel_C) == 0x000008, "Wrong alignment on UWB_CampCharaPanel_C");
static_assert(sizeof(UWB_CampCharaPanel_C) == 0x0003A0, "Wrong size on UWB_CampCharaPanel_C");
static_assert(offsetof(UWB_CampCharaPanel_C, UberGraphFrame) == 0x000260, "Member 'UWB_CampCharaPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, CanvasPanel_AnalyzeNoData) == 0x000268, "Member 'UWB_CampCharaPanel_C::CanvasPanel_AnalyzeNoData' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, CanvasPanel_DevilStock) == 0x000270, "Member 'UWB_CampCharaPanel_C::CanvasPanel_DevilStock' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, CanvasPanel_Party) == 0x000278, "Member 'UWB_CampCharaPanel_C::CanvasPanel_Party' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, CanvasPanelCharaPanelArea) == 0x000280, "Member 'UWB_CampCharaPanel_C::CanvasPanelCharaPanelArea' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, MainCanvas) == 0x000288, "Member 'UWB_CampCharaPanel_C::MainCanvas' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, MessageSimpleTextAnalyzeNoData) == 0x000290, "Member 'UWB_CampCharaPanel_C::MessageSimpleTextAnalyzeNoData' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, SsPlayerDevilStock) == 0x000298, "Member 'UWB_CampCharaPanel_C::SsPlayerDevilStock' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, SsPlayerMainMember) == 0x0002A0, "Member 'UWB_CampCharaPanel_C::SsPlayerMainMember' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, SsPlayerMainPartition) == 0x0002A8, "Member 'UWB_CampCharaPanel_C::SsPlayerMainPartition' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, SsPlayerPosition) == 0x0002B0, "Member 'UWB_CampCharaPanel_C::SsPlayerPosition' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, SsPlayerScroll) == 0x0002B8, "Member 'UWB_CampCharaPanel_C::SsPlayerScroll' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, SsPlayerStockMember) == 0x0002C0, "Member 'UWB_CampCharaPanel_C::SsPlayerStockMember' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, SsPlayerStockPartition) == 0x0002C8, "Member 'UWB_CampCharaPanel_C::SsPlayerStockPartition' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, SsPlayerWidget_AnalyzeNoData) == 0x0002D0, "Member 'UWB_CampCharaPanel_C::SsPlayerWidget_AnalyzeNoData' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, WB_CampNumSelector) == 0x0002D8, "Member 'UWB_CampCharaPanel_C::WB_CampNumSelector' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, WB_CharaPanel_10) == 0x0002E0, "Member 'UWB_CampCharaPanel_C::WB_CharaPanel_10' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, WB_CharaPanel_11) == 0x0002E8, "Member 'UWB_CampCharaPanel_C::WB_CharaPanel_11' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, WB_CharaPanel_12) == 0x0002F0, "Member 'UWB_CampCharaPanel_C::WB_CharaPanel_12' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, WB_CharaPanel_13) == 0x0002F8, "Member 'UWB_CampCharaPanel_C::WB_CharaPanel_13' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, WB_CharaPanel_14) == 0x000300, "Member 'UWB_CampCharaPanel_C::WB_CharaPanel_14' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, WB_CharaPanel_15) == 0x000308, "Member 'UWB_CampCharaPanel_C::WB_CharaPanel_15' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, WB_CharaPanel_00) == 0x000310, "Member 'UWB_CampCharaPanel_C::WB_CharaPanel_00' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, WB_CharaPanel_01) == 0x000318, "Member 'UWB_CampCharaPanel_C::WB_CharaPanel_01' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, WB_CharaPanel_02) == 0x000320, "Member 'UWB_CampCharaPanel_C::WB_CharaPanel_02' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, WB_CharaPanel_03) == 0x000328, "Member 'UWB_CampCharaPanel_C::WB_CharaPanel_03' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, WB_CharaPanel_04) == 0x000330, "Member 'UWB_CampCharaPanel_C::WB_CharaPanel_04' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, WB_CharaPanel_05) == 0x000338, "Member 'UWB_CampCharaPanel_C::WB_CharaPanel_05' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, WB_CharaPanel_06) == 0x000340, "Member 'UWB_CampCharaPanel_C::WB_CharaPanel_06' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, WB_CharaPanel_07) == 0x000348, "Member 'UWB_CampCharaPanel_C::WB_CharaPanel_07' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, WB_CharaPanel_08) == 0x000350, "Member 'UWB_CampCharaPanel_C::WB_CharaPanel_08' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, WB_CharaPanel_09) == 0x000358, "Member 'UWB_CampCharaPanel_C::WB_CharaPanel_09' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, WB_NNumberIcon01Denominator) == 0x000360, "Member 'UWB_CampCharaPanel_C::WB_NNumberIcon01Denominator' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, WB_NNumberIcon01Numerator) == 0x000368, "Member 'UWB_CampCharaPanel_C::WB_NNumberIcon01Numerator' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, WB_NSlashIcon01) == 0x000370, "Member 'UWB_CampCharaPanel_C::WB_NSlashIcon01' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, WB_ScrollBar) == 0x000378, "Member 'UWB_CampCharaPanel_C::WB_ScrollBar' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, Stocknumber) == 0x000380, "Member 'UWB_CampCharaPanel_C::Stocknumber' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, Stockmax) == 0x000384, "Member 'UWB_CampCharaPanel_C::Stockmax' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, IsExistScrollBar) == 0x000388, "Member 'UWB_CampCharaPanel_C::IsExistScrollBar' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, IsItScrollBar) == 0x000389, "Member 'UWB_CampCharaPanel_C::IsItScrollBar' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, Scrollbarvalue) == 0x00038C, "Member 'UWB_CampCharaPanel_C::Scrollbarvalue' has a wrong offset!");
static_assert(offsetof(UWB_CampCharaPanel_C, OnClickedMouseEvent) == 0x000390, "Member 'UWB_CampCharaPanel_C::OnClickedMouseEvent' has a wrong offset!");

}

