#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CampHelpWindow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.SetScrollNumber
// 0x0008 (0x0008 - 0x0000)
struct WB_CampHelpWindow_C_SetScrollNumber final
{
public:
	int32                                         InMaxNumber;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InDispNumber;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampHelpWindow_C_SetScrollNumber) == 0x000004, "Wrong alignment on WB_CampHelpWindow_C_SetScrollNumber");
static_assert(sizeof(WB_CampHelpWindow_C_SetScrollNumber) == 0x000008, "Wrong size on WB_CampHelpWindow_C_SetScrollNumber");
static_assert(offsetof(WB_CampHelpWindow_C_SetScrollNumber, InMaxNumber) == 0x000000, "Member 'WB_CampHelpWindow_C_SetScrollNumber::InMaxNumber' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetScrollNumber, InDispNumber) == 0x000004, "Member 'WB_CampHelpWindow_C_SetScrollNumber::InDispNumber' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.GetNewIconFrame
// 0x0008 (0x0008 - 0x0000)
struct WB_CampHelpWindow_C_GetNewIconFrame final
{
public:
	float                                         OutFrame;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayFrame_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampHelpWindow_C_GetNewIconFrame) == 0x000004, "Wrong alignment on WB_CampHelpWindow_C_GetNewIconFrame");
static_assert(sizeof(WB_CampHelpWindow_C_GetNewIconFrame) == 0x000008, "Wrong size on WB_CampHelpWindow_C_GetNewIconFrame");
static_assert(offsetof(WB_CampHelpWindow_C_GetNewIconFrame, OutFrame) == 0x000000, "Member 'WB_CampHelpWindow_C_GetNewIconFrame::OutFrame' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_GetNewIconFrame, CallFunc_GetPlayFrame_ReturnValue) == 0x000004, "Member 'WB_CampHelpWindow_C_GetNewIconFrame::CallFunc_GetPlayFrame_ReturnValue' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.IsHelpListRectArea
// 0x0002 (0x0002 - 0x0000)
struct WB_CampHelpWindow_C_IsHelpListRectArea final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMouseOvered_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpWindow_C_IsHelpListRectArea) == 0x000001, "Wrong alignment on WB_CampHelpWindow_C_IsHelpListRectArea");
static_assert(sizeof(WB_CampHelpWindow_C_IsHelpListRectArea) == 0x000002, "Wrong size on WB_CampHelpWindow_C_IsHelpListRectArea");
static_assert(offsetof(WB_CampHelpWindow_C_IsHelpListRectArea, OutParam) == 0x000000, "Member 'WB_CampHelpWindow_C_IsHelpListRectArea::OutParam' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_IsHelpListRectArea, CallFunc_GetMouseOvered_ReturnValue) == 0x000001, "Member 'WB_CampHelpWindow_C_IsHelpListRectArea::CallFunc_GetMouseOvered_ReturnValue' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.IsItAvobeScrollBar
// 0x0001 (0x0001 - 0x0000)
struct WB_CampHelpWindow_C_IsItAvobeScrollBar final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpWindow_C_IsItAvobeScrollBar) == 0x000001, "Wrong alignment on WB_CampHelpWindow_C_IsItAvobeScrollBar");
static_assert(sizeof(WB_CampHelpWindow_C_IsItAvobeScrollBar) == 0x000001, "Wrong size on WB_CampHelpWindow_C_IsItAvobeScrollBar");
static_assert(offsetof(WB_CampHelpWindow_C_IsItAvobeScrollBar, OutParam) == 0x000000, "Member 'WB_CampHelpWindow_C_IsItAvobeScrollBar::OutParam' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.GetScrollBarValue
// 0x0008 (0x0008 - 0x0000)
struct WB_CampHelpWindow_C_GetScrollBarValue final
{
public:
	float                                         OutValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RetValue;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampHelpWindow_C_GetScrollBarValue) == 0x000004, "Wrong alignment on WB_CampHelpWindow_C_GetScrollBarValue");
static_assert(sizeof(WB_CampHelpWindow_C_GetScrollBarValue) == 0x000008, "Wrong size on WB_CampHelpWindow_C_GetScrollBarValue");
static_assert(offsetof(WB_CampHelpWindow_C_GetScrollBarValue, OutValue) == 0x000000, "Member 'WB_CampHelpWindow_C_GetScrollBarValue::OutValue' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_GetScrollBarValue, RetValue) == 0x000004, "Member 'WB_CampHelpWindow_C_GetScrollBarValue::RetValue' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.DisableListMouseFocus
// 0x0018 (0x0018 - 0x0000)
struct WB_CampHelpWindow_C_DisableListMouseFocus final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CampHelpList_C*                     CallFunc_GetCampHelpList_OutCampHelpList;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpWindow_C_DisableListMouseFocus) == 0x000008, "Wrong alignment on WB_CampHelpWindow_C_DisableListMouseFocus");
static_assert(sizeof(WB_CampHelpWindow_C_DisableListMouseFocus) == 0x000018, "Wrong size on WB_CampHelpWindow_C_DisableListMouseFocus");
static_assert(offsetof(WB_CampHelpWindow_C_DisableListMouseFocus, Temp_int_Variable) == 0x000000, "Member 'WB_CampHelpWindow_C_DisableListMouseFocus::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_DisableListMouseFocus, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WB_CampHelpWindow_C_DisableListMouseFocus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_DisableListMouseFocus, CallFunc_GetCampHelpList_OutCampHelpList) == 0x000008, "Member 'WB_CampHelpWindow_C_DisableListMouseFocus::CallFunc_GetCampHelpList_OutCampHelpList' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_DisableListMouseFocus, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'WB_CampHelpWindow_C_DisableListMouseFocus::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.EnableListMouseFocus
// 0x0018 (0x0018 - 0x0000)
struct WB_CampHelpWindow_C_EnableListMouseFocus final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CampHelpList_C*                     CallFunc_GetCampHelpList_OutCampHelpList;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpWindow_C_EnableListMouseFocus) == 0x000008, "Wrong alignment on WB_CampHelpWindow_C_EnableListMouseFocus");
static_assert(sizeof(WB_CampHelpWindow_C_EnableListMouseFocus) == 0x000018, "Wrong size on WB_CampHelpWindow_C_EnableListMouseFocus");
static_assert(offsetof(WB_CampHelpWindow_C_EnableListMouseFocus, Temp_int_Variable) == 0x000000, "Member 'WB_CampHelpWindow_C_EnableListMouseFocus::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_EnableListMouseFocus, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WB_CampHelpWindow_C_EnableListMouseFocus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_EnableListMouseFocus, CallFunc_GetCampHelpList_OutCampHelpList) == 0x000008, "Member 'WB_CampHelpWindow_C_EnableListMouseFocus::CallFunc_GetCampHelpList_OutCampHelpList' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_EnableListMouseFocus, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'WB_CampHelpWindow_C_EnableListMouseFocus::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.GetMouseHovered
// 0x0020 (0x0020 - 0x0000)
struct WB_CampHelpWindow_C_GetMouseHovered final
{
public:
	int32                                         OutIndex;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Retindex;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9364[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampHelpList_C*                     CallFunc_GetCampHelpList_OutCampHelpList;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItHovered_OutHovered;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9365[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampHelpWindow_C_GetMouseHovered) == 0x000008, "Wrong alignment on WB_CampHelpWindow_C_GetMouseHovered");
static_assert(sizeof(WB_CampHelpWindow_C_GetMouseHovered) == 0x000020, "Wrong size on WB_CampHelpWindow_C_GetMouseHovered");
static_assert(offsetof(WB_CampHelpWindow_C_GetMouseHovered, OutIndex) == 0x000000, "Member 'WB_CampHelpWindow_C_GetMouseHovered::OutIndex' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_GetMouseHovered, Retindex) == 0x000004, "Member 'WB_CampHelpWindow_C_GetMouseHovered::Retindex' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_GetMouseHovered, Temp_int_Variable) == 0x000008, "Member 'WB_CampHelpWindow_C_GetMouseHovered::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_GetMouseHovered, CallFunc_GetCampHelpList_OutCampHelpList) == 0x000010, "Member 'WB_CampHelpWindow_C_GetMouseHovered::CallFunc_GetCampHelpList_OutCampHelpList' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_GetMouseHovered, CallFunc_IsItHovered_OutHovered) == 0x000018, "Member 'WB_CampHelpWindow_C_GetMouseHovered::CallFunc_IsItHovered_OutHovered' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_GetMouseHovered, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000019, "Member 'WB_CampHelpWindow_C_GetMouseHovered::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_GetMouseHovered, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WB_CampHelpWindow_C_GetMouseHovered::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.GetMouseOnClicked
// 0x0020 (0x0020 - 0x0000)
struct WB_CampHelpWindow_C_GetMouseOnClicked final
{
public:
	int32                                         OutIndex;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Retindex;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9366[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampHelpList_C*                     CallFunc_GetCampHelpList_OutCampHelpList;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItClicked_OutClicked;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9367[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampHelpWindow_C_GetMouseOnClicked) == 0x000008, "Wrong alignment on WB_CampHelpWindow_C_GetMouseOnClicked");
static_assert(sizeof(WB_CampHelpWindow_C_GetMouseOnClicked) == 0x000020, "Wrong size on WB_CampHelpWindow_C_GetMouseOnClicked");
static_assert(offsetof(WB_CampHelpWindow_C_GetMouseOnClicked, OutIndex) == 0x000000, "Member 'WB_CampHelpWindow_C_GetMouseOnClicked::OutIndex' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_GetMouseOnClicked, Retindex) == 0x000004, "Member 'WB_CampHelpWindow_C_GetMouseOnClicked::Retindex' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_GetMouseOnClicked, Temp_int_Variable) == 0x000008, "Member 'WB_CampHelpWindow_C_GetMouseOnClicked::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_GetMouseOnClicked, CallFunc_GetCampHelpList_OutCampHelpList) == 0x000010, "Member 'WB_CampHelpWindow_C_GetMouseOnClicked::CallFunc_GetCampHelpList_OutCampHelpList' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_GetMouseOnClicked, CallFunc_IsItClicked_OutClicked) == 0x000018, "Member 'WB_CampHelpWindow_C_GetMouseOnClicked::CallFunc_IsItClicked_OutClicked' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_GetMouseOnClicked, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000019, "Member 'WB_CampHelpWindow_C_GetMouseOnClicked::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_GetMouseOnClicked, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WB_CampHelpWindow_C_GetMouseOnClicked::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.ResetMouseFlag
// 0x0018 (0x0018 - 0x0000)
struct WB_CampHelpWindow_C_ResetMouseFlag final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CampHelpList_C*                     CallFunc_GetCampHelpList_OutCampHelpList;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpWindow_C_ResetMouseFlag) == 0x000008, "Wrong alignment on WB_CampHelpWindow_C_ResetMouseFlag");
static_assert(sizeof(WB_CampHelpWindow_C_ResetMouseFlag) == 0x000018, "Wrong size on WB_CampHelpWindow_C_ResetMouseFlag");
static_assert(offsetof(WB_CampHelpWindow_C_ResetMouseFlag, Temp_int_Variable) == 0x000000, "Member 'WB_CampHelpWindow_C_ResetMouseFlag::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_ResetMouseFlag, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WB_CampHelpWindow_C_ResetMouseFlag::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_ResetMouseFlag, CallFunc_GetCampHelpList_OutCampHelpList) == 0x000008, "Member 'WB_CampHelpWindow_C_ResetMouseFlag::CallFunc_GetCampHelpList_OutCampHelpList' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_ResetMouseFlag, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'WB_CampHelpWindow_C_ResetMouseFlag::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.TopMenuPanelOff
// 0x0001 (0x0001 - 0x0000)
struct WB_CampHelpWindow_C_TopMenuPanelOff final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpWindow_C_TopMenuPanelOff) == 0x000001, "Wrong alignment on WB_CampHelpWindow_C_TopMenuPanelOff");
static_assert(sizeof(WB_CampHelpWindow_C_TopMenuPanelOff) == 0x000001, "Wrong size on WB_CampHelpWindow_C_TopMenuPanelOff");
static_assert(offsetof(WB_CampHelpWindow_C_TopMenuPanelOff, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampHelpWindow_C_TopMenuPanelOff::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.TopMenuPanelOn
// 0x0001 (0x0001 - 0x0000)
struct WB_CampHelpWindow_C_TopMenuPanelOn final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpWindow_C_TopMenuPanelOn) == 0x000001, "Wrong alignment on WB_CampHelpWindow_C_TopMenuPanelOn");
static_assert(sizeof(WB_CampHelpWindow_C_TopMenuPanelOn) == 0x000001, "Wrong size on WB_CampHelpWindow_C_TopMenuPanelOn");
static_assert(offsetof(WB_CampHelpWindow_C_TopMenuPanelOn, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampHelpWindow_C_TopMenuPanelOn::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.IsHelpListAnimationEnd
// 0x0020 (0x0020 - 0x0000)
struct WB_CampHelpWindow_C_IsHelpListAnimationEnd final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RetFlag;                                           // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9368[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9369[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampHelpList_C*                     CallFunc_GetCampHelpList_OutCampHelpList;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationEnd_OutParam;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpWindow_C_IsHelpListAnimationEnd) == 0x000008, "Wrong alignment on WB_CampHelpWindow_C_IsHelpListAnimationEnd");
static_assert(sizeof(WB_CampHelpWindow_C_IsHelpListAnimationEnd) == 0x000020, "Wrong size on WB_CampHelpWindow_C_IsHelpListAnimationEnd");
static_assert(offsetof(WB_CampHelpWindow_C_IsHelpListAnimationEnd, OutFinished) == 0x000000, "Member 'WB_CampHelpWindow_C_IsHelpListAnimationEnd::OutFinished' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_IsHelpListAnimationEnd, RetFlag) == 0x000001, "Member 'WB_CampHelpWindow_C_IsHelpListAnimationEnd::RetFlag' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_IsHelpListAnimationEnd, Temp_int_Variable) == 0x000004, "Member 'WB_CampHelpWindow_C_IsHelpListAnimationEnd::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_IsHelpListAnimationEnd, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WB_CampHelpWindow_C_IsHelpListAnimationEnd::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_IsHelpListAnimationEnd, CallFunc_GetCampHelpList_OutCampHelpList) == 0x000010, "Member 'WB_CampHelpWindow_C_IsHelpListAnimationEnd::CallFunc_GetCampHelpList_OutCampHelpList' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_IsHelpListAnimationEnd, CallFunc_IsAnimationEnd_OutParam) == 0x000018, "Member 'WB_CampHelpWindow_C_IsHelpListAnimationEnd::CallFunc_IsAnimationEnd_OutParam' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_IsHelpListAnimationEnd, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000019, "Member 'WB_CampHelpWindow_C_IsHelpListAnimationEnd::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.SetScrollRate
// 0x0004 (0x0004 - 0x0000)
struct WB_CampHelpWindow_C_SetScrollRate final
{
public:
	float                                         InRate;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampHelpWindow_C_SetScrollRate) == 0x000004, "Wrong alignment on WB_CampHelpWindow_C_SetScrollRate");
static_assert(sizeof(WB_CampHelpWindow_C_SetScrollRate) == 0x000004, "Wrong size on WB_CampHelpWindow_C_SetScrollRate");
static_assert(offsetof(WB_CampHelpWindow_C_SetScrollRate, InRate) == 0x000000, "Member 'WB_CampHelpWindow_C_SetScrollRate::InRate' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.SetPanelHelpNameColor
// 0x0010 (0x0010 - 0x0000)
struct WB_CampHelpWindow_C_SetPanelHelpNameColor final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InUseHelpNo;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CampHelpList_C*                     CallFunc_GetCampHelpList_OutCampHelpList;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampHelpWindow_C_SetPanelHelpNameColor) == 0x000008, "Wrong alignment on WB_CampHelpWindow_C_SetPanelHelpNameColor");
static_assert(sizeof(WB_CampHelpWindow_C_SetPanelHelpNameColor) == 0x000010, "Wrong size on WB_CampHelpWindow_C_SetPanelHelpNameColor");
static_assert(offsetof(WB_CampHelpWindow_C_SetPanelHelpNameColor, InIndex) == 0x000000, "Member 'WB_CampHelpWindow_C_SetPanelHelpNameColor::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetPanelHelpNameColor, InUseHelpNo) == 0x000004, "Member 'WB_CampHelpWindow_C_SetPanelHelpNameColor::InUseHelpNo' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetPanelHelpNameColor, CallFunc_GetCampHelpList_OutCampHelpList) == 0x000008, "Member 'WB_CampHelpWindow_C_SetPanelHelpNameColor::CallFunc_GetCampHelpList_OutCampHelpList' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.HelpTitleOff
// 0x0001 (0x0001 - 0x0000)
struct WB_CampHelpWindow_C_HelpTitleOff final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpWindow_C_HelpTitleOff) == 0x000001, "Wrong alignment on WB_CampHelpWindow_C_HelpTitleOff");
static_assert(sizeof(WB_CampHelpWindow_C_HelpTitleOff) == 0x000001, "Wrong size on WB_CampHelpWindow_C_HelpTitleOff");
static_assert(offsetof(WB_CampHelpWindow_C_HelpTitleOff, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampHelpWindow_C_HelpTitleOff::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.HelpTitleOn
// 0x0001 (0x0001 - 0x0000)
struct WB_CampHelpWindow_C_HelpTitleOn final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpWindow_C_HelpTitleOn) == 0x000001, "Wrong alignment on WB_CampHelpWindow_C_HelpTitleOn");
static_assert(sizeof(WB_CampHelpWindow_C_HelpTitleOn) == 0x000001, "Wrong size on WB_CampHelpWindow_C_HelpTitleOn");
static_assert(offsetof(WB_CampHelpWindow_C_HelpTitleOn, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampHelpWindow_C_HelpTitleOn::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.PanelHelpOff
// 0x0010 (0x0010 - 0x0000)
struct WB_CampHelpWindow_C_PanelHelpOff final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_936A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampHelpList_C*                     CallFunc_GetCampHelpList_OutCampHelpList;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampHelpWindow_C_PanelHelpOff) == 0x000008, "Wrong alignment on WB_CampHelpWindow_C_PanelHelpOff");
static_assert(sizeof(WB_CampHelpWindow_C_PanelHelpOff) == 0x000010, "Wrong size on WB_CampHelpWindow_C_PanelHelpOff");
static_assert(offsetof(WB_CampHelpWindow_C_PanelHelpOff, InIndex) == 0x000000, "Member 'WB_CampHelpWindow_C_PanelHelpOff::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_PanelHelpOff, CallFunc_GetCampHelpList_OutCampHelpList) == 0x000008, "Member 'WB_CampHelpWindow_C_PanelHelpOff::CallFunc_GetCampHelpList_OutCampHelpList' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.PanelHelpOn
// 0x0010 (0x0010 - 0x0000)
struct WB_CampHelpWindow_C_PanelHelpOn final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_936B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampHelpList_C*                     CallFunc_GetCampHelpList_OutCampHelpList;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampHelpWindow_C_PanelHelpOn) == 0x000008, "Wrong alignment on WB_CampHelpWindow_C_PanelHelpOn");
static_assert(sizeof(WB_CampHelpWindow_C_PanelHelpOn) == 0x000010, "Wrong size on WB_CampHelpWindow_C_PanelHelpOn");
static_assert(offsetof(WB_CampHelpWindow_C_PanelHelpOn, InIndex) == 0x000000, "Member 'WB_CampHelpWindow_C_PanelHelpOn::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_PanelHelpOn, CallFunc_GetCampHelpList_OutCampHelpList) == 0x000008, "Member 'WB_CampHelpWindow_C_PanelHelpOn::CallFunc_GetCampHelpList_OutCampHelpList' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.SetPanelHelp
// 0x0020 (0x0020 - 0x0000)
struct WB_CampHelpWindow_C_SetPanelHelp final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InCategoryId;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InHelpId;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InUseHelpNo;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InDispOnFlag;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_936C[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampHelpList_C*                     CallFunc_GetCampHelpList_OutCampHelpList;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampHelpWindow_C_SetPanelHelp) == 0x000008, "Wrong alignment on WB_CampHelpWindow_C_SetPanelHelp");
static_assert(sizeof(WB_CampHelpWindow_C_SetPanelHelp) == 0x000020, "Wrong size on WB_CampHelpWindow_C_SetPanelHelp");
static_assert(offsetof(WB_CampHelpWindow_C_SetPanelHelp, InIndex) == 0x000000, "Member 'WB_CampHelpWindow_C_SetPanelHelp::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetPanelHelp, InCategoryId) == 0x000004, "Member 'WB_CampHelpWindow_C_SetPanelHelp::InCategoryId' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetPanelHelp, InHelpId) == 0x000008, "Member 'WB_CampHelpWindow_C_SetPanelHelp::InHelpId' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetPanelHelp, InUseHelpNo) == 0x00000C, "Member 'WB_CampHelpWindow_C_SetPanelHelp::InUseHelpNo' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetPanelHelp, InDispOnFlag) == 0x000010, "Member 'WB_CampHelpWindow_C_SetPanelHelp::InDispOnFlag' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetPanelHelp, CallFunc_GetCampHelpList_OutCampHelpList) == 0x000018, "Member 'WB_CampHelpWindow_C_SetPanelHelp::CallFunc_GetCampHelpList_OutCampHelpList' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.SetPanelHelpName
// 0x0018 (0x0018 - 0x0000)
struct WB_CampHelpWindow_C_SetPanelHelpName final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InCategoryId;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InHelpId;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_936D[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampHelpList_C*                     CallFunc_GetCampHelpList_OutCampHelpList;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampHelpWindow_C_SetPanelHelpName) == 0x000008, "Wrong alignment on WB_CampHelpWindow_C_SetPanelHelpName");
static_assert(sizeof(WB_CampHelpWindow_C_SetPanelHelpName) == 0x000018, "Wrong size on WB_CampHelpWindow_C_SetPanelHelpName");
static_assert(offsetof(WB_CampHelpWindow_C_SetPanelHelpName, InIndex) == 0x000000, "Member 'WB_CampHelpWindow_C_SetPanelHelpName::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetPanelHelpName, InCategoryId) == 0x000004, "Member 'WB_CampHelpWindow_C_SetPanelHelpName::InCategoryId' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetPanelHelpName, InHelpId) == 0x000008, "Member 'WB_CampHelpWindow_C_SetPanelHelpName::InHelpId' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetPanelHelpName, CallFunc_GetCampHelpList_OutCampHelpList) == 0x000010, "Member 'WB_CampHelpWindow_C_SetPanelHelpName::CallFunc_GetCampHelpList_OutCampHelpList' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.GetCategoryPosition
// 0x0010 (0x0010 - 0x0000)
struct WB_CampHelpWindow_C_GetCategoryPosition final
{
public:
	struct FVector2D                              OutVec;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampHelpWindow_C_GetCategoryPosition) == 0x000004, "Wrong alignment on WB_CampHelpWindow_C_GetCategoryPosition");
static_assert(sizeof(WB_CampHelpWindow_C_GetCategoryPosition) == 0x000010, "Wrong size on WB_CampHelpWindow_C_GetCategoryPosition");
static_assert(offsetof(WB_CampHelpWindow_C_GetCategoryPosition, OutVec) == 0x000000, "Member 'WB_CampHelpWindow_C_GetCategoryPosition::OutVec' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_GetCategoryPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec) == 0x000008, "Member 'WB_CampHelpWindow_C_GetCategoryPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.HelpScrollBarOut
// 0x0001 (0x0001 - 0x0000)
struct WB_CampHelpWindow_C_HelpScrollBarOut final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpWindow_C_HelpScrollBarOut) == 0x000001, "Wrong alignment on WB_CampHelpWindow_C_HelpScrollBarOut");
static_assert(sizeof(WB_CampHelpWindow_C_HelpScrollBarOut) == 0x000001, "Wrong size on WB_CampHelpWindow_C_HelpScrollBarOut");
static_assert(offsetof(WB_CampHelpWindow_C_HelpScrollBarOut, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampHelpWindow_C_HelpScrollBarOut::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.HelpScrollBarIn
// 0x0001 (0x0001 - 0x0000)
struct WB_CampHelpWindow_C_HelpScrollBarIn final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpWindow_C_HelpScrollBarIn) == 0x000001, "Wrong alignment on WB_CampHelpWindow_C_HelpScrollBarIn");
static_assert(sizeof(WB_CampHelpWindow_C_HelpScrollBarIn) == 0x000001, "Wrong size on WB_CampHelpWindow_C_HelpScrollBarIn");
static_assert(offsetof(WB_CampHelpWindow_C_HelpScrollBarIn, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampHelpWindow_C_HelpScrollBarIn::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.GetCampHelpList
// 0x0020 (0x0020 - 0x0000)
struct WB_CampHelpWindow_C_GetCampHelpList final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_936E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampHelpList_C*                     OutCampHelpList;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CampHelpList_C*                     Retcamphelplist;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpWindow_C_GetCampHelpList) == 0x000008, "Wrong alignment on WB_CampHelpWindow_C_GetCampHelpList");
static_assert(sizeof(WB_CampHelpWindow_C_GetCampHelpList) == 0x000020, "Wrong size on WB_CampHelpWindow_C_GetCampHelpList");
static_assert(offsetof(WB_CampHelpWindow_C_GetCampHelpList, InIndex) == 0x000000, "Member 'WB_CampHelpWindow_C_GetCampHelpList::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_GetCampHelpList, OutCampHelpList) == 0x000008, "Member 'WB_CampHelpWindow_C_GetCampHelpList::OutCampHelpList' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_GetCampHelpList, Retcamphelplist) == 0x000010, "Member 'WB_CampHelpWindow_C_GetCampHelpList::Retcamphelplist' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_GetCampHelpList, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'WB_CampHelpWindow_C_GetCampHelpList::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.NoDataOff
// 0x0014 (0x0014 - 0x0000)
struct WB_CampHelpWindow_C_NoDataOff final
{
public:
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpWindow_C_NoDataOff) == 0x000004, "Wrong alignment on WB_CampHelpWindow_C_NoDataOff");
static_assert(sizeof(WB_CampHelpWindow_C_NoDataOff) == 0x000014, "Wrong size on WB_CampHelpWindow_C_NoDataOff");
static_assert(offsetof(WB_CampHelpWindow_C_NoDataOff, CallFunc_GetPlayingAnimationName_OutAnimPackName) == 0x000000, "Member 'WB_CampHelpWindow_C_NoDataOff::CallFunc_GetPlayingAnimationName_OutAnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_NoDataOff, CallFunc_GetPlayingAnimationName_OutAnimationName) == 0x000008, "Member 'WB_CampHelpWindow_C_NoDataOff::CallFunc_GetPlayingAnimationName_OutAnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_NoDataOff, CallFunc_Play_ReturnValue) == 0x000010, "Member 'WB_CampHelpWindow_C_NoDataOff::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.NoDataOn
// 0x0028 (0x0028 - 0x0000)
struct WB_CampHelpWindow_C_NoDataOn final
{
public:
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetScriptMessageByLabel_self_CastInput;   // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampHelpWindow_C_NoDataOn) == 0x000008, "Wrong alignment on WB_CampHelpWindow_C_NoDataOn");
static_assert(sizeof(WB_CampHelpWindow_C_NoDataOn) == 0x000028, "Wrong size on WB_CampHelpWindow_C_NoDataOn");
static_assert(offsetof(WB_CampHelpWindow_C_NoDataOn, CallFunc_SetScriptMessageByLabel_self_CastInput) == 0x000000, "Member 'WB_CampHelpWindow_C_NoDataOn::CallFunc_SetScriptMessageByLabel_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_NoDataOn, CallFunc_GetPlayingAnimationName_OutAnimPackName) == 0x000010, "Member 'WB_CampHelpWindow_C_NoDataOn::CallFunc_GetPlayingAnimationName_OutAnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_NoDataOn, CallFunc_GetPlayingAnimationName_OutAnimationName) == 0x000018, "Member 'WB_CampHelpWindow_C_NoDataOn::CallFunc_GetPlayingAnimationName_OutAnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_NoDataOn, CallFunc_Play_ReturnValue) == 0x000020, "Member 'WB_CampHelpWindow_C_NoDataOn::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.SetInitPosition
// 0x0088 (0x0088 - 0x0000)
struct WB_CampHelpWindow_C_SetInitPosition final
{
public:
	int32                                         Lpindex;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_936F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9370[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9371[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CampHelpList_C*                     CallFunc_GetCampHelpList_OutCampHelpList;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec_1;   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec_2;   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec_3;   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9372[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_4;           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec_4;   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampHelpWindow_C_SetInitPosition) == 0x000008, "Wrong alignment on WB_CampHelpWindow_C_SetInitPosition");
static_assert(sizeof(WB_CampHelpWindow_C_SetInitPosition) == 0x000088, "Wrong size on WB_CampHelpWindow_C_SetInitPosition");
static_assert(offsetof(WB_CampHelpWindow_C_SetInitPosition, Lpindex) == 0x000000, "Member 'WB_CampHelpWindow_C_SetInitPosition::Lpindex' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetInitPosition, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000008, "Member 'WB_CampHelpWindow_C_SetInitPosition::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetInitPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec) == 0x000010, "Member 'WB_CampHelpWindow_C_SetInitPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetInitPosition, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WB_CampHelpWindow_C_SetInitPosition::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetInitPosition, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00001C, "Member 'WB_CampHelpWindow_C_SetInitPosition::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetInitPosition, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'WB_CampHelpWindow_C_SetInitPosition::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetInitPosition, CallFunc_MakeVector2D_ReturnValue) == 0x000024, "Member 'WB_CampHelpWindow_C_SetInitPosition::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetInitPosition, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x00002C, "Member 'WB_CampHelpWindow_C_SetInitPosition::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetInitPosition, CallFunc_GetCampHelpList_OutCampHelpList) == 0x000038, "Member 'WB_CampHelpWindow_C_SetInitPosition::CallFunc_GetCampHelpList_OutCampHelpList' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetInitPosition, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000040, "Member 'WB_CampHelpWindow_C_SetInitPosition::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetInitPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec_1) == 0x000048, "Member 'WB_CampHelpWindow_C_SetInitPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec_1' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetInitPosition, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000050, "Member 'WB_CampHelpWindow_C_SetInitPosition::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetInitPosition, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x000058, "Member 'WB_CampHelpWindow_C_SetInitPosition::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetInitPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec_2) == 0x000060, "Member 'WB_CampHelpWindow_C_SetInitPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec_2' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetInitPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec_3) == 0x000068, "Member 'WB_CampHelpWindow_C_SetInitPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec_3' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetInitPosition, Temp_int_Variable) == 0x000070, "Member 'WB_CampHelpWindow_C_SetInitPosition::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetInitPosition, CallFunc_SlotAsCanvasSlot_ReturnValue_4) == 0x000078, "Member 'WB_CampHelpWindow_C_SetInitPosition::CallFunc_SlotAsCanvasSlot_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_SetInitPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec_4) == 0x000080, "Member 'WB_CampHelpWindow_C_SetInitPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec_4' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.BndEvt__WB_CampHelpWindow_WB_ScrollBar_K2Node_ComponentBoundEvent_4_OnScrolledByMouse__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_WB_ScrollBar_K2Node_ComponentBoundEvent_4_OnScrolledByMouse__DelegateSignature final
{
public:
	float                                         Position;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_WB_ScrollBar_K2Node_ComponentBoundEvent_4_OnScrolledByMouse__DelegateSignature) == 0x000004, "Wrong alignment on WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_WB_ScrollBar_K2Node_ComponentBoundEvent_4_OnScrolledByMouse__DelegateSignature");
static_assert(sizeof(WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_WB_ScrollBar_K2Node_ComponentBoundEvent_4_OnScrolledByMouse__DelegateSignature) == 0x000004, "Wrong size on WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_WB_ScrollBar_K2Node_ComponentBoundEvent_4_OnScrolledByMouse__DelegateSignature");
static_assert(offsetof(WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_WB_ScrollBar_K2Node_ComponentBoundEvent_4_OnScrolledByMouse__DelegateSignature, Position) == 0x000000, "Member 'WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_WB_ScrollBar_K2Node_ComponentBoundEvent_4_OnScrolledByMouse__DelegateSignature::Position' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.BndEvt__WB_CampHelpWindow_SsPlayerHelpTitle_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_SsPlayerHelpTitle_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_SsPlayerHelpTitle_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_SsPlayerHelpTitle_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_SsPlayerHelpTitle_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_SsPlayerHelpTitle_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_SsPlayerHelpTitle_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_SsPlayerHelpTitle_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_SsPlayerHelpTitle_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_SsPlayerHelpTitle_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_SsPlayerHelpTitle_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_SsPlayerHelpTitle_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_SsPlayerHelpTitle_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_SsPlayerHelpTitle_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_CampHelpWindow.WB_CampHelpWindow_C.BndEvt__WB_CampHelpWindow_SsPlayerNoData_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_SsPlayerNoData_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_SsPlayerNoData_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_SsPlayerNoData_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_SsPlayerNoData_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_SsPlayerNoData_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_SsPlayerNoData_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_SsPlayerNoData_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_SsPlayerNoData_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_CampHelpWindow_C_BndEvt__WB_CampHelpWindow_SsPlayerNoData_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
