#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CharaStatus

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_CharaStatus.WB_CharaStatus_C.AffinitiesPos
// 0x001C (0x001C - 0x0000)
struct WB_CharaStatus_C_AffinitiesPos final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82D5[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82D6[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaStatus_C_AffinitiesPos) == 0x000004, "Wrong alignment on WB_CharaStatus_C_AffinitiesPos");
static_assert(sizeof(WB_CharaStatus_C_AffinitiesPos) == 0x00001C, "Wrong size on WB_CharaStatus_C_AffinitiesPos");
static_assert(offsetof(WB_CharaStatus_C_AffinitiesPos, Param_Index) == 0x000000, "Member 'WB_CharaStatus_C_AffinitiesPos::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_AffinitiesPos, ReturnValue) == 0x000004, "Member 'WB_CharaStatus_C_AffinitiesPos::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_AffinitiesPos, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000008, "Member 'WB_CharaStatus_C_AffinitiesPos::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_AffinitiesPos, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WB_CharaStatus_C_AffinitiesPos::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_AffinitiesPos, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000010, "Member 'WB_CharaStatus_C_AffinitiesPos::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_AffinitiesPos, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'WB_CharaStatus_C_AffinitiesPos::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_AffinitiesPos, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x000018, "Member 'WB_CharaStatus_C_AffinitiesPos::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");

// Function WB_CharaStatus.WB_CharaStatus_C.PartsAnimPlayerSelectOptionParts
// 0x0030 (0x0030 - 0x0000)
struct WB_CharaStatus_C_PartsAnimPlayerSelectOptionParts final
{
public:
	int32                                         AnimNum;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82D7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIStatusCtrlDataObjBase*               UIStatusCtrlObj;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_UI_STATUS_FUSION_ORDER                      CallFunc_GetFaceIconOrder_ReturnValue;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82D8[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextOrder_OrderText;                      // 0x0018(0x0018)()
};
static_assert(alignof(WB_CharaStatus_C_PartsAnimPlayerSelectOptionParts) == 0x000008, "Wrong alignment on WB_CharaStatus_C_PartsAnimPlayerSelectOptionParts");
static_assert(sizeof(WB_CharaStatus_C_PartsAnimPlayerSelectOptionParts) == 0x000030, "Wrong size on WB_CharaStatus_C_PartsAnimPlayerSelectOptionParts");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimPlayerSelectOptionParts, AnimNum) == 0x000000, "Member 'WB_CharaStatus_C_PartsAnimPlayerSelectOptionParts::AnimNum' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimPlayerSelectOptionParts, UIStatusCtrlObj) == 0x000008, "Member 'WB_CharaStatus_C_PartsAnimPlayerSelectOptionParts::UIStatusCtrlObj' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimPlayerSelectOptionParts, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WB_CharaStatus_C_PartsAnimPlayerSelectOptionParts::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimPlayerSelectOptionParts, CallFunc_GetFaceIconOrder_ReturnValue) == 0x000011, "Member 'WB_CharaStatus_C_PartsAnimPlayerSelectOptionParts::CallFunc_GetFaceIconOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimPlayerSelectOptionParts, K2Node_SwitchInteger_CmpSuccess) == 0x000012, "Member 'WB_CharaStatus_C_PartsAnimPlayerSelectOptionParts::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimPlayerSelectOptionParts, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000013, "Member 'WB_CharaStatus_C_PartsAnimPlayerSelectOptionParts::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimPlayerSelectOptionParts, CallFunc_TextOrder_OrderText) == 0x000018, "Member 'WB_CharaStatus_C_PartsAnimPlayerSelectOptionParts::CallFunc_TextOrder_OrderText' has a wrong offset!");

// Function WB_CharaStatus.WB_CharaStatus_C.GetRightScrollBarRate
// 0x0028 (0x0028 - 0x0000)
struct WB_CharaStatus_C_GetRightScrollBarRate final
{
public:
	E_UI_STATUS_PAGE_TYPE                         PageType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82D9[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIStatusCtrlDataObjBase*               StatusCtrlDataObj;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Offset;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82DA[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ScrollBarRate_Skill_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ScrollBarRate_Condition_ReturnValue;      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaStatus_C_GetRightScrollBarRate) == 0x000008, "Wrong alignment on WB_CharaStatus_C_GetRightScrollBarRate");
static_assert(sizeof(WB_CharaStatus_C_GetRightScrollBarRate) == 0x000028, "Wrong size on WB_CharaStatus_C_GetRightScrollBarRate");
static_assert(offsetof(WB_CharaStatus_C_GetRightScrollBarRate, PageType) == 0x000000, "Member 'WB_CharaStatus_C_GetRightScrollBarRate::PageType' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_GetRightScrollBarRate, StatusCtrlDataObj) == 0x000008, "Member 'WB_CharaStatus_C_GetRightScrollBarRate::StatusCtrlDataObj' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_GetRightScrollBarRate, Offset) == 0x000010, "Member 'WB_CharaStatus_C_GetRightScrollBarRate::Offset' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_GetRightScrollBarRate, ReturnValue) == 0x000014, "Member 'WB_CharaStatus_C_GetRightScrollBarRate::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_GetRightScrollBarRate, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000018, "Member 'WB_CharaStatus_C_GetRightScrollBarRate::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_GetRightScrollBarRate, CallFunc_ScrollBarRate_Skill_ReturnValue) == 0x00001C, "Member 'WB_CharaStatus_C_GetRightScrollBarRate::CallFunc_ScrollBarRate_Skill_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_GetRightScrollBarRate, CallFunc_ScrollBarRate_Condition_ReturnValue) == 0x000020, "Member 'WB_CharaStatus_C_GetRightScrollBarRate::CallFunc_ScrollBarRate_Condition_ReturnValue' has a wrong offset!");

// Function WB_CharaStatus.WB_CharaStatus_C.Close_SimpleStatus
// 0x0004 (0x0004 - 0x0000)
struct WB_CharaStatus_C_Close_SimpleStatus final
{
public:
	int32                                         AnimNum;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaStatus_C_Close_SimpleStatus) == 0x000004, "Wrong alignment on WB_CharaStatus_C_Close_SimpleStatus");
static_assert(sizeof(WB_CharaStatus_C_Close_SimpleStatus) == 0x000004, "Wrong size on WB_CharaStatus_C_Close_SimpleStatus");
static_assert(offsetof(WB_CharaStatus_C_Close_SimpleStatus, AnimNum) == 0x000000, "Member 'WB_CharaStatus_C_Close_SimpleStatus::AnimNum' has a wrong offset!");

// Function WB_CharaStatus.WB_CharaStatus_C.ChangeStatus_SimpleStatus
// 0x00D0 (0x00D0 - 0x0000)
struct WB_CharaStatus_C_ChangeStatus_SimpleStatus final
{
public:
	class UUIStatusCtrlDataObjBase*               Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseLevelUpParts_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UseLvUpGimmerParts_ReturnValue;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82DB[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUIStatusDataUpParam                   CallFunc_GetUpParam_ReturnValue;                   // 0x0010(0x0048)(ConstParm)
	struct FUIStatusDataLeft                      CallFunc_GetLeftData_ReturnValue;                  // 0x0058(0x0070)(ConstParm)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUtsusemiStatusData_ReturnValue;         // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmptyStatusData_ReturnValue;            // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CharaStatus_C_ChangeStatus_SimpleStatus) == 0x000008, "Wrong alignment on WB_CharaStatus_C_ChangeStatus_SimpleStatus");
static_assert(sizeof(WB_CharaStatus_C_ChangeStatus_SimpleStatus) == 0x0000D0, "Wrong size on WB_CharaStatus_C_ChangeStatus_SimpleStatus");
static_assert(offsetof(WB_CharaStatus_C_ChangeStatus_SimpleStatus, Data) == 0x000000, "Member 'WB_CharaStatus_C_ChangeStatus_SimpleStatus::Data' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_ChangeStatus_SimpleStatus, CallFunc_UseLevelUpParts_ReturnValue) == 0x000008, "Member 'WB_CharaStatus_C_ChangeStatus_SimpleStatus::CallFunc_UseLevelUpParts_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_ChangeStatus_SimpleStatus, CallFunc_UseLvUpGimmerParts_ReturnValue) == 0x000009, "Member 'WB_CharaStatus_C_ChangeStatus_SimpleStatus::CallFunc_UseLvUpGimmerParts_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_ChangeStatus_SimpleStatus, CallFunc_SelectInt_ReturnValue) == 0x00000C, "Member 'WB_CharaStatus_C_ChangeStatus_SimpleStatus::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_ChangeStatus_SimpleStatus, CallFunc_GetUpParam_ReturnValue) == 0x000010, "Member 'WB_CharaStatus_C_ChangeStatus_SimpleStatus::CallFunc_GetUpParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_ChangeStatus_SimpleStatus, CallFunc_GetLeftData_ReturnValue) == 0x000058, "Member 'WB_CharaStatus_C_ChangeStatus_SimpleStatus::CallFunc_GetLeftData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_ChangeStatus_SimpleStatus, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000C8, "Member 'WB_CharaStatus_C_ChangeStatus_SimpleStatus::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_ChangeStatus_SimpleStatus, CallFunc_IsUtsusemiStatusData_ReturnValue) == 0x0000C9, "Member 'WB_CharaStatus_C_ChangeStatus_SimpleStatus::CallFunc_IsUtsusemiStatusData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_ChangeStatus_SimpleStatus, CallFunc_IsEmptyStatusData_ReturnValue) == 0x0000CA, "Member 'WB_CharaStatus_C_ChangeStatus_SimpleStatus::CallFunc_IsEmptyStatusData_ReturnValue' has a wrong offset!");

// Function WB_CharaStatus.WB_CharaStatus_C.Open_SimpleStatus
// 0x00E0 (0x00E0 - 0x0000)
struct WB_CharaStatus_C_Open_SimpleStatus final
{
public:
	class UUIStatusCtrlDataObjBase*               Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimNum;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82DC[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseLevelUpParts_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UseLvUpGimmerParts_ReturnValue;           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82DD[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82DE[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIStatusDataUpParam                   CallFunc_GetUpParam_ReturnValue;                   // 0x0020(0x0048)(ConstParm)
	struct FUIStatusDataLeft                      CallFunc_GetLeftData_ReturnValue;                  // 0x0068(0x0070)(ConstParm)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUtsusemiStatusData_ReturnValue;         // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmptyStatusData_ReturnValue;            // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CharaStatus_C_Open_SimpleStatus) == 0x000008, "Wrong alignment on WB_CharaStatus_C_Open_SimpleStatus");
static_assert(sizeof(WB_CharaStatus_C_Open_SimpleStatus) == 0x0000E0, "Wrong size on WB_CharaStatus_C_Open_SimpleStatus");
static_assert(offsetof(WB_CharaStatus_C_Open_SimpleStatus, Data) == 0x000000, "Member 'WB_CharaStatus_C_Open_SimpleStatus::Data' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_Open_SimpleStatus, AnimNum) == 0x000008, "Member 'WB_CharaStatus_C_Open_SimpleStatus::AnimNum' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_Open_SimpleStatus, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WB_CharaStatus_C_Open_SimpleStatus::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_Open_SimpleStatus, CallFunc_SelectInt_ReturnValue) == 0x000010, "Member 'WB_CharaStatus_C_Open_SimpleStatus::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_Open_SimpleStatus, CallFunc_UseLevelUpParts_ReturnValue) == 0x000014, "Member 'WB_CharaStatus_C_Open_SimpleStatus::CallFunc_UseLevelUpParts_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_Open_SimpleStatus, CallFunc_UseLvUpGimmerParts_ReturnValue) == 0x000015, "Member 'WB_CharaStatus_C_Open_SimpleStatus::CallFunc_UseLvUpGimmerParts_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_Open_SimpleStatus, CallFunc_SelectInt_ReturnValue_1) == 0x000018, "Member 'WB_CharaStatus_C_Open_SimpleStatus::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_Open_SimpleStatus, CallFunc_GetUpParam_ReturnValue) == 0x000020, "Member 'WB_CharaStatus_C_Open_SimpleStatus::CallFunc_GetUpParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_Open_SimpleStatus, CallFunc_GetLeftData_ReturnValue) == 0x000068, "Member 'WB_CharaStatus_C_Open_SimpleStatus::CallFunc_GetLeftData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_Open_SimpleStatus, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000D8, "Member 'WB_CharaStatus_C_Open_SimpleStatus::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_Open_SimpleStatus, CallFunc_IsUtsusemiStatusData_ReturnValue) == 0x0000D9, "Member 'WB_CharaStatus_C_Open_SimpleStatus::CallFunc_IsUtsusemiStatusData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_Open_SimpleStatus, CallFunc_IsEmptyStatusData_ReturnValue) == 0x0000DA, "Member 'WB_CharaStatus_C_Open_SimpleStatus::CallFunc_IsEmptyStatusData_ReturnValue' has a wrong offset!");

// Function WB_CharaStatus.WB_CharaStatus_C.Text???_Race
// 0x0038 (0x0038 - 0x0000)
struct WB_CharaStatus_C_Text____Race final
{
public:
	class FText                                   NewParam;                                          // 0x0000(0x0018)(Parm, OutParm)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTextByLabel_ReturnValue;               // 0x0020(0x0018)()
};
static_assert(alignof(WB_CharaStatus_C_Text____Race) == 0x000008, "Wrong alignment on WB_CharaStatus_C_Text____Race");
static_assert(sizeof(WB_CharaStatus_C_Text____Race) == 0x000038, "Wrong size on WB_CharaStatus_C_Text____Race");
static_assert(offsetof(WB_CharaStatus_C_Text____Race, NewParam) == 0x000000, "Member 'WB_CharaStatus_C_Text____Race::NewParam' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_Text____Race, CallFunc_MakeLiteralName_ReturnValue) == 0x000018, "Member 'WB_CharaStatus_C_Text____Race::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_Text____Race, CallFunc_GetTextByLabel_ReturnValue) == 0x000020, "Member 'WB_CharaStatus_C_Text____Race::CallFunc_GetTextByLabel_ReturnValue' has a wrong offset!");

// Function WB_CharaStatus.WB_CharaStatus_C.Text???_Name
// 0x0038 (0x0038 - 0x0000)
struct WB_CharaStatus_C_Text____Name final
{
public:
	class FText                                   NewParam;                                          // 0x0000(0x0018)(Parm, OutParm)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTextByLabel_ReturnValue;               // 0x0020(0x0018)()
};
static_assert(alignof(WB_CharaStatus_C_Text____Name) == 0x000008, "Wrong alignment on WB_CharaStatus_C_Text____Name");
static_assert(sizeof(WB_CharaStatus_C_Text____Name) == 0x000038, "Wrong size on WB_CharaStatus_C_Text____Name");
static_assert(offsetof(WB_CharaStatus_C_Text____Name, NewParam) == 0x000000, "Member 'WB_CharaStatus_C_Text____Name::NewParam' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_Text____Name, CallFunc_MakeLiteralName_ReturnValue) == 0x000018, "Member 'WB_CharaStatus_C_Text____Name::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_Text____Name, CallFunc_GetTextByLabel_ReturnValue) == 0x000020, "Member 'WB_CharaStatus_C_Text____Name::CallFunc_GetTextByLabel_ReturnValue' has a wrong offset!");

// Function WB_CharaStatus.WB_CharaStatus_C.SetSlotCursorExitButton
// 0x0010 (0x0010 - 0x0000)
struct WB_CharaStatus_C_SetSlotCursorExitButton final
{
public:
	bool                                          IsUsedSlotCursor;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82DF[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AnimNum;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82E0[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaStatus_C_SetSlotCursorExitButton) == 0x000004, "Wrong alignment on WB_CharaStatus_C_SetSlotCursorExitButton");
static_assert(sizeof(WB_CharaStatus_C_SetSlotCursorExitButton) == 0x000010, "Wrong size on WB_CharaStatus_C_SetSlotCursorExitButton");
static_assert(offsetof(WB_CharaStatus_C_SetSlotCursorExitButton, IsUsedSlotCursor) == 0x000000, "Member 'WB_CharaStatus_C_SetSlotCursorExitButton::IsUsedSlotCursor' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetSlotCursorExitButton, AnimNum) == 0x000004, "Member 'WB_CharaStatus_C_SetSlotCursorExitButton::AnimNum' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetSlotCursorExitButton, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000008, "Member 'WB_CharaStatus_C_SetSlotCursorExitButton::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetSlotCursorExitButton, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WB_CharaStatus_C_SetSlotCursorExitButton::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CharaStatus.WB_CharaStatus_C.SetFaceIconPos
// 0x0048 (0x0048 - 0x0000)
struct WB_CharaStatus_C_SetFaceIconPos final
{
public:
	float                                         ShiftRate;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_LastIndex;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_FirstIndex;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82E1[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82E2[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CallFunc_GetPartsFaceIcon_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82E3[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CharaStatus_C_SetFaceIconPos) == 0x000008, "Wrong alignment on WB_CharaStatus_C_SetFaceIconPos");
static_assert(sizeof(WB_CharaStatus_C_SetFaceIconPos) == 0x000048, "Wrong size on WB_CharaStatus_C_SetFaceIconPos");
static_assert(offsetof(WB_CharaStatus_C_SetFaceIconPos, ShiftRate) == 0x000000, "Member 'WB_CharaStatus_C_SetFaceIconPos::ShiftRate' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetFaceIconPos, Lo_LastIndex) == 0x000004, "Member 'WB_CharaStatus_C_SetFaceIconPos::Lo_LastIndex' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetFaceIconPos, Lo_FirstIndex) == 0x000008, "Member 'WB_CharaStatus_C_SetFaceIconPos::Lo_FirstIndex' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetFaceIconPos, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'WB_CharaStatus_C_SetFaceIconPos::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetFaceIconPos, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'WB_CharaStatus_C_SetFaceIconPos::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetFaceIconPos, CallFunc_Less_FloatFloat_ReturnValue) == 0x000014, "Member 'WB_CharaStatus_C_SetFaceIconPos::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetFaceIconPos, Temp_int_Variable) == 0x000018, "Member 'WB_CharaStatus_C_SetFaceIconPos::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetFaceIconPos, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00001C, "Member 'WB_CharaStatus_C_SetFaceIconPos::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetFaceIconPos, CallFunc_GetPartsFaceIcon_ReturnValue) == 0x000020, "Member 'WB_CharaStatus_C_SetFaceIconPos::CallFunc_GetPartsFaceIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetFaceIconPos, CallFunc_Add_FloatFloat_ReturnValue) == 0x000028, "Member 'WB_CharaStatus_C_SetFaceIconPos::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetFaceIconPos, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000030, "Member 'WB_CharaStatus_C_SetFaceIconPos::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetFaceIconPos, CallFunc_MakeVector2D_ReturnValue) == 0x000038, "Member 'WB_CharaStatus_C_SetFaceIconPos::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetFaceIconPos, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'WB_CharaStatus_C_SetFaceIconPos::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetFaceIconPos, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000044, "Member 'WB_CharaStatus_C_SetFaceIconPos::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CharaStatus.WB_CharaStatus_C.SetSlotCursorPos
// 0x0058 (0x0058 - 0x0000)
struct WB_CharaStatus_C_SetSlotCursorPos final
{
public:
	bool                                          IsParent;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82E4[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SlotNum;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82E5[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82E6[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82E7[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82E8[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaStatus_C_SetSlotCursorPos) == 0x000008, "Wrong alignment on WB_CharaStatus_C_SetSlotCursorPos");
static_assert(sizeof(WB_CharaStatus_C_SetSlotCursorPos) == 0x000058, "Wrong size on WB_CharaStatus_C_SetSlotCursorPos");
static_assert(offsetof(WB_CharaStatus_C_SetSlotCursorPos, IsParent) == 0x000000, "Member 'WB_CharaStatus_C_SetSlotCursorPos::IsParent' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetSlotCursorPos, SlotNum) == 0x000004, "Member 'WB_CharaStatus_C_SetSlotCursorPos::SlotNum' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetSlotCursorPos, Temp_bool_Variable) == 0x000008, "Member 'WB_CharaStatus_C_SetSlotCursorPos::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetSlotCursorPos, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000009, "Member 'WB_CharaStatus_C_SetSlotCursorPos::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetSlotCursorPos, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00000C, "Member 'WB_CharaStatus_C_SetSlotCursorPos::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetSlotCursorPos, Temp_name_Variable) == 0x000010, "Member 'WB_CharaStatus_C_SetSlotCursorPos::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetSlotCursorPos, Temp_name_Variable_1) == 0x000018, "Member 'WB_CharaStatus_C_SetSlotCursorPos::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetSlotCursorPos, K2Node_Select_Default) == 0x000020, "Member 'WB_CharaStatus_C_SetSlotCursorPos::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetSlotCursorPos, CallFunc_GetSSPPositionDataByPartsName_OutVec) == 0x000028, "Member 'WB_CharaStatus_C_SetSlotCursorPos::CallFunc_GetSSPPositionDataByPartsName_OutVec' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetSlotCursorPos, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WB_CharaStatus_C_SetSlotCursorPos::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetSlotCursorPos, CallFunc_BreakVector2D_X) == 0x000034, "Member 'WB_CharaStatus_C_SetSlotCursorPos::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetSlotCursorPos, CallFunc_BreakVector2D_Y) == 0x000038, "Member 'WB_CharaStatus_C_SetSlotCursorPos::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetSlotCursorPos, CallFunc_BooleanAND_ReturnValue) == 0x00003C, "Member 'WB_CharaStatus_C_SetSlotCursorPos::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetSlotCursorPos, CallFunc_Add_FloatFloat_ReturnValue) == 0x000040, "Member 'WB_CharaStatus_C_SetSlotCursorPos::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetSlotCursorPos, CallFunc_MakeVector2D_ReturnValue) == 0x000044, "Member 'WB_CharaStatus_C_SetSlotCursorPos::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_SetSlotCursorPos, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000050, "Member 'WB_CharaStatus_C_SetSlotCursorPos::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function WB_CharaStatus.WB_CharaStatus_C.PartsAnimSlotCursor
// 0x0014 (0x0014 - 0x0000)
struct WB_CharaStatus_C_PartsAnimSlotCursor final
{
public:
	bool                                          IsParent;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82E9[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SlotNum;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimNum;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StartFrame;                                        // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CharaStatus_C_PartsAnimSlotCursor) == 0x000004, "Wrong alignment on WB_CharaStatus_C_PartsAnimSlotCursor");
static_assert(sizeof(WB_CharaStatus_C_PartsAnimSlotCursor) == 0x000014, "Wrong size on WB_CharaStatus_C_PartsAnimSlotCursor");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimSlotCursor, IsParent) == 0x000000, "Member 'WB_CharaStatus_C_PartsAnimSlotCursor::IsParent' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimSlotCursor, SlotNum) == 0x000004, "Member 'WB_CharaStatus_C_PartsAnimSlotCursor::SlotNum' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimSlotCursor, AnimNum) == 0x000008, "Member 'WB_CharaStatus_C_PartsAnimSlotCursor::AnimNum' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimSlotCursor, StartFrame) == 0x00000C, "Member 'WB_CharaStatus_C_PartsAnimSlotCursor::StartFrame' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimSlotCursor, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'WB_CharaStatus_C_PartsAnimSlotCursor::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_CharaStatus.WB_CharaStatus_C.PartsAnimBar
// 0x0028 (0x0028 - 0x0000)
struct WB_CharaStatus_C_PartsAnimBar final
{
public:
	class USsPlayerWidget*                        TargetSSP;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ScrollBar_C*                        TargetBar;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BarPosition;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimNum;                                           // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CharaStatus_C_PartsAnimBar) == 0x000008, "Wrong alignment on WB_CharaStatus_C_PartsAnimBar");
static_assert(sizeof(WB_CharaStatus_C_PartsAnimBar) == 0x000028, "Wrong size on WB_CharaStatus_C_PartsAnimBar");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimBar, TargetSSP) == 0x000000, "Member 'WB_CharaStatus_C_PartsAnimBar::TargetSSP' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimBar, TargetBar) == 0x000008, "Member 'WB_CharaStatus_C_PartsAnimBar::TargetBar' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimBar, BarPosition) == 0x000010, "Member 'WB_CharaStatus_C_PartsAnimBar::BarPosition' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimBar, AnimNum) == 0x000014, "Member 'WB_CharaStatus_C_PartsAnimBar::AnimNum' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimBar, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'WB_CharaStatus_C_PartsAnimBar::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimBar, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000019, "Member 'WB_CharaStatus_C_PartsAnimBar::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimBar, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00001A, "Member 'WB_CharaStatus_C_PartsAnimBar::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimBar, CallFunc_BooleanOR_ReturnValue) == 0x00001B, "Member 'WB_CharaStatus_C_PartsAnimBar::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimBar, CallFunc_FClamp_ReturnValue) == 0x00001C, "Member 'WB_CharaStatus_C_PartsAnimBar::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimBar, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000020, "Member 'WB_CharaStatus_C_PartsAnimBar::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimBar, CallFunc_IsVisible_ReturnValue) == 0x000021, "Member 'WB_CharaStatus_C_PartsAnimBar::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_PartsAnimBar, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'WB_CharaStatus_C_PartsAnimBar::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WB_CharaStatus.WB_CharaStatus_C.UpdateStatus_Inherit
// 0x0190 (0x0190 - 0x0000)
struct WB_CharaStatus_C_UpdateStatus_Inherit final
{
public:
	class UUIStatusCtrlDataObjBase*               StatusDataObj;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ParentTopIndex;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ChildTopIndex;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUIStatusDataUpParam                   CallFunc_GetUpParam_ReturnValue;                   // 0x0010(0x0048)(ConstParm)
	struct FUIStatusDataLeft                      CallFunc_GetLeftData_ReturnValue;                  // 0x0058(0x0070)(ConstParm)
	bool                                          CallFunc_UseLevelUpParts_ReturnValue;              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82EA[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUIStatusDataUpParam                   CallFunc_GetUpParam_ReturnValue_1;                 // 0x00D0(0x0048)(ConstParm)
	struct FUIStatusDataLeft                      CallFunc_GetLeftData_ReturnValue_1;                // 0x0118(0x0070)(ConstParm)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CharaStatus_C_UpdateStatus_Inherit) == 0x000008, "Wrong alignment on WB_CharaStatus_C_UpdateStatus_Inherit");
static_assert(sizeof(WB_CharaStatus_C_UpdateStatus_Inherit) == 0x000190, "Wrong size on WB_CharaStatus_C_UpdateStatus_Inherit");
static_assert(offsetof(WB_CharaStatus_C_UpdateStatus_Inherit, StatusDataObj) == 0x000000, "Member 'WB_CharaStatus_C_UpdateStatus_Inherit::StatusDataObj' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_UpdateStatus_Inherit, ParentTopIndex) == 0x000008, "Member 'WB_CharaStatus_C_UpdateStatus_Inherit::ParentTopIndex' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_UpdateStatus_Inherit, ChildTopIndex) == 0x00000C, "Member 'WB_CharaStatus_C_UpdateStatus_Inherit::ChildTopIndex' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_UpdateStatus_Inherit, CallFunc_GetUpParam_ReturnValue) == 0x000010, "Member 'WB_CharaStatus_C_UpdateStatus_Inherit::CallFunc_GetUpParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_UpdateStatus_Inherit, CallFunc_GetLeftData_ReturnValue) == 0x000058, "Member 'WB_CharaStatus_C_UpdateStatus_Inherit::CallFunc_GetLeftData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_UpdateStatus_Inherit, CallFunc_UseLevelUpParts_ReturnValue) == 0x0000C8, "Member 'WB_CharaStatus_C_UpdateStatus_Inherit::CallFunc_UseLevelUpParts_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_UpdateStatus_Inherit, CallFunc_SelectInt_ReturnValue) == 0x0000CC, "Member 'WB_CharaStatus_C_UpdateStatus_Inherit::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_UpdateStatus_Inherit, CallFunc_GetUpParam_ReturnValue_1) == 0x0000D0, "Member 'WB_CharaStatus_C_UpdateStatus_Inherit::CallFunc_GetUpParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_UpdateStatus_Inherit, CallFunc_GetLeftData_ReturnValue_1) == 0x000118, "Member 'WB_CharaStatus_C_UpdateStatus_Inherit::CallFunc_GetLeftData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_UpdateStatus_Inherit, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000188, "Member 'WB_CharaStatus_C_UpdateStatus_Inherit::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CharaStatus.WB_CharaStatus_C.ShowStatus_Inherit
// 0x0190 (0x0190 - 0x0000)
struct WB_CharaStatus_C_ShowStatus_Inherit final
{
public:
	class UUIStatusCtrlDataObjBase*               StatusDataObj;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_STATUS_PAGE_TYPE                         In_UIType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82EB[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIStatusDataUpParam                   CallFunc_GetUpParam_ReturnValue;                   // 0x0010(0x0048)(ConstParm)
	struct FUIStatusDataLeft                      CallFunc_GetLeftData_ReturnValue;                  // 0x0058(0x0070)(ConstParm)
	bool                                          CallFunc_UseLevelUpParts_ReturnValue;              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82EC[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUIStatusDataUpParam                   CallFunc_GetUpParam_ReturnValue_1;                 // 0x00D0(0x0048)(ConstParm)
	struct FUIStatusDataLeft                      CallFunc_GetLeftData_ReturnValue_1;                // 0x0118(0x0070)(ConstParm)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CharaStatus_C_ShowStatus_Inherit) == 0x000008, "Wrong alignment on WB_CharaStatus_C_ShowStatus_Inherit");
static_assert(sizeof(WB_CharaStatus_C_ShowStatus_Inherit) == 0x000190, "Wrong size on WB_CharaStatus_C_ShowStatus_Inherit");
static_assert(offsetof(WB_CharaStatus_C_ShowStatus_Inherit, StatusDataObj) == 0x000000, "Member 'WB_CharaStatus_C_ShowStatus_Inherit::StatusDataObj' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_ShowStatus_Inherit, In_UIType) == 0x000008, "Member 'WB_CharaStatus_C_ShowStatus_Inherit::In_UIType' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_ShowStatus_Inherit, CallFunc_GetUpParam_ReturnValue) == 0x000010, "Member 'WB_CharaStatus_C_ShowStatus_Inherit::CallFunc_GetUpParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_ShowStatus_Inherit, CallFunc_GetLeftData_ReturnValue) == 0x000058, "Member 'WB_CharaStatus_C_ShowStatus_Inherit::CallFunc_GetLeftData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_ShowStatus_Inherit, CallFunc_UseLevelUpParts_ReturnValue) == 0x0000C8, "Member 'WB_CharaStatus_C_ShowStatus_Inherit::CallFunc_UseLevelUpParts_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_ShowStatus_Inherit, CallFunc_SelectInt_ReturnValue) == 0x0000CC, "Member 'WB_CharaStatus_C_ShowStatus_Inherit::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_ShowStatus_Inherit, CallFunc_GetUpParam_ReturnValue_1) == 0x0000D0, "Member 'WB_CharaStatus_C_ShowStatus_Inherit::CallFunc_GetUpParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_ShowStatus_Inherit, CallFunc_GetLeftData_ReturnValue_1) == 0x000118, "Member 'WB_CharaStatus_C_ShowStatus_Inherit::CallFunc_GetLeftData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_ShowStatus_Inherit, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000188, "Member 'WB_CharaStatus_C_ShowStatus_Inherit::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CharaStatus.WB_CharaStatus_C.TextOrder
// 0x00C8 (0x00C8 - 0x0000)
struct WB_CharaStatus_C_TextOrder final
{
public:
	E_UI_STATUS_FUSION_ORDER                      Order;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82ED[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OrderText;                                         // 0x0008(0x0018)(Parm, OutParm)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82EE[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_2;            // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_3;            // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_4;            // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82EF[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTextByLabel_ReturnValue;               // 0x0050(0x0018)()
	class FText                                   CallFunc_GetTextByLabel_ReturnValue_1;             // 0x0068(0x0018)()
	class FText                                   CallFunc_GetTextByLabel_ReturnValue_2;             // 0x0080(0x0018)()
	class FText                                   CallFunc_GetTextByLabel_ReturnValue_3;             // 0x0098(0x0018)()
	class FText                                   CallFunc_GetTextByLabel_ReturnValue_4;             // 0x00B0(0x0018)()
};
static_assert(alignof(WB_CharaStatus_C_TextOrder) == 0x000008, "Wrong alignment on WB_CharaStatus_C_TextOrder");
static_assert(sizeof(WB_CharaStatus_C_TextOrder) == 0x0000C8, "Wrong size on WB_CharaStatus_C_TextOrder");
static_assert(offsetof(WB_CharaStatus_C_TextOrder, Order) == 0x000000, "Member 'WB_CharaStatus_C_TextOrder::Order' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_TextOrder, OrderText) == 0x000008, "Member 'WB_CharaStatus_C_TextOrder::OrderText' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_TextOrder, CallFunc_MakeLiteralName_ReturnValue) == 0x000020, "Member 'WB_CharaStatus_C_TextOrder::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_TextOrder, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'WB_CharaStatus_C_TextOrder::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_TextOrder, CallFunc_MakeLiteralName_ReturnValue_1) == 0x00002C, "Member 'WB_CharaStatus_C_TextOrder::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_TextOrder, CallFunc_MakeLiteralName_ReturnValue_2) == 0x000034, "Member 'WB_CharaStatus_C_TextOrder::CallFunc_MakeLiteralName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_CharaStatus_C_TextOrder, CallFunc_MakeLiteralName_ReturnValue_3) == 0x00003C, "Member 'WB_CharaStatus_C_TextOrder::CallFunc_MakeLiteralName_ReturnValue_3' has a wrong offset!");
