#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CommonWindow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_CommonWindow.WB_CommonWindow_C.ExecuteUbergraph_WB_CommonWindow
// 0x0060 (0x0060 - 0x0000)
struct WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6491[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6492[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0024(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow) == 0x000004, "Wrong alignment on WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow");
static_assert(sizeof(WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow) == 0x000060, "Wrong size on WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow");
static_assert(offsetof(WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow, EntryPoint) == 0x000000, "Member 'WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow, CallFunc_Play_ReturnValue) == 0x000004, "Member 'WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow, CallFunc_Play_ReturnValue_1) == 0x000005, "Member 'WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow, K2Node_ComponentBoundEvent_AnimPackName) == 0x000008, "Member 'WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow::K2Node_ComponentBoundEvent_AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow, K2Node_ComponentBoundEvent_AnimationName) == 0x000010, "Member 'WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow::K2Node_ComponentBoundEvent_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow, K2Node_ComponentBoundEvent_AnimPackIndex) == 0x000018, "Member 'WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow::K2Node_ComponentBoundEvent_AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow, K2Node_ComponentBoundEvent_AnimationIndex) == 0x00001C, "Member 'WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow::K2Node_ComponentBoundEvent_AnimationIndex' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow, K2Node_SwitchName_CmpSuccess) == 0x000020, "Member 'WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow, CallFunc_Play_ReturnValue_2) == 0x000021, "Member 'WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow, K2Node_Event_MyGeometry) == 0x000024, "Member 'WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow, K2Node_Event_InDeltaTime) == 0x00005C, "Member 'WB_CommonWindow_C_ExecuteUbergraph_WB_CommonWindow::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function WB_CommonWindow.WB_CommonWindow_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_CommonWindow_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CommonWindow_C_Tick) == 0x000004, "Wrong alignment on WB_CommonWindow_C_Tick");
static_assert(sizeof(WB_CommonWindow_C_Tick) == 0x00003C, "Wrong size on WB_CommonWindow_C_Tick");
static_assert(offsetof(WB_CommonWindow_C_Tick, MyGeometry) == 0x000000, "Member 'WB_CommonWindow_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_CommonWindow_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_CommonWindow.WB_CommonWindow_C.BndEvt__SsPlayerSearch_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_CommonWindow_C_BndEvt__SsPlayerSearch_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CommonWindow_C_BndEvt__SsPlayerSearch_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_CommonWindow_C_BndEvt__SsPlayerSearch_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_CommonWindow_C_BndEvt__SsPlayerSearch_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_CommonWindow_C_BndEvt__SsPlayerSearch_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_CommonWindow_C_BndEvt__SsPlayerSearch_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_CommonWindow_C_BndEvt__SsPlayerSearch_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_BndEvt__SsPlayerSearch_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_CommonWindow_C_BndEvt__SsPlayerSearch_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_BndEvt__SsPlayerSearch_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_CommonWindow_C_BndEvt__SsPlayerSearch_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_BndEvt__SsPlayerSearch_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_CommonWindow_C_BndEvt__SsPlayerSearch_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_CommonWindow.WB_CommonWindow_C.SetActionWindowTextByLabel
// 0x0020 (0x0020 - 0x0000)
struct WB_CommonWindow_C_SetActionWindowTextByLabel final
{
public:
	class UScriptMessageAsset*                    InScriptMessageAsset;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InLabel;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetScriptMessageByLabel_self_CastInput;   // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CommonWindow_C_SetActionWindowTextByLabel) == 0x000008, "Wrong alignment on WB_CommonWindow_C_SetActionWindowTextByLabel");
static_assert(sizeof(WB_CommonWindow_C_SetActionWindowTextByLabel) == 0x000020, "Wrong size on WB_CommonWindow_C_SetActionWindowTextByLabel");
static_assert(offsetof(WB_CommonWindow_C_SetActionWindowTextByLabel, InScriptMessageAsset) == 0x000000, "Member 'WB_CommonWindow_C_SetActionWindowTextByLabel::InScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_SetActionWindowTextByLabel, InLabel) == 0x000008, "Member 'WB_CommonWindow_C_SetActionWindowTextByLabel::InLabel' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_SetActionWindowTextByLabel, CallFunc_SetScriptMessageByLabel_self_CastInput) == 0x000010, "Member 'WB_CommonWindow_C_SetActionWindowTextByLabel::CallFunc_SetScriptMessageByLabel_self_CastInput' has a wrong offset!");

// Function WB_CommonWindow.WB_CommonWindow_C.SetActionWindowTextByIndex
// 0x0020 (0x0020 - 0x0000)
struct WB_CommonWindow_C_SetActionWindowTextByIndex final
{
public:
	class UScriptMessageAsset*                    InScriptMessageAsset;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InIndex;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6493[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetScriptMessageByID_self_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CommonWindow_C_SetActionWindowTextByIndex) == 0x000008, "Wrong alignment on WB_CommonWindow_C_SetActionWindowTextByIndex");
static_assert(sizeof(WB_CommonWindow_C_SetActionWindowTextByIndex) == 0x000020, "Wrong size on WB_CommonWindow_C_SetActionWindowTextByIndex");
static_assert(offsetof(WB_CommonWindow_C_SetActionWindowTextByIndex, InScriptMessageAsset) == 0x000000, "Member 'WB_CommonWindow_C_SetActionWindowTextByIndex::InScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_SetActionWindowTextByIndex, InIndex) == 0x000008, "Member 'WB_CommonWindow_C_SetActionWindowTextByIndex::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_SetActionWindowTextByIndex, CallFunc_SetScriptMessageByID_self_CastInput) == 0x000010, "Member 'WB_CommonWindow_C_SetActionWindowTextByIndex::CallFunc_SetScriptMessageByID_self_CastInput' has a wrong offset!");

// Function WB_CommonWindow.WB_CommonWindow_C.SetIcon
// 0x0020 (0x0020 - 0x0000)
struct WB_CommonWindow_C_SetIcon final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BTN_HELP_MAPPING_KEY_TYPE                   InActionMap;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6494[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_CalcIconPosition_OutVec;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_CalcTranslation_OutVec;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CommonWindow_C_SetIcon) == 0x000008, "Wrong alignment on WB_CommonWindow_C_SetIcon");
static_assert(sizeof(WB_CommonWindow_C_SetIcon) == 0x000020, "Wrong size on WB_CommonWindow_C_SetIcon");
static_assert(offsetof(WB_CommonWindow_C_SetIcon, InIndex) == 0x000000, "Member 'WB_CommonWindow_C_SetIcon::InIndex' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_SetIcon, InActionMap) == 0x000004, "Member 'WB_CommonWindow_C_SetIcon::InActionMap' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_SetIcon, CallFunc_CalcIconPosition_OutVec) == 0x000008, "Member 'WB_CommonWindow_C_SetIcon::CallFunc_CalcIconPosition_OutVec' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_SetIcon, CallFunc_CalcTranslation_OutVec) == 0x000010, "Member 'WB_CommonWindow_C_SetIcon::CallFunc_CalcTranslation_OutVec' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_SetIcon, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000018, "Member 'WB_CommonWindow_C_SetIcon::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function WB_CommonWindow.WB_CommonWindow_C.SetIconColor
// 0x0028 (0x0028 - 0x0000)
struct WB_CommonWindow_C_SetIconColor final
{
public:
	int32                                         InColorType;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6495[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLinearColor>                   ColorTable;                                        // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<struct FLinearColor>                   K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
};
static_assert(alignof(WB_CommonWindow_C_SetIconColor) == 0x000008, "Wrong alignment on WB_CommonWindow_C_SetIconColor");
static_assert(sizeof(WB_CommonWindow_C_SetIconColor) == 0x000028, "Wrong size on WB_CommonWindow_C_SetIconColor");
static_assert(offsetof(WB_CommonWindow_C_SetIconColor, InColorType) == 0x000000, "Member 'WB_CommonWindow_C_SetIconColor::InColorType' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_SetIconColor, ColorTable) == 0x000008, "Member 'WB_CommonWindow_C_SetIconColor::ColorTable' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_SetIconColor, K2Node_MakeArray_Array) == 0x000018, "Member 'WB_CommonWindow_C_SetIconColor::K2Node_MakeArray_Array' has a wrong offset!");

// Function WB_CommonWindow.WB_CommonWindow_C.IsActionWindowActive
// 0x0002 (0x0002 - 0x0000)
struct WB_CommonWindow_C_IsActionWindowActive final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CommonWindow_C_IsActionWindowActive) == 0x000001, "Wrong alignment on WB_CommonWindow_C_IsActionWindowActive");
static_assert(sizeof(WB_CommonWindow_C_IsActionWindowActive) == 0x000002, "Wrong size on WB_CommonWindow_C_IsActionWindowActive");
static_assert(offsetof(WB_CommonWindow_C_IsActionWindowActive, OutParam) == 0x000000, "Member 'WB_CommonWindow_C_IsActionWindowActive::OutParam' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_IsActionWindowActive, CallFunc_IsVisible_ReturnValue) == 0x000001, "Member 'WB_CommonWindow_C_IsActionWindowActive::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function WB_CommonWindow.WB_CommonWindow_C.SetIconDispMode
// 0x0020 (0x0020 - 0x0000)
struct WB_CommonWindow_C_SetIconDispMode final
{
public:
	bool                                          InMode;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6496[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_CalcTranslation_OutVec;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_CalcIconPosition_OutVec;                  // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6497[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CommonWindow_C_SetIconDispMode) == 0x000008, "Wrong alignment on WB_CommonWindow_C_SetIconDispMode");
static_assert(sizeof(WB_CommonWindow_C_SetIconDispMode) == 0x000020, "Wrong size on WB_CommonWindow_C_SetIconDispMode");
static_assert(offsetof(WB_CommonWindow_C_SetIconDispMode, InMode) == 0x000000, "Member 'WB_CommonWindow_C_SetIconDispMode::InMode' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_SetIconDispMode, CallFunc_CalcTranslation_OutVec) == 0x000004, "Member 'WB_CommonWindow_C_SetIconDispMode::CallFunc_CalcTranslation_OutVec' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_SetIconDispMode, CallFunc_CalcIconPosition_OutVec) == 0x00000C, "Member 'WB_CommonWindow_C_SetIconDispMode::CallFunc_CalcIconPosition_OutVec' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_SetIconDispMode, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000018, "Member 'WB_CommonWindow_C_SetIconDispMode::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function WB_CommonWindow.WB_CommonWindow_C.CalcTranslation
// 0x0028 (0x0028 - 0x0000)
struct WB_CommonWindow_C_CalcTranslation final
{
public:
	struct FVector2D                              OutVec;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CommonWindow_C_CalcTranslation) == 0x000004, "Wrong alignment on WB_CommonWindow_C_CalcTranslation");
static_assert(sizeof(WB_CommonWindow_C_CalcTranslation) == 0x000028, "Wrong size on WB_CommonWindow_C_CalcTranslation");
static_assert(offsetof(WB_CommonWindow_C_CalcTranslation, OutVec) == 0x000000, "Member 'WB_CommonWindow_C_CalcTranslation::OutVec' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_CalcTranslation, CallFunc_GetDesiredSize_ReturnValue) == 0x000008, "Member 'WB_CommonWindow_C_CalcTranslation::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_CalcTranslation, CallFunc_BreakVector2D_X) == 0x000010, "Member 'WB_CommonWindow_C_CalcTranslation::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_CalcTranslation, CallFunc_BreakVector2D_Y) == 0x000014, "Member 'WB_CommonWindow_C_CalcTranslation::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_CalcTranslation, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000018, "Member 'WB_CommonWindow_C_CalcTranslation::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_CalcTranslation, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'WB_CommonWindow_C_CalcTranslation::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_CalcTranslation, CallFunc_MakeVector2D_ReturnValue) == 0x000020, "Member 'WB_CommonWindow_C_CalcTranslation::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WB_CommonWindow.WB_CommonWindow_C.CalcIconPosition
// 0x0044 (0x0044 - 0x0000)
struct WB_CommonWindow_C_CalcIconPosition final
{
public:
	struct FVector2D                              OutVec;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue_1;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CommonWindow_C_CalcIconPosition) == 0x000004, "Wrong alignment on WB_CommonWindow_C_CalcIconPosition");
static_assert(sizeof(WB_CommonWindow_C_CalcIconPosition) == 0x000044, "Wrong size on WB_CommonWindow_C_CalcIconPosition");
static_assert(offsetof(WB_CommonWindow_C_CalcIconPosition, OutVec) == 0x000000, "Member 'WB_CommonWindow_C_CalcIconPosition::OutVec' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_CalcIconPosition, CallFunc_GetDesiredSize_ReturnValue) == 0x000008, "Member 'WB_CommonWindow_C_CalcIconPosition::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_CalcIconPosition, CallFunc_BreakVector2D_X) == 0x000010, "Member 'WB_CommonWindow_C_CalcIconPosition::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_CalcIconPosition, CallFunc_BreakVector2D_Y) == 0x000014, "Member 'WB_CommonWindow_C_CalcIconPosition::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_CalcIconPosition, CallFunc_GetDesiredSize_ReturnValue_1) == 0x000018, "Member 'WB_CommonWindow_C_CalcIconPosition::CallFunc_GetDesiredSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_CalcIconPosition, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'WB_CommonWindow_C_CalcIconPosition::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_CalcIconPosition, CallFunc_BreakVector2D_X_1) == 0x000024, "Member 'WB_CommonWindow_C_CalcIconPosition::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_CalcIconPosition, CallFunc_BreakVector2D_Y_1) == 0x000028, "Member 'WB_CommonWindow_C_CalcIconPosition::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_CalcIconPosition, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'WB_CommonWindow_C_CalcIconPosition::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_CalcIconPosition, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000030, "Member 'WB_CommonWindow_C_CalcIconPosition::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_CalcIconPosition, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000034, "Member 'WB_CommonWindow_C_CalcIconPosition::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_CalcIconPosition, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000038, "Member 'WB_CommonWindow_C_CalcIconPosition::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CommonWindow_C_CalcIconPosition, CallFunc_MakeVector2D_ReturnValue) == 0x00003C, "Member 'WB_CommonWindow_C_CalcIconPosition::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

}

