#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CampNumSelector

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_CampNumSelector.WB_CampNumSelector_C.GetNumber
// 0x0004 (0x0004 - 0x0000)
struct WB_CampNumSelector_C_GetNumber final
{
public:
	int32                                         Param_Number;                                      // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampNumSelector_C_GetNumber) == 0x000004, "Wrong alignment on WB_CampNumSelector_C_GetNumber");
static_assert(sizeof(WB_CampNumSelector_C_GetNumber) == 0x000004, "Wrong size on WB_CampNumSelector_C_GetNumber");
static_assert(offsetof(WB_CampNumSelector_C_GetNumber, Param_Number) == 0x000000, "Member 'WB_CampNumSelector_C_GetNumber::Param_Number' has a wrong offset!");

// Function WB_CampNumSelector.WB_CampNumSelector_C.OnFinishedBaseAnim
// 0x0014 (0x0014 - 0x0000)
struct WB_CampNumSelector_C_OnFinishedBaseAnim final
{
public:
	class FName                                   InAnimPackName;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InAnimationName;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampNumSelector_C_OnFinishedBaseAnim) == 0x000004, "Wrong alignment on WB_CampNumSelector_C_OnFinishedBaseAnim");
static_assert(sizeof(WB_CampNumSelector_C_OnFinishedBaseAnim) == 0x000014, "Wrong size on WB_CampNumSelector_C_OnFinishedBaseAnim");
static_assert(offsetof(WB_CampNumSelector_C_OnFinishedBaseAnim, InAnimPackName) == 0x000000, "Member 'WB_CampNumSelector_C_OnFinishedBaseAnim::InAnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_OnFinishedBaseAnim, InAnimationName) == 0x000008, "Member 'WB_CampNumSelector_C_OnFinishedBaseAnim::InAnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_OnFinishedBaseAnim, K2Node_SwitchName_CmpSuccess) == 0x000010, "Member 'WB_CampNumSelector_C_OnFinishedBaseAnim::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function WB_CampNumSelector.WB_CampNumSelector_C.PlayAnim_Down
// 0x0001 (0x0001 - 0x0000)
struct WB_CampNumSelector_C_PlayAnim_Down final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampNumSelector_C_PlayAnim_Down) == 0x000001, "Wrong alignment on WB_CampNumSelector_C_PlayAnim_Down");
static_assert(sizeof(WB_CampNumSelector_C_PlayAnim_Down) == 0x000001, "Wrong size on WB_CampNumSelector_C_PlayAnim_Down");
static_assert(offsetof(WB_CampNumSelector_C_PlayAnim_Down, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampNumSelector_C_PlayAnim_Down::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampNumSelector.WB_CampNumSelector_C.PlayAnim_Up
// 0x0001 (0x0001 - 0x0000)
struct WB_CampNumSelector_C_PlayAnim_Up final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampNumSelector_C_PlayAnim_Up) == 0x000001, "Wrong alignment on WB_CampNumSelector_C_PlayAnim_Up");
static_assert(sizeof(WB_CampNumSelector_C_PlayAnim_Up) == 0x000001, "Wrong size on WB_CampNumSelector_C_PlayAnim_Up");
static_assert(offsetof(WB_CampNumSelector_C_PlayAnim_Up, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_CampNumSelector_C_PlayAnim_Up::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampNumSelector.WB_CampNumSelector_C.Play Anim Main
// 0x000C (0x000C - 0x0000)
struct WB_CampNumSelector_C_Play_Anim_Main final
{
public:
	class FName                                   InState;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampNumSelector_C_Play_Anim_Main) == 0x000004, "Wrong alignment on WB_CampNumSelector_C_Play_Anim_Main");
static_assert(sizeof(WB_CampNumSelector_C_Play_Anim_Main) == 0x00000C, "Wrong size on WB_CampNumSelector_C_Play_Anim_Main");
static_assert(offsetof(WB_CampNumSelector_C_Play_Anim_Main, InState) == 0x000000, "Member 'WB_CampNumSelector_C_Play_Anim_Main::InState' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_Play_Anim_Main, CallFunc_Play_ReturnValue) == 0x000008, "Member 'WB_CampNumSelector_C_Play_Anim_Main::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_CampNumSelector.WB_CampNumSelector_C.SetNumber
// 0x0018 (0x0018 - 0x0000)
struct WB_CampNumSelector_C_SetNumber final
{
public:
	int32                                         InNum;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampNumSelector_C_SetNumber) == 0x000004, "Wrong alignment on WB_CampNumSelector_C_SetNumber");
static_assert(sizeof(WB_CampNumSelector_C_SetNumber) == 0x000018, "Wrong size on WB_CampNumSelector_C_SetNumber");
static_assert(offsetof(WB_CampNumSelector_C_SetNumber, InNum) == 0x000000, "Member 'WB_CampNumSelector_C_SetNumber::InNum' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_SetNumber, CallFunc_Clamp_ReturnValue) == 0x000004, "Member 'WB_CampNumSelector_C_SetNumber::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_SetNumber, CallFunc_Divide_IntInt_ReturnValue) == 0x000008, "Member 'WB_CampNumSelector_C_SetNumber::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_SetNumber, CallFunc_Percent_IntInt_ReturnValue) == 0x00000C, "Member 'WB_CampNumSelector_C_SetNumber::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_SetNumber, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000010, "Member 'WB_CampNumSelector_C_SetNumber::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_SetNumber, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'WB_CampNumSelector_C_SetNumber::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_CampNumSelector.WB_CampNumSelector_C.SetNumImgParam
// 0x0030 (0x0030 - 0x0000)
struct WB_CampNumSelector_C_SetNumImgParam final
{
public:
	class UImage*                                 InImg;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InNum;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_90EB[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampNumSelector_C_SetNumImgParam) == 0x000008, "Wrong alignment on WB_CampNumSelector_C_SetNumImgParam");
static_assert(sizeof(WB_CampNumSelector_C_SetNumImgParam) == 0x000030, "Wrong size on WB_CampNumSelector_C_SetNumImgParam");
static_assert(offsetof(WB_CampNumSelector_C_SetNumImgParam, InImg) == 0x000000, "Member 'WB_CampNumSelector_C_SetNumImgParam::InImg' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_SetNumImgParam, InNum) == 0x000008, "Member 'WB_CampNumSelector_C_SetNumImgParam::InNum' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_SetNumImgParam, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WB_CampNumSelector_C_SetNumImgParam::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_SetNumImgParam, CallFunc_Clamp_ReturnValue) == 0x000018, "Member 'WB_CampNumSelector_C_SetNumImgParam::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_SetNumImgParam, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00001C, "Member 'WB_CampNumSelector_C_SetNumImgParam::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_SetNumImgParam, K2Node_MakeStruct_LinearColor) == 0x000020, "Member 'WB_CampNumSelector_C_SetNumImgParam::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function WB_CampNumSelector.WB_CampNumSelector_C.BndEvt__SsPlayerWidget_Buy_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_CampNumSelector_C_BndEvt__SsPlayerWidget_Buy_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampNumSelector_C_BndEvt__SsPlayerWidget_Buy_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_CampNumSelector_C_BndEvt__SsPlayerWidget_Buy_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_CampNumSelector_C_BndEvt__SsPlayerWidget_Buy_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_CampNumSelector_C_BndEvt__SsPlayerWidget_Buy_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_CampNumSelector_C_BndEvt__SsPlayerWidget_Buy_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_CampNumSelector_C_BndEvt__SsPlayerWidget_Buy_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_BndEvt__SsPlayerWidget_Buy_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_CampNumSelector_C_BndEvt__SsPlayerWidget_Buy_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_BndEvt__SsPlayerWidget_Buy_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_CampNumSelector_C_BndEvt__SsPlayerWidget_Buy_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_BndEvt__SsPlayerWidget_Buy_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_CampNumSelector_C_BndEvt__SsPlayerWidget_Buy_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_CampNumSelector.WB_CampNumSelector_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_CampNumSelector_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampNumSelector_C_PreConstruct) == 0x000001, "Wrong alignment on WB_CampNumSelector_C_PreConstruct");
static_assert(sizeof(WB_CampNumSelector_C_PreConstruct) == 0x000001, "Wrong size on WB_CampNumSelector_C_PreConstruct");
static_assert(offsetof(WB_CampNumSelector_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_CampNumSelector_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_CampNumSelector.WB_CampNumSelector_C.BndEvt__WB_ShopItemNumSelector_ButtonS5_Up_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_CampNumSelector_C_BndEvt__WB_ShopItemNumSelector_ButtonS5_Up_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              UV;                                                // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampNumSelector_C_BndEvt__WB_ShopItemNumSelector_ButtonS5_Up_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature) == 0x000004, "Wrong alignment on WB_CampNumSelector_C_BndEvt__WB_ShopItemNumSelector_ButtonS5_Up_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature");
static_assert(sizeof(WB_CampNumSelector_C_BndEvt__WB_ShopItemNumSelector_ButtonS5_Up_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature) == 0x000010, "Wrong size on WB_CampNumSelector_C_BndEvt__WB_ShopItemNumSelector_ButtonS5_Up_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature");
static_assert(offsetof(WB_CampNumSelector_C_BndEvt__WB_ShopItemNumSelector_ButtonS5_Up_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature, Pos) == 0x000000, "Member 'WB_CampNumSelector_C_BndEvt__WB_ShopItemNumSelector_ButtonS5_Up_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature::Pos' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_BndEvt__WB_ShopItemNumSelector_ButtonS5_Up_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature, UV) == 0x000008, "Member 'WB_CampNumSelector_C_BndEvt__WB_ShopItemNumSelector_ButtonS5_Up_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature::UV' has a wrong offset!");

// Function WB_CampNumSelector.WB_CampNumSelector_C.BndEvt__WB_ShopItemNumSelector_ButtonS5_Down_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_CampNumSelector_C_BndEvt__WB_ShopItemNumSelector_ButtonS5_Down_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              UV;                                                // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampNumSelector_C_BndEvt__WB_ShopItemNumSelector_ButtonS5_Down_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature) == 0x000004, "Wrong alignment on WB_CampNumSelector_C_BndEvt__WB_ShopItemNumSelector_ButtonS5_Down_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature");
static_assert(sizeof(WB_CampNumSelector_C_BndEvt__WB_ShopItemNumSelector_ButtonS5_Down_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature) == 0x000010, "Wrong size on WB_CampNumSelector_C_BndEvt__WB_ShopItemNumSelector_ButtonS5_Down_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature");
static_assert(offsetof(WB_CampNumSelector_C_BndEvt__WB_ShopItemNumSelector_ButtonS5_Down_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature, Pos) == 0x000000, "Member 'WB_CampNumSelector_C_BndEvt__WB_ShopItemNumSelector_ButtonS5_Down_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature::Pos' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_BndEvt__WB_ShopItemNumSelector_ButtonS5_Down_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature, UV) == 0x000008, "Member 'WB_CampNumSelector_C_BndEvt__WB_ShopItemNumSelector_ButtonS5_Down_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature::UV' has a wrong offset!");

// Function WB_CampNumSelector.WB_CampNumSelector_C.ExecuteUbergraph_WB_CampNumSelector
// 0x0040 (0x0040 - 0x0000)
struct WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName;           // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName;          // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_90EC[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_ComponentBoundEvent_Pos_1;                  // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_UV_1;                   // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_Pos;                    // 0x0030(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_UV;                     // 0x0038(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector) == 0x000004, "Wrong alignment on WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector");
static_assert(sizeof(WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector) == 0x000040, "Wrong size on WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector");
static_assert(offsetof(WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector, EntryPoint) == 0x000000, "Member 'WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector, K2Node_ComponentBoundEvent_AnimPackName) == 0x000004, "Member 'WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector::K2Node_ComponentBoundEvent_AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector, K2Node_ComponentBoundEvent_AnimationName) == 0x00000C, "Member 'WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector::K2Node_ComponentBoundEvent_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector, K2Node_ComponentBoundEvent_AnimPackIndex) == 0x000014, "Member 'WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector::K2Node_ComponentBoundEvent_AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector, K2Node_ComponentBoundEvent_AnimationIndex) == 0x000018, "Member 'WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector::K2Node_ComponentBoundEvent_AnimationIndex' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector, K2Node_Event_IsDesignTime) == 0x00001C, "Member 'WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector, K2Node_ComponentBoundEvent_Pos_1) == 0x000020, "Member 'WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector::K2Node_ComponentBoundEvent_Pos_1' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector, K2Node_ComponentBoundEvent_UV_1) == 0x000028, "Member 'WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector::K2Node_ComponentBoundEvent_UV_1' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector, K2Node_ComponentBoundEvent_Pos) == 0x000030, "Member 'WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector::K2Node_ComponentBoundEvent_Pos' has a wrong offset!");
static_assert(offsetof(WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector, K2Node_ComponentBoundEvent_UV) == 0x000038, "Member 'WB_CampNumSelector_C_ExecuteUbergraph_WB_CampNumSelector::K2Node_ComponentBoundEvent_UV' has a wrong offset!");

// Function WB_CampNumSelector.WB_CampNumSelector_C.MouseEvent_OnClickedArrow__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WB_CampNumSelector_C_MouseEvent_OnClickedArrow__DelegateSignature final
{
public:
	bool                                          IsClicked_UP;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CampNumSelector_C_MouseEvent_OnClickedArrow__DelegateSignature) == 0x000001, "Wrong alignment on WB_CampNumSelector_C_MouseEvent_OnClickedArrow__DelegateSignature");
static_assert(sizeof(WB_CampNumSelector_C_MouseEvent_OnClickedArrow__DelegateSignature) == 0x000001, "Wrong size on WB_CampNumSelector_C_MouseEvent_OnClickedArrow__DelegateSignature");
static_assert(offsetof(WB_CampNumSelector_C_MouseEvent_OnClickedArrow__DelegateSignature, IsClicked_UP) == 0x000000, "Member 'WB_CampNumSelector_C_MouseEvent_OnClickedArrow__DelegateSignature::IsClicked_UP' has a wrong offset!");

}

