#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_DebugMenu_Box

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Project_structs.hpp"
#include "WB_DebugMenu_Base_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_DebugMenu_Box.WB_DebugMenu_Box_C
// 0x00A0 (0x0318 - 0x0278)
class UWB_DebugMenu_Box_C final : public UWB_DebugMenu_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           Canvas;                                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_PageSpace;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               TabBox;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ViewRange;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWB_DebugMenuTab_C*>             WB_Tab;                                            // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         ViewPageIndex;                                     // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ViewPageNum;                                       // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDebugMenuPageData                     Lo_Data;                                           // 0x02B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TSoftClassPtr<class UClass>                   WB_PageClassAssetId;                               // 0x02D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Const_DrawPageMax;                                 // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FCA[0x4];                                     // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Class_WbPage;                                      // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWB_DebugMenu_ItemBase_C*>       PageWidgetList;                                    // 0x0308(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_WB_DebugMenu_Box(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Delete();
	void CreateTopPage();
	void CallAction();
	void StartLoad();
	void OnLoaded_20877BBA43015E3F1DA8199118A0FAA9(TSubclassOf<class UObject> Loaded);
	void Cast_DebugMenuItemBase(class UUserWidget* Widget, class UWB_DebugMenu_ItemBase_C** WB_DebugMenuBase);
	void SlidePage();
	void AddPage(int32 PageId, bool IsDrawPlus);
	void CallMoveY(bool IsUp, bool IsLimitStop, bool* IsMove);
	void GetNowPageWidget(class UWB_DebugMenu_ItemBase_C** AsWB_Debug_Menu_Base, bool* bSuccess);
	void ClosePage(bool* IsEnd);
	void CallCancel(bool* IsEnd);
	void CheckMouse();
	void UpDataActivePagePathName();
	void UpdateAlwaysFunc();
	void TypeFunc_CallFunc();
	void UnInit();
	void Init(TScriptInterface<class IBPI_DebugMenuUI_C> Param_BPI_DebugMenu);
	void CallAddParam(int32 Add);
	void CallMoveCurosrPullDown(int32 Add);
	void CallEndPullDown(bool IsCancel);
	void CallEndParam(bool IsCancel);
	void IsLoad(bool* Param_IsLoad);
	void GetIsKeyLock(bool* Param_IsKeyLock);
	void TypeFunc_IsKeyLock(bool* Param_IsKeyLock);
	void TypeFunc_IsCall(bool* IsCall);
	void GetKeyType(E_D_MENU_TYPE* Param_KeyType);
	void CallMenuViewChange(bool IsView, bool* Ret);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_DebugMenu_Box_C">();
	}
	static class UWB_DebugMenu_Box_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_DebugMenu_Box_C>();
	}
};
static_assert(alignof(UWB_DebugMenu_Box_C) == 0x000008, "Wrong alignment on UWB_DebugMenu_Box_C");
static_assert(sizeof(UWB_DebugMenu_Box_C) == 0x000318, "Wrong size on UWB_DebugMenu_Box_C");
static_assert(offsetof(UWB_DebugMenu_Box_C, UberGraphFrame) == 0x000278, "Member 'UWB_DebugMenu_Box_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_DebugMenu_Box_C, Canvas) == 0x000280, "Member 'UWB_DebugMenu_Box_C::Canvas' has a wrong offset!");
static_assert(offsetof(UWB_DebugMenu_Box_C, Canvas_PageSpace) == 0x000288, "Member 'UWB_DebugMenu_Box_C::Canvas_PageSpace' has a wrong offset!");
static_assert(offsetof(UWB_DebugMenu_Box_C, TabBox) == 0x000290, "Member 'UWB_DebugMenu_Box_C::TabBox' has a wrong offset!");
static_assert(offsetof(UWB_DebugMenu_Box_C, ViewRange) == 0x000298, "Member 'UWB_DebugMenu_Box_C::ViewRange' has a wrong offset!");
static_assert(offsetof(UWB_DebugMenu_Box_C, WB_Tab) == 0x0002A0, "Member 'UWB_DebugMenu_Box_C::WB_Tab' has a wrong offset!");
static_assert(offsetof(UWB_DebugMenu_Box_C, ViewPageIndex) == 0x0002B0, "Member 'UWB_DebugMenu_Box_C::ViewPageIndex' has a wrong offset!");
static_assert(offsetof(UWB_DebugMenu_Box_C, ViewPageNum) == 0x0002B4, "Member 'UWB_DebugMenu_Box_C::ViewPageNum' has a wrong offset!");
static_assert(offsetof(UWB_DebugMenu_Box_C, Lo_Data) == 0x0002B8, "Member 'UWB_DebugMenu_Box_C::Lo_Data' has a wrong offset!");
static_assert(offsetof(UWB_DebugMenu_Box_C, WB_PageClassAssetId) == 0x0002D0, "Member 'UWB_DebugMenu_Box_C::WB_PageClassAssetId' has a wrong offset!");
static_assert(offsetof(UWB_DebugMenu_Box_C, Const_DrawPageMax) == 0x0002F8, "Member 'UWB_DebugMenu_Box_C::Const_DrawPageMax' has a wrong offset!");
static_assert(offsetof(UWB_DebugMenu_Box_C, Class_WbPage) == 0x000300, "Member 'UWB_DebugMenu_Box_C::Class_WbPage' has a wrong offset!");
static_assert(offsetof(UWB_DebugMenu_Box_C, PageWidgetList) == 0x000308, "Member 'UWB_DebugMenu_Box_C::PageWidgetList' has a wrong offset!");

}

