#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_DialogSelectMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_DialogSelectMenu.WB_DialogSelectMenu_C.OnAnyItemClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WB_DialogSelectMenu_C_OnAnyItemClicked__DelegateSignature final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogSelectMenu_C_OnAnyItemClicked__DelegateSignature) == 0x000004, "Wrong alignment on WB_DialogSelectMenu_C_OnAnyItemClicked__DelegateSignature");
static_assert(sizeof(WB_DialogSelectMenu_C_OnAnyItemClicked__DelegateSignature) == 0x000004, "Wrong size on WB_DialogSelectMenu_C_OnAnyItemClicked__DelegateSignature");
static_assert(offsetof(WB_DialogSelectMenu_C_OnAnyItemClicked__DelegateSignature, ItemIndex) == 0x000000, "Member 'WB_DialogSelectMenu_C_OnAnyItemClicked__DelegateSignature::ItemIndex' has a wrong offset!");

// Function WB_DialogSelectMenu.WB_DialogSelectMenu_C.OnAnyItemSelected__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WB_DialogSelectMenu_C_OnAnyItemSelected__DelegateSignature final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogSelectMenu_C_OnAnyItemSelected__DelegateSignature) == 0x000004, "Wrong alignment on WB_DialogSelectMenu_C_OnAnyItemSelected__DelegateSignature");
static_assert(sizeof(WB_DialogSelectMenu_C_OnAnyItemSelected__DelegateSignature) == 0x000004, "Wrong size on WB_DialogSelectMenu_C_OnAnyItemSelected__DelegateSignature");
static_assert(offsetof(WB_DialogSelectMenu_C_OnAnyItemSelected__DelegateSignature, ItemIndex) == 0x000000, "Member 'WB_DialogSelectMenu_C_OnAnyItemSelected__DelegateSignature::ItemIndex' has a wrong offset!");

// Function WB_DialogSelectMenu.WB_DialogSelectMenu_C.ExecuteUbergraph_WB_DialogSelectMenu
// 0x0080 (0x0080 - 0x0000)
struct WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64D1[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_menunum;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InDefaultCursor;                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64D2[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 ItemIndex)>              K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64D3[0x1];                                     // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_ItemIndex_1;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ItemIndex;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64D4[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0034(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 ItemIndex)>              K2Node_CreateDelegate_OutputDelegate_1;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu) == 0x000004, "Wrong alignment on WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu");
static_assert(sizeof(WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu) == 0x000080, "Wrong size on WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu");
static_assert(offsetof(WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu, EntryPoint) == 0x000000, "Member 'WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu, CallFunc_Less_IntInt_ReturnValue) == 0x000005, "Member 'WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu, K2Node_CustomEvent_menunum) == 0x000008, "Member 'WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu::K2Node_CustomEvent_menunum' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu, K2Node_CustomEvent_InDefaultCursor) == 0x00000C, "Member 'WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu::K2Node_CustomEvent_InDefaultCursor' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000024, "Member 'WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000025, "Member 'WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu, CallFunc_Less_IntInt_ReturnValue_1) == 0x000026, "Member 'WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu, K2Node_CustomEvent_ItemIndex_1) == 0x000028, "Member 'WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu::K2Node_CustomEvent_ItemIndex_1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu, K2Node_CustomEvent_ItemIndex) == 0x00002C, "Member 'WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu::K2Node_CustomEvent_ItemIndex' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000030, "Member 'WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu, CallFunc_Less_IntInt_ReturnValue_2) == 0x000031, "Member 'WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu, K2Node_Event_MyGeometry) == 0x000034, "Member 'WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu, K2Node_Event_InDeltaTime) == 0x00006C, "Member 'WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000070, "Member 'WB_DialogSelectMenu_C_ExecuteUbergraph_WB_DialogSelectMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WB_DialogSelectMenu.WB_DialogSelectMenu_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_DialogSelectMenu_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogSelectMenu_C_Tick) == 0x000004, "Wrong alignment on WB_DialogSelectMenu_C_Tick");
static_assert(sizeof(WB_DialogSelectMenu_C_Tick) == 0x00003C, "Wrong size on WB_DialogSelectMenu_C_Tick");
static_assert(offsetof(WB_DialogSelectMenu_C_Tick, MyGeometry) == 0x000000, "Member 'WB_DialogSelectMenu_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_DialogSelectMenu_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_DialogSelectMenu.WB_DialogSelectMenu_C.OnMouseSelected
// 0x0004 (0x0004 - 0x0000)
struct WB_DialogSelectMenu_C_OnMouseSelected final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogSelectMenu_C_OnMouseSelected) == 0x000004, "Wrong alignment on WB_DialogSelectMenu_C_OnMouseSelected");
static_assert(sizeof(WB_DialogSelectMenu_C_OnMouseSelected) == 0x000004, "Wrong size on WB_DialogSelectMenu_C_OnMouseSelected");
static_assert(offsetof(WB_DialogSelectMenu_C_OnMouseSelected, ItemIndex) == 0x000000, "Member 'WB_DialogSelectMenu_C_OnMouseSelected::ItemIndex' has a wrong offset!");

// Function WB_DialogSelectMenu.WB_DialogSelectMenu_C.OnMoueClicked
// 0x0004 (0x0004 - 0x0000)
struct WB_DialogSelectMenu_C_OnMoueClicked final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogSelectMenu_C_OnMoueClicked) == 0x000004, "Wrong alignment on WB_DialogSelectMenu_C_OnMoueClicked");
static_assert(sizeof(WB_DialogSelectMenu_C_OnMoueClicked) == 0x000004, "Wrong size on WB_DialogSelectMenu_C_OnMoueClicked");
static_assert(offsetof(WB_DialogSelectMenu_C_OnMoueClicked, ItemIndex) == 0x000000, "Member 'WB_DialogSelectMenu_C_OnMoueClicked::ItemIndex' has a wrong offset!");

// Function WB_DialogSelectMenu.WB_DialogSelectMenu_C.Select_In
// 0x0008 (0x0008 - 0x0000)
struct WB_DialogSelectMenu_C_Select_In final
{
public:
	int32                                         MenuNum;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InDefaultCursor;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogSelectMenu_C_Select_In) == 0x000004, "Wrong alignment on WB_DialogSelectMenu_C_Select_In");
static_assert(sizeof(WB_DialogSelectMenu_C_Select_In) == 0x000008, "Wrong size on WB_DialogSelectMenu_C_Select_In");
static_assert(offsetof(WB_DialogSelectMenu_C_Select_In, MenuNum) == 0x000000, "Member 'WB_DialogSelectMenu_C_Select_In::MenuNum' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_Select_In, InDefaultCursor) == 0x000004, "Member 'WB_DialogSelectMenu_C_Select_In::InDefaultCursor' has a wrong offset!");

// Function WB_DialogSelectMenu.WB_DialogSelectMenu_C.DecSelect
// 0x000C (0x000C - 0x0000)
struct WB_DialogSelectMenu_C_DecSelect final
{
public:
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DialogSelectMenu_C_DecSelect) == 0x000004, "Wrong alignment on WB_DialogSelectMenu_C_DecSelect");
static_assert(sizeof(WB_DialogSelectMenu_C_DecSelect) == 0x00000C, "Wrong size on WB_DialogSelectMenu_C_DecSelect");
static_assert(offsetof(WB_DialogSelectMenu_C_DecSelect, CallFunc_Subtract_IntInt_ReturnValue) == 0x000000, "Member 'WB_DialogSelectMenu_C_DecSelect::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_DecSelect, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000004, "Member 'WB_DialogSelectMenu_C_DecSelect::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_DecSelect, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'WB_DialogSelectMenu_C_DecSelect::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_DecSelect, CallFunc_Less_IntInt_ReturnValue) == 0x000009, "Member 'WB_DialogSelectMenu_C_DecSelect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_DialogSelectMenu.WB_DialogSelectMenu_C.AddSelect
// 0x0010 (0x0010 - 0x0000)
struct WB_DialogSelectMenu_C_AddSelect final
{
public:
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64D5[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64D6[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogSelectMenu_C_AddSelect) == 0x000004, "Wrong alignment on WB_DialogSelectMenu_C_AddSelect");
static_assert(sizeof(WB_DialogSelectMenu_C_AddSelect) == 0x000010, "Wrong size on WB_DialogSelectMenu_C_AddSelect");
static_assert(offsetof(WB_DialogSelectMenu_C_AddSelect, CallFunc_Greater_IntInt_ReturnValue) == 0x000000, "Member 'WB_DialogSelectMenu_C_AddSelect::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_AddSelect, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WB_DialogSelectMenu_C_AddSelect::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_AddSelect, CallFunc_Less_IntInt_ReturnValue) == 0x000008, "Member 'WB_DialogSelectMenu_C_AddSelect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_AddSelect, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WB_DialogSelectMenu_C_AddSelect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WB_DialogSelectMenu.WB_DialogSelectMenu_C.SetSelectCursorText
// 0x0080 (0x0080 - 0x0000)
struct WB_DialogSelectMenu_C_SetSelectCursorText final
{
public:
	int32                                         CursorPos;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64D7[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_DialogSelect_C*                     CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_DialogSelect_C*                     CallFunc_Array_Get_Item_1;                         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMessageRichTextWidget*                 CallFunc_GetRichTextParam_OutMessageRichText;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    CallFunc_GetRichTextParam_OutScriptMessageAsset;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetRichTextParam_OutLabel;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRichTextParam_OutIndex;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRichTextParam_OutUseIndex;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64D8[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMessageRichTextWidget*                 CallFunc_GetRichTextParam_OutMessageRichText_1;    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    CallFunc_GetRichTextParam_OutScriptMessageAsset_1; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetRichTextParam_OutLabel_1;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRichTextParam_OutIndex_1;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRichTextParam_OutUseIndex_1;           // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64D9[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_DialogSelect_C*                     CallFunc_Array_Get_Item_2;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMessageRichTextWidget*                 CallFunc_GetRichTextParam_OutMessageRichText_2;    // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    CallFunc_GetRichTextParam_OutScriptMessageAsset_2; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetRichTextParam_OutLabel_2;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRichTextParam_OutIndex_2;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRichTextParam_OutUseIndex_2;           // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DialogSelectMenu_C_SetSelectCursorText) == 0x000008, "Wrong alignment on WB_DialogSelectMenu_C_SetSelectCursorText");
static_assert(sizeof(WB_DialogSelectMenu_C_SetSelectCursorText) == 0x000080, "Wrong size on WB_DialogSelectMenu_C_SetSelectCursorText");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorText, CursorPos) == 0x000000, "Member 'WB_DialogSelectMenu_C_SetSelectCursorText::CursorPos' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorText, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_DialogSelectMenu_C_SetSelectCursorText::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorText, CallFunc_Array_Get_Item) == 0x000008, "Member 'WB_DialogSelectMenu_C_SetSelectCursorText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorText, CallFunc_Array_Get_Item_1) == 0x000010, "Member 'WB_DialogSelectMenu_C_SetSelectCursorText::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorText, CallFunc_GetRichTextParam_OutMessageRichText) == 0x000018, "Member 'WB_DialogSelectMenu_C_SetSelectCursorText::CallFunc_GetRichTextParam_OutMessageRichText' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorText, CallFunc_GetRichTextParam_OutScriptMessageAsset) == 0x000020, "Member 'WB_DialogSelectMenu_C_SetSelectCursorText::CallFunc_GetRichTextParam_OutScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorText, CallFunc_GetRichTextParam_OutLabel) == 0x000028, "Member 'WB_DialogSelectMenu_C_SetSelectCursorText::CallFunc_GetRichTextParam_OutLabel' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorText, CallFunc_GetRichTextParam_OutIndex) == 0x000030, "Member 'WB_DialogSelectMenu_C_SetSelectCursorText::CallFunc_GetRichTextParam_OutIndex' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorText, CallFunc_GetRichTextParam_OutUseIndex) == 0x000034, "Member 'WB_DialogSelectMenu_C_SetSelectCursorText::CallFunc_GetRichTextParam_OutUseIndex' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorText, CallFunc_GetRichTextParam_OutMessageRichText_1) == 0x000038, "Member 'WB_DialogSelectMenu_C_SetSelectCursorText::CallFunc_GetRichTextParam_OutMessageRichText_1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorText, CallFunc_GetRichTextParam_OutScriptMessageAsset_1) == 0x000040, "Member 'WB_DialogSelectMenu_C_SetSelectCursorText::CallFunc_GetRichTextParam_OutScriptMessageAsset_1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorText, CallFunc_GetRichTextParam_OutLabel_1) == 0x000048, "Member 'WB_DialogSelectMenu_C_SetSelectCursorText::CallFunc_GetRichTextParam_OutLabel_1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorText, CallFunc_GetRichTextParam_OutIndex_1) == 0x000050, "Member 'WB_DialogSelectMenu_C_SetSelectCursorText::CallFunc_GetRichTextParam_OutIndex_1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorText, CallFunc_GetRichTextParam_OutUseIndex_1) == 0x000054, "Member 'WB_DialogSelectMenu_C_SetSelectCursorText::CallFunc_GetRichTextParam_OutUseIndex_1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorText, CallFunc_Array_Get_Item_2) == 0x000058, "Member 'WB_DialogSelectMenu_C_SetSelectCursorText::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorText, CallFunc_GetRichTextParam_OutMessageRichText_2) == 0x000060, "Member 'WB_DialogSelectMenu_C_SetSelectCursorText::CallFunc_GetRichTextParam_OutMessageRichText_2' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorText, CallFunc_GetRichTextParam_OutScriptMessageAsset_2) == 0x000068, "Member 'WB_DialogSelectMenu_C_SetSelectCursorText::CallFunc_GetRichTextParam_OutScriptMessageAsset_2' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorText, CallFunc_GetRichTextParam_OutLabel_2) == 0x000070, "Member 'WB_DialogSelectMenu_C_SetSelectCursorText::CallFunc_GetRichTextParam_OutLabel_2' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorText, CallFunc_GetRichTextParam_OutIndex_2) == 0x000078, "Member 'WB_DialogSelectMenu_C_SetSelectCursorText::CallFunc_GetRichTextParam_OutIndex_2' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorText, CallFunc_GetRichTextParam_OutUseIndex_2) == 0x00007C, "Member 'WB_DialogSelectMenu_C_SetSelectCursorText::CallFunc_GetRichTextParam_OutUseIndex_2' has a wrong offset!");

// Function WB_DialogSelectMenu.WB_DialogSelectMenu_C.SetSelectMessage
// 0x0058 (0x0058 - 0x0000)
struct WB_DialogSelectMenu_C_SetSelectMessage final
{
public:
	class UScriptMessageAsset*                    InScriptMessageAsset;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InLable0;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InLabel1;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InLabel2;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64DA[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64DB[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_DialogSelect_C*                     CallFunc_GetSelectWork_OutDeialogSelect;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64DC[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_DialogSelect_C*                     CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogSelectMenu_C_SetSelectMessage) == 0x000008, "Wrong alignment on WB_DialogSelectMenu_C_SetSelectMessage");
static_assert(sizeof(WB_DialogSelectMenu_C_SetSelectMessage) == 0x000058, "Wrong size on WB_DialogSelectMenu_C_SetSelectMessage");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessage, InScriptMessageAsset) == 0x000000, "Member 'WB_DialogSelectMenu_C_SetSelectMessage::InScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessage, InLable0) == 0x000008, "Member 'WB_DialogSelectMenu_C_SetSelectMessage::InLable0' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessage, InLabel1) == 0x000010, "Member 'WB_DialogSelectMenu_C_SetSelectMessage::InLabel1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessage, InLabel2) == 0x000018, "Member 'WB_DialogSelectMenu_C_SetSelectMessage::InLabel2' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessage, Temp_int_Variable) == 0x000020, "Member 'WB_DialogSelectMenu_C_SetSelectMessage::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessage, K2Node_SwitchInteger_CmpSuccess) == 0x000024, "Member 'WB_DialogSelectMenu_C_SetSelectMessage::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessage, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WB_DialogSelectMenu_C_SetSelectMessage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessage, CallFunc_Subtract_IntInt_ReturnValue) == 0x00002C, "Member 'WB_DialogSelectMenu_C_SetSelectMessage::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessage, Temp_int_Variable_1) == 0x000030, "Member 'WB_DialogSelectMenu_C_SetSelectMessage::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessage, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000034, "Member 'WB_DialogSelectMenu_C_SetSelectMessage::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessage, CallFunc_GetSelectWork_OutDeialogSelect) == 0x000038, "Member 'WB_DialogSelectMenu_C_SetSelectMessage::CallFunc_GetSelectWork_OutDeialogSelect' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessage, CallFunc_Array_Add_ReturnValue) == 0x000040, "Member 'WB_DialogSelectMenu_C_SetSelectMessage::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessage, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'WB_DialogSelectMenu_C_SetSelectMessage::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessage, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000048, "Member 'WB_DialogSelectMenu_C_SetSelectMessage::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessage, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00004C, "Member 'WB_DialogSelectMenu_C_SetSelectMessage::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessage, CallFunc_Array_Get_Item) == 0x000050, "Member 'WB_DialogSelectMenu_C_SetSelectMessage::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WB_DialogSelectMenu.WB_DialogSelectMenu_C.SetSelectCursorOffset
// 0x0028 (0x0028 - 0x0000)
struct WB_DialogSelectMenu_C_SetSelectCursorOffset final
{
public:
	int32                                         Defaultcursoroffset;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64DD[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_DialogSelect_C*                     CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64DE[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_DialogSelect_C*                     CallFunc_Array_Get_Item_1;                         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DialogSelectMenu_C_SetSelectCursorOffset) == 0x000008, "Wrong alignment on WB_DialogSelectMenu_C_SetSelectCursorOffset");
static_assert(sizeof(WB_DialogSelectMenu_C_SetSelectCursorOffset) == 0x000028, "Wrong size on WB_DialogSelectMenu_C_SetSelectCursorOffset");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorOffset, Defaultcursoroffset) == 0x000000, "Member 'WB_DialogSelectMenu_C_SetSelectCursorOffset::Defaultcursoroffset' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorOffset, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'WB_DialogSelectMenu_C_SetSelectCursorOffset::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorOffset, CallFunc_Less_IntInt_ReturnValue) == 0x000005, "Member 'WB_DialogSelectMenu_C_SetSelectCursorOffset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorOffset, CallFunc_Array_Get_Item) == 0x000008, "Member 'WB_DialogSelectMenu_C_SetSelectCursorOffset::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorOffset, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'WB_DialogSelectMenu_C_SetSelectCursorOffset::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorOffset, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WB_DialogSelectMenu_C_SetSelectCursorOffset::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorOffset, CallFunc_Array_Get_Item_1) == 0x000018, "Member 'WB_DialogSelectMenu_C_SetSelectCursorOffset::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorOffset, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WB_DialogSelectMenu_C_SetSelectCursorOffset::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorOffset, CallFunc_Less_IntInt_ReturnValue_1) == 0x000024, "Member 'WB_DialogSelectMenu_C_SetSelectCursorOffset::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorOffset, CallFunc_IsValid_ReturnValue_1) == 0x000025, "Member 'WB_DialogSelectMenu_C_SetSelectCursorOffset::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectCursorOffset, CallFunc_BooleanAND_ReturnValue) == 0x000026, "Member 'WB_DialogSelectMenu_C_SetSelectCursorOffset::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WB_DialogSelectMenu.WB_DialogSelectMenu_C.GetSelectCursorIndex
// 0x0004 (0x0004 - 0x0000)
struct WB_DialogSelectMenu_C_GetSelectCursorIndex final
{
public:
	int32                                         OutIndex;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogSelectMenu_C_GetSelectCursorIndex) == 0x000004, "Wrong alignment on WB_DialogSelectMenu_C_GetSelectCursorIndex");
static_assert(sizeof(WB_DialogSelectMenu_C_GetSelectCursorIndex) == 0x000004, "Wrong size on WB_DialogSelectMenu_C_GetSelectCursorIndex");
static_assert(offsetof(WB_DialogSelectMenu_C_GetSelectCursorIndex, OutIndex) == 0x000000, "Member 'WB_DialogSelectMenu_C_GetSelectCursorIndex::OutIndex' has a wrong offset!");

// Function WB_DialogSelectMenu.WB_DialogSelectMenu_C.SetSelectMessageByIndex
// 0x0050 (0x0050 - 0x0000)
struct WB_DialogSelectMenu_C_SetSelectMessageByIndex final
{
public:
	class UScriptMessageAsset*                    InScriptMessageAsset;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InSelectItem0;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InSelectItem1;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InSelectItem2;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64DF[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64E0[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64E1[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_DialogSelect_C*                     CallFunc_GetSelectWork_OutDeialogSelect;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64E2[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_DialogSelect_C*                     CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogSelectMenu_C_SetSelectMessageByIndex) == 0x000008, "Wrong alignment on WB_DialogSelectMenu_C_SetSelectMessageByIndex");
static_assert(sizeof(WB_DialogSelectMenu_C_SetSelectMessageByIndex) == 0x000050, "Wrong size on WB_DialogSelectMenu_C_SetSelectMessageByIndex");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessageByIndex, InScriptMessageAsset) == 0x000000, "Member 'WB_DialogSelectMenu_C_SetSelectMessageByIndex::InScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessageByIndex, InSelectItem0) == 0x000008, "Member 'WB_DialogSelectMenu_C_SetSelectMessageByIndex::InSelectItem0' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessageByIndex, InSelectItem1) == 0x00000C, "Member 'WB_DialogSelectMenu_C_SetSelectMessageByIndex::InSelectItem1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessageByIndex, InSelectItem2) == 0x000010, "Member 'WB_DialogSelectMenu_C_SetSelectMessageByIndex::InSelectItem2' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessageByIndex, Temp_int_Variable) == 0x000014, "Member 'WB_DialogSelectMenu_C_SetSelectMessageByIndex::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessageByIndex, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'WB_DialogSelectMenu_C_SetSelectMessageByIndex::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessageByIndex, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WB_DialogSelectMenu_C_SetSelectMessageByIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessageByIndex, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'WB_DialogSelectMenu_C_SetSelectMessageByIndex::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessageByIndex, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000024, "Member 'WB_DialogSelectMenu_C_SetSelectMessageByIndex::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessageByIndex, Temp_int_Variable_1) == 0x000028, "Member 'WB_DialogSelectMenu_C_SetSelectMessageByIndex::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessageByIndex, CallFunc_GetSelectWork_OutDeialogSelect) == 0x000030, "Member 'WB_DialogSelectMenu_C_SetSelectMessageByIndex::CallFunc_GetSelectWork_OutDeialogSelect' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessageByIndex, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000038, "Member 'WB_DialogSelectMenu_C_SetSelectMessageByIndex::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessageByIndex, CallFunc_Array_Add_ReturnValue) == 0x00003C, "Member 'WB_DialogSelectMenu_C_SetSelectMessageByIndex::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessageByIndex, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000040, "Member 'WB_DialogSelectMenu_C_SetSelectMessageByIndex::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessageByIndex, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'WB_DialogSelectMenu_C_SetSelectMessageByIndex::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_SetSelectMessageByIndex, CallFunc_Array_Get_Item) == 0x000048, "Member 'WB_DialogSelectMenu_C_SetSelectMessageByIndex::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WB_DialogSelectMenu.WB_DialogSelectMenu_C.InitializeSelectCursorOffset
// 0x0010 (0x0010 - 0x0000)
struct WB_DialogSelectMenu_C_InitializeSelectCursorOffset final
{
public:
	int32                                         InCursorOffset;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64E3[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_DialogSelect_C*                     CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogSelectMenu_C_InitializeSelectCursorOffset) == 0x000008, "Wrong alignment on WB_DialogSelectMenu_C_InitializeSelectCursorOffset");
static_assert(sizeof(WB_DialogSelectMenu_C_InitializeSelectCursorOffset) == 0x000010, "Wrong size on WB_DialogSelectMenu_C_InitializeSelectCursorOffset");
static_assert(offsetof(WB_DialogSelectMenu_C_InitializeSelectCursorOffset, InCursorOffset) == 0x000000, "Member 'WB_DialogSelectMenu_C_InitializeSelectCursorOffset::InCursorOffset' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_InitializeSelectCursorOffset, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'WB_DialogSelectMenu_C_InitializeSelectCursorOffset::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_InitializeSelectCursorOffset, CallFunc_Less_IntInt_ReturnValue) == 0x000005, "Member 'WB_DialogSelectMenu_C_InitializeSelectCursorOffset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_InitializeSelectCursorOffset, CallFunc_Array_Get_Item) == 0x000008, "Member 'WB_DialogSelectMenu_C_InitializeSelectCursorOffset::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WB_DialogSelectMenu.WB_DialogSelectMenu_C.IsClosedSelect
// 0x0006 (0x0006 - 0x0000)
struct WB_DialogSelectMenu_C_IsClosedSelect final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsClosedSelect_OutParam;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsClosedSelect_OutParam_1;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsClosedSelect_OutParam_2;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DialogSelectMenu_C_IsClosedSelect) == 0x000001, "Wrong alignment on WB_DialogSelectMenu_C_IsClosedSelect");
static_assert(sizeof(WB_DialogSelectMenu_C_IsClosedSelect) == 0x000006, "Wrong size on WB_DialogSelectMenu_C_IsClosedSelect");
static_assert(offsetof(WB_DialogSelectMenu_C_IsClosedSelect, OutParam) == 0x000000, "Member 'WB_DialogSelectMenu_C_IsClosedSelect::OutParam' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_IsClosedSelect, CallFunc_IsClosedSelect_OutParam) == 0x000001, "Member 'WB_DialogSelectMenu_C_IsClosedSelect::CallFunc_IsClosedSelect_OutParam' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_IsClosedSelect, CallFunc_IsClosedSelect_OutParam_1) == 0x000002, "Member 'WB_DialogSelectMenu_C_IsClosedSelect::CallFunc_IsClosedSelect_OutParam_1' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_IsClosedSelect, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'WB_DialogSelectMenu_C_IsClosedSelect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_IsClosedSelect, CallFunc_IsClosedSelect_OutParam_2) == 0x000004, "Member 'WB_DialogSelectMenu_C_IsClosedSelect::CallFunc_IsClosedSelect_OutParam_2' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_IsClosedSelect, CallFunc_BooleanAND_ReturnValue_1) == 0x000005, "Member 'WB_DialogSelectMenu_C_IsClosedSelect::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function WB_DialogSelectMenu.WB_DialogSelectMenu_C.GetSelectWork
// 0x0020 (0x0020 - 0x0000)
struct WB_DialogSelectMenu_C_GetSelectWork final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64E4[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_DialogSelect_C*                     OutDeialogSelect;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_DialogSelect_C*                     Retdialogselect;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DialogSelectMenu_C_GetSelectWork) == 0x000008, "Wrong alignment on WB_DialogSelectMenu_C_GetSelectWork");
static_assert(sizeof(WB_DialogSelectMenu_C_GetSelectWork) == 0x000020, "Wrong size on WB_DialogSelectMenu_C_GetSelectWork");
static_assert(offsetof(WB_DialogSelectMenu_C_GetSelectWork, InIndex) == 0x000000, "Member 'WB_DialogSelectMenu_C_GetSelectWork::InIndex' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_GetSelectWork, OutDeialogSelect) == 0x000008, "Member 'WB_DialogSelectMenu_C_GetSelectWork::OutDeialogSelect' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_GetSelectWork, Retdialogselect) == 0x000010, "Member 'WB_DialogSelectMenu_C_GetSelectWork::Retdialogselect' has a wrong offset!");
static_assert(offsetof(WB_DialogSelectMenu_C_GetSelectWork, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'WB_DialogSelectMenu_C_GetSelectWork::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_DialogSelectMenu.WB_DialogSelectMenu_C.GetSelectCursorNum
// 0x0004 (0x0004 - 0x0000)
struct WB_DialogSelectMenu_C_GetSelectCursorNum final
{
public:
	int32                                         OutNumber;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogSelectMenu_C_GetSelectCursorNum) == 0x000004, "Wrong alignment on WB_DialogSelectMenu_C_GetSelectCursorNum");
static_assert(sizeof(WB_DialogSelectMenu_C_GetSelectCursorNum) == 0x000004, "Wrong size on WB_DialogSelectMenu_C_GetSelectCursorNum");
static_assert(offsetof(WB_DialogSelectMenu_C_GetSelectCursorNum, OutNumber) == 0x000000, "Member 'WB_DialogSelectMenu_C_GetSelectCursorNum::OutNumber' has a wrong offset!");

// Function WB_DialogSelectMenu.WB_DialogSelectMenu_C.SelectInAnimationProc
// 0x001C (0x001C - 0x0000)
struct WB_DialogSelectMenu_C_SelectInAnimationProc final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64E5[0x1];                                     // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64E6[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogSelectMenu_C_SelectInAnimationProc) == 0x000004, "Wrong alignment on WB_DialogSelectMenu_C_SelectInAnimationProc");
static_assert(sizeof(WB_DialogSelectMenu_C_SelectInAnimationProc) == 0x00001C, "Wrong size on WB_DialogSelectMenu_C_SelectInAnimationProc");
static_assert(offsetof(WB_DialogSelectMenu_C_SelectInAnimationProc, InDeltaTime) == 0x000000, "Member 'WB_DialogSelectMenu_C_SelectInAnimationProc::InDeltaTime' has a wrong offset!");
