#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_DebugMenuTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_DebugMenuTab.WB_DebugMenuTab_C
// 0x0050 (0x02B0 - 0x0260)
class UWB_DebugMenuTab_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG_Base;                                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Frame_Bottom;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Frame_Left;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Frame_Right;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Frame_Top;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_WB_DebugMenuTab_C;                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TabName;                                           // 0x0298(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WB_DebugMenuTab(int32 EntryPoint);
	void Construct();
	void ReSizeBG();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_DebugMenuTab_C">();
	}
	static class UWB_DebugMenuTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_DebugMenuTab_C>();
	}
};
static_assert(alignof(UWB_DebugMenuTab_C) == 0x000008, "Wrong alignment on UWB_DebugMenuTab_C");
static_assert(sizeof(UWB_DebugMenuTab_C) == 0x0002B0, "Wrong size on UWB_DebugMenuTab_C");
static_assert(offsetof(UWB_DebugMenuTab_C, UberGraphFrame) == 0x000260, "Member 'UWB_DebugMenuTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_DebugMenuTab_C, BG_Base) == 0x000268, "Member 'UWB_DebugMenuTab_C::BG_Base' has a wrong offset!");
static_assert(offsetof(UWB_DebugMenuTab_C, BG_Frame_Bottom) == 0x000270, "Member 'UWB_DebugMenuTab_C::BG_Frame_Bottom' has a wrong offset!");
static_assert(offsetof(UWB_DebugMenuTab_C, BG_Frame_Left) == 0x000278, "Member 'UWB_DebugMenuTab_C::BG_Frame_Left' has a wrong offset!");
static_assert(offsetof(UWB_DebugMenuTab_C, BG_Frame_Right) == 0x000280, "Member 'UWB_DebugMenuTab_C::BG_Frame_Right' has a wrong offset!");
static_assert(offsetof(UWB_DebugMenuTab_C, BG_Frame_Top) == 0x000288, "Member 'UWB_DebugMenuTab_C::BG_Frame_Top' has a wrong offset!");
static_assert(offsetof(UWB_DebugMenuTab_C, Name_WB_DebugMenuTab_C) == 0x000290, "Member 'UWB_DebugMenuTab_C::Name_WB_DebugMenuTab_C' has a wrong offset!");
static_assert(offsetof(UWB_DebugMenuTab_C, TabName) == 0x000298, "Member 'UWB_DebugMenuTab_C::TabName' has a wrong offset!");

}

