#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_DebugNumber

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WB_DebugNumber.WB_DebugNumber_C.ExecuteUbergraph_WB_DebugNumber
// 0x0044 (0x0044 - 0x0000)
struct WB_DebugNumber_C_ExecuteUbergraph_WB_DebugNumber final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInField_ReturnValue;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DebugNumber_C_ExecuteUbergraph_WB_DebugNumber) == 0x000004, "Wrong alignment on WB_DebugNumber_C_ExecuteUbergraph_WB_DebugNumber");
static_assert(sizeof(WB_DebugNumber_C_ExecuteUbergraph_WB_DebugNumber) == 0x000044, "Wrong size on WB_DebugNumber_C_ExecuteUbergraph_WB_DebugNumber");
static_assert(offsetof(WB_DebugNumber_C_ExecuteUbergraph_WB_DebugNumber, EntryPoint) == 0x000000, "Member 'WB_DebugNumber_C_ExecuteUbergraph_WB_DebugNumber::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_DebugNumber_C_ExecuteUbergraph_WB_DebugNumber, K2Node_Event_MyGeometry) == 0x000004, "Member 'WB_DebugNumber_C_ExecuteUbergraph_WB_DebugNumber::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_DebugNumber_C_ExecuteUbergraph_WB_DebugNumber, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'WB_DebugNumber_C_ExecuteUbergraph_WB_DebugNumber::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_DebugNumber_C_ExecuteUbergraph_WB_DebugNumber, CallFunc_GetVisibility_ReturnValue) == 0x000040, "Member 'WB_DebugNumber_C_ExecuteUbergraph_WB_DebugNumber::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DebugNumber_C_ExecuteUbergraph_WB_DebugNumber, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000041, "Member 'WB_DebugNumber_C_ExecuteUbergraph_WB_DebugNumber::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DebugNumber_C_ExecuteUbergraph_WB_DebugNumber, CallFunc_IsInField_ReturnValue) == 0x000042, "Member 'WB_DebugNumber_C_ExecuteUbergraph_WB_DebugNumber::CallFunc_IsInField_ReturnValue' has a wrong offset!");

// Function WB_DebugNumber.WB_DebugNumber_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_DebugNumber_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DebugNumber_C_Tick) == 0x000004, "Wrong alignment on WB_DebugNumber_C_Tick");
static_assert(sizeof(WB_DebugNumber_C_Tick) == 0x00003C, "Wrong size on WB_DebugNumber_C_Tick");
static_assert(offsetof(WB_DebugNumber_C_Tick, MyGeometry) == 0x000000, "Member 'WB_DebugNumber_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_DebugNumber_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_DebugNumber_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_DebugNumber.WB_DebugNumber_C.Setup
// 0x0020 (0x0020 - 0x0000)
struct WB_DebugNumber_C_Setup final
{
public:
	class ABattleMain_C*                          Work;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_DebugNumberIndex_C*                 CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToWidgetPrio_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DebugNumber_C_Setup) == 0x000008, "Wrong alignment on WB_DebugNumber_C_Setup");
static_assert(sizeof(WB_DebugNumber_C_Setup) == 0x000020, "Wrong size on WB_DebugNumber_C_Setup");
static_assert(offsetof(WB_DebugNumber_C_Setup, Work) == 0x000000, "Member 'WB_DebugNumber_C_Setup::Work' has a wrong offset!");
static_assert(offsetof(WB_DebugNumber_C_Setup, Param_Index) == 0x000008, "Member 'WB_DebugNumber_C_Setup::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_DebugNumber_C_Setup, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WB_DebugNumber_C_Setup::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DebugNumber_C_Setup, CallFunc_AddToWidgetPrio_ReturnValue) == 0x000018, "Member 'WB_DebugNumber_C_Setup::CallFunc_AddToWidgetPrio_ReturnValue' has a wrong offset!");

// Function WB_DebugNumber.WB_DebugNumber_C.SetPos
// 0x0090 (0x0090 - 0x0000)
struct WB_DebugNumber_C_SetPos final
{
public:
	class UBattlePartySystem_C*                   CallFunc_GetPartyAccessor_retValue;                // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharaBase_C*                           CallFunc_GetPartyUnit_retValue;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_retValue;              // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldLocationToScreen_ScreenLocation; // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldLocationToScreen_ReturnValue; // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DebugNumber_C_SetPos) == 0x000010, "Wrong alignment on WB_DebugNumber_C_SetPos");
static_assert(sizeof(WB_DebugNumber_C_SetPos) == 0x000090, "Wrong size on WB_DebugNumber_C_SetPos");
static_assert(offsetof(WB_DebugNumber_C_SetPos, CallFunc_GetPartyAccessor_retValue) == 0x000000, "Member 'WB_DebugNumber_C_SetPos::CallFunc_GetPartyAccessor_retValue' has a wrong offset!");
static_assert(offsetof(WB_DebugNumber_C_SetPos, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WB_DebugNumber_C_SetPos::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DebugNumber_C_SetPos, CallFunc_GetPartyUnit_retValue) == 0x000010, "Member 'WB_DebugNumber_C_SetPos::CallFunc_GetPartyUnit_retValue' has a wrong offset!");
static_assert(offsetof(WB_DebugNumber_C_SetPos, CallFunc_GetSocketTransform_retValue) == 0x000020, "Member 'WB_DebugNumber_C_SetPos::CallFunc_GetSocketTransform_retValue' has a wrong offset!");
static_assert(offsetof(WB_DebugNumber_C_SetPos, CallFunc_BreakTransform_Location) == 0x000050, "Member 'WB_DebugNumber_C_SetPos::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(WB_DebugNumber_C_SetPos, CallFunc_BreakTransform_Rotation) == 0x00005C, "Member 'WB_DebugNumber_C_SetPos::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(WB_DebugNumber_C_SetPos, CallFunc_BreakTransform_Scale) == 0x000068, "Member 'WB_DebugNumber_C_SetPos::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(WB_DebugNumber_C_SetPos, CallFunc_ProjectWorldLocationToScreen_ScreenLocation) == 0x000074, "Member 'WB_DebugNumber_C_SetPos::CallFunc_ProjectWorldLocationToScreen_ScreenLocation' has a wrong offset!");
static_assert(offsetof(WB_DebugNumber_C_SetPos, CallFunc_ProjectWorldLocationToScreen_ReturnValue) == 0x00007C, "Member 'WB_DebugNumber_C_SetPos::CallFunc_ProjectWorldLocationToScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DebugNumber_C_SetPos, CallFunc_BreakVector2D_X) == 0x000080, "Member 'WB_DebugNumber_C_SetPos::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_DebugNumber_C_SetPos, CallFunc_BreakVector2D_Y) == 0x000084, "Member 'WB_DebugNumber_C_SetPos::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_DebugNumber_C_SetPos, CallFunc_MakeVector2D_ReturnValue) == 0x000088, "Member 'WB_DebugNumber_C_SetPos::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

}

