#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_DialogSelect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_DialogSelect.WB_DialogSelect_C
// 0x0070 (0x02D0 - 0x0260)
class UWB_DialogSelect_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButtonS5*                              ButtonS5_MouseCheck;                               // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        Selectcursor;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMessageRichTextWidget*                 Selectcursormessagerichtext;                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        Selectitem;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMessageRichTextWidget*                 Selectmessagerichtext;                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScriptMessageAsset*                    Scriptmessagelabel;                                // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Selectitemname;                                    // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Selectitemindex;                                   // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsItemNameUseIndex;                                // 0x02A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64BF[0x3];                                     // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnMouseClicked;                                    // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnMouseSelected;                                   // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         ItemIndex;                                         // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnMouseClicked__DelegateSignature(int32 Param_ItemIndex);
	void OnMouseSelected__DelegateSignature(int32 Param_ItemIndex);
	void ExecuteUbergraph_WB_DialogSelect(int32 EntryPoint);
	void BndEvt__WB_DialogSelect_ButtonS5_MouseCheck_K2Node_ComponentBoundEvent_3_ButtonSimpleEventS5__DelegateSignature();
	void BndEvt__WB_DialogSelect_ButtonS5_MouseCheck_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature(const struct FVector2D& Pos, const struct FVector2D& UV);
	void Construct();
	void BndEvt__selectcursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void SetSelectItemName(class UScriptMessageAsset* InScriptMessageAsset, class FName InName);
	void SelectOut();
	void SelectIn();
	void BndEvt__selectitem_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void SetSelectItemNameByIndex(class UScriptMessageAsset* InScriptMessageAsset, int32 InIndex);
	void SetText();
	void SetTextByIndex();
	void GetRichTextParam(class UMessageRichTextWidget** OutMessageRichText, class UScriptMessageAsset** OutScriptMessageAsset, class FName* OutLabel, int32* OutIndex, bool* OutUseIndex);
	void SSetRichTextParam();
	void SelectCursorOn();
	void SelectCursorOff();
	void SelectCursorIn();
	void SelectCursorOut();
	void SelectItemOff();
	void IsClosedSelect(bool* OutParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_DialogSelect_C">();
	}
	static class UWB_DialogSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_DialogSelect_C>();
	}
};
static_assert(alignof(UWB_DialogSelect_C) == 0x000008, "Wrong alignment on UWB_DialogSelect_C");
static_assert(sizeof(UWB_DialogSelect_C) == 0x0002D0, "Wrong size on UWB_DialogSelect_C");
static_assert(offsetof(UWB_DialogSelect_C, UberGraphFrame) == 0x000260, "Member 'UWB_DialogSelect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_DialogSelect_C, ButtonS5_MouseCheck) == 0x000268, "Member 'UWB_DialogSelect_C::ButtonS5_MouseCheck' has a wrong offset!");
static_assert(offsetof(UWB_DialogSelect_C, Selectcursor) == 0x000270, "Member 'UWB_DialogSelect_C::Selectcursor' has a wrong offset!");
static_assert(offsetof(UWB_DialogSelect_C, Selectcursormessagerichtext) == 0x000278, "Member 'UWB_DialogSelect_C::Selectcursormessagerichtext' has a wrong offset!");
static_assert(offsetof(UWB_DialogSelect_C, Selectitem) == 0x000280, "Member 'UWB_DialogSelect_C::Selectitem' has a wrong offset!");
static_assert(offsetof(UWB_DialogSelect_C, Selectmessagerichtext) == 0x000288, "Member 'UWB_DialogSelect_C::Selectmessagerichtext' has a wrong offset!");
static_assert(offsetof(UWB_DialogSelect_C, Scriptmessagelabel) == 0x000290, "Member 'UWB_DialogSelect_C::Scriptmessagelabel' has a wrong offset!");
static_assert(offsetof(UWB_DialogSelect_C, Selectitemname) == 0x000298, "Member 'UWB_DialogSelect_C::Selectitemname' has a wrong offset!");
static_assert(offsetof(UWB_DialogSelect_C, Selectitemindex) == 0x0002A0, "Member 'UWB_DialogSelect_C::Selectitemindex' has a wrong offset!");
static_assert(offsetof(UWB_DialogSelect_C, IsItemNameUseIndex) == 0x0002A4, "Member 'UWB_DialogSelect_C::IsItemNameUseIndex' has a wrong offset!");
static_assert(offsetof(UWB_DialogSelect_C, OnMouseClicked) == 0x0002A8, "Member 'UWB_DialogSelect_C::OnMouseClicked' has a wrong offset!");
static_assert(offsetof(UWB_DialogSelect_C, OnMouseSelected) == 0x0002B8, "Member 'UWB_DialogSelect_C::OnMouseSelected' has a wrong offset!");
static_assert(offsetof(UWB_DialogSelect_C, ItemIndex) == 0x0002C8, "Member 'UWB_DialogSelect_C::ItemIndex' has a wrong offset!");

}

