#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_DebugMenuTab

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_DebugMenuTab.WB_DebugMenuTab_C.ExecuteUbergraph_WB_DebugMenuTab
// 0x0004 (0x0004 - 0x0000)
struct WB_DebugMenuTab_C_ExecuteUbergraph_WB_DebugMenuTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DebugMenuTab_C_ExecuteUbergraph_WB_DebugMenuTab) == 0x000004, "Wrong alignment on WB_DebugMenuTab_C_ExecuteUbergraph_WB_DebugMenuTab");
static_assert(sizeof(WB_DebugMenuTab_C_ExecuteUbergraph_WB_DebugMenuTab) == 0x000004, "Wrong size on WB_DebugMenuTab_C_ExecuteUbergraph_WB_DebugMenuTab");
static_assert(offsetof(WB_DebugMenuTab_C_ExecuteUbergraph_WB_DebugMenuTab, EntryPoint) == 0x000000, "Member 'WB_DebugMenuTab_C_ExecuteUbergraph_WB_DebugMenuTab::EntryPoint' has a wrong offset!");

// Function WB_DebugMenuTab.WB_DebugMenuTab_C.ReSizeBG
// 0x00E8 (0x00E8 - 0x0000)
struct WB_DebugMenuTab_C_ReSizeBG final
{
public:
	float                                         Space;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LeftSizeW;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SizeX;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4027[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue_1;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue_2;                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_4;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_4;                        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_4;           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue_1;                // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_5;                        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_5;                        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_5;           // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue_3;                    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_6;                        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_6;                        // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_4;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DebugMenuTab_C_ReSizeBG) == 0x000008, "Wrong alignment on WB_DebugMenuTab_C_ReSizeBG");
static_assert(sizeof(WB_DebugMenuTab_C_ReSizeBG) == 0x0000E8, "Wrong size on WB_DebugMenuTab_C_ReSizeBG");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, Space) == 0x000000, "Member 'WB_DebugMenuTab_C_ReSizeBG::Space' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, LeftSizeW) == 0x000004, "Member 'WB_DebugMenuTab_C_ReSizeBG::LeftSizeW' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, SizeX) == 0x000008, "Member 'WB_DebugMenuTab_C_ReSizeBG::SizeX' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000018, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_GetSize_ReturnValue) == 0x000020, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_GetPosition_ReturnValue) == 0x000028, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_BreakVector2D_X) == 0x000030, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_BreakVector2D_Y) == 0x000034, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_BreakVector2D_X_1) == 0x000038, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_BreakVector2D_Y_1) == 0x00003C, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000040, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x000048, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_GetSize_ReturnValue_1) == 0x000050, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_GetSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_GetSize_ReturnValue_2) == 0x000058, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_GetSize_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_BreakVector2D_X_2) == 0x000060, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_BreakVector2D_Y_2) == 0x000064, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_BreakVector2D_X_3) == 0x000068, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_BreakVector2D_Y_3) == 0x00006C, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_GetDesiredSize_ReturnValue) == 0x000070, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_BreakVector2D_X_4) == 0x000078, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_BreakVector2D_X_4' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_BreakVector2D_Y_4) == 0x00007C, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_BreakVector2D_Y_4' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_SlotAsCanvasSlot_ReturnValue_4) == 0x000080, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_SlotAsCanvasSlot_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000088, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_GetPosition_ReturnValue_1) == 0x00008C, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_GetPosition_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_Add_FloatFloat_ReturnValue) == 0x000094, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_BreakVector2D_X_5) == 0x000098, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_BreakVector2D_X_5' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_BreakVector2D_Y_5) == 0x00009C, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_BreakVector2D_Y_5' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0000A0, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_MakeVector2D_ReturnValue) == 0x0000A4, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0000AC, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000B0, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_SlotAsCanvasSlot_ReturnValue_5) == 0x0000B8, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_SlotAsCanvasSlot_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_GetSize_ReturnValue_3) == 0x0000C0, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_GetSize_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_BreakVector2D_X_6) == 0x0000C8, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_BreakVector2D_X_6' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_BreakVector2D_Y_6) == 0x0000CC, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_BreakVector2D_Y_6' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_MakeVector2D_ReturnValue_2) == 0x0000D0, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_MakeVector2D_ReturnValue_3) == 0x0000D8, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_DebugMenuTab_C_ReSizeBG, CallFunc_MakeVector2D_ReturnValue_4) == 0x0000E0, "Member 'WB_DebugMenuTab_C_ReSizeBG::CallFunc_MakeVector2D_ReturnValue_4' has a wrong offset!");

}

