#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_DebugNumberIndex

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_DebugNumberIndex.WB_DebugNumberIndex_C
// 0x0048 (0x02A8 - 0x0260)
class UWB_DebugNumberIndex_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Number_00;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Number_01;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Number_02;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Number_03;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Number_04;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UImage*>                         ImgNumData;                                        // 0x0290(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         Param;                                             // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_DebugNumberIndex(int32 EntryPoint);
	void Setting(int32 Param_Param);
	void Construct();
	void Setting_Param(int32 Param_Param);
	void Setting_ImgNumber(int32 Num, class UImage* ImgNum);
	void CreateImgData();
	void CalcNumPos(int32 Num, struct FVector2D* UVPos);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_DebugNumberIndex_C">();
	}
	static class UWB_DebugNumberIndex_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_DebugNumberIndex_C>();
	}
};
static_assert(alignof(UWB_DebugNumberIndex_C) == 0x000008, "Wrong alignment on UWB_DebugNumberIndex_C");
static_assert(sizeof(UWB_DebugNumberIndex_C) == 0x0002A8, "Wrong size on UWB_DebugNumberIndex_C");
static_assert(offsetof(UWB_DebugNumberIndex_C, UberGraphFrame) == 0x000260, "Member 'UWB_DebugNumberIndex_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_DebugNumberIndex_C, Img_Number_00) == 0x000268, "Member 'UWB_DebugNumberIndex_C::Img_Number_00' has a wrong offset!");
static_assert(offsetof(UWB_DebugNumberIndex_C, Img_Number_01) == 0x000270, "Member 'UWB_DebugNumberIndex_C::Img_Number_01' has a wrong offset!");
static_assert(offsetof(UWB_DebugNumberIndex_C, Img_Number_02) == 0x000278, "Member 'UWB_DebugNumberIndex_C::Img_Number_02' has a wrong offset!");
static_assert(offsetof(UWB_DebugNumberIndex_C, Img_Number_03) == 0x000280, "Member 'UWB_DebugNumberIndex_C::Img_Number_03' has a wrong offset!");
static_assert(offsetof(UWB_DebugNumberIndex_C, Img_Number_04) == 0x000288, "Member 'UWB_DebugNumberIndex_C::Img_Number_04' has a wrong offset!");
static_assert(offsetof(UWB_DebugNumberIndex_C, ImgNumData) == 0x000290, "Member 'UWB_DebugNumberIndex_C::ImgNumData' has a wrong offset!");
static_assert(offsetof(UWB_DebugNumberIndex_C, Param) == 0x0002A0, "Member 'UWB_DebugNumberIndex_C::Param' has a wrong offset!");

}

