#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_DialogWindow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WB_DialogWindow.WB_DialogWindow_C.ExecuteUbergraph_WB_DialogWindow
// 0x00C0 (0x00C0 - 0x0000)
struct WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_3;                       // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_2;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_2;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_2;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_2;       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F07[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_3;         // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_3;        // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_3;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_3;       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_4;                       // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_5;                       // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F08[0x1];                                     // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_1;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_1;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_1;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_1;       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_2;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_6;                       // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_InExecutionFlag_1;              // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_7;                       // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_InExecutionFlag;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F09[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0060(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName;           // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName;          // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex;          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex;         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_3;                    // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_8;                       // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_9;                       // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsClosedSelect_OutParam;                  // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow) == 0x000004, "Wrong alignment on WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow");
static_assert(sizeof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow) == 0x0000C0, "Wrong size on WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, EntryPoint) == 0x000000, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, CallFunc_Play_ReturnValue) == 0x000004, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, CallFunc_Play_ReturnValue_1) == 0x000005, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, CallFunc_Play_ReturnValue_2) == 0x000006, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, CallFunc_Play_ReturnValue_3) == 0x000007, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::CallFunc_Play_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_ComponentBoundEvent_AnimPackName_2) == 0x000008, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_ComponentBoundEvent_AnimPackName_2' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_ComponentBoundEvent_AnimationName_2) == 0x000010, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_ComponentBoundEvent_AnimationName_2' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_ComponentBoundEvent_AnimPackIndex_2) == 0x000018, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_ComponentBoundEvent_AnimPackIndex_2' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_ComponentBoundEvent_AnimationIndex_2) == 0x00001C, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_ComponentBoundEvent_AnimationIndex_2' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_SwitchName_CmpSuccess) == 0x000020, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_ComponentBoundEvent_AnimPackName_3) == 0x000024, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_ComponentBoundEvent_AnimPackName_3' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_ComponentBoundEvent_AnimationName_3) == 0x00002C, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_ComponentBoundEvent_AnimationName_3' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_ComponentBoundEvent_AnimPackIndex_3) == 0x000034, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_ComponentBoundEvent_AnimPackIndex_3' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_ComponentBoundEvent_AnimationIndex_3) == 0x000038, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_ComponentBoundEvent_AnimationIndex_3' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_SwitchName_CmpSuccess_1) == 0x00003C, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_SwitchName_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, CallFunc_Play_ReturnValue_4) == 0x00003D, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::CallFunc_Play_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, CallFunc_Play_ReturnValue_5) == 0x00003E, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::CallFunc_Play_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_ComponentBoundEvent_AnimPackName_1) == 0x000040, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_ComponentBoundEvent_AnimPackName_1' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_ComponentBoundEvent_AnimationName_1) == 0x000048, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_ComponentBoundEvent_AnimationName_1' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_ComponentBoundEvent_AnimPackIndex_1) == 0x000050, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_ComponentBoundEvent_AnimPackIndex_1' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_ComponentBoundEvent_AnimationIndex_1) == 0x000054, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_ComponentBoundEvent_AnimationIndex_1' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_SwitchName_CmpSuccess_2) == 0x000058, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_SwitchName_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, CallFunc_Play_ReturnValue_6) == 0x000059, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::CallFunc_Play_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_CustomEvent_InExecutionFlag_1) == 0x00005A, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_CustomEvent_InExecutionFlag_1' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, CallFunc_Play_ReturnValue_7) == 0x00005B, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::CallFunc_Play_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_CustomEvent_InExecutionFlag) == 0x00005C, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_CustomEvent_InExecutionFlag' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_Event_MyGeometry) == 0x000060, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_Event_InDeltaTime) == 0x000098, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_ComponentBoundEvent_AnimPackName) == 0x00009C, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_ComponentBoundEvent_AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_ComponentBoundEvent_AnimationName) == 0x0000A4, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_ComponentBoundEvent_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_ComponentBoundEvent_AnimPackIndex) == 0x0000AC, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_ComponentBoundEvent_AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_ComponentBoundEvent_AnimationIndex) == 0x0000B0, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_ComponentBoundEvent_AnimationIndex' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_SwitchName_CmpSuccess_3) == 0x0000B4, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_SwitchName_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, CallFunc_Play_ReturnValue_8) == 0x0000B5, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::CallFunc_Play_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, K2Node_Event_IsDesignTime) == 0x0000B6, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, CallFunc_Play_ReturnValue_9) == 0x0000B7, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::CallFunc_Play_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, CallFunc_IsVisible_ReturnValue) == 0x0000B8, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, CallFunc_GetVisibility_ReturnValue) == 0x0000B9, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000BA, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, CallFunc_IsClosedSelect_OutParam) == 0x0000BB, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::CallFunc_IsClosedSelect_OutParam' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow, CallFunc_BooleanAND_ReturnValue) == 0x0000BC, "Member 'WB_DialogWindow_C_ExecuteUbergraph_WB_DialogWindow::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WB_DialogWindow.WB_DialogWindow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_DialogWindow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DialogWindow_C_PreConstruct) == 0x000001, "Wrong alignment on WB_DialogWindow_C_PreConstruct");
static_assert(sizeof(WB_DialogWindow_C_PreConstruct) == 0x000001, "Wrong size on WB_DialogWindow_C_PreConstruct");
static_assert(offsetof(WB_DialogWindow_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_DialogWindow_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_DialogWindow.WB_DialogWindow_C.BndEvt__SsPlayerIcon_K2Node_ComponentBoundEvent_3_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_DialogWindow_C_BndEvt__SsPlayerIcon_K2Node_ComponentBoundEvent_3_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogWindow_C_BndEvt__SsPlayerIcon_K2Node_ComponentBoundEvent_3_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_DialogWindow_C_BndEvt__SsPlayerIcon_K2Node_ComponentBoundEvent_3_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_DialogWindow_C_BndEvt__SsPlayerIcon_K2Node_ComponentBoundEvent_3_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_DialogWindow_C_BndEvt__SsPlayerIcon_K2Node_ComponentBoundEvent_3_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_DialogWindow_C_BndEvt__SsPlayerIcon_K2Node_ComponentBoundEvent_3_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_DialogWindow_C_BndEvt__SsPlayerIcon_K2Node_ComponentBoundEvent_3_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_BndEvt__SsPlayerIcon_K2Node_ComponentBoundEvent_3_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_DialogWindow_C_BndEvt__SsPlayerIcon_K2Node_ComponentBoundEvent_3_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_BndEvt__SsPlayerIcon_K2Node_ComponentBoundEvent_3_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_DialogWindow_C_BndEvt__SsPlayerIcon_K2Node_ComponentBoundEvent_3_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_BndEvt__SsPlayerIcon_K2Node_ComponentBoundEvent_3_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_DialogWindow_C_BndEvt__SsPlayerIcon_K2Node_ComponentBoundEvent_3_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_DialogWindow.WB_DialogWindow_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_DialogWindow_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogWindow_C_Tick) == 0x000004, "Wrong alignment on WB_DialogWindow_C_Tick");
static_assert(sizeof(WB_DialogWindow_C_Tick) == 0x00003C, "Wrong size on WB_DialogWindow_C_Tick");
static_assert(offsetof(WB_DialogWindow_C_Tick, MyGeometry) == 0x000000, "Member 'WB_DialogWindow_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_DialogWindow_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_DialogWindow.WB_DialogWindow_C.RunningIconOut
// 0x0001 (0x0001 - 0x0000)
struct WB_DialogWindow_C_RunningIconOut final
{
public:
	bool                                          InExecutionFlag;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DialogWindow_C_RunningIconOut) == 0x000001, "Wrong alignment on WB_DialogWindow_C_RunningIconOut");
static_assert(sizeof(WB_DialogWindow_C_RunningIconOut) == 0x000001, "Wrong size on WB_DialogWindow_C_RunningIconOut");
static_assert(offsetof(WB_DialogWindow_C_RunningIconOut, InExecutionFlag) == 0x000000, "Member 'WB_DialogWindow_C_RunningIconOut::InExecutionFlag' has a wrong offset!");

// Function WB_DialogWindow.WB_DialogWindow_C.RunningIconIn
// 0x0001 (0x0001 - 0x0000)
struct WB_DialogWindow_C_RunningIconIn final
{
public:
	bool                                          InExecutionFlag;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DialogWindow_C_RunningIconIn) == 0x000001, "Wrong alignment on WB_DialogWindow_C_RunningIconIn");
static_assert(sizeof(WB_DialogWindow_C_RunningIconIn) == 0x000001, "Wrong size on WB_DialogWindow_C_RunningIconIn");
static_assert(offsetof(WB_DialogWindow_C_RunningIconIn, InExecutionFlag) == 0x000000, "Member 'WB_DialogWindow_C_RunningIconIn::InExecutionFlag' has a wrong offset!");

// Function WB_DialogWindow.WB_DialogWindow_C.BndEvt__SsPlayerRunningIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_DialogWindow_C_BndEvt__SsPlayerRunningIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogWindow_C_BndEvt__SsPlayerRunningIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_DialogWindow_C_BndEvt__SsPlayerRunningIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_DialogWindow_C_BndEvt__SsPlayerRunningIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_DialogWindow_C_BndEvt__SsPlayerRunningIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_DialogWindow_C_BndEvt__SsPlayerRunningIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_DialogWindow_C_BndEvt__SsPlayerRunningIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_BndEvt__SsPlayerRunningIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_DialogWindow_C_BndEvt__SsPlayerRunningIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_BndEvt__SsPlayerRunningIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_DialogWindow_C_BndEvt__SsPlayerRunningIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_BndEvt__SsPlayerRunningIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_DialogWindow_C_BndEvt__SsPlayerRunningIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_DialogWindow.WB_DialogWindow_C.BndEvt__SsPlayerDialogWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_DialogWindow_C_BndEvt__SsPlayerDialogWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogWindow_C_BndEvt__SsPlayerDialogWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_DialogWindow_C_BndEvt__SsPlayerDialogWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_DialogWindow_C_BndEvt__SsPlayerDialogWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_DialogWindow_C_BndEvt__SsPlayerDialogWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_DialogWindow_C_BndEvt__SsPlayerDialogWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_DialogWindow_C_BndEvt__SsPlayerDialogWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_BndEvt__SsPlayerDialogWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_DialogWindow_C_BndEvt__SsPlayerDialogWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_BndEvt__SsPlayerDialogWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_DialogWindow_C_BndEvt__SsPlayerDialogWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_BndEvt__SsPlayerDialogWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_DialogWindow_C_BndEvt__SsPlayerDialogWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_DialogWindow.WB_DialogWindow_C.BndEvt__SsPlayerBlackCurtain_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_DialogWindow_C_BndEvt__SsPlayerBlackCurtain_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogWindow_C_BndEvt__SsPlayerBlackCurtain_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_DialogWindow_C_BndEvt__SsPlayerBlackCurtain_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_DialogWindow_C_BndEvt__SsPlayerBlackCurtain_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_DialogWindow_C_BndEvt__SsPlayerBlackCurtain_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_DialogWindow_C_BndEvt__SsPlayerBlackCurtain_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_DialogWindow_C_BndEvt__SsPlayerBlackCurtain_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_BndEvt__SsPlayerBlackCurtain_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_DialogWindow_C_BndEvt__SsPlayerBlackCurtain_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_BndEvt__SsPlayerBlackCurtain_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_DialogWindow_C_BndEvt__SsPlayerBlackCurtain_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_BndEvt__SsPlayerBlackCurtain_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_DialogWindow_C_BndEvt__SsPlayerBlackCurtain_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_DialogWindow.WB_DialogWindow_C.IsOpenDialogWindow
// 0x0001 (0x0001 - 0x0000)
struct WB_DialogWindow_C_IsOpenDialogWindow final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DialogWindow_C_IsOpenDialogWindow) == 0x000001, "Wrong alignment on WB_DialogWindow_C_IsOpenDialogWindow");
static_assert(sizeof(WB_DialogWindow_C_IsOpenDialogWindow) == 0x000001, "Wrong size on WB_DialogWindow_C_IsOpenDialogWindow");
static_assert(offsetof(WB_DialogWindow_C_IsOpenDialogWindow, OutFinished) == 0x000000, "Member 'WB_DialogWindow_C_IsOpenDialogWindow::OutFinished' has a wrong offset!");

// Function WB_DialogWindow.WB_DialogWindow_C.IsCloseDialogWindow
// 0x0001 (0x0001 - 0x0000)
struct WB_DialogWindow_C_IsCloseDialogWindow final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DialogWindow_C_IsCloseDialogWindow) == 0x000001, "Wrong alignment on WB_DialogWindow_C_IsCloseDialogWindow");
static_assert(sizeof(WB_DialogWindow_C_IsCloseDialogWindow) == 0x000001, "Wrong size on WB_DialogWindow_C_IsCloseDialogWindow");
static_assert(offsetof(WB_DialogWindow_C_IsCloseDialogWindow, OutFinished) == 0x000000, "Member 'WB_DialogWindow_C_IsCloseDialogWindow::OutFinished' has a wrong offset!");

// Function WB_DialogWindow.WB_DialogWindow_C.SetMessageText
// 0x0028 (0x0028 - 0x0000)
struct WB_DialogWindow_C_SetMessageText final
{
public:
	class UScriptMessageAsset*                    InScriptMessageAsset;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InLabel;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InExecutionText;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InBuildText;                                       // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F0A[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetScriptMessageByLabel_self_CastInput;   // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DialogWindow_C_SetMessageText) == 0x000008, "Wrong alignment on WB_DialogWindow_C_SetMessageText");
static_assert(sizeof(WB_DialogWindow_C_SetMessageText) == 0x000028, "Wrong size on WB_DialogWindow_C_SetMessageText");
static_assert(offsetof(WB_DialogWindow_C_SetMessageText, InScriptMessageAsset) == 0x000000, "Member 'WB_DialogWindow_C_SetMessageText::InScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetMessageText, InLabel) == 0x000008, "Member 'WB_DialogWindow_C_SetMessageText::InLabel' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetMessageText, InExecutionText) == 0x000010, "Member 'WB_DialogWindow_C_SetMessageText::InExecutionText' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetMessageText, InBuildText) == 0x000011, "Member 'WB_DialogWindow_C_SetMessageText::InBuildText' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetMessageText, CallFunc_SetScriptMessageByLabel_self_CastInput) == 0x000018, "Member 'WB_DialogWindow_C_SetMessageText::CallFunc_SetScriptMessageByLabel_self_CastInput' has a wrong offset!");

// Function WB_DialogWindow.WB_DialogWindow_C.IsSetMessageText
// 0x0001 (0x0001 - 0x0000)
struct WB_DialogWindow_C_IsSetMessageText final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DialogWindow_C_IsSetMessageText) == 0x000001, "Wrong alignment on WB_DialogWindow_C_IsSetMessageText");
static_assert(sizeof(WB_DialogWindow_C_IsSetMessageText) == 0x000001, "Wrong size on WB_DialogWindow_C_IsSetMessageText");
static_assert(offsetof(WB_DialogWindow_C_IsSetMessageText, OutFinished) == 0x000000, "Member 'WB_DialogWindow_C_IsSetMessageText::OutFinished' has a wrong offset!");

// Function WB_DialogWindow.WB_DialogWindow_C.MessageClear
// 0x0018 (0x0018 - 0x0000)
struct WB_DialogWindow_C_MessageClear final
{
public:
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetScriptMessageByID_self_CastInput;      // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DialogWindow_C_MessageClear) == 0x000008, "Wrong alignment on WB_DialogWindow_C_MessageClear");
static_assert(sizeof(WB_DialogWindow_C_MessageClear) == 0x000018, "Wrong size on WB_DialogWindow_C_MessageClear");
static_assert(offsetof(WB_DialogWindow_C_MessageClear, CallFunc_SetScriptMessageByID_self_CastInput) == 0x000000, "Member 'WB_DialogWindow_C_MessageClear::CallFunc_SetScriptMessageByID_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_MessageClear, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WB_DialogWindow_C_MessageClear::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WB_DialogWindow.WB_DialogWindow_C.ExecutionOpenDialogWindow
// 0x0004 (0x0004 - 0x0000)
struct WB_DialogWindow_C_ExecutionOpenDialogWindow final
{
public:
	bool                                          InUseRunningIcon;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DialogWindow_C_ExecutionOpenDialogWindow) == 0x000001, "Wrong alignment on WB_DialogWindow_C_ExecutionOpenDialogWindow");
static_assert(sizeof(WB_DialogWindow_C_ExecutionOpenDialogWindow) == 0x000004, "Wrong size on WB_DialogWindow_C_ExecutionOpenDialogWindow");
static_assert(offsetof(WB_DialogWindow_C_ExecutionOpenDialogWindow, InUseRunningIcon) == 0x000000, "Member 'WB_DialogWindow_C_ExecutionOpenDialogWindow::InUseRunningIcon' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecutionOpenDialogWindow, CallFunc_Play_ReturnValue) == 0x000001, "Member 'WB_DialogWindow_C_ExecutionOpenDialogWindow::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecutionOpenDialogWindow, CallFunc_Play_ReturnValue_1) == 0x000002, "Member 'WB_DialogWindow_C_ExecutionOpenDialogWindow::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_ExecutionOpenDialogWindow, CallFunc_Play_ReturnValue_2) == 0x000003, "Member 'WB_DialogWindow_C_ExecutionOpenDialogWindow::CallFunc_Play_ReturnValue_2' has a wrong offset!");

// Function WB_DialogWindow.WB_DialogWindow_C.SetDialogSelectMenu
// 0x0068 (0x0068 - 0x0000)
struct WB_DialogWindow_C_SetDialogSelectMenu final
{
public:
	int32                                         InMunuNumber;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InInitCursorPosition;                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    InScriptMessageAsset;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           InSelectItemNme;                                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class FName>                           LabelName;                                         // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F0B[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F0C[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	class FName                                   Temp_name_Variable;                                // 0x0060(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogWindow_C_SetDialogSelectMenu) == 0x000008, "Wrong alignment on WB_DialogWindow_C_SetDialogSelectMenu");
static_assert(sizeof(WB_DialogWindow_C_SetDialogSelectMenu) == 0x000068, "Wrong size on WB_DialogWindow_C_SetDialogSelectMenu");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenu, InMunuNumber) == 0x000000, "Member 'WB_DialogWindow_C_SetDialogSelectMenu::InMunuNumber' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenu, InInitCursorPosition) == 0x000004, "Member 'WB_DialogWindow_C_SetDialogSelectMenu::InInitCursorPosition' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenu, InScriptMessageAsset) == 0x000008, "Member 'WB_DialogWindow_C_SetDialogSelectMenu::InScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenu, InSelectItemNme) == 0x000010, "Member 'WB_DialogWindow_C_SetDialogSelectMenu::InSelectItemNme' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenu, LabelName) == 0x000020, "Member 'WB_DialogWindow_C_SetDialogSelectMenu::LabelName' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenu, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'WB_DialogWindow_C_SetDialogSelectMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenu, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'WB_DialogWindow_C_SetDialogSelectMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WB_DialogWindow_C_SetDialogSelectMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenu, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WB_DialogWindow_C_SetDialogSelectMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenu, Temp_int_Array_Index_Variable) == 0x000040, "Member 'WB_DialogWindow_C_SetDialogSelectMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenu, CallFunc_Array_Get_Item) == 0x000044, "Member 'WB_DialogWindow_C_SetDialogSelectMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenu, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00004C, "Member 'WB_DialogWindow_C_SetDialogSelectMenu::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenu, K2Node_MakeArray_Array) == 0x000050, "Member 'WB_DialogWindow_C_SetDialogSelectMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenu, Temp_name_Variable) == 0x000060, "Member 'WB_DialogWindow_C_SetDialogSelectMenu::Temp_name_Variable' has a wrong offset!");

// Function WB_DialogWindow.WB_DialogWindow_C.SetDialogSelectMenuByIndex
// 0x0068 (0x0068 - 0x0000)
struct WB_DialogWindow_C_SetDialogSelectMenuByIndex final
{
public:
	int32                                         InMenuNumber;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InInitCursorPosition;                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    InScriptMessageAsset;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 InSelectItemIndex;                                 // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 LabelIndex;                                        // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F0D[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F0E[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x0060(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogWindow_C_SetDialogSelectMenuByIndex) == 0x000008, "Wrong alignment on WB_DialogWindow_C_SetDialogSelectMenuByIndex");
static_assert(sizeof(WB_DialogWindow_C_SetDialogSelectMenuByIndex) == 0x000068, "Wrong size on WB_DialogWindow_C_SetDialogSelectMenuByIndex");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenuByIndex, InMenuNumber) == 0x000000, "Member 'WB_DialogWindow_C_SetDialogSelectMenuByIndex::InMenuNumber' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenuByIndex, InInitCursorPosition) == 0x000004, "Member 'WB_DialogWindow_C_SetDialogSelectMenuByIndex::InInitCursorPosition' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenuByIndex, InScriptMessageAsset) == 0x000008, "Member 'WB_DialogWindow_C_SetDialogSelectMenuByIndex::InScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenuByIndex, InSelectItemIndex) == 0x000010, "Member 'WB_DialogWindow_C_SetDialogSelectMenuByIndex::InSelectItemIndex' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenuByIndex, LabelIndex) == 0x000020, "Member 'WB_DialogWindow_C_SetDialogSelectMenuByIndex::LabelIndex' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenuByIndex, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'WB_DialogWindow_C_SetDialogSelectMenuByIndex::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenuByIndex, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'WB_DialogWindow_C_SetDialogSelectMenuByIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenuByIndex, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WB_DialogWindow_C_SetDialogSelectMenuByIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenuByIndex, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WB_DialogWindow_C_SetDialogSelectMenuByIndex::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenuByIndex, Temp_int_Array_Index_Variable) == 0x000040, "Member 'WB_DialogWindow_C_SetDialogSelectMenuByIndex::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenuByIndex, CallFunc_Array_Get_Item) == 0x000044, "Member 'WB_DialogWindow_C_SetDialogSelectMenuByIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenuByIndex, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000048, "Member 'WB_DialogWindow_C_SetDialogSelectMenuByIndex::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenuByIndex, K2Node_MakeArray_Array) == 0x000050, "Member 'WB_DialogWindow_C_SetDialogSelectMenuByIndex::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectMenuByIndex, Temp_int_Variable) == 0x000060, "Member 'WB_DialogWindow_C_SetDialogSelectMenuByIndex::Temp_int_Variable' has a wrong offset!");

// Function WB_DialogWindow.WB_DialogWindow_C.AddDialogSelect
// 0x0001 (0x0001 - 0x0000)
struct WB_DialogWindow_C_AddDialogSelect final
{
public:
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DialogWindow_C_AddDialogSelect) == 0x000001, "Wrong alignment on WB_DialogWindow_C_AddDialogSelect");
static_assert(sizeof(WB_DialogWindow_C_AddDialogSelect) == 0x000001, "Wrong size on WB_DialogWindow_C_AddDialogSelect");
static_assert(offsetof(WB_DialogWindow_C_AddDialogSelect, CallFunc_IsVisible_ReturnValue) == 0x000000, "Member 'WB_DialogWindow_C_AddDialogSelect::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function WB_DialogWindow.WB_DialogWindow_C.DecDialogSelect
// 0x0001 (0x0001 - 0x0000)
struct WB_DialogWindow_C_DecDialogSelect final
{
public:
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DialogWindow_C_DecDialogSelect) == 0x000001, "Wrong alignment on WB_DialogWindow_C_DecDialogSelect");
static_assert(sizeof(WB_DialogWindow_C_DecDialogSelect) == 0x000001, "Wrong size on WB_DialogWindow_C_DecDialogSelect");
static_assert(offsetof(WB_DialogWindow_C_DecDialogSelect, CallFunc_IsVisible_ReturnValue) == 0x000000, "Member 'WB_DialogWindow_C_DecDialogSelect::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function WB_DialogWindow.WB_DialogWindow_C.SetDialogSelectCursorOffset
// 0x0004 (0x0004 - 0x0000)
struct WB_DialogWindow_C_SetDialogSelectCursorOffset final
{
public:
	int32                                         DefaultCursorPos;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogWindow_C_SetDialogSelectCursorOffset) == 0x000004, "Wrong alignment on WB_DialogWindow_C_SetDialogSelectCursorOffset");
static_assert(sizeof(WB_DialogWindow_C_SetDialogSelectCursorOffset) == 0x000004, "Wrong size on WB_DialogWindow_C_SetDialogSelectCursorOffset");
static_assert(offsetof(WB_DialogWindow_C_SetDialogSelectCursorOffset, DefaultCursorPos) == 0x000000, "Member 'WB_DialogWindow_C_SetDialogSelectCursorOffset::DefaultCursorPos' has a wrong offset!");

// Function WB_DialogWindow.WB_DialogWindow_C.DecidesDialogSelectCursor
// 0x000C (0x000C - 0x0000)
struct WB_DialogWindow_C_DecidesDialogSelectCursor final
{
public:
	int32                                         OutParam;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Retparam;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectCursorIndex_OutIndex;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogWindow_C_DecidesDialogSelectCursor) == 0x000004, "Wrong alignment on WB_DialogWindow_C_DecidesDialogSelectCursor");
static_assert(sizeof(WB_DialogWindow_C_DecidesDialogSelectCursor) == 0x00000C, "Wrong size on WB_DialogWindow_C_DecidesDialogSelectCursor");
static_assert(offsetof(WB_DialogWindow_C_DecidesDialogSelectCursor, OutParam) == 0x000000, "Member 'WB_DialogWindow_C_DecidesDialogSelectCursor::OutParam' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_DecidesDialogSelectCursor, Retparam) == 0x000004, "Member 'WB_DialogWindow_C_DecidesDialogSelectCursor::Retparam' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_DecidesDialogSelectCursor, CallFunc_GetSelectCursorIndex_OutIndex) == 0x000008, "Member 'WB_DialogWindow_C_DecidesDialogSelectCursor::CallFunc_GetSelectCursorIndex_OutIndex' has a wrong offset!");

// Function WB_DialogWindow.WB_DialogWindow_C.SetInitPosition
// 0x0010 (0x0010 - 0x0000)
struct WB_DialogWindow_C_SetInitPosition final
{
public:
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogWindow_C_SetInitPosition) == 0x000008, "Wrong alignment on WB_DialogWindow_C_SetInitPosition");
static_assert(sizeof(WB_DialogWindow_C_SetInitPosition) == 0x000010, "Wrong size on WB_DialogWindow_C_SetInitPosition");
static_assert(offsetof(WB_DialogWindow_C_SetInitPosition, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000000, "Member 'WB_DialogWindow_C_SetInitPosition::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogWindow_C_SetInitPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec) == 0x000008, "Member 'WB_DialogWindow_C_SetInitPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec' has a wrong offset!");

// Function WB_DialogWindow.WB_DialogWindow_C.GetDialogCursorIndex
// 0x0010 (0x0010 - 0x0000)
