#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_DebugNumber

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_DebugNumber.WB_DebugNumber_C
// 0x0020 (0x0280 - 0x0260)
class UWB_DebugNumber_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWB_DebugNumberIndex_C*                 M_WBPartyIndex;                                    // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         M_PartyIndex;                                      // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_455F[0x4];                                     // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleMain_C*                          M_Work;                                            // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_DebugNumber(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void ShowPartyIndex();
	void Setup(class ABattleMain_C* Work, int32 Param_Index);
	void SetPos();
	void HidePartyIndex();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_DebugNumber_C">();
	}
	static class UWB_DebugNumber_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_DebugNumber_C>();
	}
};
static_assert(alignof(UWB_DebugNumber_C) == 0x000008, "Wrong alignment on UWB_DebugNumber_C");
static_assert(sizeof(UWB_DebugNumber_C) == 0x000280, "Wrong size on UWB_DebugNumber_C");
static_assert(offsetof(UWB_DebugNumber_C, UberGraphFrame) == 0x000260, "Member 'UWB_DebugNumber_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_DebugNumber_C, M_WBPartyIndex) == 0x000268, "Member 'UWB_DebugNumber_C::M_WBPartyIndex' has a wrong offset!");
static_assert(offsetof(UWB_DebugNumber_C, M_PartyIndex) == 0x000270, "Member 'UWB_DebugNumber_C::M_PartyIndex' has a wrong offset!");
static_assert(offsetof(UWB_DebugNumber_C, M_Work) == 0x000278, "Member 'UWB_DebugNumber_C::M_Work' has a wrong offset!");

}

