#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ExternalFontIcon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Project_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ExternalFontIcon.WB_ExternalFontIcon_C
// 0x0040 (0x02A0 - 0x0260)
class UWB_ExternalFontIcon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Icon;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_BTN_ICON_SIZE                               IconSize2;                                         // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63C6[0x3];                                     // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           IconColor;                                         // 0x0274(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63C7[0x4];                                     // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Debug_KeyInfo;                                     // 0x0288(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ExternalFontIcon(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetIconSize(E_BTN_ICON_SIZE InSIze2);
	void SetIcon(const struct FKey& InKeyInfo);
	void SetIconColor(const struct FLinearColor& InColor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ExternalFontIcon_C">();
	}
	static class UWB_ExternalFontIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ExternalFontIcon_C>();
	}
};
static_assert(alignof(UWB_ExternalFontIcon_C) == 0x000008, "Wrong alignment on UWB_ExternalFontIcon_C");
static_assert(sizeof(UWB_ExternalFontIcon_C) == 0x0002A0, "Wrong size on UWB_ExternalFontIcon_C");
static_assert(offsetof(UWB_ExternalFontIcon_C, UberGraphFrame) == 0x000260, "Member 'UWB_ExternalFontIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ExternalFontIcon_C, Image_Icon) == 0x000268, "Member 'UWB_ExternalFontIcon_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWB_ExternalFontIcon_C, IconSize2) == 0x000270, "Member 'UWB_ExternalFontIcon_C::IconSize2' has a wrong offset!");
static_assert(offsetof(UWB_ExternalFontIcon_C, IconColor) == 0x000274, "Member 'UWB_ExternalFontIcon_C::IconColor' has a wrong offset!");
static_assert(offsetof(UWB_ExternalFontIcon_C, Debug_KeyInfo) == 0x000288, "Member 'UWB_ExternalFontIcon_C::Debug_KeyInfo' has a wrong offset!");

}

