#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_EventTest

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_EventTest.WB_EventTest_C
// 0x0018 (0x0278 - 0x0260)
class UWB_EventTest_C final : public UUserWidget
{
public:
	class UAtRichText*                            EventMessageText;                                  // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAtRichText*                            EventVoiceTimeText;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAtRichText*                            EventVoiceTimeText_1;                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_EventTest_C">();
	}
	static class UWB_EventTest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_EventTest_C>();
	}
};
static_assert(alignof(UWB_EventTest_C) == 0x000008, "Wrong alignment on UWB_EventTest_C");
static_assert(sizeof(UWB_EventTest_C) == 0x000278, "Wrong size on UWB_EventTest_C");
static_assert(offsetof(UWB_EventTest_C, EventMessageText) == 0x000260, "Member 'UWB_EventTest_C::EventMessageText' has a wrong offset!");
static_assert(offsetof(UWB_EventTest_C, EventVoiceTimeText) == 0x000268, "Member 'UWB_EventTest_C::EventVoiceTimeText' has a wrong offset!");
static_assert(offsetof(UWB_EventTest_C, EventVoiceTimeText_1) == 0x000270, "Member 'UWB_EventTest_C::EventVoiceTimeText_1' has a wrong offset!");

}

