#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_FacilityListBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_FacilityListBase.WB_FacilityListBase_C.InitScrollCrtl
// 0x0030 (0x0030 - 0x0000)
struct WB_FacilityListBase_C_InitScrollCrtl final
{
public:
	int32                                         InDispNum;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InDataNum;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InDataIndex;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetDataIndex_NewSelect;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_FacilityListBase_C_InitScrollCrtl) == 0x000004, "Wrong alignment on WB_FacilityListBase_C_InitScrollCrtl");
static_assert(sizeof(WB_FacilityListBase_C_InitScrollCrtl) == 0x000030, "Wrong size on WB_FacilityListBase_C_InitScrollCrtl");
static_assert(offsetof(WB_FacilityListBase_C_InitScrollCrtl, InDispNum) == 0x000000, "Member 'WB_FacilityListBase_C_InitScrollCrtl::InDispNum' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_InitScrollCrtl, InDataNum) == 0x000004, "Member 'WB_FacilityListBase_C_InitScrollCrtl::InDataNum' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_InitScrollCrtl, InDataIndex) == 0x000008, "Member 'WB_FacilityListBase_C_InitScrollCrtl::InDataIndex' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_InitScrollCrtl, CallFunc_SetDataIndex_NewSelect) == 0x00000C, "Member 'WB_FacilityListBase_C_InitScrollCrtl::CallFunc_SetDataIndex_NewSelect' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_InitScrollCrtl, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'WB_FacilityListBase_C_InitScrollCrtl::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_InitScrollCrtl, CallFunc_Min_ReturnValue) == 0x000014, "Member 'WB_FacilityListBase_C_InitScrollCrtl::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_InitScrollCrtl, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'WB_FacilityListBase_C_InitScrollCrtl::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_InitScrollCrtl, CallFunc_Max_ReturnValue) == 0x00001C, "Member 'WB_FacilityListBase_C_InitScrollCrtl::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_InitScrollCrtl, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000020, "Member 'WB_FacilityListBase_C_InitScrollCrtl::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_InitScrollCrtl, CallFunc_Clamp_ReturnValue) == 0x000024, "Member 'WB_FacilityListBase_C_InitScrollCrtl::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_InitScrollCrtl, CallFunc_Max_ReturnValue_1) == 0x000028, "Member 'WB_FacilityListBase_C_InitScrollCrtl::CallFunc_Max_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_InitScrollCrtl, CallFunc_Clamp_ReturnValue_1) == 0x00002C, "Member 'WB_FacilityListBase_C_InitScrollCrtl::CallFunc_Clamp_ReturnValue_1' has a wrong offset!");

// Function WB_FacilityListBase.WB_FacilityListBase_C.scrollUp
// 0x004C (0x004C - 0x0000)
struct WB_FacilityListBase_C_ScrollUp final
{
public:
	int32                                         NewSelect;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_index;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectDataIndex_DataIndex;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectDataIndex_DataIndex_1;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectDataIndex_DataIndex_2;           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_4;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_FacilityListBase_C_ScrollUp) == 0x000004, "Wrong alignment on WB_FacilityListBase_C_ScrollUp");
static_assert(sizeof(WB_FacilityListBase_C_ScrollUp) == 0x00004C, "Wrong size on WB_FacilityListBase_C_ScrollUp");
static_assert(offsetof(WB_FacilityListBase_C_ScrollUp, NewSelect) == 0x000000, "Member 'WB_FacilityListBase_C_ScrollUp::NewSelect' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollUp, L_index) == 0x000004, "Member 'WB_FacilityListBase_C_ScrollUp::L_index' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollUp, Temp_int_Variable) == 0x000008, "Member 'WB_FacilityListBase_C_ScrollUp::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollUp, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WB_FacilityListBase_C_ScrollUp::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollUp, Temp_int_Variable_1) == 0x000010, "Member 'WB_FacilityListBase_C_ScrollUp::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollUp, CallFunc_Max_ReturnValue) == 0x000014, "Member 'WB_FacilityListBase_C_ScrollUp::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollUp, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000018, "Member 'WB_FacilityListBase_C_ScrollUp::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollUp, CallFunc_Max_ReturnValue_1) == 0x00001C, "Member 'WB_FacilityListBase_C_ScrollUp::CallFunc_Max_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollUp, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000020, "Member 'WB_FacilityListBase_C_ScrollUp::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollUp, CallFunc_GetSelectDataIndex_DataIndex) == 0x000024, "Member 'WB_FacilityListBase_C_ScrollUp::CallFunc_GetSelectDataIndex_DataIndex' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollUp, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'WB_FacilityListBase_C_ScrollUp::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollUp, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x00002C, "Member 'WB_FacilityListBase_C_ScrollUp::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollUp, CallFunc_GetSelectDataIndex_DataIndex_1) == 0x000030, "Member 'WB_FacilityListBase_C_ScrollUp::CallFunc_GetSelectDataIndex_DataIndex_1' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollUp, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x000034, "Member 'WB_FacilityListBase_C_ScrollUp::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollUp, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000038, "Member 'WB_FacilityListBase_C_ScrollUp::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollUp, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000039, "Member 'WB_FacilityListBase_C_ScrollUp::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollUp, CallFunc_GetSelectDataIndex_DataIndex_2) == 0x00003C, "Member 'WB_FacilityListBase_C_ScrollUp::CallFunc_GetSelectDataIndex_DataIndex_2' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollUp, Temp_int_Variable_2) == 0x000040, "Member 'WB_FacilityListBase_C_ScrollUp::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollUp, CallFunc_GreaterEqual_IntInt_ReturnValue_2) == 0x000044, "Member 'WB_FacilityListBase_C_ScrollUp::CallFunc_GreaterEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollUp, CallFunc_Subtract_IntInt_ReturnValue_4) == 0x000048, "Member 'WB_FacilityListBase_C_ScrollUp::CallFunc_Subtract_IntInt_ReturnValue_4' has a wrong offset!");

// Function WB_FacilityListBase.WB_FacilityListBase_C.scrollDown
// 0x0070 (0x0070 - 0x0000)
struct WB_FacilityListBase_C_ScrollDown final
{
public:
	int32                                         NewSelect;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_index;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_2;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectDataIndex_DataIndex;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectDataIndex_DataIndex_1;           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_3;                        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_4;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_4;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_5;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_5;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectDataIndex_DataIndex_2;           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FacilityListBase_C_ScrollDown) == 0x000004, "Wrong alignment on WB_FacilityListBase_C_ScrollDown");
static_assert(sizeof(WB_FacilityListBase_C_ScrollDown) == 0x000070, "Wrong size on WB_FacilityListBase_C_ScrollDown");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, NewSelect) == 0x000000, "Member 'WB_FacilityListBase_C_ScrollDown::NewSelect' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, L_index) == 0x000004, "Member 'WB_FacilityListBase_C_ScrollDown::L_index' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_Max_ReturnValue) == 0x00000C, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000010, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_Max_ReturnValue_1) == 0x000014, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_Max_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000018, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_Max_ReturnValue_2) == 0x00001C, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_Max_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_GetSelectDataIndex_DataIndex) == 0x000020, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_GetSelectDataIndex_DataIndex' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x000024, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_GetSelectDataIndex_DataIndex_1) == 0x000028, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_GetSelectDataIndex_DataIndex_1' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_Max_ReturnValue_3) == 0x00002C, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_Max_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, Temp_int_Variable) == 0x000030, "Member 'WB_FacilityListBase_C_ScrollDown::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, Temp_int_Variable_1) == 0x000034, "Member 'WB_FacilityListBase_C_ScrollDown::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_Subtract_IntInt_ReturnValue_4) == 0x00003C, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_Subtract_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_Max_ReturnValue_4) == 0x000040, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_Max_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000048, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_Subtract_IntInt_ReturnValue_5) == 0x00004C, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_Subtract_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_Max_ReturnValue_5) == 0x000050, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_Max_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_Add_IntInt_ReturnValue_2) == 0x000054, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000058, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, Temp_int_Variable_2) == 0x00005C, "Member 'WB_FacilityListBase_C_ScrollDown::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_GetSelectDataIndex_DataIndex_2) == 0x000060, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_GetSelectDataIndex_DataIndex_2' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_Add_IntInt_ReturnValue_3) == 0x000064, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_Add_IntInt_ReturnValue_4) == 0x000068, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00006C, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollDown, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x00006D, "Member 'WB_FacilityListBase_C_ScrollDown::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function WB_FacilityListBase.WB_FacilityListBase_C.scrollPageUp
// 0x0038 (0x0038 - 0x0000)
struct WB_FacilityListBase_C_ScrollPageUp final
{
public:
	int32                                         NewSelect;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_TopIndex;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectDataIndex_DataIndex;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_2;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectDataIndex_DataIndex_1;           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_3;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FacilityListBase_C_ScrollPageUp) == 0x000004, "Wrong alignment on WB_FacilityListBase_C_ScrollPageUp");
static_assert(sizeof(WB_FacilityListBase_C_ScrollPageUp) == 0x000038, "Wrong size on WB_FacilityListBase_C_ScrollPageUp");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageUp, NewSelect) == 0x000000, "Member 'WB_FacilityListBase_C_ScrollPageUp::NewSelect' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageUp, L_TopIndex) == 0x000004, "Member 'WB_FacilityListBase_C_ScrollPageUp::L_TopIndex' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageUp, CallFunc_GetSelectDataIndex_DataIndex) == 0x000008, "Member 'WB_FacilityListBase_C_ScrollPageUp::CallFunc_GetSelectDataIndex_DataIndex' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageUp, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WB_FacilityListBase_C_ScrollPageUp::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageUp, CallFunc_Max_ReturnValue) == 0x000010, "Member 'WB_FacilityListBase_C_ScrollPageUp::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageUp, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000014, "Member 'WB_FacilityListBase_C_ScrollPageUp::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageUp, CallFunc_Max_ReturnValue_1) == 0x000018, "Member 'WB_FacilityListBase_C_ScrollPageUp::CallFunc_Max_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageUp, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'WB_FacilityListBase_C_ScrollPageUp::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageUp, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000020, "Member 'WB_FacilityListBase_C_ScrollPageUp::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageUp, CallFunc_Max_ReturnValue_2) == 0x000024, "Member 'WB_FacilityListBase_C_ScrollPageUp::CallFunc_Max_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageUp, CallFunc_GetSelectDataIndex_DataIndex_1) == 0x000028, "Member 'WB_FacilityListBase_C_ScrollPageUp::CallFunc_GetSelectDataIndex_DataIndex_1' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageUp, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x00002C, "Member 'WB_FacilityListBase_C_ScrollPageUp::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageUp, CallFunc_Max_ReturnValue_3) == 0x000030, "Member 'WB_FacilityListBase_C_ScrollPageUp::CallFunc_Max_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageUp, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000034, "Member 'WB_FacilityListBase_C_ScrollPageUp::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageUp, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000035, "Member 'WB_FacilityListBase_C_ScrollPageUp::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function WB_FacilityListBase.WB_FacilityListBase_C.scrollPageDown
// 0x0054 (0x0054 - 0x0000)
struct WB_FacilityListBase_C_ScrollPageDown final
{
public:
	int32                                         NewSelect;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_BottomIndex;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_2;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectDataIndex_DataIndex;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_3;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectDataIndex_DataIndex_1;           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_4;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_4;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_5;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_5;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Min_ReturnValue;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FacilityListBase_C_ScrollPageDown) == 0x000004, "Wrong alignment on WB_FacilityListBase_C_ScrollPageDown");
static_assert(sizeof(WB_FacilityListBase_C_ScrollPageDown) == 0x000054, "Wrong size on WB_FacilityListBase_C_ScrollPageDown");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageDown, NewSelect) == 0x000000, "Member 'WB_FacilityListBase_C_ScrollPageDown::NewSelect' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageDown, L_BottomIndex) == 0x000004, "Member 'WB_FacilityListBase_C_ScrollPageDown::L_BottomIndex' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageDown, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WB_FacilityListBase_C_ScrollPageDown::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageDown, CallFunc_Max_ReturnValue) == 0x00000C, "Member 'WB_FacilityListBase_C_ScrollPageDown::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageDown, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000010, "Member 'WB_FacilityListBase_C_ScrollPageDown::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageDown, CallFunc_Max_ReturnValue_1) == 0x000014, "Member 'WB_FacilityListBase_C_ScrollPageDown::CallFunc_Max_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageDown, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000018, "Member 'WB_FacilityListBase_C_ScrollPageDown::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageDown, CallFunc_Max_ReturnValue_2) == 0x00001C, "Member 'WB_FacilityListBase_C_ScrollPageDown::CallFunc_Max_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageDown, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x000020, "Member 'WB_FacilityListBase_C_ScrollPageDown::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageDown, CallFunc_GetSelectDataIndex_DataIndex) == 0x000024, "Member 'WB_FacilityListBase_C_ScrollPageDown::CallFunc_GetSelectDataIndex_DataIndex' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageDown, CallFunc_Max_ReturnValue_3) == 0x000028, "Member 'WB_FacilityListBase_C_ScrollPageDown::CallFunc_Max_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageDown, CallFunc_GetSelectDataIndex_DataIndex_1) == 0x00002C, "Member 'WB_FacilityListBase_C_ScrollPageDown::CallFunc_GetSelectDataIndex_DataIndex_1' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageDown, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WB_FacilityListBase_C_ScrollPageDown::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageDown, CallFunc_Subtract_IntInt_ReturnValue_4) == 0x000034, "Member 'WB_FacilityListBase_C_ScrollPageDown::CallFunc_Subtract_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageDown, CallFunc_Max_ReturnValue_4) == 0x000038, "Member 'WB_FacilityListBase_C_ScrollPageDown::CallFunc_Max_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageDown, CallFunc_Subtract_IntInt_ReturnValue_5) == 0x00003C, "Member 'WB_FacilityListBase_C_ScrollPageDown::CallFunc_Subtract_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageDown, CallFunc_Max_ReturnValue_5) == 0x000040, "Member 'WB_FacilityListBase_C_ScrollPageDown::CallFunc_Max_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageDown, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'WB_FacilityListBase_C_ScrollPageDown::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageDown, CallFunc_Less_IntInt_ReturnValue_1) == 0x000048, "Member 'WB_FacilityListBase_C_ScrollPageDown::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageDown, CallFunc_Min_ReturnValue) == 0x00004C, "Member 'WB_FacilityListBase_C_ScrollPageDown::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_ScrollPageDown, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000050, "Member 'WB_FacilityListBase_C_ScrollPageDown::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_FacilityListBase.WB_FacilityListBase_C.SetDispCursor
// 0x001C (0x001C - 0x0000)
struct WB_FacilityListBase_C_SetDispCursor final
{
public:
	int32                                         DispIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewSelect;                                         // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectDataIndex_DataIndex;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FacilityListBase_C_SetDispCursor) == 0x000004, "Wrong alignment on WB_FacilityListBase_C_SetDispCursor");
static_assert(sizeof(WB_FacilityListBase_C_SetDispCursor) == 0x00001C, "Wrong size on WB_FacilityListBase_C_SetDispCursor");
static_assert(offsetof(WB_FacilityListBase_C_SetDispCursor, DispIndex) == 0x000000, "Member 'WB_FacilityListBase_C_SetDispCursor::DispIndex' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDispCursor, NewSelect) == 0x000004, "Member 'WB_FacilityListBase_C_SetDispCursor::NewSelect' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDispCursor, CallFunc_GetSelectDataIndex_DataIndex) == 0x000008, "Member 'WB_FacilityListBase_C_SetDispCursor::CallFunc_GetSelectDataIndex_DataIndex' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDispCursor, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WB_FacilityListBase_C_SetDispCursor::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDispCursor, CallFunc_Max_ReturnValue) == 0x000010, "Member 'WB_FacilityListBase_C_SetDispCursor::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDispCursor, CallFunc_Clamp_ReturnValue) == 0x000014, "Member 'WB_FacilityListBase_C_SetDispCursor::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDispCursor, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000018, "Member 'WB_FacilityListBase_C_SetDispCursor::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_FacilityListBase.WB_FacilityListBase_C.SetDataIndex
// 0x0038 (0x0038 - 0x0000)
struct WB_FacilityListBase_C_SetDataIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewSelect;                                         // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_index;                                           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectDataIndex_DataIndex;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetDispTop_DispTop;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_FacilityListBase_C_SetDataIndex) == 0x000004, "Wrong alignment on WB_FacilityListBase_C_SetDataIndex");
static_assert(sizeof(WB_FacilityListBase_C_SetDataIndex) == 0x000038, "Wrong size on WB_FacilityListBase_C_SetDataIndex");
static_assert(offsetof(WB_FacilityListBase_C_SetDataIndex, Param_Index) == 0x000000, "Member 'WB_FacilityListBase_C_SetDataIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDataIndex, NewSelect) == 0x000004, "Member 'WB_FacilityListBase_C_SetDataIndex::NewSelect' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDataIndex, L_index) == 0x000008, "Member 'WB_FacilityListBase_C_SetDataIndex::L_index' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDataIndex, Temp_bool_Variable) == 0x00000C, "Member 'WB_FacilityListBase_C_SetDataIndex::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDataIndex, Temp_int_Variable) == 0x000010, "Member 'WB_FacilityListBase_C_SetDataIndex::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDataIndex, CallFunc_GetSelectDataIndex_DataIndex) == 0x000014, "Member 'WB_FacilityListBase_C_SetDataIndex::CallFunc_GetSelectDataIndex_DataIndex' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDataIndex, CallFunc_Divide_IntInt_ReturnValue) == 0x000018, "Member 'WB_FacilityListBase_C_SetDataIndex::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDataIndex, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'WB_FacilityListBase_C_SetDataIndex::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDataIndex, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'WB_FacilityListBase_C_SetDataIndex::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDataIndex, CallFunc_SetDispTop_DispTop) == 0x000024, "Member 'WB_FacilityListBase_C_SetDataIndex::CallFunc_SetDispTop_DispTop' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDataIndex, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000028, "Member 'WB_FacilityListBase_C_SetDataIndex::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDataIndex, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x00002C, "Member 'WB_FacilityListBase_C_SetDataIndex::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDataIndex, K2Node_Select_Default) == 0x000030, "Member 'WB_FacilityListBase_C_SetDataIndex::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDataIndex, CallFunc_Clamp_ReturnValue) == 0x000034, "Member 'WB_FacilityListBase_C_SetDataIndex::CallFunc_Clamp_ReturnValue' has a wrong offset!");

// Function WB_FacilityListBase.WB_FacilityListBase_C.SetDispTop
// 0x0014 (0x0014 - 0x0000)
struct WB_FacilityListBase_C_SetDispTop final
{
public:
	int32                                         DataIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_DispTop;                                     // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_FacilityListBase_C_SetDispTop) == 0x000004, "Wrong alignment on WB_FacilityListBase_C_SetDispTop");
static_assert(sizeof(WB_FacilityListBase_C_SetDispTop) == 0x000014, "Wrong size on WB_FacilityListBase_C_SetDispTop");
static_assert(offsetof(WB_FacilityListBase_C_SetDispTop, DataIndex) == 0x000000, "Member 'WB_FacilityListBase_C_SetDispTop::DataIndex' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDispTop, Param_DispTop) == 0x000004, "Member 'WB_FacilityListBase_C_SetDispTop::Param_DispTop' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDispTop, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'WB_FacilityListBase_C_SetDispTop::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDispTop, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WB_FacilityListBase_C_SetDispTop::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetDispTop, CallFunc_Clamp_ReturnValue) == 0x000010, "Member 'WB_FacilityListBase_C_SetDispTop::CallFunc_Clamp_ReturnValue' has a wrong offset!");

// Function WB_FacilityListBase.WB_FacilityListBase_C.SetScrollRate
// 0x0020 (0x0020 - 0x0000)
struct WB_FacilityListBase_C_SetScrollRate final
{
public:
	float                                         InScrollRate;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_MaxOffset;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_FacilityListBase_C_SetScrollRate) == 0x000004, "Wrong alignment on WB_FacilityListBase_C_SetScrollRate");
static_assert(sizeof(WB_FacilityListBase_C_SetScrollRate) == 0x000020, "Wrong size on WB_FacilityListBase_C_SetScrollRate");
static_assert(offsetof(WB_FacilityListBase_C_SetScrollRate, InScrollRate) == 0x000000, "Member 'WB_FacilityListBase_C_SetScrollRate::InScrollRate' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetScrollRate, L_MaxOffset) == 0x000004, "Member 'WB_FacilityListBase_C_SetScrollRate::L_MaxOffset' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetScrollRate, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'WB_FacilityListBase_C_SetScrollRate::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetScrollRate, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00000C, "Member 'WB_FacilityListBase_C_SetScrollRate::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetScrollRate, CallFunc_FClamp_ReturnValue) == 0x000010, "Member 'WB_FacilityListBase_C_SetScrollRate::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetScrollRate, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'WB_FacilityListBase_C_SetScrollRate::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetScrollRate, CallFunc_Round_ReturnValue) == 0x000018, "Member 'WB_FacilityListBase_C_SetScrollRate::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_SetScrollRate, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'WB_FacilityListBase_C_SetScrollRate::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function WB_FacilityListBase.WB_FacilityListBase_C.GetSelectDataIndex
// 0x0014 (0x0014 - 0x0000)
struct WB_FacilityListBase_C_GetSelectDataIndex final
{
public:
	int32                                         DataIndex;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_FacilityListBase_C_GetSelectDataIndex) == 0x000004, "Wrong alignment on WB_FacilityListBase_C_GetSelectDataIndex");
static_assert(sizeof(WB_FacilityListBase_C_GetSelectDataIndex) == 0x000014, "Wrong size on WB_FacilityListBase_C_GetSelectDataIndex");
static_assert(offsetof(WB_FacilityListBase_C_GetSelectDataIndex, DataIndex) == 0x000000, "Member 'WB_FacilityListBase_C_GetSelectDataIndex::DataIndex' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_GetSelectDataIndex, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'WB_FacilityListBase_C_GetSelectDataIndex::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_GetSelectDataIndex, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WB_FacilityListBase_C_GetSelectDataIndex::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_GetSelectDataIndex, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WB_FacilityListBase_C_GetSelectDataIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FacilityListBase_C_GetSelectDataIndex, CallFunc_Clamp_ReturnValue) == 0x000010, "Member 'WB_FacilityListBase_C_GetSelectDataIndex::CallFunc_Clamp_ReturnValue' has a wrong offset!");

// Function WB_FacilityListBase.WB_FacilityListBase_C.GetDispDataIndex
// 0x0014 (0x0014 - 0x0000)
struct WB_FacilityListBase_C_GetDispDataIndex final
{
public:
	int32                                         Top;                                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
