#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_HealRecoveryAll

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_HealRecoveryAll.WB_HealRecoveryAll_C
// 0x0018 (0x0278 - 0x0260)
class UWB_HealRecoveryAll_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanelMain;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerRecoveryAll;                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetRecoveryAllAnimation();
	void Construct();
	void BndEvt__SsPlayerRecoveryAll_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void ExecuteUbergraph_WB_HealRecoveryAll(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_HealRecoveryAll_C">();
	}
	static class UWB_HealRecoveryAll_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_HealRecoveryAll_C>();
	}
};
static_assert(alignof(UWB_HealRecoveryAll_C) == 0x000008, "Wrong alignment on UWB_HealRecoveryAll_C");
static_assert(sizeof(UWB_HealRecoveryAll_C) == 0x000278, "Wrong size on UWB_HealRecoveryAll_C");
static_assert(offsetof(UWB_HealRecoveryAll_C, UberGraphFrame) == 0x000260, "Member 'UWB_HealRecoveryAll_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_HealRecoveryAll_C, CanvasPanelMain) == 0x000268, "Member 'UWB_HealRecoveryAll_C::CanvasPanelMain' has a wrong offset!");
static_assert(offsetof(UWB_HealRecoveryAll_C, SsPlayerRecoveryAll) == 0x000270, "Member 'UWB_HealRecoveryAll_C::SsPlayerRecoveryAll' has a wrong offset!");

}

