#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_HealRecoveryAll

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_HealRecoveryAll.WB_HealRecoveryAll_C.SetRecoveryAllAnimation
// 0x0001 (0x0001 - 0x0000)
struct WB_HealRecoveryAll_C_SetRecoveryAllAnimation final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_HealRecoveryAll_C_SetRecoveryAllAnimation) == 0x000001, "Wrong alignment on WB_HealRecoveryAll_C_SetRecoveryAllAnimation");
static_assert(sizeof(WB_HealRecoveryAll_C_SetRecoveryAllAnimation) == 0x000001, "Wrong size on WB_HealRecoveryAll_C_SetRecoveryAllAnimation");
static_assert(offsetof(WB_HealRecoveryAll_C_SetRecoveryAllAnimation, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_HealRecoveryAll_C_SetRecoveryAllAnimation::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_HealRecoveryAll.WB_HealRecoveryAll_C.BndEvt__SsPlayerRecoveryAll_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_HealRecoveryAll_C_BndEvt__SsPlayerRecoveryAll_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_HealRecoveryAll_C_BndEvt__SsPlayerRecoveryAll_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_HealRecoveryAll_C_BndEvt__SsPlayerRecoveryAll_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_HealRecoveryAll_C_BndEvt__SsPlayerRecoveryAll_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_HealRecoveryAll_C_BndEvt__SsPlayerRecoveryAll_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_HealRecoveryAll_C_BndEvt__SsPlayerRecoveryAll_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_HealRecoveryAll_C_BndEvt__SsPlayerRecoveryAll_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_HealRecoveryAll_C_BndEvt__SsPlayerRecoveryAll_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_HealRecoveryAll_C_BndEvt__SsPlayerRecoveryAll_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_HealRecoveryAll_C_BndEvt__SsPlayerRecoveryAll_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_HealRecoveryAll_C_BndEvt__SsPlayerRecoveryAll_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_HealRecoveryAll_C_BndEvt__SsPlayerRecoveryAll_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_HealRecoveryAll_C_BndEvt__SsPlayerRecoveryAll_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_HealRecoveryAll.WB_HealRecoveryAll_C.ExecuteUbergraph_WB_HealRecoveryAll
// 0x001C (0x001C - 0x0000)
struct WB_HealRecoveryAll_C_ExecuteUbergraph_WB_HealRecoveryAll final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName;           // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName;          // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_HealRecoveryAll_C_ExecuteUbergraph_WB_HealRecoveryAll) == 0x000004, "Wrong alignment on WB_HealRecoveryAll_C_ExecuteUbergraph_WB_HealRecoveryAll");
static_assert(sizeof(WB_HealRecoveryAll_C_ExecuteUbergraph_WB_HealRecoveryAll) == 0x00001C, "Wrong size on WB_HealRecoveryAll_C_ExecuteUbergraph_WB_HealRecoveryAll");
static_assert(offsetof(WB_HealRecoveryAll_C_ExecuteUbergraph_WB_HealRecoveryAll, EntryPoint) == 0x000000, "Member 'WB_HealRecoveryAll_C_ExecuteUbergraph_WB_HealRecoveryAll::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_HealRecoveryAll_C_ExecuteUbergraph_WB_HealRecoveryAll, K2Node_ComponentBoundEvent_AnimPackName) == 0x000004, "Member 'WB_HealRecoveryAll_C_ExecuteUbergraph_WB_HealRecoveryAll::K2Node_ComponentBoundEvent_AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_HealRecoveryAll_C_ExecuteUbergraph_WB_HealRecoveryAll, K2Node_ComponentBoundEvent_AnimationName) == 0x00000C, "Member 'WB_HealRecoveryAll_C_ExecuteUbergraph_WB_HealRecoveryAll::K2Node_ComponentBoundEvent_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_HealRecoveryAll_C_ExecuteUbergraph_WB_HealRecoveryAll, K2Node_ComponentBoundEvent_AnimPackIndex) == 0x000014, "Member 'WB_HealRecoveryAll_C_ExecuteUbergraph_WB_HealRecoveryAll::K2Node_ComponentBoundEvent_AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_HealRecoveryAll_C_ExecuteUbergraph_WB_HealRecoveryAll, K2Node_ComponentBoundEvent_AnimationIndex) == 0x000018, "Member 'WB_HealRecoveryAll_C_ExecuteUbergraph_WB_HealRecoveryAll::K2Node_ComponentBoundEvent_AnimationIndex' has a wrong offset!");

}

