#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ItemWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ItemWindow.WB_ItemWindow_C
// 0x0058 (0x02B8 - 0x0260)
class UWB_ItemWindow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Imageslash;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMessageRichTextWidget*                 MessageRichTextWidget_102;                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerWidgetpos;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerWidgetWindow;                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlockItemName;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_NElementIcon_C*                     WB_NElementIcon;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_NNumberIcon01_C*                    WB_NNumberIcon01Denominator;                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_NNumberIcon01_C*                    WB_NNumberIcon01Numerator;                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsWindowOpenFlag;                                  // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsWindowCloseFlag;                                 // 0x02B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSetText;                                         // 0x02B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_ItemWindow(int32 EntryPoint);
	void Construct();
	void BndEvt__SsPlayerWidgetWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void ExecutionItemWindowClose();
	void ExecutionItemWindowOpen(int32 InItemId);
	void ItemWindowClose();
	void ItemWindowOpen(int32 InItemId);
	void IsFinishedOpenWindow(bool* OutFinished);
	void IsFinishedCloseWindow(bool* OutFinished);
	void SetItemText(class UScriptMessageAsset* InScriptMessageAsset, class FName InLabel, bool InExecutionText);
	void SetItemTextByIndex(class UScriptMessageAsset* InScriptMessageAsset, int32 InIndex, bool InExecutionText);
	void ClearItemText();
	void GetItemText(class UAtRichText** OutMessage);
	void SetWindowPosition();
	void SetItemName(int32 InItemId);
	void SetItemNumber(int32 InItemNumber, int32 InItemMax);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ItemWindow_C">();
	}
	static class UWB_ItemWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ItemWindow_C>();
	}
};
static_assert(alignof(UWB_ItemWindow_C) == 0x000008, "Wrong alignment on UWB_ItemWindow_C");
static_assert(sizeof(UWB_ItemWindow_C) == 0x0002B8, "Wrong size on UWB_ItemWindow_C");
static_assert(offsetof(UWB_ItemWindow_C, UberGraphFrame) == 0x000260, "Member 'UWB_ItemWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ItemWindow_C, CanvasPanel_0) == 0x000268, "Member 'UWB_ItemWindow_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWB_ItemWindow_C, Imageslash) == 0x000270, "Member 'UWB_ItemWindow_C::Imageslash' has a wrong offset!");
static_assert(offsetof(UWB_ItemWindow_C, MessageRichTextWidget_102) == 0x000278, "Member 'UWB_ItemWindow_C::MessageRichTextWidget_102' has a wrong offset!");
static_assert(offsetof(UWB_ItemWindow_C, SsPlayerWidgetpos) == 0x000280, "Member 'UWB_ItemWindow_C::SsPlayerWidgetpos' has a wrong offset!");
static_assert(offsetof(UWB_ItemWindow_C, SsPlayerWidgetWindow) == 0x000288, "Member 'UWB_ItemWindow_C::SsPlayerWidgetWindow' has a wrong offset!");
static_assert(offsetof(UWB_ItemWindow_C, TextBlockItemName) == 0x000290, "Member 'UWB_ItemWindow_C::TextBlockItemName' has a wrong offset!");
static_assert(offsetof(UWB_ItemWindow_C, WB_NElementIcon) == 0x000298, "Member 'UWB_ItemWindow_C::WB_NElementIcon' has a wrong offset!");
static_assert(offsetof(UWB_ItemWindow_C, WB_NNumberIcon01Denominator) == 0x0002A0, "Member 'UWB_ItemWindow_C::WB_NNumberIcon01Denominator' has a wrong offset!");
static_assert(offsetof(UWB_ItemWindow_C, WB_NNumberIcon01Numerator) == 0x0002A8, "Member 'UWB_ItemWindow_C::WB_NNumberIcon01Numerator' has a wrong offset!");
static_assert(offsetof(UWB_ItemWindow_C, IsWindowOpenFlag) == 0x0002B0, "Member 'UWB_ItemWindow_C::IsWindowOpenFlag' has a wrong offset!");
static_assert(offsetof(UWB_ItemWindow_C, IsWindowCloseFlag) == 0x0002B1, "Member 'UWB_ItemWindow_C::IsWindowCloseFlag' has a wrong offset!");
static_assert(offsetof(UWB_ItemWindow_C, IsSetText) == 0x0002B2, "Member 'UWB_ItemWindow_C::IsSetText' has a wrong offset!");

}

