#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_InfoWindow

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_InfoWindow.WB_InfoWindow_C.ExecuteUbergraph_WB_InfoWindow
// 0x0024 (0x0024 - 0x0000)
struct WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName;           // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName;          // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_3;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow) == 0x000004, "Wrong alignment on WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow");
static_assert(sizeof(WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow) == 0x000024, "Wrong size on WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow");
static_assert(offsetof(WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow, EntryPoint) == 0x000000, "Member 'WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow, K2Node_ComponentBoundEvent_AnimPackName) == 0x000004, "Member 'WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow::K2Node_ComponentBoundEvent_AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow, K2Node_ComponentBoundEvent_AnimationName) == 0x00000C, "Member 'WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow::K2Node_ComponentBoundEvent_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow, K2Node_ComponentBoundEvent_AnimPackIndex) == 0x000014, "Member 'WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow::K2Node_ComponentBoundEvent_AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow, K2Node_ComponentBoundEvent_AnimationIndex) == 0x000018, "Member 'WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow::K2Node_ComponentBoundEvent_AnimationIndex' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow, K2Node_SwitchName_CmpSuccess) == 0x00001C, "Member 'WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow, CallFunc_Play_ReturnValue) == 0x00001D, "Member 'WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow, CallFunc_Play_ReturnValue_1) == 0x00001E, "Member 'WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow, CallFunc_Play_ReturnValue_2) == 0x00001F, "Member 'WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow, CallFunc_Play_ReturnValue_3) == 0x000020, "Member 'WB_InfoWindow_C_ExecuteUbergraph_WB_InfoWindow::CallFunc_Play_ReturnValue_3' has a wrong offset!");

// Function WB_InfoWindow.WB_InfoWindow_C.BndEvt__SsPlayerInfoWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_InfoWindow_C_BndEvt__SsPlayerInfoWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_InfoWindow_C_BndEvt__SsPlayerInfoWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_InfoWindow_C_BndEvt__SsPlayerInfoWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_InfoWindow_C_BndEvt__SsPlayerInfoWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_InfoWindow_C_BndEvt__SsPlayerInfoWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_InfoWindow_C_BndEvt__SsPlayerInfoWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_InfoWindow_C_BndEvt__SsPlayerInfoWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_BndEvt__SsPlayerInfoWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_InfoWindow_C_BndEvt__SsPlayerInfoWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_BndEvt__SsPlayerInfoWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_InfoWindow_C_BndEvt__SsPlayerInfoWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_BndEvt__SsPlayerInfoWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_InfoWindow_C_BndEvt__SsPlayerInfoWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_InfoWindow.WB_InfoWindow_C.IsFinishedOpenWindow
// 0x0001 (0x0001 - 0x0000)
struct WB_InfoWindow_C_IsFinishedOpenWindow final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_InfoWindow_C_IsFinishedOpenWindow) == 0x000001, "Wrong alignment on WB_InfoWindow_C_IsFinishedOpenWindow");
static_assert(sizeof(WB_InfoWindow_C_IsFinishedOpenWindow) == 0x000001, "Wrong size on WB_InfoWindow_C_IsFinishedOpenWindow");
static_assert(offsetof(WB_InfoWindow_C_IsFinishedOpenWindow, OutFinished) == 0x000000, "Member 'WB_InfoWindow_C_IsFinishedOpenWindow::OutFinished' has a wrong offset!");

// Function WB_InfoWindow.WB_InfoWindow_C.IsFinishedCloseWindow
// 0x0001 (0x0001 - 0x0000)
struct WB_InfoWindow_C_IsFinishedCloseWindow final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_InfoWindow_C_IsFinishedCloseWindow) == 0x000001, "Wrong alignment on WB_InfoWindow_C_IsFinishedCloseWindow");
static_assert(sizeof(WB_InfoWindow_C_IsFinishedCloseWindow) == 0x000001, "Wrong size on WB_InfoWindow_C_IsFinishedCloseWindow");
static_assert(offsetof(WB_InfoWindow_C_IsFinishedCloseWindow, OutFinished) == 0x000000, "Member 'WB_InfoWindow_C_IsFinishedCloseWindow::OutFinished' has a wrong offset!");

// Function WB_InfoWindow.WB_InfoWindow_C.SetInfoText
// 0x0028 (0x0028 - 0x0000)
struct WB_InfoWindow_C_SetInfoText final
{
public:
	class UScriptMessageAsset*                    InScriptMessageAsset;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InLabel;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InExecutionText;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3375[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetScriptMessageByLabel_self_CastInput;   // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_InfoWindow_C_SetInfoText) == 0x000008, "Wrong alignment on WB_InfoWindow_C_SetInfoText");
static_assert(sizeof(WB_InfoWindow_C_SetInfoText) == 0x000028, "Wrong size on WB_InfoWindow_C_SetInfoText");
static_assert(offsetof(WB_InfoWindow_C_SetInfoText, InScriptMessageAsset) == 0x000000, "Member 'WB_InfoWindow_C_SetInfoText::InScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_SetInfoText, InLabel) == 0x000008, "Member 'WB_InfoWindow_C_SetInfoText::InLabel' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_SetInfoText, InExecutionText) == 0x000010, "Member 'WB_InfoWindow_C_SetInfoText::InExecutionText' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_SetInfoText, CallFunc_SetScriptMessageByLabel_self_CastInput) == 0x000018, "Member 'WB_InfoWindow_C_SetInfoText::CallFunc_SetScriptMessageByLabel_self_CastInput' has a wrong offset!");

// Function WB_InfoWindow.WB_InfoWindow_C.SetInfoTextByIndex
// 0x0020 (0x0020 - 0x0000)
struct WB_InfoWindow_C_SetInfoTextByIndex final
{
public:
	class UScriptMessageAsset*                    InScriptMessageAsset;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InIndex;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InExecutionText;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3376[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetScriptMessageByID_self_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_InfoWindow_C_SetInfoTextByIndex) == 0x000008, "Wrong alignment on WB_InfoWindow_C_SetInfoTextByIndex");
static_assert(sizeof(WB_InfoWindow_C_SetInfoTextByIndex) == 0x000020, "Wrong size on WB_InfoWindow_C_SetInfoTextByIndex");
static_assert(offsetof(WB_InfoWindow_C_SetInfoTextByIndex, InScriptMessageAsset) == 0x000000, "Member 'WB_InfoWindow_C_SetInfoTextByIndex::InScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_SetInfoTextByIndex, InIndex) == 0x000008, "Member 'WB_InfoWindow_C_SetInfoTextByIndex::InIndex' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_SetInfoTextByIndex, InExecutionText) == 0x00000C, "Member 'WB_InfoWindow_C_SetInfoTextByIndex::InExecutionText' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_SetInfoTextByIndex, CallFunc_SetScriptMessageByID_self_CastInput) == 0x000010, "Member 'WB_InfoWindow_C_SetInfoTextByIndex::CallFunc_SetScriptMessageByID_self_CastInput' has a wrong offset!");

// Function WB_InfoWindow.WB_InfoWindow_C.ClearInfoText
// 0x0018 (0x0018 - 0x0000)
struct WB_InfoWindow_C_ClearInfoText final
{
public:
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetScriptMessageByID_self_CastInput;      // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_InfoWindow_C_ClearInfoText) == 0x000008, "Wrong alignment on WB_InfoWindow_C_ClearInfoText");
static_assert(sizeof(WB_InfoWindow_C_ClearInfoText) == 0x000018, "Wrong size on WB_InfoWindow_C_ClearInfoText");
static_assert(offsetof(WB_InfoWindow_C_ClearInfoText, CallFunc_SetScriptMessageByID_self_CastInput) == 0x000000, "Member 'WB_InfoWindow_C_ClearInfoText::CallFunc_SetScriptMessageByID_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_ClearInfoText, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WB_InfoWindow_C_ClearInfoText::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WB_InfoWindow.WB_InfoWindow_C.SetInfoRichTextProgramValue
// 0x0028 (0x0028 - 0x0000)
struct WB_InfoWindow_C_SetInfoRichTextProgramValue final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3377[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InString;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetProgramValue_self_CastInput;           // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_InfoWindow_C_SetInfoRichTextProgramValue) == 0x000008, "Wrong alignment on WB_InfoWindow_C_SetInfoRichTextProgramValue");
static_assert(sizeof(WB_InfoWindow_C_SetInfoRichTextProgramValue) == 0x000028, "Wrong size on WB_InfoWindow_C_SetInfoRichTextProgramValue");
static_assert(offsetof(WB_InfoWindow_C_SetInfoRichTextProgramValue, InIndex) == 0x000000, "Member 'WB_InfoWindow_C_SetInfoRichTextProgramValue::InIndex' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_SetInfoRichTextProgramValue, InString) == 0x000008, "Member 'WB_InfoWindow_C_SetInfoRichTextProgramValue::InString' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_SetInfoRichTextProgramValue, CallFunc_SetProgramValue_self_CastInput) == 0x000018, "Member 'WB_InfoWindow_C_SetInfoRichTextProgramValue::CallFunc_SetProgramValue_self_CastInput' has a wrong offset!");

// Function WB_InfoWindow.WB_InfoWindow_C.SetInfoRichTextValueParam
// 0x0018 (0x0018 - 0x0000)
struct WB_InfoWindow_C_SetInfoRichTextValueParam final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InValeParam;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetValueParam_self_CastInput;             // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_InfoWindow_C_SetInfoRichTextValueParam) == 0x000008, "Wrong alignment on WB_InfoWindow_C_SetInfoRichTextValueParam");
static_assert(sizeof(WB_InfoWindow_C_SetInfoRichTextValueParam) == 0x000018, "Wrong size on WB_InfoWindow_C_SetInfoRichTextValueParam");
static_assert(offsetof(WB_InfoWindow_C_SetInfoRichTextValueParam, InIndex) == 0x000000, "Member 'WB_InfoWindow_C_SetInfoRichTextValueParam::InIndex' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_SetInfoRichTextValueParam, InValeParam) == 0x000004, "Member 'WB_InfoWindow_C_SetInfoRichTextValueParam::InValeParam' has a wrong offset!");
static_assert(offsetof(WB_InfoWindow_C_SetInfoRichTextValueParam, CallFunc_SetValueParam_self_CastInput) == 0x000008, "Member 'WB_InfoWindow_C_SetInfoRichTextValueParam::CallFunc_SetValueParam_self_CastInput' has a wrong offset!");

}

