#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_KeyConfigDebug_PrioView

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_KeyConfigDebug_PrioView.WB_KeyConfigDebug_PrioView_C.ExecuteUbergraph_WB_KeyConfigDebug_PrioView
// 0x0120 (0x0120 - 0x0000)
struct WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5619[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0028(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561A[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APadController*                         K2Node_DynamicCast_AsPad_Controller;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckGamePadEnable_ReturnValue;           // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckGamePadUI_ReturnValue;               // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_561B[0x5];                                     // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckMouseKeyboardEnable_ReturnValue;     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_561C[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_1;          // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0108(0x0018)()
};
static_assert(alignof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView) == 0x000008, "Wrong alignment on WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView");
static_assert(sizeof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView) == 0x000120, "Wrong size on WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView, EntryPoint) == 0x000000, "Member 'WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView, Temp_bool_Variable) == 0x000004, "Member 'WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView, Temp_string_Variable) == 0x000008, "Member 'WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView, Temp_string_Variable_1) == 0x000018, "Member 'WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView, K2Node_Event_MyGeometry) == 0x000028, "Member 'WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView, K2Node_Event_InDeltaTime) == 0x000060, "Member 'WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView, CallFunc_GetPlayerController_ReturnValue) == 0x000068, "Member 'WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView, K2Node_DynamicCast_AsPad_Controller) == 0x000070, "Member 'WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView::K2Node_DynamicCast_AsPad_Controller' has a wrong offset!");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView, CallFunc_CheckGamePadEnable_ReturnValue) == 0x000079, "Member 'WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView::CallFunc_CheckGamePadEnable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView, CallFunc_CheckGamePadUI_ReturnValue) == 0x00007A, "Member 'WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView::CallFunc_CheckGamePadUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView, CallFunc_Conv_BoolToString_ReturnValue) == 0x000080, "Member 'WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView, CallFunc_Concat_StrStr_ReturnValue) == 0x000090, "Member 'WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView, K2Node_Select_Default) == 0x0000A0, "Member 'WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000B0, "Member 'WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView, CallFunc_CheckMouseKeyboardEnable_ReturnValue) == 0x0000C0, "Member 'WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView::CallFunc_CheckMouseKeyboardEnable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView, CallFunc_Conv_BoolToString_ReturnValue_1) == 0x0000C8, "Member 'WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView::CallFunc_Conv_BoolToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000D8, "Member 'WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000E8, "Member 'WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000F8, "Member 'WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView, CallFunc_Conv_StringToText_ReturnValue) == 0x000108, "Member 'WB_KeyConfigDebug_PrioView_C_ExecuteUbergraph_WB_KeyConfigDebug_PrioView::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WB_KeyConfigDebug_PrioView.WB_KeyConfigDebug_PrioView_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_KeyConfigDebug_PrioView_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_KeyConfigDebug_PrioView_C_Tick) == 0x000004, "Wrong alignment on WB_KeyConfigDebug_PrioView_C_Tick");
static_assert(sizeof(WB_KeyConfigDebug_PrioView_C_Tick) == 0x00003C, "Wrong size on WB_KeyConfigDebug_PrioView_C_Tick");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_Tick, MyGeometry) == 0x000000, "Member 'WB_KeyConfigDebug_PrioView_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_KeyConfigDebug_PrioView_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_KeyConfigDebug_PrioView_C_Tick::InDeltaTime' has a wrong offset!");

}

