#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_LocationWin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Project_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_LocationWin.WB_LocationWin_C
// 0x0078 (0x02D8 - 0x0260)
class UWB_LocationWin_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USsPlayerWidget*                        SsPlayerMapAreaName;                               // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Location;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_LOCATION_WINDOW_STATE                       M_State;                                           // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6659[0x3];                                     // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           OtherFontColor;                                    // 0x027C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           OtherOutlineColor;                                 // 0x028C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NormalFontColor;                                   // 0x029C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NormalOutlineColor;                                // 0x02AC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOther;                                           // 0x02BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_665A[0x3];                                     // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CurrentText;                                       // 0x02C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WB_LocationWin(int32 EntryPoint);
	void BndEvt__SsPlayerMapAreaName_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void Close(bool PlayAnim);
	void Open(bool PlayAnim);
	void Construct();
	class FText GetMapAreaNameText();
	void SetOtherColor();
	void SetNormalColor();
	struct FSlateColor Get_AtRichText_Location_ColorAndOpacity_0();
	void SetCurrentText(class FText& InText);
	void GetState(E_LOCATION_WINDOW_STATE* State);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_LocationWin_C">();
	}
	static class UWB_LocationWin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_LocationWin_C>();
	}
};
static_assert(alignof(UWB_LocationWin_C) == 0x000008, "Wrong alignment on UWB_LocationWin_C");
static_assert(sizeof(UWB_LocationWin_C) == 0x0002D8, "Wrong size on UWB_LocationWin_C");
static_assert(offsetof(UWB_LocationWin_C, UberGraphFrame) == 0x000260, "Member 'UWB_LocationWin_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_LocationWin_C, SsPlayerMapAreaName) == 0x000268, "Member 'UWB_LocationWin_C::SsPlayerMapAreaName' has a wrong offset!");
static_assert(offsetof(UWB_LocationWin_C, TextBlock_Location) == 0x000270, "Member 'UWB_LocationWin_C::TextBlock_Location' has a wrong offset!");
static_assert(offsetof(UWB_LocationWin_C, M_State) == 0x000278, "Member 'UWB_LocationWin_C::M_State' has a wrong offset!");
static_assert(offsetof(UWB_LocationWin_C, OtherFontColor) == 0x00027C, "Member 'UWB_LocationWin_C::OtherFontColor' has a wrong offset!");
static_assert(offsetof(UWB_LocationWin_C, OtherOutlineColor) == 0x00028C, "Member 'UWB_LocationWin_C::OtherOutlineColor' has a wrong offset!");
static_assert(offsetof(UWB_LocationWin_C, NormalFontColor) == 0x00029C, "Member 'UWB_LocationWin_C::NormalFontColor' has a wrong offset!");
static_assert(offsetof(UWB_LocationWin_C, NormalOutlineColor) == 0x0002AC, "Member 'UWB_LocationWin_C::NormalOutlineColor' has a wrong offset!");
static_assert(offsetof(UWB_LocationWin_C, IsOther) == 0x0002BC, "Member 'UWB_LocationWin_C::IsOther' has a wrong offset!");
static_assert(offsetof(UWB_LocationWin_C, CurrentText) == 0x0002C0, "Member 'UWB_LocationWin_C::CurrentText' has a wrong offset!");

}

