#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Message_ButtonEffect

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_Message_ButtonEffect.WB_Message_ButtonEffect_C.ExecuteUbergraph_WB_Message_ButtonEffect
// 0x0018 (0x0018 - 0x0000)
struct WB_Message_ButtonEffect_C_ExecuteUbergraph_WB_Message_ButtonEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsOn;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BDF[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BE0[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_ButtonEffect_C_ExecuteUbergraph_WB_Message_ButtonEffect) == 0x000008, "Wrong alignment on WB_Message_ButtonEffect_C_ExecuteUbergraph_WB_Message_ButtonEffect");
static_assert(sizeof(WB_Message_ButtonEffect_C_ExecuteUbergraph_WB_Message_ButtonEffect) == 0x000018, "Wrong size on WB_Message_ButtonEffect_C_ExecuteUbergraph_WB_Message_ButtonEffect");
static_assert(offsetof(WB_Message_ButtonEffect_C_ExecuteUbergraph_WB_Message_ButtonEffect, EntryPoint) == 0x000000, "Member 'WB_Message_ButtonEffect_C_ExecuteUbergraph_WB_Message_ButtonEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Message_ButtonEffect_C_ExecuteUbergraph_WB_Message_ButtonEffect, K2Node_CustomEvent_IsOn) == 0x000004, "Member 'WB_Message_ButtonEffect_C_ExecuteUbergraph_WB_Message_ButtonEffect::K2Node_CustomEvent_IsOn' has a wrong offset!");
static_assert(offsetof(WB_Message_ButtonEffect_C_ExecuteUbergraph_WB_Message_ButtonEffect, CallFunc_GetEndTime_ReturnValue) == 0x000008, "Member 'WB_Message_ButtonEffect_C_ExecuteUbergraph_WB_Message_ButtonEffect::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_ButtonEffect_C_ExecuteUbergraph_WB_Message_ButtonEffect, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WB_Message_ButtonEffect_C_ExecuteUbergraph_WB_Message_ButtonEffect::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WB_Message_ButtonEffect.WB_Message_ButtonEffect_C.Play_AutoAnim
// 0x0001 (0x0001 - 0x0000)
struct WB_Message_ButtonEffect_C_Play_AutoAnim final
{
public:
	bool                                          IsOn;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Message_ButtonEffect_C_Play_AutoAnim) == 0x000001, "Wrong alignment on WB_Message_ButtonEffect_C_Play_AutoAnim");
static_assert(sizeof(WB_Message_ButtonEffect_C_Play_AutoAnim) == 0x000001, "Wrong size on WB_Message_ButtonEffect_C_Play_AutoAnim");
static_assert(offsetof(WB_Message_ButtonEffect_C_Play_AutoAnim, IsOn) == 0x000000, "Member 'WB_Message_ButtonEffect_C_Play_AutoAnim::IsOn' has a wrong offset!");

}

