#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MsgSelect

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MsgSelect.WB_MsgSelect_C
// 0x0120 (0x0380 - 0x0260)
class UWB_MsgSelect_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButtonS5*                              ButtonS5MouseCursor;                               // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Selectcursorgardentalkicon;                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        Selectcursornewicon;                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Selectgardentalkicon;                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        Selectitem;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        Selectnewicon;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMessageSimpleTextWidget*               SimpleText;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMessageSimpleTextWidget*               SimpleTextCursor;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerSelectCursor;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScriptMessageAsset*                    Scriptmessagelabel;                                // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    Scriptmessageindex;                                // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Selectitemname;                                    // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNewIcon;                                         // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_640E[0x3];                                     // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Selectitemnameindex;                               // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsItemNameUseIndex;                                // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSelectPanelOff;                                  // 0x02D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSelectItemVisible;                               // 0x02D2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSsPlayerSelectCursorVisible;                     // 0x02D3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FLinearColor                           NormalTextColor;                                   // 0x02D4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DisabledTextColor;                                 // 0x02E4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDisabled;                                        // 0x02F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_640F[0x3];                                     // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CurrentTextColor;                                  // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NormalCursorColor;                                 // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DisabledCursorColor;                               // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NormalTextOutlineColor;                            // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NormalCursorOutlilneColor;                         // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DisabledOutlineColor;                              // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Itemselect;                                        // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6410[0x4];                                     // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnMouseClicked;                                    // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnMouseSelected;                                   // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnMouseClicked__DelegateSignature(int32 InIndex);
	void OnMouseSelected__DelegateSignature(int32 InIndex);
	void ExecuteUbergraph_WB_MsgSelect(int32 EntryPoint);
	void Construct();
	void BndEvt__WB_MsgSelect_ButtonS5MouseCursor_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature(const struct FVector2D& Pos, const struct FVector2D& UV);
	void BndEvt__WB_MsgSelect_ButtonS5MouseCursor_K2Node_ComponentBoundEvent_3_ButtonSimpleEventS5__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__selectitem_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void InitializeMsgSelect();
	void MsgSelect_In(int32 InNewIconFrame);
	void SelectCursorOut();
	void SelectCursorIn();
	void BndEvt__SsPlayerSelectCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void SetSelectItemNameByIndex(class UScriptMessageAsset* ArgScriptMessageLabel, int32 Argindex, bool InAfterBuild);
	void MsgSelect_Out();
	void SetSelectItemName(class UScriptMessageAsset* ArgScriptMessageLabel, class FName Argselectitemname, bool InAfterBuild);
	void GetText(class FText* OutText);
	void SetText(bool InAfterBuild);
	void SetNewIcon();
	void NewIconOn(int32 InStartFrame, bool InInitialize);
	void NewIconOff();
	void ResetNewIcon();
	void IsNewIconOn(bool* Outnewicon);
	void SetTextByIndex(bool InAfterBuild);
	void SelectCursorNewIconOn();
	void SelectCursorNewIconOff();
	void SetSelectCursorTextParam();
	void ClearSelectCursorText();
	void SelectCursorOn();
	void SelectCursorOff();
	void SSetSelectCursorTextParam();
	void SetBuildTextLater();
	void SetRichTextValueParam(int32 InIndex, int32 InValueParam);
	void IsFinishedSelect(bool* OutParam);
	void InitVisibleFlag();
	void GetNewIconFrame(int32 InType, float* OutFrame);
	void SetTextColor(bool Disabled);
	void GetSelectText(TScriptInterface<class IMessageTagInterface>* Text);
	void SetGardenTalkIcon();
	void ResetGardenTalkIcon();
	void GetGardenTalkIconUV(E_MINIMAP_POI_ICON InIconType, float* OutU, float* OutV);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MsgSelect_C">();
	}
	static class UWB_MsgSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MsgSelect_C>();
	}
};
static_assert(alignof(UWB_MsgSelect_C) == 0x000008, "Wrong alignment on UWB_MsgSelect_C");
static_assert(sizeof(UWB_MsgSelect_C) == 0x000380, "Wrong size on UWB_MsgSelect_C");
static_assert(offsetof(UWB_MsgSelect_C, UberGraphFrame) == 0x000260, "Member 'UWB_MsgSelect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, ButtonS5MouseCursor) == 0x000268, "Member 'UWB_MsgSelect_C::ButtonS5MouseCursor' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, Selectcursorgardentalkicon) == 0x000270, "Member 'UWB_MsgSelect_C::Selectcursorgardentalkicon' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, Selectcursornewicon) == 0x000278, "Member 'UWB_MsgSelect_C::Selectcursornewicon' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, Selectgardentalkicon) == 0x000280, "Member 'UWB_MsgSelect_C::Selectgardentalkicon' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, Selectitem) == 0x000288, "Member 'UWB_MsgSelect_C::Selectitem' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, Selectnewicon) == 0x000290, "Member 'UWB_MsgSelect_C::Selectnewicon' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, SimpleText) == 0x000298, "Member 'UWB_MsgSelect_C::SimpleText' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, SimpleTextCursor) == 0x0002A0, "Member 'UWB_MsgSelect_C::SimpleTextCursor' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, SsPlayerSelectCursor) == 0x0002A8, "Member 'UWB_MsgSelect_C::SsPlayerSelectCursor' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, Scriptmessagelabel) == 0x0002B0, "Member 'UWB_MsgSelect_C::Scriptmessagelabel' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, Scriptmessageindex) == 0x0002B8, "Member 'UWB_MsgSelect_C::Scriptmessageindex' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, Selectitemname) == 0x0002C0, "Member 'UWB_MsgSelect_C::Selectitemname' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, IsNewIcon) == 0x0002C8, "Member 'UWB_MsgSelect_C::IsNewIcon' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, Selectitemnameindex) == 0x0002CC, "Member 'UWB_MsgSelect_C::Selectitemnameindex' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, IsItemNameUseIndex) == 0x0002D0, "Member 'UWB_MsgSelect_C::IsItemNameUseIndex' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, IsSelectPanelOff) == 0x0002D1, "Member 'UWB_MsgSelect_C::IsSelectPanelOff' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, IsSelectItemVisible) == 0x0002D2, "Member 'UWB_MsgSelect_C::IsSelectItemVisible' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, IsSsPlayerSelectCursorVisible) == 0x0002D3, "Member 'UWB_MsgSelect_C::IsSsPlayerSelectCursorVisible' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, NormalTextColor) == 0x0002D4, "Member 'UWB_MsgSelect_C::NormalTextColor' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, DisabledTextColor) == 0x0002E4, "Member 'UWB_MsgSelect_C::DisabledTextColor' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, IsDisabled) == 0x0002F4, "Member 'UWB_MsgSelect_C::IsDisabled' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, CurrentTextColor) == 0x0002F8, "Member 'UWB_MsgSelect_C::CurrentTextColor' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, NormalCursorColor) == 0x000308, "Member 'UWB_MsgSelect_C::NormalCursorColor' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, DisabledCursorColor) == 0x000318, "Member 'UWB_MsgSelect_C::DisabledCursorColor' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, NormalTextOutlineColor) == 0x000328, "Member 'UWB_MsgSelect_C::NormalTextOutlineColor' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, NormalCursorOutlilneColor) == 0x000338, "Member 'UWB_MsgSelect_C::NormalCursorOutlilneColor' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, DisabledOutlineColor) == 0x000348, "Member 'UWB_MsgSelect_C::DisabledOutlineColor' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, Itemselect) == 0x000358, "Member 'UWB_MsgSelect_C::Itemselect' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, OnMouseClicked) == 0x000360, "Member 'UWB_MsgSelect_C::OnMouseClicked' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelect_C, OnMouseSelected) == 0x000370, "Member 'UWB_MsgSelect_C::OnMouseSelected' has a wrong offset!");

}

